usr/src/man/man1b/biff.1b
'\" te
.\" Copyright (c) 1988, Sun Microsystems, Inc.  All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH biff 1B "14 Sep 1992" "SunOS 5.11" "SunOS/BSD Compatibility Package Commands"
.SH NAME
biff \- give notice of incoming mail messages
.SH SYNOPSIS
.LP
.nf
\fB/usr/ucb/biff\fR [y | n]
.fi

.SH DESCRIPTION
.sp
.LP
.B biff
turns mail notification on or off for the terminal session. With
no arguments,
.B biff
displays the current notification status for the
terminal.
.sp
.LP
If notification is allowed, the terminal rings the bell and displays the
header and the first few lines of each arriving mail message. \fBbiff\fR
.RB "operates asynchronously. For synchronized notices, use the" " MAIL"
variable of
.BR sh (1)
or the
.B mail
variable of
.BR csh (1).
.sp
.LP
A `\fBbiff y\fR' command can be included in your
.B ~/.login
or
.B ~/.profile
file for execution when you log in.
.SH OPTIONS
.sp
.ne 2
.mk
.na
.B y
.ad
.RS 5n
.rt
Allow mail notification for the terminal.
.RE

.sp
.ne 2
.mk
.na
.B n
.ad
.RS 5n
.rt
Disable notification for the terminal.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B ~/.login
.ad
.RS 14n
.rt
User's login file
.RE

.sp
.ne 2
.mk
.na
.B ~/.profile
.ad
.RS 14n
.rt
User's profile file
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWscpu
.TE

.SH SEE ALSO
.sp
.LP
.BR csh (1),
.BR mail (1),
.BR sh (1),
.BR attributes (5)
