usr/src/man/man1b/chown.1b
'\" te
.\" Copyright (c) 1980 Regents of the University of California.
.\" All rights reserved. The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\" Copyright (c) 2004, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.TH chown 1B "21 Jun 2004" "SunOS 5.11" "SunOS/BSD Compatibility Package Commands"
.SH NAME
chown \- change owner
.SH SYNOPSIS
.LP
.nf
\fB/usr/ucb/chown\fR [\fB-fR\fR] \fIowner\fR[.group] \fIfilename\fR...
.fi

.SH DESCRIPTION
.sp
.LP
.B chown
changes the owner of the
.IR filename s
to
.IR owner .
The
owner can be either a decimal user
.B ID
.RB ( UID )
or a login name
found in the password file. An optional
.I group
can also be specified.
The group can be either a decimal group
.B ID
.RB ( GID )
or a group name
found in the
.B GID
file.
.sp
.LP
In the default case, only the super-user of the machine where  the file is
physically located can change the owner. The system configuration option
.B {_POSIX_CHOWN_RESTRICTED}
and the privileges
.B PRIV_FILE_CHOWN
and
.B PRIV_FILE_CHOWN_SELF
also affect who can change the ownership of a
file. See
.BR chown (2)
and
.BR privileges (5).
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -f
.ad
.RS 6n
.rt
Do not report errors.
.RE

.sp
.ne 2
.mk
.na
.B -R
.ad
.RS 6n
.rt
Recursively descend into directories setting the ownership of all files in
each directory encountered. When symbolic links are encountered, their
ownership is changed, but they are not traversed.
.RE

.SH USAGE
.sp
.LP
See
.BR largefile (5)
for the description of the behavior of
.BR chown
when encountering files greater than or equal to 2 Gbyte ( 2^31 bytes).
.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/passwd
.ad
.RS 15n
.rt
Password file
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWscpu
.TE

.SH SEE ALSO
.sp
.LP
.BR chgrp (1),
.BR chown (2),
.BR group (4),
.BR passwd (4),
.BR attributes (5),
.BR largefile (5),
.BR privileges (5)
