usr/src/man/man1b/echo.1b
'\" te
.\" Copyright (c) 1988 Sun Microsystems, Inc - All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH echo 1B "3 Aug 1994" "SunOS 5.11" "SunOS/BSD Compatibility Package Commands"
.SH NAME
echo \- echo arguments to standard output
.SH SYNOPSIS
.LP
.nf
\fB/usr/ucb/echo\fR [\fB-n\fR] [\fIargument\fR]
.fi

.SH DESCRIPTION
.sp
.LP
.B echo
writes its arguments, separated by
.IR BLANK s
and terminated
by a
.IR NEWLINE ,
to the standard output.
.sp
.LP
.B echo
is useful for producing diagnostics in command files and for
sending known data into a pipe, and for displaying the contents of
environment variables.
.sp
.LP
For example, you can use
.B echo
to determine how many subdirectories
below the root directory
.RB ( / )
is your current directory, as follows:
.RS +4
.TP
.ie t \(bu
.el o
echo your current-working-directory's full pathname
.RE
.RS +4
.TP
.ie t \(bu
.el o
pipe the output through
.B tr
to translate the path's embedded
slash-characters into space-characters
.RE
.RS +4
.TP
.ie t \(bu
.el o
pipe that output through
.B "wc -w"
for a count of the names in your
path.
.sp
.in +2
.nf
example% \fB/usr/bin/echo "echo $PWD | tr '/' ' ' | wc -w"\fR
.fi
.in -2
.sp

.RE
.sp
.LP
See
.BR tr (1)
and
.BR wc (1)
for their functionality.
.sp
.LP
The shells
.BR csh (1),
.BR ksh (1),
and
.BR sh (1),
each have an
.B echo
built-in command, which, by default, will have precedence, and
will be invoked if the user calls
.B echo
without a full pathname.
.B /usr/ucb/echo
and
.BR csh 's
.B echo()
have an
.B -n
option,
but do not understand back-slashed escape characters.
.BR sh 's
.BR echo() ,
.BR ksh 's
.BR echo() ,
and
.BR /usr/bin/echo ,
on the
other hand, understand the black-slashed escape characters, and
.BR ksh 's
.B echo()
also understands
.B \ea
as the audible bell character;
however, these commands do not have an
.B -n
option.
.SH OPTIONS
.sp
.ne 2
.mk
.na
.B -n
.ad
.RS 6n
.rt
Do not add the
.I NEWLINE
to the output.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWscpu
.TE

.SH SEE ALSO
.sp
.LP
.BR csh (1),
.BR echo (1),
.BR ksh (1),
.BR sh (1),
.BR tr (1),
.BR wc (1),
.BR attributes (5)
.SH NOTES
.sp
.LP
The
.B -n
option is a transition aid for
.B BSD
applications, and may
not be supported in future releases.
