usr/src/man/man1b/exportfs.1b
'\" te
.\" Copyright (c) 1994, Sun Microsystems, Inc.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH exportfs 1B "6 Nov 2000" "SunOS 5.11" "SunOS/BSD Compatibility Package Commands"
.SH NAME
exportfs \- translates exportfs options to share/unshare commands
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/exportfs\fR [\fB-aiuv\fR] [\fB-o\fR \fIoptions\fR] [\fIpathname\fR]
.fi

.SH DESCRIPTION
.sp
.LP
\fBexportfs\fR translates SunOS 4.x \fBexportfs\fR options to the
corresponding \fBshare\fR/\fBunshare\fR options and invokes
\fBshare\fR/\fBunshare\fR with the translated options.
.sp
.LP
With no options or arguments, \fBexportfs\fR invokes
.B share
to print
out the list of all currently shared
.B NFS
filesystems.
.sp
.LP
\fBexportfs\fR is the BSD/Compatibility Package command of
.BR share (1M)
and \fBunshare\fR(1M). Use  \fBshare\fR(1M)/
.BR unshare (1M)
whenever
possible.
.SH OPTIONS
.sp
.ne 2
.mk
.na
.B -a
.ad
.RS 14n
.rt
Invokes \fBshareall\fR(1M), or if \fB-u\fR is specified, invokes
.BR unshareall (1M).
.RE

.sp
.ne 2
.mk
.na
.B -i
.ad
.RS 14n
.rt
Ignore options in
.BR /etc/dfs/dfstab .
.RE

.sp
.ne 2
.mk
.na
.B -u
.ad
.RS 14n
.rt
Invokes
.BR unshare "(1M) on"
.IR pathname .
.RE

.sp
.ne 2
.mk
.na
.B -v
.ad
.RS 14n
.rt
Verbose.
.RE

.sp
.ne 2
.mk
.na
.BI -o " options"
.ad
.RS 14n
.rt
Specify a comma-separated list of optional characteristics for the
filesystems being exported. \fBexportfs\fR translates
.I options
to
\fBshare\fR-equivalent options. (see \fBshare\fR(1M) for information about
individual options).
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWnfssu
.TE

.SH SEE ALSO
.sp
.LP
.BR share (1M),
.BR shareall (1M),
.BR unshare (1M),
.BR unshareall (1M),
.BR attributes (5)
