usr/src/man/man1b/groups.1b
'\" te
.\" Copyright (c) 1988 Sun Microsystems, Inc. - All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH groups 1B "14 Sep 1992" "SunOS 5.11" "SunOS/BSD Compatibility Package Commands"
.SH NAME
groups \- display a user's group memberships
.SH SYNOPSIS
.LP
.nf
\fB/usr/ucb/groups\fR [\fIuser\fR]...
.fi

.SH DESCRIPTION
.sp
.LP
With no arguments,
.B groups
displays the groups to which you belong;
else it displays the groups to which the
.B user
belongs. Each user
belongs to a group specified in the password file
.B /etc/passwd
and
possibly to other groups as specified in the file
.BR /etc/group .
If you
do not own a file but belong to the group which it is owned by then you are
granted group access to the file.
.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/passwd
.ad
.RS 15n
.rt

.RE

.sp
.ne 2
.mk
.na
.B /etc/group
.ad
.RS 15n
.rt

.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWscpu
.TE

.SH SEE ALSO
.sp
.LP
.BR getgroups (2),
.BR attributes (5)
.SH NOTES
.sp
.LP
This command is obsolete.
