usr/src/man/man1b/lpq.1b
'\" te
.\" Copyright (C) 2006, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH lpq 1B "2 Jun 2006" "SunOS 5.11" "SunOS/BSD Compatibility Package Commands"
.SH NAME
lpq \- display the content of a print queue
.SH SYNOPSIS
.LP
.nf
\fB/usr/ucb/lpq\fR [\fB-P\fR \fIdestination\fR] [\fB-l\fR] [+ [\fIinterval\fR]]
     [\fIrequest-ID\fR.\|.\|.] [\fIuser\fR].\|.\|.
.fi

.SH DESCRIPTION
.sp
.LP
The
.B lpq
utility displays the information about the contents of a
print queue. A print queue is comprised of print requests that are waiting
in the process of being printed.
.sp
.LP
.B lpq
displays the following information to the standard output:
.RS +4
.TP
.ie t \(bu
.el o
the username of the person associated with a print request,
.RE
.RS +4
.TP
.ie t \(bu
.el o
the position of a print request in the print queue,
.RE
.RS +4
.TP
.ie t \(bu
.el o
the name of file or files comprising a print request,
.RE
.RS +4
.TP
.ie t \(bu
.el o
the job number of a print request, and
.RE
.RS +4
.TP
.ie t \(bu
.el o
the size of the file requested by a print request. File size is reported in
bytes.
.RE
.sp
.LP
Normally, only as much information as will fit on one line is displayed. If
the name of the input file associated with a print request is not available,
the input file field indicates the standard input.
.sp
.LP
The print client commands locate destination information using the
.B printers
database in the name service switch. See
.BR nsswitch.conf (4),
.BR printers (4),
and
.BR printers.conf (4)
for
details.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -l
.ad
.RS 18n
.rt
Displays information in long format. Long format includes the name of the
host from which a print request originated in the display.
.RE

.sp
.ne 2
.mk
.na
.B -P
.I destination
.ad
.RS 18n
.rt
Displays information about printer or class of printers (see
.BR lpadmin (1M))
\fI\&.\fR Specify
.I destination
using atomic,
URI-style (\fIscheme\fB://endpoint\fR), or POSIX-style
(\fIserver\fB:\fIdestination\fR) names. See \fBprinters.conf\fR(4) for
information regarding destination names.
.RE

.sp
.ne 2
.mk
.na
\fB+\fR [\fIinterval\fR]\fR
.ad
.RS 18n
.rt
Displays information at specific time intervals. Stops displaying
information when the print queue is empty. Clears the screen before
reporting displaying the print queue. Specify
.I interval
as the number
of seconds between displays. If
.I interval
is not specified only
executes once.
.RE

.SH OPERANDS
.sp
.LP
The following operands are supported:
.sp
.ne 2
.mk
.na
.I request-ID
.ad
.RS 14n
.rt
The job number associated with a print request.
.RE

.sp
.ne 2
.mk
.na
.I user
.ad
.RS 14n
.rt
The name of the user about whose jobs
.B lpq
reports information.
Specify
.I user
as a valid username.
.RE

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 12n
.rt
Successful completion.
.RE

.sp
.ne 2
.mk
.na
.B non-zero
.ad
.RS 12n
.rt
An error occurred.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B $HOME/.printers
.ad
.RS 24n
.rt
User-configurable printer database
.RE

.sp
.ne 2
.mk
.na
.B /etc/printers.conf
.ad
.RS 24n
.rt
System printer configuration database
.RE

.sp
.ne 2
.mk
.na
.B printers.conf.byname
.ad
.RS 24n
.rt
NIS version of
.B /etc/printers.conf
.RE

.sp
.ne 2
.mk
.na
.B printers.org_dir
.ad
.RS 24n
.rt
NIS+ version of
.B /etc/printers.conf
.RE

.sp
.ne 2
.mk
.na
.B ou=printers
.ad
.RS 24n
.rt
LDAP version of
.B /etc/printers.conf
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWlpr-cmds
_
Interface StabilityStandard
.TE

.SH SEE ALSO
.sp
.LP
.BR lp (1),
.BR lpc (1B),
.BR lpr (1B),
.BR lprm (1B),
.BR lpstat (1),
.BR lpadmin (1M),
.BR nsswitch.conf (4),
.BR printers (4),
.BR printers.conf (4),
.BR attributes (5),
.BR standards (5)
.SH NOTES
.sp
.LP
When IPP is in use, the user is prompted for a passphrase if the remote
print service is configured to require authentication.
