usr/src/man/man1b/lpr.1b
'\" te
.\" Copyright (c) 1980 Regents of the University of California.
.\" All rights reserved. The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\" Copyright (C) 2006, Sun Microsystems, Inc. All Rights Reserved
.TH lpr 1B "2 Jun 2006" "SunOS 5.11" "SunOS/BSD Compatibility Package Commands"
.SH NAME
lpr \- submit print requests
.SH SYNOPSIS
.LP
.nf
\fB/usr/ucb/lpr\fR [\fB-P\fR \fIdestination\fR] [\fB-#\fR \fInumber\fR] [\fB-C\fR \fIclass\fR]
     [\fB-J\fR \fIjob\fR] [\fB-T\fR \fItitle\fR] [\fB-i\fR [\fIindent\fR]]
     [\fB-1\fR | \fB-2\fR | \fB-3\fR | \fB-4\fR \fIfont\fR] [\fB-w\fR \fIcols\fR] [\fB-m\fR] [\fB-h\fR] [\fB-s\fR]
     [\fB-filter_option\fR] [\fIfile\fR]...
.fi

.SH DESCRIPTION
.sp
.LP
The
.B lpr
.RB "utility submits print requests to a destination." " lpr"
prints files (\fIfile\fR) and associated information, collectively called a
.IR "print request" .
If \fIfile\fR is not specified,
.B lpr
assumes the
standard input.
.sp
.LP
The print client commands locate destination information using the
"printers" database in the name service switch. See \fBnsswitch.conf\fR(4),
.BR printers (4),
and
.BR printers.conf (4)
for details.
.sp
.LP
Print requests with more than 52 \fIfile\fRs specified is truncated to 52
files when the BSD print protocol is used for job submission.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB-C\fR \fIclass\fR
.ad
.sp .6
.RS 4n
Prints
.I class
as the job classification on the banner page of the
output. Enclose
.I class
in double quotes if it contains blanks. If
\fIclass\fR is not specified, the name of the system (as returned by
.BR hostname )
is printed as the job classification. See
.BR hostname (1).
.RE

.sp
.ne 2
.mk
.na
.B -h
.ad
.sp .6
.RS 4n
Suppresses printing of the banner page of the output.
.RE

.sp
.ne 2
.mk
.na
\fB-i\fR \fIindent\fR
.ad
.sp .6
.RS 4n
Indents the output a specific number of
.I SPACE
characters. Use
\fIindent\fR to indicate the number of \fISPACE\fR characters to be
indented. Specify
.I indent
as a positive integer. If the optional
argument to indent is not specified, then eight
.I SPACE
characters is
the default. The
.B -i
option is ignored unless it is specified with the
\fB-p\fR filter option.
.RE

.sp
.ne 2
.mk
.na
\fB-J\fR \fIjob\fR
.ad
.sp .6
.RS 4n
Prints
.I job
as the
.I "job name"
on the banner page of the output.
Enclose
.I job
in double quotes if it contains blanks. If
.I job
is
not specified, \fIfile\fR (or in the case of multiple files, the first
\fIfile\fR specified on the command line) is printed as the job name on the
banner page of the output.
.RE

.sp
.ne 2
.mk
.na
.B -m
.ad
.sp .6
.RS 4n
Sends mail after \fIfile\fR has printed. See
.BR mail (1).
By default, no
mail is sent upon normal completion of a print request.
.RE

.sp
.ne 2
.mk
.na
\fB-P\fR \fIdestination\fR
.ad
.sp .6
.RS 4n
Prints \fIfile\fR on a specific printer or class of printers (see
.BR lpadmin (1M)).
Specify
.I destination
using atomic, URI-style
(\fIscheme\fB://\fBendpoint\fR), or POSIX-style
(\fIserver\fB:\fIdestination\fR) names. See \fBprinters.conf\fR(4) for
information regarding destination names.
.RE

.sp
.ne 2
.mk
.na
.B -s
.ad
.sp .6
.RS 4n
Prints files by reference rather than copying them. This means that files
should not be modified or removed until they have completed printing. This
option only prevents copying of files when the print queue is on the local
machine and the files are specified on the command line.
.RE

.sp
.ne 2
.mk
.na
\fB-T\fR \fItitle\fR
.ad
.sp .6
.RS 4n
Prints a title on the page header of the output. Enclose
.I title
in
double quotes if it contains blanks. The
.B -T
option is ignored unless
it is specified with the
.B -p
filter option.
.RE

.sp
.ne 2
.mk
.na
\fB-w\fR \fIcols\fR
.ad
.sp .6
.RS 4n
Prints \fIfile\fR with pages of a specific width.
.I cols
indicates the
number of columns wide. The
.B -w
option is ignored unless it is
specified with the
.B -p
filter option.
.RE

.sp
.ne 2
.mk
.na
\fB\(mi\fB1\fR|\(mi\fB2\fR|\(mi\fB3\fR|\(mi\fB4\fR \fIfont\fR
.ad
.sp .6
.RS 4n
Mounts the specified font in the font position
.BR 1 ,
.BR 2 ,
.BR 3 ,
or
.BR 4 .
Specify \fIfont\fR as a valid font name.
.RE

.sp
.ne 2
.mk
.na
\fB\(mi\fR \fIfilter_option\fR
.ad
.sp .6
.RS 4n
Notifies the print spooler that \fIfile\fR is not a standard text file.
Enables the spooling daemon to use the appropriate filters to print
.IR file .
.sp
\fIfilter_option\fRs offer a standard user interface. All filter options
might not be available for, or applicable to, all printers.
.sp
Specify \fIfilter_option\fR as a single character.
.sp
If \fIfilter_option\fR is not specified and the printer can interpret
PostScript\(rg, inserting `\fB%!\fR' as the first two characters of
\fIfile\fR causes \fIfile\fR to be interpreted as PostScript.
.sp
The following filter options are supported:
.sp
.ne 2
.mk
.na
.B c
.ad
.RS 5n
.rt
\fIfile\fR contains data produced by \fIcifplot\fR.
.RE

.sp
.ne 2
.mk
.na
.B d
.ad
.RS 5n
.rt
\fIfile\fR contains \fBtex\fR data in \fBDVI\fR format from Stanford.
.RE

.sp
.ne 2
.mk
.na
\fBf\fR
.ad
.RS 5n
.rt
Interprets the first character of each line as a standard FORTRAN carriage
control character.
.RE

.sp
.ne 2
.mk
.na
.B g
.ad
.RS 5n
.rt
\fIfile\fR contains standard plot data produced by \fBplot\fR(1B)
routines.
.RE

.sp
.ne 2
.mk
.na
.B l
.ad
.RS 5n
.rt
Print control characters and suppress page breaks.
.RE

.sp
.ne 2
.mk
.na
.B n
.ad
.RS 5n
.rt
\fIfile\fR contains \fBditroff\fR data from device independent troff.
.RE

.sp
.ne 2
.mk
.na
.B p
.ad
.RS 5n
.rt
Use
.B pr
to format the files. See
.BR pr (1).
.RE

.sp
.ne 2
.mk
.na
.B t
.ad
.RS 5n
.rt
\fIfile\fR contains \fBtroff\fR (cat phototypesetter) binary data.
.RE

.sp
.ne 2
.mk
.na
.B v
.ad
.RS 5n
.rt
\fIfile\fR contains a raster image. \fIprinter\fR must support an
appropriate imaging model such as PostScript in order to print the image.
.RE

.RE

.sp
.ne 2
.mk
.na
\fB-#\fR \fInumber\fR
.ad
.sp .6
.RS 4n
Prints a specific number of copies. Specify
.I number
as a positive
integer. The default for
.I number
is
.BR 1 .
.RE

.SH OPERANDS
.sp
.LP
The following operand is supported:
.sp
.ne 2
.mk
.na
\fIfile\fR
.ad
.RS 8n
.rt
The name of the file to be printed. Specify \fIfile\fR as a pathname. If
\fIfile\fR is not specified, \fBlpr\fR uses the standard input.
.RE

.SH USAGE
.sp
.LP
See
.BR largefile (5)
for the description of the behavior of
.BR lpr
when encountering files greater than or equal to 2 Gbyte ( 2^31 bytes).
.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 12n
.rt
Successful completion.
.RE

.sp
.ne 2
.mk
.na
.B non-zero
.ad
.RS 12n
.rt
An error occurred.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
\fB/etc/printers.conf\fR
.ad
.RS 24n
.rt
System printer configuration database
.RE

.sp
.ne 2
.mk
.na
.B $HOME/.printers
.ad
.RS 24n
.rt
User-configurable printer database
.RE

.sp
.ne 2
.mk
.na
.B ou=printers
.ad
.RS 24n
.rt
LDAP version of \fB/etc/printers.conf\fR
.RE

.sp
.ne 2
.mk
.na
\fBprinters.conf.byname\fR
.ad
.RS 24n
.rt
NIS version of \fB/etc/printers.conf\fR
.RE

.sp
.ne 2
.mk
.na
.B printers.org_dir
.ad
.RS 24n
.rt
NIS+ version of \fB/etc/printers.conf\fR
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWlpr_cmds
_
Interface StabilitlyStandard
_
CSIEnabled. See NOTES
.TE

.SH SEE ALSO
.sp
.LP
.BR hostname (1),
.BR lp (1),
.BR lpc (1B),
.BR lpq (1B),
.BR lprm (1B),
.BR lpstat (1),
.BR mail (1),
.BR plot (1B),
.BR pr (1),
\fBtroff\fR(1), \fBlpadmin\fR(1M), \fBnsswitch.conf\fR(4),
.BR printers (4),
\fBprinters.conf\fR(4), \fBattributes\fR(5),
\fBlargefile\fR(5), \fBstandards\fR(5)
.SH DIAGNOSTICS
.sp
.ne 2
.mk
.na
.B lpr:
.I destination
.B |: unknown destination
.ad
.sp .6
.RS 4n
\fIdestination\fR was not found in the \fBLP\fR configuration database.
Usually this is a typing mistake; however, it can indicate that the
\fIdestination\fR does not exist on the system. Use \fBlpstat -p\fR to
display information about the status of the print service.
.RE

.SH NOTES
.sp
.LP
\fBlpr\fR is CSI-enabled except for the \fIprinter\fR name.
.sp
.LP
Print jobs are assumed to contain one type of data. That type of data is
either specified on the command line or autodetected (simple, PostScript)
based on the contents of the first file in the job.
.sp
.LP
When IPP is in use, the user is prompted for a passphrase if the remote
print service is configured to require authentication.
