usr/src/man/man1b/lptest.1b
'\" te
.\" Copyright (c) 1985 Regents of the University of California.
.\" All rights reserved. The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\" Copyright (c) 1996 Sun Microsystems, Inc.  All Rights Reserved.
.TH lptest 1B "9 Sep 1996" "SunOS 5.11" "SunOS/BSD Compatibility Package Commands"
.SH NAME
lptest \- generate line printer ripple pattern
.SH SYNOPSIS
.LP
.nf
\fB/usr/ucb/lptest\fR [\fIlength\fR [\fIcount\fR]]
.fi

.SH DESCRIPTION
.sp
.LP
The
.B lptest
utility writes the traditional
.I "ripple test"
pattern
to the standard output. In 96 lines, the ripple test pattern prints all 96
printable
.B ASCII
characters in each position. The ripple test pattern
was originally created to test printers.  It is also useful for testing
terminals, driving terminal ports, debugging, and performing tasks that
require a quick supply of random data.
.sp
.LP
This command is obsolete.
.SH OPTIONS
.sp
.ne 2
.mk
.na
.I length
.ad
.RS 10n
.rt
Specifies the length of the output line in characters.
.B 79
characters
is the default.
.RE

.sp
.ne 2
.mk
.na
.I count
.ad
.RS 10n
.rt
Specifies the number of output lines.
.B 200
lines is the default. If
.I count
is specified,
.I length
must also be specified.
.RE

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 12n
.rt
Successful completion.
.RE

.sp
.ne 2
.mk
.na
.B non-zero
.ad
.RS 12n
.rt
An error occurred.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWscplp
.TE

.SH SEE ALSO
.sp
.LP
.BR attributes (5)
