usr/src/man/man1b/mail.1b
'\" te
.\" Copyright (c) 1998, Sun Microsystems, Inc.  All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH mail 1B "19 Aug 1998" "SunOS 5.11" "SunOS/BSD Compatibility Package Commands"
.SH NAME
mail, Mail \- interactive message processing system
.SH SYNOPSIS
.LP
.nf
\fB/usr/ucb/mail\fR ...
.fi

.LP
.nf
\fB/usr/ucb/Mail\fR ...
.fi

.SH DESCRIPTION
.sp
.LP
.B /usr/ucb/mail
and
.B /usr/ucb/Mail
are provided as links to
.B /usr/bin/mailx.
See
.BR mailx (1)
for more information on the usage
of these commands.
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.SS "\fB/usr/ucb/mail\fR"
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWscpu
.TE

.SS "\fB/usr/ucb/Mail\fR"
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWscpu
.TE

.SH SEE ALSO
.sp
.LP
\fBmailx\fR(1),\fBattributes\fR(5)
