usr/src/man/man1b/ps.1b
'\" te
.\" Copyright (c) 2002, Sun Microsystems, Inc. - All Rights Reserved.
.\" Copyright (c) 1980 Regents of the University of California.
.\" All rights reserved. The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.TH ps 1B "26 May 2006" "SunOS 5.11" "SunOS/BSD Compatibility Package Commands"
.SH NAME
ps \- display the status of current processes
.SH SYNOPSIS
.LP
.nf
\fB/usr/ucb/ps\fR [\fB-aceglnrSuUvwx\fR] [\fB-t\fR \fIterm\fR] [\fInum\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The \fBps\fR command displays information about processes. Normally, only
those processes that are running with your effective user \fBID\fR and are
attached to a controlling terminal (see  \fBtermio\fR(7I)) are shown.
Additional categories of processes can be added to the display using various
options. In particular, the \fB-a\fR option allows you to include processes
that are not owned by you (that do not have your user \fBID\fR), and the
\fB-x\fR option allows you to include processes without controlling
terminals. When you specify both \fB-a\fR and \fB-x\fR, you get processes
owned by anyone, with or without a controlling terminal. The \fB-r\fR option
restricts the list of processes printed to running and runnable processes.
.sp
.LP
\fBps\fR displays in tabular form the process ID, under \fBPID\fR; the
controlling terminal (if any), under \fBTT\fR; the cpu time used by the
process so far, including both user and system time, under \fBTIME\fR; the
state of the process, under S; and finally, an indication of the
\fBCOMMAND\fR that is running.
.sp
.LP
The state is given by a single letter from the following:
.sp
.ne 2
.mk
.na
\fBO\fR
.ad
.RS 5n
.rt
Process is running on a processor.
.RE

.sp
.ne 2
.mk
.na
\fBS\fR
.ad
.RS 5n
.rt
Sleeping. Process is waiting for an event to complete.
.RE

.sp
.ne 2
.mk
.na
\fBR\fR
.ad
.RS 5n
.rt
Runnable. Process is on run queue.
.RE

.sp
.ne 2
.mk
.na
\fBZ\fR
.ad
.RS 5n
.rt
Zombie state. Process terminated and parent not waiting.
.RE

.sp
.ne 2
.mk
.na
\fBT\fR
.ad
.RS 5n
.rt
Traced. Process stopped by a signal because parent is tracing it.
.RE

.SH OPTIONS
.sp
.LP
The following options must all be combined to form the first argument:
.sp
.ne 2
.mk
.na
\fB-a\fR
.ad
.RS 11n
.rt
Includes information about processes owned by others.
.RE

.sp
.ne 2
.mk
.na
\fB-c\fR
.ad
.RS 11n
.rt
Displays the command name rather than the command arguments.
.RE

.sp
.ne 2
.mk
.na
\fB-e\fR
.ad
.RS 11n
.rt
Displays the environment as well as the arguments to the command.
.RE

.sp
.ne 2
.mk
.na
\fB-g\fR
.ad
.RS 11n
.rt
Displays all processes. Without this option, \fBps\fR only prints
interesting processes. Processes are deemed to be uninteresting if they are
process group leaders. This normally eliminates top-level command
interpreters and processes waiting for users to login on free terminals.
.RE

.sp
.ne 2
.mk
.na
\fB-l\fR
.ad
.RS 11n
.rt
Displays a long listing, with fields \fBF\fR, \fBPPID\fR, \fBCP\fR,
\fBPRI\fR, \fBNI\fR, \fBSZ\fR, \fBRSS\fR, and \fBWCHAN\fR as described
below.
.RE

.sp
.ne 2
.mk
.na
\fB-n\fR
.ad
.RS 11n
.rt
Produces numerical output for some fields. In a user listing, the
\fBUSER\fR field is replaced by a \fBUID\fR field.
.RE

.sp
.ne 2
.mk
.na
\fB-r\fR
.ad
.RS 11n
.rt
Restricts output to running and runnable processes.
.RE

.sp
.ne 2
.mk
.na
\fB-S\fR
.ad
.RS 11n
.rt
Displays accumulated \fBCPU\fR time used by this process and all of its
reaped children.
.RE

.sp
.ne 2
.mk
.na
\fB-t\fR \fIterm\fR
.ad
.RS 11n
.rt
Lists only process data associated with the terminal, \fIterm\fR. Terminal
identifiers may be specified in one of two forms:  the device's file name
(for example,  \fBtty04\fR or \fBterm/14\fR ) or, if the device's file name
starts with  \fBtty\fR, just the digit identifier (for example, \fB04\fR).
.RE

.sp
.ne 2
.mk
.na
\fB-u\fR
.ad
.RS 11n
.rt
Displays user-oriented output. This includes fields \fBUSER\fR, \fB%CPU\fR,
\fB%MEM\fR, \fBSZ\fR, \fBRSS\fR, and \fBSTART\fR as described below.
.RE

.sp
.ne 2
.mk
.na
\fB-U\fR
.ad
.RS 11n
.rt
Obsolete. This option no longer has any effect. It causes \fBps\fR to exit
without printing the process listing.
.RE

.sp
.ne 2
.mk
.na
\fB-v\fR
.ad
.RS 11n
.rt
Displays a version of the output containing virtual memory. This includes
fields \fBSIZE\fR, \fB%CPU\fR, \fB%MEM\fR, and \fBRSS\fR, described below.
.RE

.sp
.ne 2
.mk
.na
\fB-w\fR
.ad
.RS 11n
.rt
Uses a wide output format, that is, 132 columns rather than 80. If the
option letter is repeated, that is, \fB-ww\fR, this option uses arbitrarily
wide output. This information is used to decide how much of long commands to
print. \fBNote:\fR The wide output option can be viewed only by a superuser
or the user who owns the process.
.RE

.sp
.ne 2
.mk
.na
\fB-x\fR
.ad
.RS 11n
.rt
Includes processes with no controlling terminal.
.RE

.sp
.ne 2
.mk
.na
\fInum\fR
.ad
.RS 11n
.rt
A process number may be given, in which case the output is restricted to
that process. This option must be supplied last.
.RE

.SH DISPLAY FORMATS
.sp
.LP
Fields that are not common to all output formats:
.sp
.ne 2
.mk
.na
\fBUSER\fR
.ad
.RS 9n
.rt
Name of the owner of the process.
.RE

.sp
.ne 2
.mk
.na
\fB%CPU\fR
.ad
.RS 9n
.rt
\fBCPU\fR use of the process. This is a decaying average over up to a
minute of previous (real) time.
.RE

.sp
.ne 2
.mk
.na
\fBNI\fR
.ad
.RS 9n
.rt
Process scheduling increment (see \fBgetpriority\fR(3C) and
\fBnice\fR(3UCB)).
.RE

.sp
.ne 2
.mk
.na
\fBSIZE\fR
.ad
.RS 9n
.rt
The total size of the process in virtual memory, including all mapped files
and devices, in kilobyte units.
.RE

.sp
.ne 2
.mk
.na
\fBSZ\fR
.ad
.RS 9n
.rt
Same as \fBSIZE\fR.
.RE

.sp
.ne 2
.mk
.na
\fBRSS\fR
.ad
.RS 9n
.rt
Real memory (resident set) size of the process, in kilobyte units.
.RE

.sp
.ne 2
.mk
.na
\fBUID\fR
.ad
.RS 9n
.rt
Numerical user-ID of process owner.
.RE

.sp
.ne 2
.mk
.na
\fBPPID\fR
.ad
.RS 9n
.rt
Numerical \fBID\fR of parent of process.
.RE

.sp
.ne 2
.mk
.na
\fBCP\fR
.ad
.RS 9n
.rt
Short-term \fBCPU\fR utilization factor (used in scheduling).
.RE

.sp
.ne 2
.mk
.na
\fBPRI\fR
.ad
.RS 9n
.rt
The priority of the process (higher numbers mean lower priority).
.RE

.sp
.ne 2
.mk
.na
\fBSTART\fR
.ad
.RS 9n
.rt
The starting time of the process, given in hours, minutes, and seconds. A
process begun more than 24 hours before the \fBps\fR inquiry is executed is
given in months and days.
.RE

.sp
.ne 2
.mk
.na
\fBWCHAN\fR
.ad
.RS 9n
.rt
The address of an event for which the process is sleeping (if blank, the
process is running).
.RE

.sp
.ne 2
.mk
.na
\fB%MEM\fR
.ad
.RS 9n
.rt
The ratio of the process's resident set size to the physical memory on the
machine, expressed as a percentage.
.RE

.sp
.ne 2
.mk
.na
\fBF\fR
.ad
.RS 9n
.rt
Flags (hexadecimal and additive) associated with the process. These flags
are available for historical purposes; no meaning should be currently
ascribed to them.
.RE

.sp
.LP
A process that has exited and has a parent, but has not yet been waited for
by the parent, is marked <\fBdefunct\fR>\|; otherwise, \fBps\fR tries to
determine the command name and arguments given when the process was created
by examining the user block.
.SH FILES
.sp
.LP
\fB/dev/tty*\fR
.sp
.ne 2
.mk
.na
\fB/etc/passwd\fR
.ad
.RS 15n
.rt
\fBUID\fR information supplier
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWscpu
.TE

.SH SEE ALSO
.sp
.LP
\fBkill\fR(1), \fBps\fR(1), \fBwhodo\fR(1M), \fBgetpriority\fR(3C),
\fBnice\fR(3UCB), \fBproc\fR(4), \fBattributes\fR(5), \fBtermio\fR(7I)
.SH NOTES
.sp
.LP
Things can change while \fBps\fR is running. The picture \fBps\fR gives is
only a close approximation to the current state. Some data printed for
defunct processes is irrelevant.
