usr/src/man/man1b/shutdown.1b
'\" te
.\" Copyright (c) 1980 Regents of the University of California.
.\" All rights reserved. The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.TH shutdown 1B "11 Oct 1994" "SunOS 5.11" "SunOS/BSD Compatibility Package Commands"
.SH NAME
shutdown \- close down the system at a given time
.SH SYNOPSIS
.LP
.nf
\fB/usr/ucb/shutdown\fR [\fB-fhknr\fR] \fItime\fR [\fIwarning-message\fR]...
.fi

.SH DESCRIPTION
.sp
.LP
\fBshutdown\fR provides an automated procedure to notify users when the system
is to be shut down.
.B time
specifies when
.B shutdown
will bring the
system down; it may be the word
.B now
(indicating an immediate shutdown),
or it may specify a future time in one of two formats: \fB+\fInumber\fR and
\fIhour\fB:\fImin.\fR The first form brings the system down in
\fInumber\fR minutes, and the second brings the system down at the time of day
indicated in 24-hour notation.
.sp
.LP
At intervals that get closer as the apocalypse approaches, warning messages
are displayed at terminals of all logged-in users, and of users who have remote
mounts on that machine.
.sp
.LP
At shutdown time a message is written to the system log daemon,
.BR syslogd (1M),
containing the time of shutdown, the instigator of the
shutdown, and the reason. Then a terminate signal is sent to
.BR init ,
which
brings the system down to single-user mode.
.SH OPTIONS
.sp
.LP
As an alternative to the above procedure, these options can be specified:
.sp
.ne 2
.mk
.na
\fB-f\fR
.ad
.RS 6n
.rt
Arrange, in the manner of \fBfastboot\fR(1B), that when the system is
rebooted, the file systems will not be checked.
.RE

.sp
.ne 2
.mk
.na
.B -h
.ad
.RS 6n
.rt
Execute
.BR halt (1M).
.RE

.sp
.ne 2
.mk
.na
.B -k
.ad
.RS 6n
.rt
Simulate shutdown of the system. Do not actually shut down the system.
.RE

.sp
.ne 2
.mk
.na
.B -n
.ad
.RS 6n
.rt
Prevent the normal
.BR sync (2)
before stopping.
.RE

.sp
.ne 2
.mk
.na
.B -r
.ad
.RS 6n
.rt
Execute
.BR reboot (1M).
.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/rmtab
.ad
.RS 14n
.rt
remote mounted file system table
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWscpu
.TE

.SH SEE ALSO
.sp
.LP
\fBfastboot\fR(1B),
.BR login (1),
.BR halt (1M),
.BR reboot (1M),
.BR syslogd (1M),
.BR sync (2),
.BR rmtab (4),
.BR attributes (5)
.SH NOTES
.sp
.LP
Only allows you to bring the system down between
.B now
and 23:59 if you
use the absolute time for shutdown.
