usr/src/man/man1b/sum.1b
'\" te
.\" Copyright (c) 1996, Sun Microsystems, Inc.  All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH sum 1B "8 Nov 1995" "SunOS 5.11" "SunOS/BSD Compatibility Package Commands"
.SH NAME
sum \- calculate a checksum for a file
.SH SYNOPSIS
.LP
.nf
\fB/usr/ucb/sum\fR \fIfile\fR...
.fi

.SH DESCRIPTION
.sp
.LP
.B sum
calculates and displays a 16-bit checksum for the named file and
displays the size of the file in kilobytes. It is typically used to look for
bad spots, or to validate a file communicated over some transmission line.
The checksum is calculated by an algorithm which may yield different results
on machines with 16-bit \fBint\fRs and machines with 32-bit \fBint\fRs, so
it cannot always be used to validate that a file has been transferred
between machines with different-sized \fBint\fRs.
.SH USAGE
.sp
.LP
See
.BR largefile (5)
for the description of the behavior of
.BR sum
when encountering files greater than or equal to 2 Gbyte ( 2^31 bytes).
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWscpu
.TE

.SH SEE ALSO
.sp
.LP
.BR sum (1),
.BR wc (1),
.BR attributes (5),
.BR largefile (5)
.SH DIAGNOSTICS
.sp
.LP
.B Read error
is indistinguishable from
.B EOF
on most devices; check
the block count.
.SH NOTES
.sp
.LP
.B sum
and
.B /usr/bin/sum
(see
.BR sum (1))
return different
checksums.
.sp
.LP
This utility is obsolete.
