usr/src/man/man1b/test.1b
'\" te
.\" Copyright (c) 1996 Sun Microsystems, Inc - All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH test 1B "1 Apr 1996" "SunOS 5.11" "SunOS/BSD Compatibility Package Commands"
.SH NAME
test \- condition evaluation command
.SH SYNOPSIS
.LP
.nf
\fB/usr/ucb/test\fR \fIexpression\fR
.fi

.LP
.nf
 \fIexpression\fR
.fi

.SH DESCRIPTION
.sp
.LP
.B test
evaluates the expression
.I expression
and, if its value is
true, sets
.B 0
(true) exit status; otherwise, a non-zero (false) exit
status is set.
.B test
also sets a non-zero exit status if there are no
arguments. When permissions are tested, the effective user
.B ID
of the
process is used.
.sp
.LP
All operators, flags, and brackets (brackets used as shown in the second
.B SYNOPSIS
line) must be separate arguments to the
.B test
command;
normally these items are separated by spaces.
.SH USAGE
.SS "Primitives"
.sp
.LP
The following primitives are used to construct
.IR expression :
.sp
.ne 2
.mk
.na
.B -r
.I filename
.ad
.RS 16n
.rt
True if
.I filename
exists and is readable.
.RE

.sp
.ne 2
.mk
.na
.B -w
.I filename
.ad
.RS 16n
.rt
True if
.I filename
exists and is writable.
.RE

.sp
.ne 2
.mk
.na
.B -x
.I filename
.ad
.RS 16n
.rt
True if
.I filename
exists and is executable.
.RE

.sp
.ne 2
.mk
.na
.B -f
.I filename
.ad
.RS 16n
.rt
True if
.I filename
exists and is a regular file. Alternatively, if
.B /usr/bin/sh
users specify
.B /usr/ucb
before
.B /usr/bin
in
their
.B PATH
environment variable, then
.B test
will return true if
.I filename
exists and is (\fBnot\(mia\(midirectory\fR). This is also the
default for
.B /usr/bin/csh
users.
.RE

.sp
.ne 2
.mk
.na
.B -d
.I filename
.ad
.RS 16n
.rt
True if
.I filename
exists and is a directory.
.RE

.sp
.ne 2
.mk
.na
.B -c
.I filename
.ad
.RS 16n
.rt
True if
.I filename
exists and is a character special file.
.RE

.sp
.ne 2
.mk
.na
.B -b
.I filename
.ad
.RS 16n
.rt
True if
.I filename
exists and is a block special file.
.RE

.sp
.ne 2
.mk
.na
.B -p
.I filename
.ad
.RS 16n
.rt
True if
.I filename
exists and is a named pipe (fifo).
.RE

.sp
.ne 2
.mk
.na
.B -u
.I filename
.ad
.RS 16n
.rt
True if
.I filename
exists and its set-user-
.B ID
bit is set.
.RE

.sp
.ne 2
.mk
.na
.B -g
.I filename
.ad
.RS 16n
.rt
True if
.I filename
exists and its set-group-
.B ID
bit is set.
.RE

.sp
.ne 2
.mk
.na
.B -k
.I filename
.ad
.RS 16n
.rt
True if
.I filename
exists and its sticky bit is set.
.RE

.sp
.ne 2
.mk
.na
.B -s
.I filename
.ad
.RS 16n
.rt
True if
.I filename
exists and has a size greater than zero.
.RE

.sp
.ne 2
.mk
.na
\fB-t\fR[ \fIfildes\fR ]\fR
.ad
.RS 16n
.rt
True if the open file whose file descriptor number is
.I fildes
(1 by
default) is associated with a terminal device.
.RE

.sp
.ne 2
.mk
.na
.B -z
.I s1
.ad
.RS 16n
.rt
True if the length of string
.I s1
is zero.
.RE

.sp
.ne 2
.mk
.na
.B -n
.I s1
.ad
.RS 16n
.rt
True if the length of the string
.I s1
is non-zero.
.RE

.sp
.ne 2
.mk
.na
\fIs1\fB = \fIs2\fR
.ad
.RS 16n
.rt
True if strings
.I s1
and
.I s2
are identical.
.RE

.sp
.ne 2
.mk
.na
\fIs1\fB != \fIs2\fR
.ad
.RS 16n
.rt
True if strings
.I s1
and
.I s2
are
.I not
identical.
.RE

.sp
.ne 2
.mk
.na
.I s1
.ad
.RS 16n
.rt
True if
.I s1
is
.I not
the null string.
.RE

.sp
.ne 2
.mk
.na
\fIn1\fB \(mieq \fIn2\fR
.ad
.RS 16n
.rt
True if the integers
.I n1
and
.I n2
are algebraically equal. Any of
the comparisons \fB\(mine\fR, \fB\(migt\fR, \fB\(mige\fR, \fB\(milt\fR, and
\fB\(mile\fR may be used in place of \fB\(mieq\fR\&.
.RE

.SS "Operators"
.sp
.LP
These primaries may be combined with the following operators:
.sp
.ne 2
.mk
.na
.B !
.ad
.RS 16n
.rt
Unary negation operator.
.RE

.sp
.ne 2
.mk
.na
.B -a
.ad
.RS 16n
.rt
Binary
.I and
operator.
.RE

.sp
.ne 2
.mk
.na
.B -o
.ad
.RS 16n
.rt
Binary
.I or
operator (\fB-a\fR has higher precedence than
.BR -o ).
.RE

.sp
.ne 2
.mk
.na
\fB(\fIexpression\fR)\fR
.ad
.RS 16n
.rt
Parentheses for grouping. Notice also that parentheses are meaningful to
the shell and, therefore, must be quoted.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWscpu
.TE

.SH SEE ALSO
.sp
.LP
.BR find (1),
.BR sh (1),
.BR attributes (5)
.SH NOTES
.sp
.LP
The \fBnot\(mia\(midirectory\fR alternative to the \fB-f\fR option is a
transition aid for
.B BSD
applications and may not be supported in future
releases.
.sp
.LP
If you test a file you own (the
.B "-r ,"
.B -w ,
or
.B -x
tests), but the permission tested does not have the
.I owner
bit
set, a non-zero (false) exit status will be returned even though the file
may have the
.I group
or
.I other
bit set for that permission. The
correct exit status will be set if you are super-user.
.sp
.LP
The
.B =
and
.B !=
operators have a higher precedence than the
.B -r
through
.B -n
operators, and
.B =
and
.B !=
always expect
arguments; therefore,
.B =
and
.B !=
cannot be used with the
.BR -r
through
.B -n
operators.
.sp
.LP
If more than one argument follows the
.B -r
through
.B -n
operators,
only the first argument is examined; the others are ignored, unless a
.B -a
or a
.B -o
is the second argument.
