usr/src/man/man1b/touch.1b
'\" te
.\" Copyright (c) 1996, Sun Microsystems, Inc.  All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH touch 1B "26 Oct 1995" "SunOS 5.11" "SunOS/BSD Compatibility Package Commands"
.SH NAME
touch \- change file access and modification times
.SH SYNOPSIS
.LP
.nf
\fB/usr/ucb/touch\fR [\fB-acfm\fR] \fIfile\fR...
.fi

.SH DESCRIPTION
.sp
.LP
.B touch
sets the access and modification times of each file to the
current time.
.B file
is created if it does not already exist.
.SH OPTIONS
.sp
.ne 2
.mk
.na
.B -a
.ad
.RS 6n
.rt
Change the access time of
.BR file .
Do not change the modification time
unless
.B -m
is also specified.
.RE

.sp
.ne 2
.mk
.na
.B -c
.ad
.RS 6n
.rt
Do not create
.B file
if it does not exist.
.RE

.sp
.ne 2
.mk
.na
.B -f
.ad
.RS 6n
.rt
Attempt to force the touch in spite of read and write permissions on
.BR file .
.RE

.sp
.ne 2
.mk
.na
.B -m
.ad
.RS 6n
.rt
Change the modification time of
.BR file .
Do not change the access time
unless
.B -a
is also specified.
.RE

.SH USAGE
.sp
.LP
See
.BR largefile (5)
for the description of the behavior of
.BR touch
when encountering files greater than or equal to 2 Gbyte ( 2^31 bytes).
.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 6n
.rt
.B touch
executed successfully and all requested changes were made.
.RE

.sp
.ne 2
.mk
.na
.B >0
.ad
.RS 6n
.rt
An error occurred.
.B touch
returns the number of files for which the
times could not be successfully modified.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWscpu
.TE

.SH SEE ALSO
.sp
.LP
.BR touch (1),
.BR attributes (5),
.BR largefile (5)
