usr/src/man/man7i/hdio.7i
'\" te
.\" Copyright (c) 2002, Sun Microsystems, Inc.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH hdio 7I "13 Aug 2002" "SunOS 5.11" "Ioctl Requests"
.SH NAME
hdio \- SMD and IPI disk control operations
.SH SYNOPSIS
.LP
.nf
#include <sys/hdio.h>
.fi

.SH DESCRIPTION
.LP
Note -
.sp
.RS 2
The SMC and IPI drivers have been discontinued.
.BR dkio (7I)
is now the
preferred method for retrieving disk information.
.RE
.sp
.LP
The SMD and IPI disk drivers supplied with this release support a set of
.BR ioctl (2)
requests for diagnostics and bad sector information. Basic to
these
.B ioctl()
requests are the definitions in <\fBsys/hdio.h\fR>.
.SH IOCTLS
.sp
.ne 2
.mk
.na
.B HDKIOCGTYPE
.ad
.RS 15n
.rt
The argument is a pointer to a
.B hdk_type
structure (described below).
This
.B ioctl()
gets specific information from the hard disk.
.RE

.sp
.ne 2
.mk
.na
.B HDKIOCSTYPE
.ad
.RS 15n
.rt
The argument is a pointer to a
.B hdk_type
structure (described below).
This
.B ioctl()
sets specific information about the hard disk.
.RE

.sp
.in +2
.nf
/*
 * Used for drive info
 */
struct hdk_type {
 ushort_t  hdkt_hsect;    /* hard sector count (read only) */
 ushort_t  hdkt_promrev;  /* prom revision (read only) */
 uchar_t   hdkt_drtype;   /* drive type (ctlr specific) */
 uchar_t   hdkt_drstat;   /* drive status (ctlr specific, ro) */
};
.fi
.in -2

.sp
.ne 2
.mk
.na
.B HDKIOCGBAD
.ad
.RS 14n
.rt
The argument is a pointer to a
.B hdk_badmap
structure (described
below). This
.B ioctl()
is used to get the bad sector map from the
disk.
.RE

.sp
.ne 2
.mk
.na
.B HDKIOCSBAD
.ad
.RS 14n
.rt
The argument is a pointer to a
.B hdk_badmap
structure (described
below). This
.B ioctl()
is used to set the bad sector map on the disk.
.RE

.sp
.in +2
.nf
/*
 * Used for bad sector map
 */
struct hdk_badmap {
	caddr_t	hdkb_bufaddr;	/* address of user's map buffer */
};
.fi
.in -2

.sp
.ne 2
.mk
.na
.B HDKIOCGDIAG
.ad
.RS 15n
.rt
The argument is a pointer to a
.B hdk_diag
structure (described below).
This
.B ioctl()
gets the most recent command that failed along with the
sector and error number from the hard disk.
.RE

.sp
.in +2
.nf
/*
 * Used for disk diagnostics
 */
struct hdk_diag {
 ushort_t	hdkd_errcmd;  /* most recent command in error */
 daddr_t	hdkd_errsect; /* most recent sector in error */
 uchar_t	hdkd_errno;   /* most recent error number */
 uchar_t	hdkd_severe;  /* severity of most recent error */
};
.fi
.in -2

.SH SEE ALSO
.sp
.LP
.BR ioctl (2),
.BR dkio (7I)
