usr/src/man/man7i/iec61883.7i
'\" te
.\" Copyright (c) 2009, Sun Microsystems, Inc. All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH iec61883 7I "27 Mar 2009" "SunOS 5.11" "Ioctl Requests"
.SH NAME
iec61883 \- IEC 61883 interfaces
.SH SYNOPSIS
.LP
.nf
#include <sys/av/iec61883.h>
.fi

.SH DESCRIPTION
.sp
.LP
The set of interfaces described in this man page can be used to control and
exchange data with consumer audio/video devices using protocols specified
in\fIIEC 61883 Consumer Electronic Audio/Video Equipment - Digital
Interface\fR, including Common Isochronous Packet (CIP), Connection
Management Procedures (CMP) and Function Control Protocol (FCP).
.sp
.LP
An
.B iec61883
compliant driver exports two device nodes for isochronous
and for asynchronous transactions. See the
.B FILES
section of this man
page for the namespace definition.
.SS "Isochronous Transfers"
.sp
.LP
Two methods are provided to receive/transmit isochronous data: using
.BR mmap (2)
in combination with
.BR ioctl (2),
and
.BR read (2)
or
.BR write (2).
.SS "Mmap/Ioctl"
.sp
.LP
This method provides better performance and finer-grained control than
read/write, and is a method of choice for most applications. The data buffer
is mapped into a user process address space, which means no data copying
between the kernel and an application is necessary. Synchronization between
user processes and the driver is performed using
.BR ioctl (2)
commands.
.sp
.LP
An application allocates resources for isochronous transfer using
.BR IEC61883_ISOCH_INIT .
Then the data buffer can be mapped into the
process space using
.BR mmap (2).
.sp
.LP
A circular data buffer consists of one or more equal size frame buffers
(further referred to as frames, unless to avoid ambiguity with AV frames).
Frames are numbered starting with zero and are always transferred
sequentially. Frames consist equal sized packets. Each packet contains a CIP
header and one or more data blocks.
.sp
.LP
A driver and an application act as a producer and a consumer: producer
supplies
.B full
frames (filled with data) to the consumer, and the
producer is not allowed to access those frames until the consumer claims
them
.BR empty .
.sp
.LP
A transfer can be initiated and suspended with
.B IEC61883_START
and
.B IEC61883_STOP
commands respectively.
.B IEC61883_RECV
or
.B IEC61883_XMIT
is used for producer-consumer synchronization.
.SS "Read/Write"
.sp
.LP
Using this method, an application calls
.BR read (2)
or
.BR write (2)
to
receive or transmit a specified amount of data. Bus-specific overhead, such
as isochronous packet headers, is handled by the driver and is not exposed
to applications. Data returned by
.BR read (2)
contains CIP headers and
data blocks. Empty packets are not returned by
.BR read (2).
.BR write (2)
data should meet the same requirements.
.sp
.LP
If one or more channels have been allocated since
.BR open (2)
(see
.BR IEC61883_ISOCH_INIT ),
the data is received/transmitted using channel
that was created the last.
.sp
.LP
If no channels were allocated, the driver uses the broadcast channel by
default and allocates the default-size data buffer. During transmit, the
first packet's CIP header is used to auto-detect the data format. If it is
one of the formats supported by the driver, it is properly transmitted (with
inserted empty packets and timestamps).
.sp
.LP
For both methods, if during transmit the driver runs out of data, it
transmits empty packets containing only a CIP header of the next to be
transmitted packet, as defined in
.IR "IEC 61883-1" .
.SS "Connection Management Procedures"
.sp
.LP
Applications wishing to follow Connection Management Procedures (CMP) in
combination with isochronous transfers should use the
.BR ioctl (2)
.B IEC61883_PLUG_INIT, IEC61883_PLUG_FINI, IEC61883_PLUG_REG_READ
and
.B IEC61883_PLUG_REG_CAS
commands.
.SS "Asynchronous Transactions"
.sp
.LP
.BR read (2),
.BR write (2),
.BR ioctl (2),
and
.BR poll (2)
can be
used with asynchronous nodes. Asynchronous data exchange between a driver
and an application utilizes a common data structure called asynchronous
request (ARQ):
.sp
.in +2
.nf
typedef struct iec61883_arq {
        int        arq_type;
        int        arq_len;
        union {
                uint32_t   quadlet;
                uint64_t   octlet;
                uint8_t    buf[8];
        } arq_data;
} iec61883_arq_t;
.fi
.in -2
.sp

.sp
.LP
.B arq_type
contains
.B ARQ
type:
.sp
.ne 2
.mk
.na
.B IEC61883_ARQ_FCP_CMD
.ad
.br
.na
.B IEC61883_ARQ_FCP_RESP
.ad
.sp .6
.RS 4n
.B FCP
command and response frame respectively. Outgoing frames are sent
using
.BR write (2),
incoming frames are received with
.BR read (2).
.sp
See
.I "IEC 61883-1"
for the FCP frame structure definition.
.RE

.sp
.ne 2
.mk
.na
.B IEC61883_ARQ_BUS_RESET
.ad
.sp .6
.RS 4n
Returned by the driver when a bus reset occurs. There is no data associated
with this request type, and
.B arq_len
is set to 0.
.RE

.sp
.LP
If
.B arq_len
is 4 or 8, then data should be supplied in
.B arq_data.quadlet
or
.B arq_data.octlet
respectively, otherwise up
to 8 bytes can be put in
.BR arq_data.buf ,
with the rest of the data
following immediately after.
.SS "write(2)"
.sp
.LP
For a request to be sent to a target, an
.B iec61883_arq_t
structure
along with associated data is passed to the driver using
.BR write (2).
.B write()
blocks until the request is completed.
.SS "read(2)"
.sp
.LP
A driver collects incoming ARQs in the internal buffer. Buffer size can be
changed using the
.BR ioctl (2)
command
.BR IEC61883_FCP_SET_IBUF_SIZE .

.sp
.LP
Reading an ARQ takes one or two steps depending on data length. An
application first reads
.B "sizeof (iec61883_arq_t)"
bytes: if
.B arq_len
is less than or equal 4, which is usually the case, no
additional step is needed. Otherwise, the remaining
.B "arq_len - 4"
bytes
should be read and concatenated.
.sp
.LP
.BR read (2)
blocks until the specified amount of data is available,
unless
.B O_NONBLOCK
or
.B O_NDELAY
flag was set during
.BR open (2),
in which case\fBread\fR(2) returns immediately.
.SS "poll(2)"
.sp
.LP
Applications can
.BR poll (2)
asynchronous nodes on the
.BR POLLIN
event.
.SS "Bus Reset"
.sp
.LP
In case of a bus reset, the driver notifies an application by generating an
.B ARQ
of type
.BR IEC61883_ARQ_BUS_RESET .
.sp
.LP
If there were established isochronous connections before bus reset, the
driver attempts to restore all connections as described in
.IR "IEC 61883"
and resume any active transfers that were in progress.
.SH IOCTLS
.sp
.LP
The following commands only apply to isochronous nodes:
.sp
.ne 2
.mk
.na
.B IEC61883_ISOCH_INIT
.ad
.sp .6
.RS 4n
This command allocates a data buffer and isochronous resources (if
necessary) for the isochronous transfer. The argument is a pointer to the
structure:
.sp
.in +2
.nf
typedef struct iec61883_isoch_init {
      int ii_version;       /* interface version */
      int   ii_pkt_size;    /* packet size */
      int   ii_frame_size;  /* packets/frame */
      int   ii_frame_cnt;   /* # of frames */
      int   ii_direction;   /* xfer direction */
      int   ii_bus_speed;   /* bus speed */
      uint64_t ii_channel;  /* channel mask */
      int   ii_dbs;         /* DBS */
      int   ii_fn;          /* FN */
      int   ii_rate_n;      /* rate numerator */
      int   ii_rate_d;      /* rate denominator */
      int   ii_ts_mode;     /* timestamp mode */
      int   ii_flags;       /* flags */
      int   ii_handle;      /* isoch handle */
      int   ii_frame_rcnt;  /* # of frames */
      off_t   *ii_mmap_off  /* mmap offset */
      int   ii_rchannel;    /* channel */
      int   ii_error;       /* error code */
} iec61883_isoch_init_t;
.fi
.in -2
.sp

.B ii_version
should be set to
.BR IEC61883_V1_0 .
.sp
The driver attempts to allocate a data buffer consisting of
.B ii_frame_cnt
frames, with
.B ii_frame_size
packets in each frame.
Packet size in bytes is specified by
.B ii_pkt_size
specifies and should
be a multiple of 512 and compatible with
.BR ii_bus_speed .
.sp
.B ii_direction
can take one of the following values:
.sp
.ne 2
.mk
.na
.B IEC61883_DIR_RECV
.ad
.sp .6
.RS 4n
Receiving isochronous data.
.RE

.sp
.ne 2
.mk
.na
.B IEC61883_DIR_XMIT
.ad
.sp .6
.RS 4n
Transmitting isochronous data.
.RE

.B ii_bus_speed
chooses bus speed to be used and can be either
.B IEC61883_S100, IEC61883_S200
or
.BR IEC61883_S400 .
.sp
.B ii_channel
is a mask that specifies an isochronous channel number to
be used, with the \fIN\fRth bit representing channel
.IR N .
When
transmitting data, several bits can be set at a time, in which case the
driver chooses one, for example,
.B 0x3FF
means a range from 0 to 9. In
case of receive, only one bit can be set.
.sp
.B ii_dbs
specifies data block size in quadlets, for example, DBS value
for
.B SD-DVCR
is
.BR 0x78 .
Refer to
.I "IEC 61883"
for more details
on DBS.
.sp
ii_fn specifies fraction number, which defines the number of blocks in
which a source packet is divided. Allowed values are from 0 to 3. Refer to
IEC 61883 for more details on FN.
.sp
Data rate expected by the AV device can be lower than the bus speed, in
which case the driver has to periodically insert empty packets into the data
stream to avoid device buffer overflows. This rate is specified with a
fraction N/D, set by
.B ii_rate_n
and
.B ii_rate_d
respectively. Any
integer numbers can be used, or the following predefined constants:
.sp
.ne 2
.mk
.na
.B IEC61883_RATE_N_DV_NTSC IEC61883_RATE_D_DV_NTSC
.ad
.sp .6
.RS 4n
Data rate expected by
.B DV-NTSC
devices.
.RE

.sp
.ne 2
.mk
.na
.B IEC61883_RATE_N_DV_PAL IEC61883_RATE_D_DV_PAL
.ad
.sp .6
.RS 4n
Data rate expected by
.B DV-PAL
devices.
.RE

During data transmission, a timestamp based on the current value of the
cycle timer is usually required.
.B ii_ts_mode
defines timestamp mode to
be used:
.sp
.ne 2
.mk
.na
.B IEC61883_TS_SYT
.ad
.sp .6
.RS 4n
Driver puts a timestamp in the SYT field of the first CIP header of each
frame.
.RE

.sp
.ne 2
.mk
.na
.B IEC61883_TS_NONE
.ad
.sp .6
.RS 4n
No timestamps.
.RE

.B ii_dbs, ii_fn, ii_rate_n, ii_rate_d
and
.B ii_ts_mode
are only
required for transmission. In other case these should be set to 0.
.sp
.B ii_flags
should be set to 0.
.sp
If command succeeds,
.B ii_handle
contains a handle that should be used
with other isochronous commands.
.B ii_frame_rcnt
contains the number of
allocated frames (can be less than
.BR ii_frame_cnt ).
.B ii_mmap_off
contains an offset to be used in
.BR mmap (2),
for example, to map an
entire data receive buffer:
.sp
.in +2
.nf
pa = mmap(NULL, init.ii_pkt_size *
      init.ii_frame_size * init.ii_frame_rcnt,
      PROT_READ, MAP_PRIVATE, fd, init.ii_mmap_off);
.fi
.in -2
.sp

.B ii_rchannel
contains channel number.
.sp
In case of command success,
.B ii_error
is set to 0; otherwise one of
the following values can be returned:
.sp
.ne 2
.mk
.na
.B IEC61883_ERR_NOMEM
.ad
.sp .6
.RS 4n
Not enough memory for the data buffer.
.RE

.sp
.ne 2
.mk
.na
.B IEC61883_ERR_NOCHANNEL
.ad
.sp .6
.RS 4n
Cannot allocate isochronous channel.
.RE

.sp
.ne 2
.mk
.na
.B IEC61883_ERR_PKT_SIZE
.ad
.sp .6
.RS 4n
Packet size is not allowed at this bus speed.
.RE

.sp
.ne 2
.mk
.na
.B IEC61883_ERR_VERSION
.ad
.sp .6
.RS 4n
Interface version is not supported.
.RE

.sp
.ne 2
.mk
.na
.B IEC61883_ERR_INVAL
.ad
.sp .6
.RS 4n
One or more the parameters are invalid
.RE

.sp
.ne 2
.mk
.na
.B IEC61883_ERR_OTHER
.ad
.sp .6
.RS 4n
Unspecified error type.
.RE

.RE

.sp
.ne 2
.mk
.na
.B IEC61883_ISOCH_FINI
.ad
.sp .6
.RS 4n
Argument is a handle returned by
.BR IEC61883_ISOCH_INIT .
This command
frees any resources associated with this handle. There must be no active
transfers and the data buffer must be unmapped; otherwise the command
fails.
.RE

.sp
.ne 2
.mk
.na
.B IEC61883_START
.ad
.sp .6
.RS 4n
This command starts an isochronous transfer. The argument is a handle
returned by
.BR IEC61883_ISOCH_INIT .
.RE

.sp
.ne 2
.mk
.na
.B IEC61883_STOP
.ad
.sp .6
.RS 4n
This command stops an isochronous transfer. The argument is a handle
returned by
.BR IEC61883_ISOCH_INIT .
.RE

.sp
.ne 2
.mk
.na
.B IEC61883_RECV
.ad
.sp .6
.RS 4n
This command is used to receive full frames and return empty frames to the
driver. The argument is a pointer to the structure:
.sp
.in +2
.nf
typedef struct iec61883_recv {
        int rx_handle;     /* isoch handle */
        int rx_flags;      /* flags */
iec61883_xfer_t rx_xfer;   /* xfer params */
} iec61883_recv_t;

typedef struct iec61883_xfer {
        int   xf_empty_idx; /* first empty frame */
        int xf_empty_cnt;   /* empty frame count */
        int   xf_full_idx;  /* first full frame */
        int   xf_full_cnt;  /* full frame count */
        int   xf_error;     /* error */
} iec61883_xfer_t;
.fi
.in -2
.sp

.B rx_flags
should be set to 0.
.sp
An application sets \fBxf_empty_idx\fR and \fBxf_empty_cnt\fR to indicate
frames it no longer needs. E.g. if a buffer consists of 6 frames,
.B xf_empty_idx
is 4,
.B xf_empty_cnt
is 3 - means that frames 4, 5
and 0 can now be reused by the driver. If there are no empty frames, for
example, the first time this command is called,
.B xf_empty_cnt
should be
set to 0.
.sp
When the command returns, \fBxf_full_idx\fR and \fBxf_full_cnt\fR specifies
the frames that are full.
.B xf_error
is always 0.
.sp
In general, AV frame boundaries are not aligned with the frame buffer
boundaries, because the first received packet might not be the first packet
of an AV frame, and, in contrast with the read/write method, the driver does
not remove empty CIP packets.
.sp
Applications should detect empty packets by comparing adjacent packets'
continuity counters (DBC field of the CIP header).
.RE

.sp
.ne 2
.mk
.na
.B IEC61883_XMIT
.ad
.sp .6
.RS 4n
This command is used to transmit full frames and get more empty frames from
the driver. The argument is a pointer to the structure:
.sp
.in +2
.nf
typedef struct iec61883_xmit {
        int   tx_handle;         /* isoch handle */
        int   tx_flags;          /* flags */
        iec61883_xfer_t tx_xfer; /* xfer params */
        int   tx_miss_cnt;       /* missed cycles */
 } iec61883_xmit_t;
.fi
.in -2
.sp

.B tx_flags
should be set to zero.
.sp
The application sets \fBxf_full_idx\fR and \fBxf_full_cnt\fR to specify
frames it wishes to transmit. If there are no frames to transmit (e.g. the
first time this command is called),
.B xf_full_cnt
should be set to 0.
.sp
When the command returns, \fBxf_empty_idx\fR and \fBxf_empty_cnt\fR
specifies empty frames which can be to transmit more data.
.B xf_error
is
always 0.
.sp
.B tx_miss_cnt
contains the number of isochronous cycles missed since
last transfer due to data buffer under run. This can happen when an
application does not supply data fast enough.
.sp
For the purposes of time stamping, the driver considers the first packet in
a frame buffer to be the first packet of an AV frame.
.RE

.sp
.ne 2
.mk
.na
.B IEC61883_PLUG_INIT
.ad
.sp .6
.RS 4n
This command returns a handle for the specified plug. The argument is a
pointer to the structure:
.sp
.in +2
.nf
typedef struct iec61883_plug_init {
        int   pi_ver;     /* interface version */
        int   pi_loc;     /* plug location */
        int   pi_type;    /* plug type */
        int   pi_num;     /* plug number */
        int   pi_flags;   /* flags */
        int   pi_handle;  /* plug handle */
        int   pi_rnum;    /* plug number */
 } iec61883_plug_init_t;
.fi
.in -2
.sp

.B pi_ver
should be set to
.BR IEC61883_V1_0 .
.sp
.B pi_loc
specifies plug location:
.sp
.ne 2
.mk
.na
.B IEC61883_LOC_LOCAL
.ad
.sp .6
.RS 4n
On the local unit (local plug). A plug control register (PCR) is allocated.
Command fails if the plug already exists
.RE

.sp
.ne 2
.mk
.na
.B IEC61883_LOC_REMOTE
.ad
.sp .6
.RS 4n
On the remote unit (remote plug). The plug should exist on the remote unit,
otherwise the command fails.
.RE

.B pi_type
specifies isochronous plug type:
.sp
.ne 2
.mk
.na
.B IEC61883_PLUG_IN IEC61883_PLUG_OUT
.ad
.sp .6
.RS 4n
Input or output plugs.
.RE

.sp
.ne 2
.mk
.na
.B IEC61883_PLUG_MASTER_IN IEC61883_PLUG_MASTER_OUT
.ad
.sp .6
.RS 4n
Master input or master output plug. These plugs always exist on the local
unit.
.RE

.B pi_num
specifies plug number. This should be 0 for master plugs, and
from 0 to 31 for input/output plugs. Alternatively, a special value
.B IEC61883_PLUG_ANY
can be used to let the driver choose a free plug
number, create the plug and return the number in
.BR pi_rnum .
.sp
.B pi_flags
should be set to 0.
.sp
If the command succeeds,
.B pi_handle
contains a handle that should be
used with other plug commands.
.RE

.sp
.ne 2
.mk
.na
.B IEC61883_PLUG_FINI
.ad
.sp .6
.RS 4n
Argument is a handle returned by
.BR IEC61883_PLUG_INIT .
This command
frees any resources associated with this handle, including the PCR.
.RE

.sp
.ne 2
.mk
.na
.B IEC61883_PLUG_REG_READ
.ad
.sp .6
.RS 4n
Read plug register value. The argument is a pointer to the structure:
.sp
.in +2
.nf
typedef struct iec61883_plug_reg_val {
        int         pr_handle; /* plug handle */
        uint32_t     pr_val;    /* register value */
} iec61883_plug_reg_val_t;
.fi
.in -2
.sp

.B pr_handle
is a handle returned by
.BR IEC61883_PLUG_INIT .
Register
value is returned in
.BR pr_val .
.RE

.sp
.ne 2
.mk
.na
.B IEC61883_PLUG_REG_CAS
.ad
.sp .6
.RS 4n
Atomically compare and swap plug register value. The argument is a pointer
to the structure:
.sp
.in +2
.nf
typedef struct iec61883_plug_reg_lock {
        int        pl_handle; /* plug handle */
        uint32_t   pl_arg;    /* compare arg */
        uint32_t   pl_data;   /* write value */
        UINT32_t   pl_old;    /* original value */
} iec61883_plug_reg_lock_t;
.fi
.in -2
.sp

pr_handle is a handle returned by IEC61883_PLUG_INIT.
.sp
Original register value is compared with pl_arg and if they are equal,
register value is replaced with pl_data. In any case, the original value is
stored in pl_old.
.RE

.sp
.LP
The following commands only apply to asynchronous nodes:
.sp
.ne 2
.mk
.na
.B IEC61883_ARQ_GET_IBUF_SIZE
.ad
.sp .6
.RS 4n
This command returns current incoming ARQ buffer size. The argument is a
pointer to
.BR int .
.RE

.sp
.ne 2
.mk
.na
.B IEC61883_ARQ_SET_IBUF_SIZE
.ad
.sp .6
.RS 4n
This command changes incoming ARQ buffer size. The argument is the new
buffer size in bytes.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B /dev/av/N/async
.ad
.RS 19n
.rt
Device node for asynchronous data
.RE

.sp
.ne 2
.mk
.na
.B /dev/av/N/isoch
.ad
.RS 19n
.rt
Device has been disconnected
.RE

.SH ERRORS
.sp
.ne 2
.mk
.na
.B EIO
.ad
.RS 10n
.rt
Bus operation failed.
.sp
DMA failure.
.RE

.sp
.ne 2
.mk
.na
.B EFAULT
.ad
.RS 10n
.rt
.BR ioctl (2)
argument points to an illegal address.
.RE

.sp
.ne 2
.mk
.na
.B EINVAL
.ad
.RS 10n
.rt
Invalid argument or argument combination.
.RE

.sp
.ne 2
.mk
.na
.B ENODEV
.ad
.RS 10n
.rt
Device has been disconnected.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(1.83i) |cw(3.67i)
lw(1.83i) |lw(3.67i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
ArchitectureAll
_
Stability levelCommitted
.TE

.SH SEE ALSO
.sp
.LP
.BR ioctl (2),
.BR mmap (2),
.BR open (2),
.BR poll (2),
.BR read (2),
.BR write (2),
.BR attributes (5),
.BR av1394 (7D)
.sp
.LP
.I "IEC 61883 Consumer audio/video equipment - Digital interface
.sp
.LP
.I "IEEE Std 1394-1995 Standard for a High Performance Serial Bus
