usr/src/man/man7i/mhd.7i
'\" te
.\" Copyright (c) 2005 Sun Microsystems, Inc.  All Rights Reserved.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH mhd 7i "1 Sep 2005" "SunOS 5.11" "Ioctl Requests"
.SH NAME
mhd \- multihost disk control operations
.SH SYNOPSIS
.LP
.nf
\fB#include\fR \fB<sys/mhd.h>\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.BR "mhd ioctl" (2)
control access rights of a multihost disk,
using disk reservations on the disk device.
.sp
.LP
The stability level of this interface (see
.BR attributes (5))
is
evolving. As a result, the interface is subject to change and you should
limit your use of it.
.sp
.LP
The mhd ioctls fall into two major categories: (1) ioctls for non-shared
multihost disks and (2)  ioctls for shared multihost disks.
.sp
.LP
One ioctl,
.BR MHIOCENFAILFAST ,
is applicable to both non-shared and
shared multihost disks.  It is described after the first two categories.
.sp
.LP
All the ioctls require root privilege.
.sp
.LP
For all of the ioctls, the caller should obtain the file descriptor for the
device by calling
.BR open (2)
with the
.B O_NDELAY
flag; without the
.B O_NDELAY
flag, the open may fail due to another host already having a
conflicting reservation on the device. Some of the ioctls below permit the
caller to forcibly clear a conflicting reservation held by another host,
however, in order to call the ioctl, the caller must first obtain the open
file descriptor.
.SS "Non-shared multihost disks"
.sp
.LP
Non-shared multihost disks ioctls consist of
.BR MHIOCTKOWN ,
.BR MHIOCRELEASE ,
.BR HIOCSTATUS ,
and
.BR MHIOCQRESERVE .
These ioctl
requests control the access rights of non-shared multihost disks. A
non-shared multihost disk is one that supports serialized, mutually
exclusive I/O mastery by the connected hosts. This is in contrast to the
shared-disk model, in which concurrent access is allowed from more than one
host (see below).
.sp
.LP
A non-shared multihost disk can be in one of two states:
.RS +4
.TP
.ie t \(bu
.el o
Exclusive access state, where only one connected host has I/O access
.RE
.RS +4
.TP
.ie t \(bu
.el o
Non-exclusive access state, where all connected hosts have I/O access. An
external hardware reset can cause the disk to enter the non-exclusive access
state.
.RE
.sp
.LP
Each multihost disk driver views the machine on which it's running as the
"local host"; each views all other machines as "remote hosts".  For each I/O
or ioctl request, the requesting host is the local host.
.sp
.LP
Note that the non-shared ioctls are designed to work with SCSI-2 disks. The
SCSI-2 RESERVE/RELEASE command set is the underlying hardware facility in
the device that supports the non-shared ioctls.
.sp
.LP
The function prototypes for the non-shared ioctls are:
.sp
.in +2
.nf
ioctl(fd, MHIOCTKOWN);
ioctl(fd, MHIOCRELEASE);
ioctl(fd, MHIOCSTATUS);
ioctl(fd, MHIOCQRESERVE);
.fi
.in -2

.sp
.ne 2
.mk
.na
.B MHIOCTKOWN
.ad
.RS 18n
.rt
Forcefully acquires exclusive access rights to the multihost disk for the
local host. Revokes all access rights to the multihost disk from remote
hosts. Causes the disk to enter the exclusive access state.
.sp
Implementation Note: Reservations (exclusive access rights) broken via
random resets should be reinstated by the driver upon their detection, for
example, in the automatic probe function described below.
.RE

.sp
.ne 2
.mk
.na
.B MHIOCRELEASE
.ad
.RS 18n
.rt
Relinquishes exclusive access rights to the multihost disk for the local
host. On success, causes the disk to enter the  non- exclusive access
state.
.RE

.sp
.ne 2
.mk
.na
.B MHIOCSTATUS
.ad
.RS 18n
.rt
Probes a multihost disk to determine whether the local host has access
rights to the disk. Returns
.B 0
if the local host has access to the
disk,
.B 1
if it doesn't, and
.B -1
with errno set to
.B EIO
if
the probe failed for some other reason.
.RE

.sp
.ne 2
.mk
.na
.B MHIOCQRESERVE
.ad
.RS 18n
.rt
Issues, simply and only, a SCSI-2 Reserve command. If the attempt to
reserve fails due to the SCSI error Reservation Conflict (which implies that
some other host has the device reserved), then the ioctl will return
.B -1
with errno set to
.BR EACCES .
The
.B MHIOCQRESERVE
ioctl does
NOT issue a bus device reset or bus reset prior to attempting the SCSI-2
reserve command.  It also does not take care of re-instating reservations
that disappear due to bus resets or bus device resets; if that behavior is
desired, then the caller can call
.B MHIOCTKOWN
after the
.B MHIOCQRESERVE
has returned success.  If the device does not support
the SCSI-2 Reserve command, then the ioctl returns
.B -1
with
.B errno
set to
.B ENOTSUP.
The
.B MHIOCQRESERVE
ioctl is intended
to be used by high-availability or clustering software for a "quorum" disk,
hence, the "Q" in the name of the ioctl.
.RE

.SS "Shared Multihost Disks"
.sp
.LP
Shared multihost disks ioctls control access to shared multihost disks. The
ioctls are merely a veneer on the SCSI-3 Persistent Reservation facility.
Therefore, the underlying semantic model is not described in detail here,
see instead the SCSI-3 standard. The SCSI-3 Persistent Reservations support
the concept of a group of hosts all sharing access to a disk.
.sp
.LP
The function prototypes and descriptions for the shared multihost ioctls
are as follows:
.sp
.ne 2
.mk
.na
\fBioctl\fR(\fBfd\fR, \fBMHIOCGRP_INKEYS\fR, (\fBmhioc_inkeys_t\fR)
\fI*k\fB);\fR
.ad
.sp .6
.RS 4n
Issues the SCSI-3 command Persistent Reserve In Read Keys to the device.
On input, the field
.B k->li
should be initialized by the caller with
.B k->li.listsize
reflecting how big of an array the caller has allocated
for the
.B k->li.list
field and with
.BR "k->li.listlen =="
.B 0.
On return, the field
.B k->li.listlen
is updated to indicate the
number of reservation keys the device currently has: if this value is larger
than
.B k->li.listsize
then that indicates that the caller should have
passed a bigger
.B k->li.list
array with a bigger
.BR k->li.listsize.
The number of array elements actually written by the callee into
.B k->li.list
is the minimum of
.B k->li.listlen
and
.B k->li.listsize.
The field k->generation is updated with the generation
information returned by the SCSI-3 Read Keys query. If the device does not
.RB "support SCSI-3 Persistent Reservations, then this ioctl returns" " -1"
with
.B errno
set to
.BR ENOTSUP .
.RE

.sp
.ne 2
.mk
.na
\fBioctl\fR(\fBfd\fR, \fBMHIOCGRP_INRESV\fR, (\fBmhioc_inresvs_t\fR)
\fI*r\fB);\fR
.ad
.sp .6
.RS 4n
Issues the SCSI-3 command Persistent Reserve In Read Reservations to the
device. Remarks similar to
.B MHIOCGRP_INKEYS
apply to the array
manipulation. If the device does not support SCSI-3 Persistent Reservations,
then this ioctl returns
.B -1
with
.B errno
set to
.BR ENOTSUP .
.RE

.sp
.ne 2
.mk
.na
\fBioctl\fR(\fBfd\fR, \fBMHIOCGRP_REGISTER\fR, (\fBmhioc_register_t\fR)
\fI*r\fB);\fR
.ad
.sp .6
.RS 4n
Issues the SCSI-3 command Persistent Reserve Out Register. The fields of
structure
.I r
are all inputs; none of the fields are modified by the
ioctl. The field
.B r->aptpl
should be set to true to specify that
registrations and reservations should persist across device power failures,
or to false to specify that registrations and reservations should be cleared
upon device power failure; true is the recommended setting. The field
.B r->oldkey
is the key that the caller believes the device may already
have for this host initiator; if the caller believes that that this host
initiator is not already registered with this device, it should pass the
special key of all zeros.  To achieve the effect of unregistering with the
device, the caller should pass its current key for the
.B r->oldkey
field
and an
.B r->newkey
field containing the special key of all zeros.  If
the device returns the SCSI error code Reservation Conflict, this ioctl
returns
.B -1
with
.B errno
set to
.BR EACCES .
.RE

.sp
.ne 2
.mk
.na
\fBioctl\fR(\fBfd\fR, \fBMHIOCGRP_RESERVE\fR, (\fBmhioc_resv_desc_t\fR)
\fI*r\fB);\fR
.ad
.sp .6
.RS 4n
Issues the SCSI-3 command Persistent Reserve Out Reserve. The fields of
structure
.I r
are all inputs; none of the fields are modified by the
ioctl. If the device returns the SCSI error code Reservation Conflict, this
ioctl returns
.B -1
with
.B errno
set to
.BR EACCES.
.RE

.sp
.ne 2
.mk
.na
\fBioctl\fR(\fBfd\fR, \fBMHIOCGRP_PREEMPTANDABORT\fR,
(\fBmhioc_preemptandabort_t\fR) \fI*r\fB);\fR
.ad
.sp .6
.RS 4n
Issues the SCSI-3 command Persistent Reserve Out Preempt-And-Abort.  The
fields of structure
.I r
are all inputs; none of the fields are modified
by the ioctl. The key of the victim host is specified by the field
.BR r->victim_key .
The field
.B r->resvdesc
supplies the preempter's
key and the reservation that it is requesting as part of the SCSI-3
Preempt-And-Abort command.  If the device returns the SCSI error code
Reservation Conflict, this ioctl returns
.B -1
with
.B errno
set to
.B EACCES.
.RE

.sp
.ne 2
.mk
.na
\fBioctl\fR(\fBfd\fR, \fBMHIOCGRP_PREEMPT\fR,
(\fBmhioc_preemptandabort_t\fR) \fI*r\fB);\fR
.ad
.sp .6
.RS 4n
Similar to
.BR MHIOCGRP_PREEMPTANDABORT ,
but instead issues the SCSI-3
command Persistent Reserve Out Preempt. (Note: This command is not
implemented).
.RE

.sp
.ne 2
.mk
.na
\fBioctl\fR(\fBfd\fR, \fBMHIOCGRP_CLEAR\fR, (\fBmhioc_resv_key_t\fR)
\fI*r\fB);\fR
.ad
.sp .6
.RS 4n
Issues the SCSI-3 command Persistent Reserve Out Clear. The input parameter
.I r
is the reservation key of the caller, which should have been already
registered with the device, by an earlier call to
.BR MHIOCGRP_REGISTER .
(Note: This command is not implemented).
.RE

.sp
.LP
For each device, the non-shared ioctls should not be mixed with the
Persistent Reserve Out shared ioctls, and vice-versa,  otherwise, the
underlying device is likely to return errors, because SCSI does not permit
SCSI-2 reservations to be mixed with SCSI-3 reservations on a single device.
It is, however, legitimate to call the Persistent Reserve In ioctls, because
these are query only.  Issuing the
.B MHIOCGRP_INKEYS
ioctl  is the
recommended way for a caller to determine if the device  supports SCSI-3
Persistent Reservations (the ioctl will return
.B -1
with
.BR errno
set to
.B ENOTSUP
if the device does not).
.SS "MHIOCENFAILFAST Ioctl"
.sp
.LP
The
.B MHIOCENFAILFAST
ioctl is applicable for both non-shared and
shared disks, and may be used with either the non-shared or shared ioctls.

.sp
.ne 2
.mk
.na
\fBioctl\fR(\fBfd\fR, \fBMHIOENFAILFAST\fR, (unsigned int \fI*\fR)
\fImillisecs\fB);\fR
.ad
.sp .6
.RS 4n
Enables or disables the failfast option in the multihost disk driver and
enables or disables automatic probing of a multihost disk, described below.
The argument is an unsigned integer specifying the number of milliseconds to
wait between executions of the automatic probe function.  An argument of
zero disables the failfast option and disables automatic probing.  If the
.B MHIOCENFAILFAST
ioctl is never called, the effect is defined to be
that both the failfast option and automatic probing are disabled.
.RE

.SS "Automatic Probing"
.sp
.LP
The
.B MHIOCENFAILFAST
ioctl sets up a timeout in the driver to
periodically schedule automatic probes of  the  disk. The automatic probe
function works in this manner: The driver is scheduled  to probe the
multihost disk every n milliseconds, rounded up to the next integral
multiple of the system clock's resolution. If
.RS +4
.TP
1.
the local host no longer has access  rights  to  the multihost disk, and
.RE
.RS +4
.TP
2.
access rights were expected to be held by the  local host,
.RE
.sp
.LP
the driver immediately panics the machine to comply with the failfast
model.
.sp
.LP
If the driver makes this discovery outside the timeout function, especially
during a read or write operation, it is imperative that it panic the system
then as well.
.SH RETURN VALUES
.sp
.LP
Each request returns
.B -1
on failure and sets
.B errno
to indicate
the error.
.sp
.ne 2
.mk
.na
.B EPERM
.ad
.RS 14n
.rt
Caller is not root.
.RE

.sp
.ne 2
.mk
.na
.B EACCES
.ad
.RS 14n
.rt
Access rights were denied.
.RE

.sp
.ne 2
.mk
.na
.B EIO
.ad
.RS 14n
.rt
The multihost disk or controller was unable to successfully complete the
requested operation.
.RE

.sp
.ne 2
.mk
.na
.B EOPNOTSUP
.ad
.RS 14n
.rt
The multihost disk does not support the operation. For example, it does not
support the SCSI-2 Reserve/Release command set, or the SCSI-3 Persistent
Reservation command set.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for a description of the following attributes:
.sp

.sp
.TS
tab() box;
lw(2.75i) lw(2.75i)
lw(2.75i) lw(2.75i)
.
\fBATTRIBUTE TYPE\fR\fBATTRIBUTE VALUE\fR
AvailabilitySUNWhea
StabilityEvolving
.TE

.SH SEE ALSO
.sp
.LP
.BR ioctl (2),
.BR open (2),
.BR attributes (5),
open(2)
