usr/src/man/man7i/quotactl.7i
'\" te
.\" Copyright (c) 2004, Sun Microsystems, Inc.  All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH quotactl 7I "14 June 2004" "SunOS 5.11" "Ioctl Requests"
.SH NAME
quotactl \- manipulate disk quotas
.SH SYNOPSIS
.LP
.nf
#include <sys/fs/ufs_quota.h>
int ioctl(int \fIfd\fR, Q_QUOTACTL, struct quotcl *\fIqp\fR)
.fi

.SH DESCRIPTION
.sp
.LP
This
.B ioctl()
call manipulates disk quotas. \fIfd\fR is the file
descriptor returned by the
.B open()
system call after opening the
\fBquotas\fR file (located in the root directory of the filesystem running
quotas.)
.B Q_QUOTACTL
is defined in
\fB/usr/include/sys/fs/ufs_quota.h\fR. \fIqp\fR is the address of the
\fBquotctl\fR structure which is defined as
.sp
.in +2
.nf
struct quotctl {
  int op;
  uid_t uid;
  caddr_t addr;
};
.fi
.in -2

.sp
.LP
\fIop\fR indicates an operation to be applied to the user \fBID\fR
.IR uid .
(See below.)
.I addr
is the address of an optional, command
specific, data structure which is copied in or out of the system. The
interpretation of
.I addr
is given with each value of
.I op
below.
.sp
.ne 2
.mk
.na
.B Q_QUOTAON
.ad
.RS 14n
.rt
Turn on quotas for a file system.
.I addr
points to the full pathname of
the
.B quotas
file.
.I uid
is ignored. It is recommended that
\fIuid\fR have the value of
.BR 0 .
This call is restricted to the
super-user.
.RE

.sp
.ne 2
.mk
.na
.B Q_QUOTAOFF
.ad
.RS 14n
.rt
Turn off quotas for a file system.
.I addr
and
.I uid
are ignored. It
is recommended that
.I addr
have the value of
.I NULL
and
.IR uid
have the value of
.BR 0 .
This call is restricted to the super-user.
.RE

.sp
.ne 2
.mk
.na
.B Q_GETQUOTA
.ad
.RS 14n
.rt
Get disk quota limits and current usage for user
.IR uid .
\fIaddr\fR is a
pointer to a
.B dqblk
structure (defined in
.BR <sys/fs/ufs_quota.h> ).
Only the super-user may get the quotas of a user other than himself.
.RE

.sp
.ne 2
.mk
.na
.B Q_SETQUOTA
.ad
.RS 14n
.rt
Set disk quota limits and current usage for user
.IR uid .
\fIaddr\fR is a
pointer to a
.B dqblk
structure (defined in
.BR sys/fs/ufs_quota.h ).
This call is restricted to the super-user.
.RE

.sp
.ne 2
.mk
.na
.B Q_SETQLIM
.ad
.RS 14n
.rt
Set disk quota limits for user
.IR uid .
\fIaddr\fR is a pointer to a
\fBdqblk\fR structure (defined in
.BR sys/fs/ufs_quota.h ).
This call is
restricted to the super-user.
.RE

.sp
.ne 2
.mk
.na
.B Q_SYNC
.ad
.RS 14n
.rt
Update the on-disk copy of quota usages for this file system. \fIaddr\fR
and
.I uid
are ignored.
.RE

.sp
.ne 2
.mk
.na
.B Q_ALLSYNC
.ad
.RS 14n
.rt
Update the on-disk copy of quota usages for all file systems with active
quotas.
.I addr
and
.I uid
are ignored.
.RE

.SH RETURN VALUES
.sp
.LP
This
.B ioctl()
returns:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 9n
.rt
on success.
.RE

.sp
.ne 2
.mk
.na
\fB\(mi1\fR
.ad
.RS 9n
.rt
on failure and sets
.B errno
to indicate the error.
.RE

.SH ERRORS
.sp
.ne 2
.mk
.na
.B EFAULT
.ad
.RS 10n
.rt
\fIaddr\fR is invalid.
.RE

.sp
.ne 2
.mk
.na
.B EINVAL
.ad
.RS 10n
.rt
The kernel has not been compiled with the
.B QUOTA
option.
.I op
is
invalid.
.RE

.sp
.ne 2
.mk
.na
.B ENOENT
.ad
.RS 10n
.rt
The
.B quotas
file specified by
.I addr
does not exist.
.RE

.sp
.ne 2
.mk
.na
.B EPERM
.ad
.RS 10n
.rt
The call is privileged and the calling process did not assert
{PRIV_SYS_MOUNT} in the effective set.
.RE

.sp
.ne 2
.mk
.na
.B ESRCH
.ad
.RS 10n
.rt
No disk quota is found for the indicated user. Quotas have not been turned
on for this file system.
.RE

.sp
.ne 2
.mk
.na
.B EUSERS
.ad
.RS 10n
.rt
The quota table is full.
.RE

.sp
.LP
If
.I op
is
.BR Q_QUOTAON ,
\fBioctl()\fR may set \fBerrno\fR to:
.sp
.ne 2
.mk
.na
.B EACCES
.ad
.RS 10n
.rt
The quota file pointed to by
.I addr
exists but is not a regular file.
The quota file pointed to by
.I addr
exists but is not on the file system
pointed to by
.IR special .
.RE

.sp
.ne 2
.mk
.na
.B EIO
.ad
.RS 10n
.rt
Internal I/O error while attempting to read the
.B quotas
file pointed
to by
.IR addr .
.RE

.SH FILES
.sp
.ne 2
.mk
.na
\fB/usr/include/sys/fs/ufs_quota.h\fR
.ad
.sp .6
.RS 4n
quota-related structure/function definitions and defines
.RE

.SH SEE ALSO
.sp
.LP
.BR quota (1M),
.BR quotacheck (1M),
.BR quotaon (1M),
.BR getrlimit (2),
.BR mount (2)
.SH BUGS
.sp
.LP
There should be some way to integrate this call with the resource limit
interface provided by
.B setrlimit()
and
.BR getrlimit (2).
.sp
.LP
This call is incompatible with Melbourne quotas.
