usr/src/man/man1m/accept.1m
'\" te
.\" Copyright (c) 2006 Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" Copyright 1989 AT&T
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH accept 1M "5 Jun 2006" "SunOS 5.11" "System Administration Commands"
.SH NAME
accept, reject \- accept or reject print requests
.SH SYNOPSIS
.LP
.nf
\fBaccept\fR \fIdestination\fR...
.fi

.LP
.nf
\fBreject\fR [\fB-r\fR \fIreason\fR] \fIdestination\fR...
.fi

.SH DESCRIPTION
.sp
.LP
.B accept
allows the queueing of print requests for the named
destinations.
.sp
.LP
.B reject
prevents queueing of print requests for the named
destinations.
.sp
.LP
Use
.B "lpstat -a"
to check if destinations are accepting or
rejecting print requests.
.sp
.LP
Generally,
.B accept
and
.B reject
are run on the print server to
control local print queues. Under some configurations,
.B accept
and
.B reject
are run on client systems when IPP is being used to communicate
between client and server.
.SH OPTIONS
.sp
.LP
The following options are supported for
.BR reject :
.sp
.ne 2
.mk
.na
.B -r
.I reason
.ad
.RS 13n
.rt
Assigns a reason for rejection of print requests for
.IR destination.
.sp
.I reason
is reported by
.BR "lpstat -a" .
By default, \fIreason\fR
is
.B "unknown reason"
for existing destinations, and \fBnew\fR
.B printer
for destinations added to the system but not yet accepting
requests. Enclose
.I reason
in quotes if it contains blanks.
.RE

.SH OPERANDS
.sp
.LP
The following operands are supported:
.sp
.ne 2
.mk
.na
.I destination
.ad
.RS 15n
.rt
The name of the destination accepting or rejecting print requests.
Destination specifies the name of a printer or class of printers (see
.BR lpadmin (1M)).
Specify
.I destination
using atomic name or URI-style
(scheme://endpoint) names. See
.BR printers.conf (4)
for information
regarding the naming conventions for destinations.
.RE

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 12n
.rt
Successful completion.
.RE

.sp
.ne 2
.mk
.na
.B non-zero
.ad
.RS 12n
.rt
An error occurred.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/printers.conf
.ad
.RS 24n
.rt
System printer configuration database
.RE

.sp
.ne 2
.mk
.na
.B $HOME/.printers
.ad
.RS 24n
.rt
User-configurable printer database
.RE

.sp
.ne 2
.mk
.na
.B ou=printers
.ad
.RS 24n
.rt
LDAP version of \fB/etc/printers.conf\fR
.RE

.sp
.ne 2
.mk
.na
.B printers.conf.byname
.ad
.RS 24n
.rt
.B NIS
version of \fB/etc/printers.conf\fR
.RE

.sp
.ne 2
.mk
.na
.B printers.org_dir
.ad
.RS 24n
.rt
.B NIS+
version of \fB/etc/printers.conf\fR
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWlp-cmds
_
CSIEnabled. See \fBNOTES\fR.
_
Interface StabilityObsolete
.TE

.SH SEE ALSO
.sp
.LP
.BR enable (1),
.BR lp (1),
.BR lpstat (1),
.BR lpadmin (1M),
.BR lpsched (1M),
.BR printers.conf (4),
.BR attributes (5)
.SH NOTES
.sp
.LP
.B accept
and
.B reject
affect only queueing on the print server's
spooling system. Requests made from a client system remain queued in the
client system's queueing mechanism until they are cancelled or accepted by
the print server's spooling system.
.sp
.LP
.B accept
is CSI-enabled except for the
.I destination
name.
.sp
.LP
When IPP is in use, the user is prompted for a passphrase if the remote
print service is configured to require authentication.
