usr/src/man/man1m/acctcms.1m
'\" te
.\" Copyright 1989 AT&T Copyright (c) 1999, Sun Microsystems, Inc.  All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH acctcms 1M "22 Feb 1999" "SunOS 5.11" "System Administration Commands"
.SH NAME
acctcms \- command summary from process accounting records
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/acct/acctcms\fR [\fB-a\fR [\fB-o\fR] [\fB-p\fR]] [\fB-c\fR] [\fB-j\fR] [\fB-n\fR] [\fB-s\fR]
     [\fB-t\fR] \fIfilename\fR.\|.\|.
.fi

.SH DESCRIPTION
.sp
.LP
.B acctcms
reads one or more
.IR filename s,
normally in the form
described in
.BR acct.h (3HEAD).
It adds all records for processes that
executed identically named commands, sorts them, and writes them to the
standard output, normally using an internal summary format.
.SH OPTIONS
.sp
.ne 2
.mk
.na
.B -a
.ad
.RS 6n
.rt
Print output in
.B ASCII
rather than in the internal summary format. The
output includes command name, number of times executed, total kcore-minutes,
total
.B CPU
minutes, total real minutes, mean size (in K), mean
\fBCPU\fR minutes per invocation, "hog factor," characters transferred, and
blocks read and written, as in
.BR acctcom (1).
Output is normally sorted
by total kcore-minutes.
.sp
Use the following options only with the
.B -a
option:
.sp
.ne 2
.mk
.na
.B -o
.ad
.RS 6n
.rt
Output a (non-prime) offshift-time-only command summary.
.RE

.sp
.ne 2
.mk
.na
.B -p
.ad
.RS 6n
.rt
Output a prime-time-only command summary.
.RE

When
.B -o
and
.B -p
are used together, a combination prime-time and
non-prime-time report is produced.  All the output summaries are total usage
except number of times executed, CPU minutes, and real minutes, which are
split into prime and non-prime.
.RE

.sp
.ne 2
.mk
.na
.B -c
.ad
.RS 6n
.rt
Sort by total
.B CPU
time, rather than total kcore-minutes.
.RE

.sp
.ne 2
.mk
.na
.B -j
.ad
.RS 6n
.rt
Combine all commands invoked only once under "***other".
.RE

.sp
.ne 2
.mk
.na
.B -n
.ad
.RS 6n
.rt
Sort by number of command invocations.
.RE

.sp
.ne 2
.mk
.na
.B -s
.ad
.RS 6n
.rt
Any file names encountered hereafter are already in internal summary
format.
.RE

.sp
.ne 2
.mk
.na
.B -t
.ad
.RS 6n
.rt
Process all records as total accounting records. The default internal
summary format splits each field into prime and non-prime-time parts. This
option combines the prime and non-prime time parts into a single field that
is the total of both, and provides upward compatibility with old style
.B acctcms
internal summary format records.
.RE

.SH EXAMPLES
.LP
.B Example 1
Using the
.B acctcms
command.
.sp
.LP
A typical sequence for performing daily command accounting and for
maintaining a running total is:

.sp
.in +2
.nf
example%\fB acctcms filename .\|.\|. > today\fR
example% \fBcp total previoustotal\fR
example% \fBacctcms \fB-s\fB today previoustotal > total\fR
example% \fBacctcms \fB-a\fB \fB-s\fB today\fR
.fi
.in -2
.sp

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWaccu
.TE

.SH SEE ALSO
.sp
.LP
.BR acctcom (1),
.BR acct (1M),
.BR acctcon (1M),
.BR acctmerg (1M),
.BR acctprc (1M),
.BR acctsh (1M),
.BR fwtmp (1M),
.BR runacct (1M),
.BR acct (2),
.BR acct.h (3HEAD),
.BR utmpx (4),
.BR attributes (5)
.SH NOTES
.sp
.LP
Unpredictable output results if
.B -t
is used on new style internal
summary format files, or if it is not used with old style internal summary
format files.
