usr/src/man/man1m/acctprc.1m
'\" te
.\" Copyright (c) 1996, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" Copyright 1989 AT&T
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH acctprc 1M "15 July 2004" "SunOS 5.11" "System Administration Commands"
.SH NAME
acctprc, acctprc1, acctprc2 \- process accounting
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/acct/acctprc\fR
.fi

.LP
.nf
\fB/usr/lib/acct/acctprc1\fR [\fIctmp\fR]
.fi

.LP
.nf
\fB/usr/lib/acct/acctprc2\fR
.fi

.SH DESCRIPTION
.sp
.LP
.B acctprc
reads the standard input and converts it to total accounting
records (see the
.B tacct
record in
.BR acct.h (3HEAD)).
\fBacctprc\fR
divides CPU time into prime time and non-prime time and determines mean
memory size (in memory segment units).
.B acctprc
then summarizes the
.B tacct
records, according to user IDs, and adds login names
corresponding to the user IDs. The summarized records are then written to
the standard output.
.B acctprc1
reads input in the form described by
.BR acct.h (3HEAD),
adds login names corresponding to user
.B IDs,
then
writes for each process an
.B ASCII
line giving user
.B ID,
login
name, prime
.B CPU
time (tics), non-prime
.B CPU
time (tics), and mean
memory size (in memory segment units). If
.I ctmp
is given, it should
contain a list of login sessions sorted by user
.B ID
and login name. If
this file is not supplied, it obtains login names from the password file,
just as
.B acctprc
does. The information in
.I ctmp
helps it
distinguish between different login names that share the same user
.B ID.
.sp
.LP
From the standard input,
.B acctprc2
reads records in the form written
by
.BR acctprc1 ,
summarizes them according to user
.B ID
and name, then
writes the sorted summaries to the standard output as total accounting
records.
.SH EXAMPLES
.LP
.B Example 1
Examples of
.BR acctprc .
.sp
.LP
The
.B acctprc
command is typically used as shown below:

.sp
.in +2
.nf
example% acctprc \|< /var/adm/pacct \|> ptacct
.fi
.in -2
.sp

.sp
.LP
The
.B acctprc1
and
.B acctprc2s
commands are typically used as shown
below:

.sp
.in +2
.nf
example% acctprc1 \|ctmp \|</var/adm/pacct
example% acctprc2 > ptacct
.fi
.in -2
.sp

.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/passwd
.ad
.RS 15n
.rt
system password file
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWaccu
.TE

.SH SEE ALSO
.sp
.LP
.BR acctcom (1),
.BR acct (1M),
.BR acctcms (1M),
.BR acctcon (1M),
.BR acctmerg (1M),
.BR acctsh (1M),
.BR cron (1M),
.BR fwtmp (1M),
.BR runacct (1M),
.BR acct (2),
.BR acct.h (3HEAD),
.BR utmpx (4),
.BR attributes (5)
.SH NOTES
.sp
.LP
Although it is possible for
.B acctprc1
to distinguish among login names
that share user
.B IDs
for commands run from a command line, it is
difficult for
.B acctprc1
to make this distinction for commands invoked
in other ways. A command run from
.BR cron (1M)
is an example of where
.B acctprc1
might have difficulty. A more precise conversion can be done
using the
.B acctwtmp
program in
.BR acct (1M).
.B acctprc
does not
distinguish between users with identical user IDs.
.sp
.LP
A memory segment of the mean memory size is a unit of measure for the
number of bytes in a logical memory segment on a particular processor.
.sp
.LP
During a single invocation of any given command, the
.BR acctprc ,
.BR acctprc1 ,
and
.B acctprc2
commands can process a maximum of
.RS +4
.TP
.ie t \(bu
.el o
6000 distinct sessions
.RE
.RS +4
.TP
.ie t \(bu
.el o
1000 distinct terminal lines
.RE
.RS +4
.TP
.ie t \(bu
.el o
2000 distinct login names
.RE
.sp
.LP
If at some point the actual number of any one of these items exceeds the
maximum, the command will not succeed.
