usr/src/man/man1m/acctsh.1m
'\" te
.\" Copyright 1989 AT&T  Copyright (c) 2002 Sun Microsystems, Inc.  All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH acctsh 1M "15 Mar 2002" "SunOS 5.11" "System Administration Commands"
.SH NAME
acctsh, chargefee, ckpacct, dodisk, lastlogin, monacct, nulladm, prctmp,
prdaily, prtacct, shutacct, startup, turnacct \- shell procedures for
accounting
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/acct/chargefee\fR \fIlogin-name\fR \fInumber\fR
.fi

.LP
.nf
\fB/usr/lib/acct/ckpacct\fR [\fIblocks\fR]
.fi

.LP
.nf
\fB/usr/lib/acct/dodisk\fR [\fB-o\fR] [\fIfilename\fR]...
.fi

.LP
.nf
\fB/usr/lib/acct/lastlogin\fR
.fi

.LP
.nf
\fB/usr/lib/acct/monacct\fR \fInumber\fR
.fi

.LP
.nf
\fB/usr/lib/acct/nulladm\fR \fIfilename\fR...
.fi

.LP
.nf
\fB/usr/lib/acct/prctmp\fR \fIfilename\fR
.fi

.LP
.nf
\fB/usr/lib/acct/prdaily\fR [\fB-c\fR] [\fB-l\fR] [\fImmdd\fR]
.fi

.LP
.nf
\fB/usr/lib/acct/prtacct\fR \fIfilename\fR ['' \fIheading\fR '']
.fi

.LP
.nf
\fB/usr/lib/acct/shutacct\fR ['' \fIreason\fR '']
.fi

.LP
.nf
\fB/usr/lib/acct/startup\fR
.fi

.LP
.nf
\fB/usr/lib/acct/turnacct\fR on | off | switch
.fi

.SH DESCRIPTION
.SS "chargefee Command"
.sp
.LP
.B chargefee
can be invoked to charge a
.I number
of units to
.IR login-name .
A record is written to
.BR /var/adm/fee ,
to be merged
with other accounting records by
.BR runacct (1M).
.SS "ckpacct Command"
.sp
.LP
.B ckpacct
should be initiated using
.BR cron "(1M) to periodically"
check the size of
.BR /var/adm/pacct .
If the size exceeds
.IR blocks ,
.B 500
by default,
.B turnacct
will be invoked with argument
.BR switch .
To avoid a conflict with
.B "turnacct switch"
execution in
.BR runacct ,
do not run
.B ckpacct
and
.B runacct
simultaneously. If
the number of free disk blocks in the
.B /var
file system falls below
.BR 500 ,
.B ckpacct
will automatically turn off the collection of
process accounting records via the
.B off
argument to
.BR turnacct .
When at least
.B 500
blocks are restored,  the accounting will be
activated again on the next invocation of
.BR ckpacct .
This feature is
sensitive to the frequency at which
.B ckpacct
is executed, usually by
the
.BR cron "(1M) command."
.SS "dodisk Command"
.sp
.LP
.B dodisk
should be invoked by \fBcron\fR(1M) to perform the disk
accounting functions.
.SS "lastlogin Command"
.sp
.LP
.B lastlogin
is invoked by
.BR runacct "(1M) to update"
.BR /var/adm/acct/sum/loginlog ,
which shows the last date on which each
person logged in.
.SS "monacct Command"
.sp
.LP
.B monacct
should be invoked once each month or each accounting period.
.I number
indicates which month or period it is. If
.I number
is not
given, it defaults to the current month (01\(mi12). This default is useful
if
.B monacct
is to executed using \fBcron\fR(1M) on the first day of
each month.
.B monacct
creates summary files in
.B /var/adm/acct/fiscal
and restarts the summary files in
.BR /var/adm/acct/sum .
.SS "nulladm Command"
.sp
.LP
.B nulladm
creates
.I filename
with mode 664 and ensures that owner
and group are
.BR adm .
It is called by various accounting shell
procedures.
.SS "prctmp Command"
.sp
.LP
.B prctmp
can be used to print the session record file (normally
.B /var/adm/acct/nite/ctmp
created by
.B acctcon1
(see
.BR acctcon (1M)).
.SS "prdaily Command"
.sp
.LP
.B prdaily
is invoked by \fBrunacct\fR(1M) to format a report of the
previous day's accounting data. The report resides in
.B /var/adm/acct/sum/rprt/mmdd
where
.I mmdd
is the month and day of
the report. The current daily accounting reports may be printed by typing
.BR prdaily .
Previous days' accounting reports can be printed by using the
.I mmdd
option and specifying the exact report date desired.
.SS "prtacct Command"
.sp
.LP
.B prtacct
can be used to format and print any total accounting
(\fBtacct\fR)file.
.SS "shutacct Command"
.sp
.LP
.B shutacct
is invoked during a system shutdown to turn process
accounting off and append a
.I reason
record to
.BR /var/adm/wtmpx .
.SS "startup Command"
.sp
.LP
.B startup
can be invoked when the system is brought to a multi-user
state to turn process accounting on.
.SS "turnacct Command"
.sp
.LP
.B turnacct
is an interface to
.B accton
(see \fBacct\fR(1M)) to turn
process accounting
.B on
or
.BR off .
The
.B switch
argument moves
the current
.B /var/adm/pacct
to the next free name in
\fB/var/adm/pacct.\fIincr\fR (where \fIincr\fR is a number starting with
.B 0
and incrementing by one  for each additional
.B pacct
file), then
.RB "turns accounting back on again. This procedure is called by" " ckpacct"
and thus can be taken care of by the
.BR cron "(1M) command and used to keep"
.B pacct
to a reasonable size.
.B shutacct
uses
.B turnacct
to
stop process accounting.
.B startup
uses
.B turnacct
to start
process accounting.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -c
.ad
.RS 6n
.rt
This option prints a report of exceptional resource usage by command, and
may be used on current day's accounting data only.
.RE

.sp
.ne 2
.mk
.na
.B -l
.ad
.RS 6n
.rt
This option prints a report of exceptional usage by login id for the
specified date. Previous daily reports are cleaned up and therefore
inaccessible after each invocation of
.BR monacct .
.RE

.sp
.ne 2
.mk
.na
.B -o
.ad
.RS 6n
.rt
This option uses
.B acctdusg
(see \fBacct\fR(1M)) to do a slower version
of disk accounting by login directory. \fIfilename\fRs specifies the one or
more filesystem names where disk accounting will be done.  If
\fIfilename\fRs are used, disk accounting will be done on these filesystems
only. If the
.B -o
option is used, \fIfilename\fRs should be mount points
of mounted filesystems. If the
.B -o
option is omitted, \fIfilename\fRs
should be the special file names of mountable filesystems.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/logadm.conf
.ad
.RS 30n
.rt
Configuration file for the
.BR logadm "(1M) command"
.RE

.sp
.ne 2
.mk
.na
.B /usr/lib/acct
.ad
.RS 30n
.rt
Holds all accounting commands listed in section
.B 1M
of this manual
.RE

.sp
.ne 2
.mk
.na
.B /usr/lib/acct/ptecms.awk
.ad
.RS 30n
.rt
Contains the limits for exceptional usage by command name
.RE

.sp
.ne 2
.mk
.na
.B /usr/lib/acct/ptelus.awk
.ad
.RS 30n
.rt
Contains the limits for exceptional usage by login
.BR ID
.RE

.sp
.ne 2
.mk
.na
.B /var/adm/acct/fiscal
.ad
.RS 30n
.rt
Fiscal reports directory
.RE

.sp
.ne 2
.mk
.na
.B /var/adm/acct/nite
.ad
.RS 30n
.rt
Working directory
.RE

.sp
.ne 2
.mk
.na
.B /var/adm/acct/sum
.ad
.RS 30n
.rt
Summary directory that contains information for
.BR monacct
.RE

.sp
.ne 2
.mk
.na
.B /var/adm/acct/sum/loginlog
.ad
.RS 30n
.rt
File updated by last login
.RE

.sp
.ne 2
.mk
.na
.B /var/adm/fee
.ad
.RS 30n
.rt
Accumulator for fees
.RE

.sp
.ne 2
.mk
.na
.B /var/adm/pacct
.ad
.RS 30n
.rt
Current file for per-process accounting
.RE

.sp
.ne 2
.mk
.na
\fB/var/adm/pacct\fIincr\fR
.ad
.RS 30n
.rt
Used if
.B pacct
gets large and during execution of daily accounting
procedure
.RE

.sp
.ne 2
.mk
.na
.B /var/adm/wtmpx
.ad
.RS 30n
.rt
History of user access and administration information
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWaccu
.TE

.SH SEE ALSO
.sp
.LP
.BR acctcom (1),
.BR acct (1M),
.BR acctcms (1M),
.BR acctcon (1M),
.BR acctmerg (1M),
.BR acctprc (1M),
.BR cron (1M),
.BR fwtmp (1M),
.BR logadm (1M),
.BR runacct (1M),
.BR acct (2),
.BR acct.h (3HEAD),
.BR utmpx (4),
.BR attributes (5)
.SH NOTES
.sp
.LP
See \fBrunacct\fR(1M) for the main daily accounting shell script, which
performs the accumulation of connect, process, fee, and disk accounting on a
daily basis. It also creates summaries of command usage.
