usr/src/man/man1m/acct.1m
'\" te
.\" Copyright 1989 AT&T  Copyright (c) 2000, Sun Microsystems, Inc.  All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH acct 1M "22 Feb 1999" "SunOS 5.11" "System Administration Commands"
.SH NAME
acct, acctdisk, acctdusg, accton, acctwtmp, closewtmp, utmp2wtmp \- overview of
accounting and miscellaneous accounting commands
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/acct/acctdisk\fR
.fi

.LP
.nf
\fB/usr/lib/acct/acctdusg\fR [\fB-u\fR \fIfilename\fR] [\fB-p\fR \fIfilename\fR]
.fi

.LP
.nf
\fB/usr/lib/acct/accton\fR [\fIfilename\fR]
.fi

.LP
.nf
\fB/usr/lib/acct/acctwtmp\fR \fIreason\fR \fIfilename\fR
.fi

.LP
.nf
\fB/usr/lib/acct/closewtmp\fR
.fi

.LP
.nf
\fB/usr/lib/acct/utmp2wtmp\fR
.fi

.SH DESCRIPTION
.sp
.LP
Accounting software is structured as a set of tools (consisting of both C
programs and shell procedures) that can be used to build accounting systems.
.BR acctsh (1M)
describes the set of shell procedures built on top of the C
programs.
.sp
.LP
Connect time accounting is handled by various programs that write records into
.BR /var/adm/wtmpx ,
as described in
.BR utmpx (4).
The programs described in
.BR acctcon (1M)
convert this file into session and charging records, which are
then summarized by
.BR acctmerg (1M).
.sp
.LP
Process accounting is performed by the system kernel. Upon termination of a
process, one record per process is written to a file (normally
.BR /var/adm/pacct ).
The programs in \fBacctprc\fR(1M) summarize this data for
charging purposes;
.BR acctcms (1M)
is used to summarize command usage. Current
process data may be examined using
.BR acctcom (1).
.sp
.LP
Process accounting records and connect time accounting records (or any
accounting records in the
.B tacct
format described in
.BR acct.h (3HEAD))
can be merged and summarized into total accounting records by
.BR acctmerg
(see
.B tacct
format in
.BR acct.h (3HEAD)).
.B prtacct
(see
.BR acctsh (1M))
is used to format any or all accounting records.
.sp
.LP
\fBacctdisk\fR reads lines that contain user
.BR ID ,
login name, and number
of disk blocks and converts them to total accounting records that can be merged
with other accounting records.
.B acctdisk
returns an error if the input file
is corrupt or improperly formatted.
.sp
.LP
\fBacctdusg\fR reads its standard input (usually from \fBfind /\fR
.BR \-print )
and computes disk resource consumption (including indirect
blocks) by login.
.sp
.LP
\fBaccton\fR without arguments turns process accounting off. If \fIfilename\fR
is given, it must be the name of an existing file, to which the kernel appends
process accounting records (see
.BR acct (2)
and
.BR acct.h (3HEAD)).
.sp
.LP
\fBacctwtmp\fR writes a
.BR utmpx (4)
record to
.IR filename .
The record
contains the current time and a string of characters that describe the
.IR reason .
A record type of
.B ACCOUNTING
is assigned (see
.BR utmpx (4))
\fIreason\fR must be a string of 11 or fewer characters, numbers,
.BR $ ,
or
spaces. For example, the following are suggestions for use in reboot and
shutdown procedures, respectively:
.sp
.in +2
.nf
acctwtmp "acctg on" /var/adm/wtmpx
acctwtmp "acctg off" /var/adm/wtmpx
.fi
.in -2

.sp
.LP
For each user currently logged on,
.B closewtmp
puts a false
\fBDEAD_PROCESS\fR record in the \fB/var/adm/wtmpx\fR file. \fBrunacct\fR (see
.BR runacct (1M))
uses this false
.B DEAD_PROCESS
record so that the connect
accounting procedures can track the time used by users logged on before
\fBrunacct\fR was invoked.
.sp
.LP
For each user currently logged on,
.B runacct
uses
.B utmp2wtmp
to create
an entry in the file
.BR /var/adm/wtmpx ,
created by
.BR runacct .
Entries in
\fB/var/adm/wtmpx\fR enable subsequent invocations of \fBrunacct\fR to account
for connect times of users currently logged in.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB-u\fR \fIfilename\fR
.ad
.RS 15n
.rt
Places in \fIfilename\fR records consisting of those filenames for which
\fBacctdusg\fR charges no one (a potential source for finding users trying to
avoid disk charges).
.RE

.sp
.ne 2
.mk
.na
\fB-p\fR \fIfilename\fR
.ad
.RS 15n
.rt
Specifies a password file,
.IR filename .
This option is not needed if the
password file is
.BR /etc/passwd .
.RE

.SH ENVIRONMENT VARIABLES
.sp
.LP
If any of the
.B LC_*
variables (\fBLC_TYPE\fR,
.BR LC_MESSAGES ,
.BR LC_TIME ,
.BR LC_COLLATE ,
.BR LC_NUMERIC ,
and
.BR LC_MONETARY )
(see
.BR environ (5))
are not set in the environment, the operational behavior of
\fBacct\fR for each corresponding locale category is determined by the value of
the
.B LANG
environment variable. If
.B LC_ALL
is set, its contents are
used to override both the
.B LANG
and the other
.B LC_*
variables. If none
of the above variables are set in the environment, the "C" (U.S. style) locale
determines how
.B acct
behaves.
.sp
.ne 2
.mk
.na
.B LC_CTYPE
.ad
.RS 12n
.rt
Determines how
.B acct
handles characters. When
.B LC_CTYPE
is set to a
valid value,
.B acct
can display and handle text and filenames containing
valid characters for that locale.
.B acct
can display and handle Extended
Unix Code (EUC) characters where any  character can be 1, 2, or 3 bytes wide.
\fBacct\fR can also handle EUC characters of 1, 2, or more column widths. In the
"C" locale, only characters from ISO 8859-1 are valid.
.RE

.sp
.ne 2
.mk
.na
.B LC_TIME
.ad
.RS 12n
.rt
Determines how \fBacct\fR handles date and time formats. In the "C" locale,
date and time handling follows the U.S. rules.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/passwd
.ad
.RS 18n
.rt
Used for login name to user
.B ID
conversions.
.RE

.sp
.ne 2
.mk
.na
.B /usr/lib/acct
.ad
.RS 18n
.rt
Holds all accounting commands listed in sub-class 1M of this manual.
.RE

.sp
.ne 2
.mk
.na
.B /var/adm/pacct
.ad
.RS 18n
.rt
Current process accounting file.
.RE

.sp
.ne 2
.mk
.na
.B /var/adm/wtmpx
.ad
.RS 18n
.rt
History of user access and administration information..
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWaccu
.TE

.SH SEE ALSO
.sp
.LP
.BR acctcom (1),
.BR acctcms (1M),
.BR acctcon (1M),
.BR acctmerg (1M),
.BR acctprc (1M),
.BR acctsh (1M),
.BR fwtmp (1M),
.BR runacct (1M),
.BR acct (2),
.BR acct.h (3HEAD),
.BR passwd (4),
.BR utmpx (4),
.BR attributes (5),
.BR environ (5)
.sp
.LP
\fR
