usr/src/man/man1m/acctcon.1m
'\" te
.\" Copyright 1989 AT&T  Copyright (c) 1999 Sun Microsystems, Inc.  All Rights Reserved.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH acctcon 1M "22 Feb 1999" "SunOS 5.11" "System Administration Commands"
.SH NAME
acctcon, acctcon1, acctcon2 \- connect-time accounting
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/acct/acctcon\fR [\fB-l\fR \fIlineuse\fR] [\fB-o\fR \fIreboot\fR]
.fi

.LP
.nf
\fB/usr/lib/acct/acctcon1\fR [\fB-p\fR] [\fB-t\fR] [\fB-l\fR \fIlineuse\fR] [\fB-o\fR \fIreboot\fR]
.fi

.LP
.nf
\fB/usr/lib/acct/acctcon2\fR
.fi

.SH DESCRIPTION
.sp
.LP
.B acctcon
converts a sequence of login/logoff records to total
accounting records (see the
.B tacct
format in
.BR acct.h "(3HEAD)). The"
login/logoff records are read from standard input.  The file
.B /var/adm/wtmpx
is usually the source of the login/logoff records;
however, because it might contain corrupted records or system date changes,
it should first be fixed using
.BR wtmpfix .
The fixed version of file
.B /var/adm/wtmpx
can then be redirected to
.BR acctcon .
The
.B tacct
records are written to standard output.
.sp
.LP
.B acctcon
is a combination of the programs
.B acctcon1
and
.BR acctcon2 .
.B acctcon1
converts login/logoff records, taken from the
fixed
.B /var/adm/wtmpx
file, to ASCII output.
.B acctcon2
reads the
ASCII records produced by
.B acctcon1
and converts them to
.BR tacct
records.
.B acctcon1
can be used with the
.B -l
and
.B -o
options,
described below, as well as with the
.B -p
and
.B -t
options.
.SH OPTIONS
.sp
.ne 2
.mk
.na
.B -p
.ad
.RS 14n
.rt
Print input only, showing line name, login name, and time (in both numeric
and date/time formats).
.RE

.sp
.ne 2
.mk
.na
.B -t
.ad
.RS 14n
.rt
.B acctcon1
maintains a list of lines on which users are logged in. When
it reaches the end of its input, it emits a session record for each line
that still appears to be active. It normally assumes that its input is a
current file, so that it uses the current time as the ending time for each
session still in progress. The
.B -t
flag causes it to use, instead, the
last time found in its input, thus assuring reasonable and repeatable
numbers for non-current files.
.RE

.sp
.ne 2
.mk
.na
.B -l
.I lineuse
.ad
.RS 14n
.rt
.I lineuse
is created to contain a summary of line usage showing line
name, number of minutes used, percentage of total elapsed time used, number
of sessions charged, number of logins, and number of logoffs.  This file
helps track line usage, identify bad lines, and find software and hardware
oddities. Hangup, termination of
.BR login (1)
and termination of the login
shell each generate logoff records, so that the number of logoffs is often
three to four times the number of sessions. See
.BR " init" (1M)
and
.BR utmpx (4).
.RE

.sp
.ne 2
.mk
.na
.B -o
.I reboot
.ad
.RS 14n
.rt
.B reboot
is filled with an overall record for the accounting period,
giving starting time, ending time, number of reboots, and number of date
changes.
.RE

.SH EXAMPLES
.LP
.B Example 1
Using the
.B acctcon
command.
.sp
.LP
The
.B acctcon
command is typically used as follows:

.sp
.in +2
.nf
example% acctcon \fB-l\fR lineuse \fB-o\fR reboots < tmpwtmp > ctacct
.fi
.in -2
.sp

.sp
.LP
The
.B acctcon1
and
.B acctcon2
commands are typically used as
follows:

.sp
.in +2
.nf
example% acctcon1 \fB-l\fR lineuse \fB-o\fR reboots < tmpwtmp | sort +1n +2 > ctmp
example% acctcon2 < ctmp > ctacct
.fi
.in -2
.sp

.SH FILES
.sp
.ne 2
.mk
.na
.B /var/adm/wtmpx
.ad
.RS 18n
.rt
History of user access and administration information
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWaccu
.TE

.SH SEE ALSO
.sp
.LP
.BR acctcom (1),
.BR login (1),
.BR acct (1M),
.BR acctcms (1M),
.BR acctmerg (1M),
.BR acctprc (1M),
.BR acctsh (1M),
.BR fwtmp (1M),
.BR init (1M),
.BR runacct (1M),
.BR acct (2),
.BR acct.h (3HEAD),
.BR utmpx (4),
.BR attributes (5)
.sp
.LP
\fR
.SH NOTES
.sp
.LP
The line usage report is confused by date changes. Use
.B wtmpfix
(see
.BR fwtmp (1M)),
with the
.B /var/adm/wtmpx
file as an argument, to
correct this situation.
.sp
.LP
During a single invocation of any given command, the
.BR acctcon ,
.BR acctcon1 ,
and
.B acctcon2
commands can process a maximum of:
.RS +4
.TP
.ie t \(bu
.el o
6000 distinct session
.RE
.RS +4
.TP
.ie t \(bu
.el o
1000 distinct terminal lines
.RE
.RS +4
.TP
.ie t \(bu
.el o
2000 distinct login names
.RE
.sp
.LP
If at some point the actual  number of any one of these items exceeds the
maximum, the command will not succeed.
