usr/src/man/man1m/add_allocatable.1m
'\" te
.\" Copyright (c) 2007, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH add_allocatable 1M "20 Jul 2007" "SunOS 5.11" "System Administration Commands"
.SH NAME
add_allocatable \- add entries to allocation databases
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/add_allocatable\fR [\fB-f\fR] [\fB-s\fR] [\fB-d\fR] \fB-n\fR \fIname\fR \fB-t\fR \fItype\fR \fB-l\fR \fIdevice-list\fR
    [\fB-a\fR \fIauthorization\fR] [\fB-c\fR \fIclean\fR] [\fB-o\fR \fIkey\fR=\fIvalue\fR]
.fi

.SH DESCRIPTION
.sp
.LP
.B add_allocatable
creates new entries for user allocatable devices that
.RB "are to be managed by the device allocation mechanism." " add_allocatable"
can also be used to update existing entries of such devices.
.sp
.LP
.B add_allocatable
can also create and update entries for
non-allocatable devices, such as printers, whose label range is managed by
the device allocation mechanism.
.sp
.LP
.B add_allocatable
can be used in shell scripts, such as installation
scripts for driver packages, to automate the administrative work of setting
up a new device.
.sp
.LP
Use
.BR list_devices (1)
to see the names and types of allocatable
devices, their attributes, and device paths.
.SH OPTIONS
.sp
.ne 2
.mk
.na
.B -f
.ad
.RS 20n
.rt
Force an update of an already-existing entry with the specified
information.
.B add_allocatable
exits with an error if this option is not
specified when an entry with the specified device name already exists.
.RE

.sp
.ne 2
.mk
.na
.B -s
.ad
.RS 20n
.rt
Turn on silent mode.
.B add_allocatable
does not print any error or
warning messages.
.RE

.sp
.ne 2
.mk
.na
.B -d
.ad
.RS 20n
.rt
If this option is present,
.B add_allocatable
updates the
system-supplied default attributes of the device type specified with
.BR -t .
.RE

.sp
.ne 2
.mk
.na
.B -n
.I name
.ad
.RS 20n
.rt
Adds or updates an entry for device that is specified by
.IR name .
.RE

.sp
.ne 2
.mk
.na
.B -t
.I type
.ad
.RS 20n
.rt
Adds or updates device entries that are of a type that are specified by
.IR type .
.RE

.sp
.ne 2
.mk
.na
.B -l
.I device-list
.ad
.RS 20n
.rt
Adds or updates device paths to the device that is specified with
.BR -n .
Multiple paths in
.I device-list
must be separated by white spaces and
the list must be quoted.
.RE

.sp
.ne 2
.mk
.na
.B -a
.I authorization
.ad
.RS 20n
.rt
Adds or updates the authorization that is associated with either the device
that is specified with
.B -n
or with devices of the type that is
specified with
.BR -t .
When more than one authorization is specified, the
list must be separated by commas and must be quoted. When the device is not
allocatable,
.I authorization
is specified with an asterisk (*) and must
.RI "be quoted. When the device is allocatable by any user," " authorization"
is specified with the at sign (@) and must be quoted. Default authorization
is '@'.
.RE

.sp
.ne 2
.mk
.na
.B -c
.I clean
.ad
.RS 20n
.rt
Specifies the
.BR device_clean (5)
program
.I clean
to be used with the
device that is specified with
.B -n
or with devices of the type that is
specified with
.BR -t .
The default clean program is
.BR /bin/true .
.RE

.sp
.ne 2
.mk
.na
\fB-o\fR \fIkey\fR=\fIvalue\fR
.ad
.RS 20n
.rt
.RI "Accepts a string of colon-separated " key = value " pairs for a"
device that is specified with
.B -n
or with devices of the type that is
specified with
.BR -t .
The following keys are currently interpreted by the
system:
.sp
.ne 2
.mk
.na
.B minlabel
.ad
.RS 12n
.rt
The minimum label at which the device can be used.
.RE

.sp
.ne 2
.mk
.na
.B maxlabel
.ad
.RS 12n
.rt
The maximum label at which the device can be used.
.RE

.sp
.ne 2
.mk
.na
.B class
.ad
.RS 12n
.rt
Specifies a logical  grouping of devices. For example, all Sun
Ray\u\s-2TM\s+2\d devices of all device types is a logical grouping. The
.B class
keyword has no default value.
.RE

.sp
.ne 2
.mk
.na
.B xdpy
.ad
.RS 12n
.rt
Specifies the display name of the X session. This keyword is used to
identify devices that are associated with the X session. The
.B xdpy
keyword has no default value.
.RE

.RE

.SH EXIT STATUS
.sp
.LP
When successful,
.B add_allocate
returns an exit status of
.BR 0
(true).
.B add_allocate
returns a nonzero exit status in the event of an
error. The exit codes are as follows:
.sp
.ne 2
.mk
.na
.B 1
.ad
.RS 5n
.rt
Invocation syntax error
.RE

.sp
.ne 2
.mk
.na
.B 2
.ad
.RS 5n
.rt
Unknown system error
.RE

.sp
.ne 2
.mk
.na
.B 3
.ad
.RS 5n
.rt
An entry already exists for the specified device. This error occurs only
when the
.B -f
option is not specified.
.RE

.sp
.ne 2
.mk
.na
.B 4
.ad
.RS 5n
.rt
Permission denied. User does not have DAC or MAC access record updates.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.82i) |cw(2.68i)
lw(2.82i) |lw(2.68i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWtsu
_
Interface StabilitySee below.
.TE

.sp
.LP
The invocation is Uncommitted. The options are Uncommitted. The output is
Not-an-Interface.
.SH SEE ALSO
.sp
.LP
.BR allocate (1),
.BR deallocate (1),
.BR list_devices (1),
.BR remove_allocatable (1M),
.BR attributes (5),
.BR device_clean (5)
.SH NOTES
.sp
.LP
The functionality described on this manual page is available only if the
system is configured with Trusted Extensions.
