usr/src/man/man1m/addbadsec.1m
'\" te
.\" Copyright (c) 1998, Sun Microsystems, Inc.  All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH addbadsec 1M "24 Feb 1998" "SunOS 5.11" "System Administration Commands"
.SH NAME
addbadsec \- map out defective disk blocks
.SH SYNOPSIS
.LP
.nf
\fBaddbadsec\fR [\fB-p\fR] [\fB-a\fR \fIblkno\fR [\fIblkno\fR].\|.\|.] [\fB-f\fR \fIfilename\fR] \fIraw_device\fR
.fi

.SH DESCRIPTION
.sp
.LP
.B addbadsec
is used by the system administrator to map out bad disk
blocks. Normally, these blocks are identified during surface analysis, but
occasionally the disk subsystem reports unrecoverable data errors indicating
a bad block. A block number reported in this way can be fed directly into
.BR addbadsec ,
and the block will be remapped.
.B addbadsec
will first
attempt hardware remapping. This is supported on
.B SCSI
drives and takes
place at the disk hardware level. If the target is an
.B IDE
drive, then
software remapping is used. In order for software remapping to succeed, the
partition must contain an alternate slice and there must be room in this
slice to perform the mapping.
.sp
.LP
It should be understood that bad blocks lead to data loss. Remapping a
defective block does not repair a damaged file. If a bad block occurs to a
disk-resident file system structure such as a superblock, the entire slice
might have to be recovered from a backup.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -a
.ad
.RS 6n
.rt
Adds the specified blocks to the hardware or software map. If more than one
block number is specified, the entire list should be quoted and block
numbers should be separated by white space.
.RE

.sp
.ne 2
.mk
.na
.B -f
.ad
.RS 6n
.rt
Adds the specified blocks to the hardware or software map. The bad blocks
are listed, one per line, in the specified file.
.RE

.sp
.ne 2
.mk
.na
.B -p
.ad
.RS 6n
.rt
Causes
.B addbadsec
to print the current software map. The output shows
the defective block and the assigned alternate. This option cannot be used
to print the hardware map.
.RE

.SH OPERANDS
.sp
.LP
The following operand is supported:
.sp
.ne 2
.mk
.na
.I raw_device
.ad
.RS 14n
.rt
The address of the disk drive (see
.BR FILES ).
.RE

.SH FILES
.sp
.LP
The raw device should be
.BR /dev/rdsk/c?[t?]d?p0 .
See
.BR disks (1M)
for an explanation of
.B SCSI
and
.B IDE
device naming conventions.
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Architecturex86
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.sp
.LP
.BR disks (1M),
.BR diskscan (1M),
.BR fdisk (1M),
.BR fmthard (1M),
.BR format (1M),
.BR attributes (5)
.SH NOTES
.sp
.LP
The
.BR format (1M)
utility is available to format, label, analyze, and
repair
.B SCSI
disks. This utility is included with the
.BR addbadsec ,
.BR diskscan (1M),
.BR fdisk (1M),
and
.BR fmthard (1M)
commands
available for x86. To format an \fBIDE\fR disk, use the \fB DOS\fR "format"
utility; however, to label, analyze, or repair
.B IDE
disks on x86
systems, use the Solaris
.BR format (1M)
utility.
