usr/src/man/man1m/apache.1m
'\" te
.\" Copyright (c) 2000, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH apache 1M "8 Aug 2000" "SunOS 5.11" "System Administration Commands"
.SH NAME
apache \- Apache hypertext transfer protocol server overview
.SH DESCRIPTION
.sp
.LP
.B apache
consists of a main server daemon, loadable server modules,
some additional support utilities, configuration files, and documentation.

.SH FILES
.sp
.LP
The
.B "apache HTTPD"
server is integrated with Solaris.
.sp
.LP
The following files specify the installation locations for
.BR apache :
.sp
.ne 2
.mk
.na
.B /etc/apache
.ad
.RS 23n
.rt
Contains server configuration files.
.sp
A newly-installed server must be manually configured before use. Typically
this involves copying \fBhttpd.conf-example\fR to the \fBhttpd.conf\fR file
and making local configuration adjustments.
.RE

.sp
.ne 2
.mk
.na
.B /usr/apache/bin
.ad
.RS 23n
.rt
Contains the
.B httpd
executable as well as other utility programs.
.RE

.sp
.ne 2
.mk
.na
.B /usr/apache/htdocs
.ad
.RS 23n
.rt
Contains the Apache manual in
.B HTML
format. This documentation is
accessible by way of a link on the server test page that gets installed upon
fresh installation.
.RE

.sp
.ne 2
.mk
.na
.B /usr/apache/include
.ad
.RS 23n
.rt
Contains the Apache header files, which are needed for building various
optional server extensions with
.BR apxs (8)
.RE

.sp
.ne 2
.mk
.na
.B /usr/apache/jserv
.ad
.RS 23n
.rt
Contains documention for the
.B mod_jserv
java servlet module.
Documention can be read with a web browser using the url:
.sp
.in +2
.nf
file:/usr/apache/jserv/docs/index.html
.fi
.in -2
.sp

.RE

.sp
.ne 2
.mk
.na
.B /usr/apache/libexec
.ad
.RS 23n
.rt
Contains loadable modules (\fBDSO\fRs) supplied with the server. Any
modules which are added using
.BR apxs "(8)are also copied into this"
directory.
.RE

.sp
.ne 2
.mk
.na
.B /usr/apache/man
.ad
.RS 23n
.rt
Contains man pages for the server, utility programs, and
.BR mod_perl .
.sp
Add this directory to your
.B MANPATH
to read the Apache man pages. See
.BR NOTES .
.RE

.sp
.ne 2
.mk
.na
.B /usr/apache/perl5
.ad
.RS 23n
.rt
Contains the modules and library files used by the
.B mod_perl
extension
to Apache.
.RE

.sp
.ne 2
.mk
.na
.B /var/apache/cgi-bin
.ad
.RS 23n
.rt
Default location for the
.B CGI
scripts.
.sp
This can be changed by altering the
.B httpd.conf
file and restarting
the server.
.RE

.sp
.ne 2
.mk
.na
.B /var/apache/htdocs
.ad
.RS 23n
.rt
Default document root.
.sp
This can be changed by altering the
.B httpd.conf
file and restarting
the server.
.RE

.sp
.ne 2
.mk
.na
.B /var/apache/icons
.ad
.RS 23n
.rt
Icons used by the server.
.sp
This normally shouldn't need to be changed.
.RE

.sp
.ne 2
.mk
.na
.B /var/apache/logs
.ad
.RS 23n
.rt
Contains server log files.
.sp
The formats, names, and locations of the files in this directory can be
altered by various configuration directives in the
.B httpd.conf
file.
.RE

.sp
.ne 2
.mk
.na
.B /var/apache/proxy
.ad
.RS 23n
.rt
Directory used to cache pages if the caching feature of
.B mod_proxy
is
enabled in the
.B httpd.conf
file.
.sp
The location of the cache can also be changed by changing the proxy
configuration in the
.B httpd.conf
file.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWapchr
_
SUNWapchu
_
SUNWapchd
.TE

.SH SEE ALSO
.sp
.LP
.BR attributes (5)
.sp
.LP
http://www.apache.org
.SH NOTES
.sp
.LP
In addition to the documentation and man pages included with Solaris, more
information is available at http://www.apache.org
.sp
.LP
The Apache man pages are provided with the programming modules. To view the
manual pages for the Apache modules with the man command, add
.B /usr/apache/man
to the
.B MANPATH
environment variable. See
.BR man (1)
for more information. Running
.BR catman (1M)
on the Apache
manual pages is not supported.
