usr/src/man/man1m/auditd.1m
'\" te
.\" Copyright (c) 2008, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH auditd 1M "29 Apr 2008" "SunOS 5.11" "System Administration Commands"
.SH NAME
auditd \- audit daemon
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/auditd\fR
.fi

.SH DESCRIPTION
.sp
.LP
The audit daemon,
.BR auditd ,
controls the generation and location of
audit trail files and the generation of syslog messages based on the
definitions in
.BR audit_control (4).
If auditing is enabled, \fBauditd\fR
reads the
.B audit_control
file to do the following:
.RS +4
.TP
.ie t \(bu
.el o
reads the path to a library module for realtime conversion of audit data
into syslog messages;
.RE
.RS +4
.TP
.ie t \(bu
.el o
reads other parameters specific to the selected plugin or plugins;
.RE
.RS +4
.TP
.ie t \(bu
.el o
obtains a list of directories into which audit files can be written;
.RE
.RS +4
.TP
.ie t \(bu
.el o
obtains the percentage limit for how much space to reserve on each
filesystem before changing to the next directory.
.RE
.sp
.LP
.BR audit (1M)
is used to control
.BR auditd .
It can cause
.BR auditd
to:
.RS +4
.TP
.ie t \(bu
.el o
close the current audit file and open a new one;
.RE
.RS +4
.TP
.ie t \(bu
.el o
close the current audit file, re-read
.B /etc/security/audit_control
and
open a new audit file;
.RE
.RS +4
.TP
.ie t \(bu
.el o
close the audit trail and terminate auditing.
.RE
.SS "Auditing Conditions"
.sp
.LP
The audit daemon invokes the program
.BR audit_warn "(1M) under the"
following conditions with the indicated options:
.sp
.ne 2
.mk
.na
.B audit_warn soft
.I pathname
.ad
.sp .6
.RS 4n
The file system upon which
.I pathname
resides has exceeded the minimum
free space limit defined in
.BR audit_control (4).
A new audit trail has
been opened on another file system.
.RE

.sp
.ne 2
.mk
.na
.B audit_warn allsoft
.ad
.sp .6
.RS 4n
All available file systems have been filled beyond the minimum free space
limit. A new audit trail has been opened anyway.
.RE

.sp
.ne 2
.mk
.na
.B audit_warn hard
.I pathname
.ad
.sp .6
.RS 4n
The file system upon which
.I pathname
resides has filled or for some
reason become unavailable. A new audit trail has been opened on another file
system.
.RE

.sp
.ne 2
.mk
.na
.B audit_warn allhard
.I count
.ad
.sp .6
.RS 4n
All available file systems have been filled or for some reason become
unavailable. The audit daemon will repeat this call to
.B audit_warn
at
intervals of at least twenty seconds until space becomes available.
.I count
is the number of times that
.B audit_warn
has been called
since the problem arose.
.RE

.sp
.ne 2
.mk
.na
.B audit_warn ebusy
.ad
.sp .6
.RS 4n
There is already an audit daemon running.
.RE

.sp
.ne 2
.mk
.na
.B audit_warn tmpfile
.ad
.sp .6
.RS 4n
The file
.B /etc/security/audit/audit_tmp
exists, indicating a fatal
error.
.RE

.sp
.ne 2
.mk
.na
.B audit_warn nostart
.ad
.sp .6
.RS 4n
The internal system audit condition is
.BR AUC_FCHDONE .
Auditing cannot
be started without rebooting the system.
.RE

.sp
.ne 2
.mk
.na
.B audit_warn auditoff
.ad
.sp .6
.RS 4n
The internal system audit condition has been changed to not be
.B AUC_AUDITING
by someone other than the audit daemon. This causes the
audit daemon to exit.
.RE

.sp
.ne 2
.mk
.na
.B audit_warn postsigterm
.ad
.sp .6
.RS 4n
An error occurred during the orderly shutdown of the auditing system.
.RE

.sp
.ne 2
.mk
.na
.B audit_warn getacdir
.ad
.sp .6
.RS 4n
There is a problem getting the directory list from
.BR /etc/security/audit/audit_control .
.sp
The audit daemon will hang in a sleep loop until this file is fixed.
.RE

.SH FILES
.sp
.LP
.B /etc/security/audit/audit_control
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
.BR audit (1M),
.BR audit_warn (1M),
.BR bsmconv (1M),
.BR praudit (1M),
.BR auditon (2),
.BR audit.log (4),
.BR audit_control (4),
.BR attributes (5)
.sp
.LP
See the section on Solaris Auditing in \fISystem Administration Guide:
Security Services\fR.
.SH NOTES
.sp
.LP
The functionality described in this man page is available only if the
Solaris Auditing feature has been enabled. See \fBbsmconv\fR(1M) for more
information.
.sp
.LP
.B auditd
is loaded in the global zone at boot time if auditing is
enabled. See
.BR bsmconv (1M).
.sp
.LP
If the audit policy
.B perzone
is set,
.B auditd
runs in each zone,
starting automatically when the local zone boots. If a zone is running when
the
.B perzone
policy is set, auditing must be started manually in local
zones. It is not necessary to reboot the system or the local zone to start
auditing in a local zone.
.B auditd
can be started with
"\fB/usr/sbin/audit -s\fR" and will start automatically with future
boots of the zone.
.sp
.LP
When
.B auditd
runs in a local zone, the configuration is taken from the
local zone's
.B /etc/security
directory's files:
.BR audit_control ,
.BR audit_class ,
.BR audit_user ,
.BR audit_startup ,
and
.BR audit_event .
.sp
.LP
Configuration changes do not affect audit sessions that are currently
running, as the changes do not modify a process's preselection mask. To
.RB "change the preselection mask on a running process, use the" " -setpmask"
option of the \fBauditconfig\fR command (see \fBauditconfig\fR(1M)). If the
user logs out and logs back in, the new configuration changes will be
reflected in the next audit session.
