usr/src/man/man1m/audit_warn.1m
'\" te
.\" Copyright (c) 2003, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH audit_warn 1M "16 Apr 2008" "SunOS 5.11" "System Administration Commands"
.SH NAME
audit_warn \- audit daemon warning script
.SH SYNOPSIS
.LP
.nf
\fB/etc/security/audit_warn\fR [\fIoption\fR [\fIarguments\fR]]
.fi

.SH DESCRIPTION
.sp
.LP
The
.B audit_warn
utility processes warning or error messages from the
audit daemon. When a problem is encountered, the audit daemon,
.BR auditd (1M)
calls
.B audit_warn
with the appropriate arguments. The
.I option
argument specifies the error type.
.sp
.LP
The system administrator can specify a list of mail recipients to be
notified when an audit_warn situation arises by defining a mail alias called
.B audit_warn
in
.BR aliases (4).
The users that make up the
.B audit_warn
alias are typically the
.B audit
and
.B root
users.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B allhard
.I count
.ad
.sp .6
.RS 4n
Indicates that the hard limit for all filesystems has been exceeded
.I count
times. The default action for this option is to send mail to the
.B audit_warn
alias only if the
.I count
is
.BR 1 ,
and to write a
message to the machine console every time. It is recommended that mail
.I not
be sent every time as this could result in a the saturation of the
file system that contains the mail spool directory.
.RE

.sp
.ne 2
.mk
.na
.B allsoft
.ad
.sp .6
.RS 4n
Indicates that the soft limit for all filesystems has been exceeded. The
default action for this option is to send mail to the
.B audit_warn
alias
and to write a message to the machine console.
.RE

.sp
.ne 2
.mk
.na
.B auditoff
.ad
.sp .6
.RS 4n
Indicates that someone other than the audit daemon changed the system audit
state to something other than \fBAUC_AUDITING\&.\fR  The audit
daemon will have exited in this case. The default action for this option is
to send mail to the
.B audit_warn
alias and to write a message to the
machine console.
.RE

.sp
.ne 2
.mk
.na
.B ebusy
.ad
.sp .6
.RS 4n
Indicates that the audit daemon is already running. The default action for
this option is to send mail to the
.B audit_warn
alias and to write a
message to the machine console.
.RE

.sp
.ne 2
.mk
.na
.B getacdir
.I count
.ad
.sp .6
.RS 4n
Indicates that there is a problem getting the directory list or plugin list
from
.BR audit_control (4).
The audit daemon will hang in a sleep loop
until the file is fixed. The default action for this option is to send mail
to the
.B audit_warn
alias only if
.I count
is
.BR 1 ,
and to write a
message to the machine console every time. It is recommended that mail
.I not
be sent every time as this could result in a the saturation of the
file system that contains the mail spool directory.
.RE

.sp
.ne 2
.mk
.na
.B hard
.I filename
.ad
.sp .6
.RS 4n
Indicates that the hard limit for the file has been exceeded. The default
action for this option is to send mail to the
.B audit_warn
alias and to
write a message to the machine console.
.RE

.sp
.ne 2
.mk
.na
.B nostart
.ad
.sp .6
.RS 4n
Indicates that auditing could not be started. The default action for this
option is to send mail to the
.B audit_warn
alias and to write a message
to the machine console. Some administrators may prefer to modify
.B audit_warn
to reboot the system when this error occurs.
.RE

.sp
.ne 2
.mk
.na
.B plugin
.I "name error"
.I count text
.ad
.sp .6
.RS 4n
Indicates that an error occurred during execution of the
.BR auditd
plugin
.IR name .
The default action for this option is to send mail to the
.B audit_warn
alias only if
.I count
is 1, and to write a message to
the machine console every time. (Separate counts are kept for each error
type.) It is recommended that mail not be sent every time as this could
result in the saturation of the file system that contains the mail spool
directory. The
.I text
field provides the detailed error message passed
from the plugin. The
.I error
field is one of the following strings:
.sp
.ne 2
.mk
.na
.B load_error
.ad
.RS 16n
.rt
Unable to load the plugin
.IR name .
.RE

.sp
.ne 2
.mk
.na
.B sys_error
.ad
.RS 16n
.rt
The plugin
.I name
is not executing due to a system error such as a lack
of resources.
.RE

.sp
.ne 2
.mk
.na
.B config_error
.ad
.RS 16n
.rt
No plugins loaded (including the binary file plugin,
.BR audit_binfile (5))
due to configuration errors in
.BR audit_control (4).
The name string is
.B --
to indicate that no
plugin name applies.
.RE

.sp
.ne 2
.mk
.na
.B retry
.ad
.RS 16n
.rt
The plugin
.I name
reports it has encountered a temporary failure. For
example, the
.B audit_binfree.so
plugin uses
.B retry
to indicate that
all directories are full.
.RE

.sp
.ne 2
.mk
.na
.B no_memory
.ad
.RS 16n
.rt
The plugin
.I name
reports a failure due to lack of memory.
.RE

.sp
.ne 2
.mk
.na
.B invalid
.ad
.RS 16n
.rt
The plugin
.I name
reports it received an invalid input.
.RE

.sp
.ne 2
.mk
.na
.B failure
.ad
.RS 16n
.rt
The plugin
.I name
has reported an error as described in
.IR text .
.RE

.RE

.sp
.ne 2
.mk
.na
.B postsigterm
.ad
.sp .6
.RS 4n
Indicates that an error occurred during the orderly shutdown of the audit
daemon. The default action for this option is to send mail to the
.B audit_warn
alias and to write a message to the machine console.
.RE

.sp
.ne 2
.mk
.na
.B soft
.I filename
.ad
.sp .6
.RS 4n
Indicates that the soft limit for
.I filename
has been exceeded. The
default action for this option is to send mail to the
.B audit_warn
alias
and to write a message to the machine console.
.RE

.sp
.ne 2
.mk
.na
.B tmpfile
.ad
.sp .6
.RS 4n
Indicates that the temporary audit file already exists indicating a fatal
error. The default action for this option is to send mail to the
.B audit_warn
alias and to write a message to the machine console.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsr
_
Interface StabilityEvolving
.TE

.sp
.LP
The interface stability is evolving. The file content is unstable.
.SH SEE ALSO
.sp
.LP
.BR audit (1M),
.BR auditd (1M),
.BR bsmconv (1M),
.BR aliases (4),
.BR audit.log (4),
.BR audit_control (4),
.BR attributes (5)
.sp
.LP
See the section on Solaris Auditing in \fISystem Administration Guide: Security Services\fR.
.SH NOTES
.sp
.LP
This functionality is available only if the Solaris Auditing feature has
been enabled. See
.BR bsmconv (1M)
for more information.
.sp
.LP
If the audit policy
.B perzone
is set, the
.B /etc/security/audit_warn
script for the local zone is used for
notifications from the local zone's instance of
.BR auditd .
If the
.B perzone
policy is not set, all
.B auditd
errors are generated by
the global zone's copy of
.BR /etc/security/audit_warn .
