usr/src/man/man1m/audit.1m
'\" te
.\" Copyright (c) 1993, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH audit 1M "16 Apr 2008" "SunOS 5.11" "System Administration Commands"
.SH NAME
audit \- control the behavior of the audit daemon
.SH SYNOPSIS
.LP
.nf
\fBaudit\fR \fB-n\fR | \fB-s\fR | \fB-t\fR | \fB-v\fR [\fIpath\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The
.B audit
command is the system administrator's interface to
maintaining the audit trail. The audit daemon can be notified to read the
contents of the
.BR audit_control (4)
file and re-initialize the current
audit directory to the first directory listed in the
.BR audit_control
file or to open a new audit file in the current audit directory specified in
the
.B audit_control
file, as last read by the audit daemon. Reading
.B audit_control
.RB "also causes the " minfree " and " plugin 
configuration lines to be re-read and reset within
.BR auditd .
The audit
daemon can also be signaled to close the audit trail and disable auditing.
.SH OPTIONS
.sp
.ne 2
.mk
.na
.B -n
.ad
.RS 11n
.rt
Notify the audit daemon to close the current audit file and open a new
audit file in the current audit directory.
.RE

.sp
.ne 2
.mk
.na
.B -s
.ad
.RS 11n
.rt
Notify the audit daemon to read the audit control file. The audit daemon
stores the information internally. If the audit daemon is not running but
audit has been enabled by means of
.BR bsmconv "(1M), the audit daemon is"
started.
.RE

.sp
.ne 2
.mk
.na
.B -t
.ad
.RS 11n
.rt
Direct the audit daemon to close the current audit trail file, disable
auditing, and die. Use
.B -s
to restart auditing.
.RE

.sp
.ne 2
.mk
.na
.B -v
.I path
.ad
.RS 11n
.rt
Verify the syntax for the audit control file stored in
.IR path .
The
.B audit
command displays an approval message or outputs specific error
messages for each error found.
.RE

.SH DIAGNOSTICS
.sp
.LP
The
.B audit
command will exit with
.B 0
upon success and a positive
integer upon failure.
.SH FILES
.RS +4
.TP
.ie t \(bu
.el o
.B /etc/security/audit_user
.RE
.RS +4
.TP
.ie t \(bu
.el o
.B /etc/security/audit_control
.RE
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
_
StabilityEvolving
.TE

.SH SEE ALSO
.sp
.LP
.BR bsmconv (1M),
.BR praudit (1M),
.BR audit (2),
.BR audit_control (4),
.BR audit_user (4),
.BR attributes (5)
.sp
.LP
See the section on Solaris Auditing in \fISystem Administration Guide: Security Services\fR.
.SH NOTES
.sp
.LP
The functionality described in this man page is available only if the
Solaris Auditing feature has been enabled. See
.BR bsmconv (1M)
for more
information.
.sp
.LP
The
.B audit
command does not modify a process's preselection mask. It
functions are limited to the following:
.RS +4
.TP
.ie t \(bu
.el o
affects which audit directories are used for audit data storage;
.RE
.RS +4
.TP
.ie t \(bu
.el o
specifies the minimum free space setting;
.RE
.RS +4
.TP
.ie t \(bu
.el o
resets the parameters supplied by means of the plugin directive.
.RE
.sp
.LP
For the
.B -s
option,
.B audit
validates the
.BR audit_control
syntax and displays an error message if a syntax error is found. If a syntax
error message is displayed, the audit daemon does not re-read
.BR audit_control .
Because
.B audit_control
is processed at boot time,
the
.B -v
option is provided to allow syntax checking of an edited copy
of
.BR audit_control .
Using
.BR -v ,
.B audit
exits with 0 if the
syntax is correct; otherwise, it returns a positive integer.
.sp
.LP
The
.B -v
option can be used in any zone, but the
.BR -t ,
.BR -s ,
and
.B -n
options are valid only in local zones and, then, only if the
.B perzone
audit policy is set. See
.BR auditd (1M)
and
.BR auditconfig (1M)
for per-zone audit configuration.
