usr/src/man/man1m/audit_startup.1m
'\" te
.\" Copyright (c) 1993, Sun Microsystems, Inc.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH audit_startup 1M "20 Jan 2009" "SunOS 5.11" "System Administration Commands"
.SH NAME
audit_startup \- audit subsystem initialization script
.SH SYNOPSIS
.LP
.nf
\fB/etc/security/audit_startup\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B audit_startup
script is used to initialize the audit subsystem
before the audit deamon is started. This script is configurable by the
system administrator, and currently consists of a series of
\fBauditconfig\fR(1M) commands to set the system default policy, and
download the initial event to class mapping.
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityObsolete Committed
.TE

.SH SEE ALSO
.sp
.LP
.BR auditconfig (1M),
.BR auditd (1M),
.BR bsmconv (1M),
.BR attributes (5)
.sp
.LP
See the section on Solaris Auditing in \fISystem Administration Guide:
Security Services\fR.
.SH NOTES
.sp
.LP
The functionality described in this man page is available only if the Basic
Security Module (\fBBSM\fR) has been enabled. See \fBbsmconv\fR(1M) for more
information.
.sp
.LP
This command is Obsolete and may be removed and replaced with equivalent
functionality in a future release of Solaris.
