usr/src/man/man1m/auditconfig.1m
'\" te
.\" Copyright (c) 2008, Sun Microsystems, Inc. All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH auditconfig 1M "14 Sep 2009" "SunOS 5.11" "System Administration Commands"
.SH NAME
auditconfig \- configure auditing
.SH SYNOPSIS
.LP
.nf
\fBauditconfig\fR \fIoption\fR.\|.\|.
.fi

.SH DESCRIPTION
.sp
.LP
.B auditconfig
provides a command line interface to get and set kernel
audit parameters.
.sp
.LP
This functionality is available only if the Solaris Auditing feature has been
enabled. See \fBbsmconv\fR(1M) for more information.
.sp
.LP
The setting of the
.B perzone
policy determines the scope of the audit
setting controlled by
.BR auditconfig .
If
.B perzone
is set, then the
values reflect the local zone except as noted. Otherwise, the settings are for
the entire system. Any restriction based on the
.B perzone
setting is noted
for each option to which it applies.
.sp
.LP
A non-global zone administrator can set all audit policy options except
.B perzone
and
.BR ahlt .
.B perzone
and
.B ahlt
apply only to the
global zone; setting these policies requires the privileges of a global zone
administrator.
.B perzone
and
.B ahlt
are described under the
.B -setpolicy
option, below.
.SH OPTIONS
.sp
.ne 2
.mk
.na
.B -aconf
.ad
.sp .6
.RS 4n
Set the non-attributable audit mask from the
.BR audit_control (4)
file. For
example:
.sp
.in +2
.nf
# auditconfig -aconf
Configured non-attributable events.
.fi
.in -2
.sp

.RE

.sp
.ne 2
.mk
.na
.B -audit
.I event sorf
.I retval string
.ad
.sp .6
.RS 4n
This command constructs an audit record for audit event
.I event
using the
process's audit characteristics containing a text token
.IR string .
The
return token is constructed from the
.I sorf
(success/failure flag) and the
.I retval
(return value). The event is type
.BR char* ,
the
.I sorf
is
0/1 for success/failure,
.I retval
is an errno value,
.I string
is type
.BR *char .
This command is useful for constructing an audit record with a
shell script. An example of this option:
.sp
.in +2
.nf
# auditconfig -audit AUE_ftpd 0 0 "test string"
#

audit record from audit trail:
    header,76,2,ftp access,,Fri Dec 08 08:44:02 2000, + 669 msec
    subject,abc,root,other,root,other,104449,102336,235 197121 elbow
    text,test string
    return,success,0
.fi
.in -2
.sp

.RE

.sp
.ne 2
.mk
.na
.B -chkaconf
.ad
.sp .6
.RS 4n
Checks the configuration of the non-attributable events set in the kernel
against the entries in
.BR audit_control (4).
If the runtime class mask of a
kernel audit event does not match the configured class mask, a mismatch is
reported.
.RE

.sp
.ne 2
.mk
.na
.B -chkconf
.ad
.sp .6
.RS 4n
Check the configuration of kernel audit event to class mappings. If the
runtime class mask of a kernel audit event does not match the configured class
mask, a mismatch is reported.
.RE

.sp
.ne 2
.mk
.na
.B -conf
.ad
.sp .6
.RS 4n
Configure kernel audit event to class mappings. Runtime class mappings are
changed to match those in the audit event to class database file.
.RE

.sp
.ne 2
.mk
.na
.B -getasid
.ad
.sp .6
.RS 4n
Prints the audit session ID of the current process. For example:
.sp
.in +2
.nf
# auditconfig -getasid
audit session id = 102336
.fi
.in -2
.sp

.RE

.sp
.ne 2
.mk
.na
.B -getaudit
.ad
.sp .6
.RS 4n
Returns the audit characteristics of the current process.
.sp
.in +2
.nf
# auditconfig -getaudit
audit id = abc(666)
process preselection mask = lo(0x1000,0x1000)
terminal id (maj,min,host) = 235,197121,elbow(172.146.89.77)
audit session id = 102336
.fi
.in -2
.sp

.RE

.sp
.ne 2
.mk
.na
.B -getauid
.ad
.sp .6
.RS 4n
Prints the audit ID of the current process. For example:
.sp
.in +2
.nf
# auditconfig -getauid
audit id = abc(666)
.fi
.in -2
.sp

.RE

.sp
.ne 2
.mk
.na
.B -getcar
.ad
.sp .6
.RS 4n
Prints current active root location (anchored from root [or local zone root]
at system boot). For example:
.sp
.in +2
.nf
# auditconfig -getcar
current active root = /
.fi
.in -2
.sp

.RE

.sp
.ne 2
.mk
.na
.B -getclass
.I event
.ad
.sp .6
.RS 4n
Display the preselection mask associated with the specified kernel audit
event.
.I event
is the kernel event number or event name.
.RE

.sp
.ne 2
.mk
.na
.B -getcond
.ad
.sp .6
.RS 4n
Display the kernel audit condition. The condition displayed is the literal
string
.B auditing
meaning auditing is enabled and turned on (the kernel
audit module is constructing and queuing audit records);
.BR noaudit ,
meaning auditing is enabled but turned off (the kernel audit module is not
constructing and queuing audit records);
.BR disabled ,
meaning that the
audit module has not been enabled; or
.BR nospace ,
meaning there is no space
for saving audit records. See
.BR auditon (2)
and
.BR auditd (1M)
for
further information.
.RE

.sp
.ne 2
.mk
.na
.B -getestate
.I event
.ad
.sp .6
.RS 4n
For the specified event (string or event number), print out classes
.I event
has been assigned. For example:
.sp
.in +2
.nf
# auditconfig -getestate 20
audit class mask for event AUE_REBOOT(20) = 0x800
# auditconfig -getestate AUE_RENAME
audit class mask for event AUE_RENAME(42) = 0x30
.fi
.in -2
.sp

.RE

.sp
.ne 2
.mk
.na
.B -getkaudit
.ad
.sp .6
.RS 4n
Get audit characteristics of the current zone. For example:
.sp
.in +2
.nf
# auditconfig -getkaudit
audit id = unknown(-2)
process preselection mask = lo,na(0x1400,0x1400)
terminal id (maj,min,host) = 0,0,(0.0.0.0)
audit session id = 0
.fi
.in -2
.sp

If the audit policy
.B perzone
is not set, the terminal id is that of the
global zone. Otherwise, it is the terminal id of the local zone.
.RE

.sp
.ne 2
.mk
.na
.B -getkmask
.ad
.sp .6
.RS 4n
Get non-attributable pre-selection mask for the current zone. For example:
.sp
.in +2
.nf
# auditconfig -getkmask
audit flags for non-attributable events = lo,na(0x1400,0x1400)
.fi
.in -2
.sp

If the audit policy
.B perzone
is not set, the kernel mask is that of the
global zone. Otherwise, it is that of the local zone.
.RE

.sp
.ne 2
.mk
.na
.B -getpinfo
.I pid
.ad
.sp .6
.RS 4n
Display the audit ID, preselection mask, terminal ID, and audit session ID
for the specified process.
.RE

.sp
.ne 2
.mk
.na
.B -getpolicy
.ad
.sp .6
.RS 4n
Display the kernel audit policy. The
.B ahlt
and
.B perzone
policies
reflect the settings from the global zone. If
.B perzone
is set, all other
policies reflect the local zone's settings. If
.B perzone
is not set, the
policies are machine-wide.
.RE

.sp
.ne 2
.mk
.na
.B -getcwd
.ad
.sp .6
.RS 4n
Prints current working directory (anchored from zone root at system boot).
For example:
.sp
.in +2
.nf
# cd /usr/tmp
# auditconfig -getcwd
current working directory = /var/tmp
.fi
.in -2
.sp

.RE

.sp
.ne 2
.mk
.na
.B -getqbufsz
.ad
.sp .6
.RS 4n
Get audit queue write buffer size. For example:
.sp
.in +2
.nf
# auditconfig -getqbufsz
        audit queue buffer size (bytes) = 1024
.fi
.in -2
.sp

.RE

.sp
.ne 2
.mk
.na
.B -getqctrl
.ad
.sp .6
.RS 4n
Get audit queue write buffer size, audit queue
.B hiwater
mark, audit
queue
.B lowater
mark, audit queue
.B prod
interval (ticks).
.sp
.in +2
.nf
# auditconfig -getqctrl
audit queue hiwater mark (records) = 100
audit queue lowater mark (records) = 10
audit queue buffer size (bytes) = 1024
audit queue delay (ticks) = 20
.fi
.in -2
.sp

.RE

.sp
.ne 2
.mk
.na
.B -getqdelay
.ad
.sp .6
.RS 4n
Get interval at which audit queue is prodded to start output. For example:
.sp
.in +2
.nf
# auditconfig -getqdelay
audit queue delay (ticks) = 20
.fi
.in -2
.sp

.RE

.sp
.ne 2
.mk
.na
.B -getqhiwater
.ad
.sp .6
.RS 4n
Get high water point in undelivered audit records when audit generation will
block. For example:
.sp
.in +2
.nf
# ./auditconfig -getqhiwater
audit queue hiwater mark (records) = 100
.fi
.in -2
.sp

.RE

.sp
.ne 2
.mk
.na
.B -getqlowater
.ad
.sp .6
.RS 4n
Get low water point in undelivered audit records where blocked processes will
resume. For example:
.sp
.in +2
.nf
# auditconfig -getqlowater
audit queue lowater mark (records) = 10
.fi
.in -2
.sp

.RE

.sp
.ne 2
.mk
.na
.B -getstat
.ad
.sp .6
.RS 4n
Print current audit statistics information. For example:
.sp
.in +2
.nf
# auditconfig -getstat
gen nona kern  aud  ctl  enq wrtn wblk rblk drop  tot  mem
910    1  725  184    0  910  910    0  231    0   88   48
.fi
.in -2
.sp

See \fBauditstat\fR(1M) for a description of the headings in \fB-getstat\fR
output.
.RE

.sp
.ne 2
.mk
.na
.B -gettid
.ad
.sp .6
.RS 4n
Print audit terminal ID for current process. For example:
.sp
.in +2
.nf
# auditconfig -gettid
terminal id (maj,min,host) = 235,197121,elbow(172.146.89.77)
.fi
.in -2
.sp

.RE

.sp
.ne 2
.mk
.na
.B -lsevent
.ad
.sp .6
.RS 4n
Display the currently configured (runtime) kernel and user level audit event
information.
.RE

.sp
.ne 2
.mk
.na
.B -lspolicy
.ad
.sp .6
.RS 4n
Display the kernel audit policies with a description of each policy.
.RE

.sp
.ne 2
.mk
.na
\fB-setasid\fR \fIsession-ID\fR [\fIcmd\fR]\fR
.ad
.sp .6
.RS 4n
Execute shell or
.I cmd
with specified
.IR session-ID .
For example:
.sp
.in +2
.nf
# ./auditconfig -setasid 2000 /bin/ksh
#
# ./auditconfig -getpinfo 104485
audit id = abc(666)
process preselection mask = lo(0x1000,0x1000)
terminal id (maj,min,host) = 235,197121,elbow(172.146.89.77)
audit session id = 2000
.fi
.in -2
.sp

.RE

.sp
.ne 2
.mk
.na
.B -setaudit
.I audit-ID preselect_flags
.I term-ID
\fIsession-ID\fR [\fIcmd\fR]\fR
.ad
.sp .6
.RS 4n
Execute shell or
.I cmd
with the specified audit characteristics.
.RE

.sp
.ne 2
.mk
.na
\fB-setauid\fR \fIaudit-ID\fR [\fIcmd\fR]\fR
.ad
.sp .6
.RS 4n
Execute shell or
.I cmd
with the specified
.IR audit-ID .
.RE

.sp
.ne 2
.mk
.na
.B -setclass
\fIevent audit_flag\fR[\fI,audit_flag .\|.\|.\fR]\fR
.ad
.sp .6
.RS 4n
Map the kernel event
.I event
to the classes specified by
.IR audit_flags .
.I event
is an event number or name. An \fIaudit_flag\fR
is a two character string representing an audit class. See
.BR audit_control (4)
for further information. If
.B perzone
is not set,
this option is valid only in the global zone.
.RE

.sp
.ne 2
.mk
.na
.B -setkaudit
.I IP-address_type IP_address
.ad
.sp .6
.RS 4n
Set IP address of machine to specified values.
.I IP-address_type
is
.B ipv6
or
.BR ipv4 .
.sp
If
.B perzone
is not set, this option is valid only in the global zone.
.RE

.sp
.ne 2
.mk
.na
.B -setkmask
.I audit_flags
.ad
.sp .6
.RS 4n
Set non-attributes selection flags of machine.
.sp
If
.B perzone
is not set, this option is valid only in the global zone.
.RE

.sp
.ne 2
.mk
.na
.B -setpmask
.I pid flags
.ad
.sp .6
.RS 4n
Set the preselection mask of the specified process.
.B flags
is the ASCII
representation of the flags similar to that in
.BR audit_control (4).
.sp
If
.B perzone
is not set, this option is valid only in the global zone.
.RE

.sp
.ne 2
.mk
.na
\fB-setpolicy\fR [\fI+\fR|\fI-\fR]\fIpolicy_flag\fR[\fI,policy_flag
\&.\|.\|.\fR]\fR
.ad
.sp .6
.RS 4n
Set the kernel audit policy. A policy
.I policy_flag
is literal strings
that denotes an audit policy. A prefix of
.B +
adds the policies specified
to the current audit policies. A prefix of
.B -
removes the policies
specified from the current audit policies. No policies can be set from a local
zone unless the
.B perzone
policy is first set from the global zone. The
following are the valid policy flag strings (\fBauditconfig -lspolicy\fR
also lists the current valid audit policy flag strings):
.sp
.ne 2
.mk
.na
.B all
.ad
.RS 16n
.rt
Include all policies that apply to the current zone.
.RE

.sp
.ne 2
.mk
.na
.B ahlt
.ad
.RS 16n
.rt
Panic is called and the system dumps core if an asynchronous audit event
occurs that cannot be delivered because the audit queue has reached the
high-water mark or because there are insufficient resources to construct an
audit record. By default, records are dropped and a count is kept of the
number of dropped records.
.RE

.sp
.ne 2
.mk
.na
.B arge
.ad
.RS 16n
.rt
Include the
.BR execv (2)
system call environment arguments to the audit
record. This information is not included by default.
.RE

.sp
.ne 2
.mk
.na
.B argv
.ad
.RS 16n
.rt
Include the
.BR execv (2)
system call parameter arguments to the audit
record. This information is not included by default.
.RE

.sp
.ne 2
.mk
.na
.B cnt
.ad
.RS 16n
.rt
Do not suspend processes when audit resources are exhausted. Instead, drop
audit records and keep a count of the number of records dropped. By default,
process are suspended until audit resources become available.
.RE

.sp
.ne 2
.mk
.na
.B group
.ad
.RS 16n
.rt
Include the supplementary group token in audit records. By default, the group
token is not included.
.RE

.sp
.ne 2
.mk
.na
.B none
.ad
.RS 16n
.rt
Include no policies. If used in other than the global zone, the \fBahlt\fR
and
.B perzone
policies are not changed.
.RE

.sp
.ne 2
.mk
.na
.B path
.ad
.RS 16n
.rt
Add secondary path tokens to audit record. These are typically the pathnames
of dynamically linked shared libraries or command interpreters for shell
scripts. By default, they are not included.
.RE

.sp
.ne 2
.mk
.na
.B perzone
.ad
.RS 16n
.rt
Maintain separate configuration, queues, and logs for each zone and execute a
separate version of \fBauditd\fR(1M) for each zone.
.RE

.sp
.ne 2
.mk
.na
.B public
.ad
.RS 16n
.rt
Audit public files. By default, read-type operations are not audited for
certain files which meet
.B public
characteristics: owned by root, readable
by all, and not writable by all.
.RE

.sp
.ne 2
.mk
.na
.B trail
.ad
.RS 16n
.rt
Include the trailer token in every audit record. By default, the trailer
token is not included.
.RE

.sp
.ne 2
.mk
.na
.B seq
.ad
.RS 16n
.rt
Include the sequence token as part of every audit record. By default, the
sequence token is not included. The sequence token attaches a sequence number
to every audit record.
.RE

.sp
.ne 2
.mk
.na
.B windata_down
.ad
.RS 16n
.rt
Include in an audit record any downgraded data moved between windows. This
policy is available only if the system is configured with Trusted Extensions.
By default, this information is not included.
.RE

.sp
.ne 2
.mk
.na
.B windata_up
.ad
.RS 16n
.rt
Include in an audit record any upgraded data moved between windows. This
policy is available only if the system is configured with Trusted Extensions.
By default, this information is not included.
.RE

.sp
.ne 2
.mk
.na
.B zonename
.ad
.RS 16n
.rt
Include the
.B zonename
token as part of every audit record. By default,
the
.B zonename
token is not included. The
.B zonename
token gives the
name of the zone from which the audit record was generated.
.RE

.RE

.sp
.ne 2
.mk
.na
.B -setqbufsz
.I buffer_size
.ad
.sp .6
.RS 4n
Set the audit queue write buffer size (bytes).
.RE

.sp
.ne 2
.mk
.na
.B -setqctrl
.I "hiwater lowater"
.I bufsz
.I interval
.ad
.sp .6
.RS 4n
Set the audit queue write buffer size (bytes), hiwater audit record count,
lowater audit record count, and wakeup interval (ticks). Valid within a local
zone only if
.B perzone
is set.
.RE

.sp
.ne 2
.mk
.na
.B -setqdelay
.I interval
.ad
.sp .6
.RS 4n
Set the audit queue wakeup interval (ticks). This determines the interval at
which the kernel pokes the audit queue, to write audit records to the audit
trail. Valid within a local zone only if
.B perzone
is set.
.RE

.sp
.ne 2
.mk
.na
.B -setqhiwater
.I hiwater
.ad
.sp .6
.RS 4n
Set the number of undelivered audit records in the audit queue at which audit
record generation blocks. Valid within a local zone only if
.B perzone
is
set.
.RE

.sp
.ne 2
.mk
.na
.B -setqlowater
.I lowater
.ad
.sp .6
.RS 4n
Set the number of undelivered audit records in the audit queue at which
blocked auditing processes unblock. Valid within a local zone only if
.B perzone
is set.
.RE

.sp
.ne 2
.mk
.na
.B -setsmask
.I asid flags
.ad
.sp .6
.RS 4n
Set the preselection mask of all processes with the specified audit session
ID. Valid within a local zone only if
.B perzone
is set.
.RE

.sp
.ne 2
.mk
.na
.B -setstat
.ad
.sp .6
.RS 4n
Reset audit statistics counters. Valid within a local zone only if
.B perzone
is set.
.RE

.sp
.ne 2
.mk
.na
.B -setumask
.I auid flags
.ad
.sp .6
.RS 4n
Set the preselection mask of all processes with the specified audit ID. Valid
within a local zone only if
.B perzone
is set.
.RE

.SH EXAMPLES
.LP
.B Example 1
Using \fBauditconfig\fR
.sp
.LP
The following is an example of an
.B auditconfig
program:

.sp
.in +2
.nf
#
# map kernel audit event number 10 to the "fr" audit class
#
% auditconfig -setclass 10 fr

#
# turn on inclusion of exec arguments in exec audit records
#
% auditconfig -setpolicy +argv
.fi
.in -2
.sp

.SH EXIT STATUS
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 5n
.rt
Successful completion.
.RE

.sp
.ne 2
.mk
.na
.B 1
.ad
.RS 5n
.rt
An error occurred.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/security/audit_event
.ad
.RS 29n
.rt
Stores event definitions used in the audit system.
.RE

.sp
.ne 2
.mk
.na
.B /etc/security/audit_class
.ad
.RS 29n
.rt
Stores class definitions used in the audit system.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
.BR audit (1M),
.BR auditd (1M),
.BR auditstat (1M),
.BR bsmconv (1M),
.BR praudit (1M),
.BR auditon (2),
.BR execv (2),
.BR audit_class (4),
.BR audit_control (4),
.BR audit_event (4),
.BR attributes (5),
.BR audit_binfile (5)
.sp
.LP
See the section on Solaris Auditing in \fISystem Administration Guide:
Security Services\fR.
.SH NOTES
.sp
.LP
If plugin output is selected using
.BR audit_control (4),
the behavior of
the system with respect to the
.B "-setpolicy +cnt"
and the
.B -setqhiwater
options is modified slightly. If \fB-setpolicy\fR
.B +cnt
is set, data will continue to be sent to the selected plugin, even
though output to the binary audit log is stopped, pending the freeing of disk
space. If
.B "-setpolicy -cnt"
is used, the blocking behavior is as
described under OPTIONS, above. The value set for the queue high water mark is
used within
.B auditd
as the default value for its queue limits unless
overridden by means of the
.B qsize
attribute as described in
.BR audit_control (4).
.sp
.LP
The
.B auditconfig
options that modify or display process-based
information are not affected by the
.B perzone
policy. Those that modify
system audit data such as the terminal id and audit queue parameters are valid
only in the global zone, unless the
.B perzone
policy is set. The display
of a system audit reflects the local zone if
.B perzone
is set. Otherwise,
it reflects the settings of the global zone.
.sp
.LP
The
.B -setcond
option has been removed. Use
.BR audit (1M)
to enable or
disable auditing.
.sp
.LP
The \fB-getfsize\fR and \fB-setfsize\fR options have been removed. Use
.BR audit_binfile (5)
.B p_fsize
to set the audit file size.
