usr/src/man/man1m/auditd.1m
'\" te
.\" Copyright (c) 2008, Sun Microsystems, Inc. All Rights Reserved.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH auditd 1M "29 Apr 2008" "SunOS 5.11" "System Administration Commands"
.SH NAME
auditd \- audit daemon
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/auditd\fR
.fi

.SH DESCRIPTION
.sp
.LP
The audit daemon, \fBauditd\fR, controls the generation and location of
audit trail files and the generation of syslog messages based on the
definitions in \fBaudit_control\fR(4). If auditing is enabled, \fBauditd\fR
reads the \fBaudit_control\fR file to do the following:
.RS +4
.TP
.ie t \(bu
.el o
reads the path to a library module for realtime conversion of audit data
into syslog messages;
.RE
.RS +4
.TP
.ie t \(bu
.el o
reads other parameters specific to the selected plugin or plugins;
.RE
.RS +4
.TP
.ie t \(bu
.el o
obtains a list of directories into which audit files can be written;
.RE
.RS +4
.TP
.ie t \(bu
.el o
obtains the percentage limit for how much space to reserve on each
filesystem before changing to the next directory.
.RE
.sp
.LP
\fBaudit\fR(1M) is used to control \fBauditd\fR. It can cause \fBauditd\fR
to:
.RS +4
.TP
.ie t \(bu
.el o
close the current audit file and open a new one;
.RE
.RS +4
.TP
.ie t \(bu
.el o
close the current audit file, re-read \fB/etc/security/audit_control\fR and
open a new audit file;
.RE
.RS +4
.TP
.ie t \(bu
.el o
close the audit trail and terminate auditing.
.RE
.SS "Auditing Conditions"
.sp
.LP
The audit daemon invokes the program \fBaudit_warn\fR(1M) under the
following conditions with the indicated options:
.sp
.ne 2
.mk
.na
\fBaudit_warn soft\fR \fIpathname\fR
.ad
.sp .6
.RS 4n
The file system upon which \fIpathname\fR resides has exceeded the minimum
free space limit defined in \fBaudit_control\fR(4). A new audit trail has
been opened on another file system.
.RE

.sp
.ne 2
.mk
.na
\fBaudit_warn allsoft\fR
.ad
.sp .6
.RS 4n
All available file systems have been filled beyond the minimum free space
limit. A new audit trail has been opened anyway.
.RE

.sp
.ne 2
.mk
.na
\fBaudit_warn hard\fR \fIpathname\fR
.ad
.sp .6
.RS 4n
The file system upon which \fIpathname\fR resides has filled or for some
reason become unavailable. A new audit trail has been opened on another file
system.
.RE

.sp
.ne 2
.mk
.na
\fBaudit_warn allhard\fR \fIcount\fR
.ad
.sp .6
.RS 4n
All available file systems have been filled or for some reason become
unavailable. The audit daemon will repeat this call to \fBaudit_warn\fR at
intervals of at least twenty seconds until space becomes available.
\fIcount\fR is the number of times that \fBaudit_warn\fR has been called
since the problem arose.
.RE

.sp
.ne 2
.mk
.na
\fBaudit_warn ebusy\fR
.ad
.sp .6
.RS 4n
There is already an audit daemon running.
.RE

.sp
.ne 2
.mk
.na
\fBaudit_warn tmpfile\fR
.ad
.sp .6
.RS 4n
The file \fB/etc/security/audit/audit_tmp\fR exists, indicating a fatal
error.
.RE

.sp
.ne 2
.mk
.na
\fBaudit_warn nostart\fR
.ad
.sp .6
.RS 4n
The internal system audit condition is \fBAUC_FCHDONE\fR. Auditing cannot
be started without rebooting the system.
.RE

.sp
.ne 2
.mk
.na
\fBaudit_warn auditoff\fR
.ad
.sp .6
.RS 4n
The internal system audit condition has been changed to not be
\fBAUC_AUDITING\fR by someone other than the audit daemon. This causes the
audit daemon to exit.
.RE

.sp
.ne 2
.mk
.na
\fBaudit_warn postsigterm\fR
.ad
.sp .6
.RS 4n
An error occurred during the orderly shutdown of the auditing system.
.RE

.sp
.ne 2
.mk
.na
\fBaudit_warn getacdir\fR
.ad
.sp .6
.RS 4n
There is a problem getting the directory list from
\fB/etc/security/audit/audit_control\fR.
.sp
The audit daemon will hang in a sleep loop until this file is fixed.
.RE

.SH FILES
.sp
.LP
\fB/etc/security/audit/audit_control\fR
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBaudit\fR(1M), \fBaudit_warn\fR(1M), \fBbsmconv\fR(1M),
\fBpraudit\fR(1M), \fBauditon\fR(2), \fBaudit.log\fR(4),
\fBaudit_control\fR(4), \fBattributes\fR(5)
.sp
.LP
See the section on Solaris Auditing in \fISystem Administration Guide:
Security Services\fR.
.SH NOTES
.sp
.LP
The functionality described in this man page is available only if the
Solaris Auditing feature has been enabled. See \fBbsmconv\fR(1M) for more
information.
.sp
.LP
\fBauditd\fR is loaded in the global zone at boot time if auditing is
enabled. See \fBbsmconv\fR(1M).
.sp
.LP
If the audit policy \fBperzone\fR is set, \fBauditd\fR runs in each zone,
starting automatically when the local zone boots. If a zone is running when
the \fBperzone\fR policy is set, auditing must be started manually in local
zones. It is not necessary to reboot the system or the local zone to start
auditing in a local zone. \fBauditd\fR can be started with
"\fB/usr/sbin/audit\fR \fB-s\fR" and will start automatically with future
boots of the zone.
.sp
.LP
When \fBauditd\fR runs in a local zone, the configuration is taken from the
local zone's \fB/etc/security\fR directory's files: \fBaudit_control\fR,
\fBaudit_class\fR, \fBaudit_user\fR, \fBaudit_startup\fR, and
\fBaudit_event\fR.
.sp
.LP
Configuration changes do not affect audit sessions that are currently
running, as the changes do not modify a process's preselection mask. To
change the preselection mask on a running process, use the \fB-setpmask\fR
option of the \fBauditconfig\fR command (see \fBauditconfig\fR(1M)). If the
user logs out and logs back in, the new configuration changes will be
reflected in the next audit session.
