usr/src/man/man1m/automount.1m
'\" te
.\" Copyright 1989 AT&T
.\" Copyright (c) 2008, Sun Microsystems, Inc. All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH automount 1M "28 Mar 2008" "SunOS 5.11" "System Administration Commands"
.SH NAME
automount \- install automatic mount points
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/automount\fR [\fB-t\fR \fIduration\fR] [\fB-v\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The
.B automount
utility installs \fBautofs\fR mount points and
associates an automount map with each mount point. It starts the
.BR automountd (1M)
daemon if it finds any non-trivial entries in either
local or distributed automount maps and if the daemon is not already
running. The \fBautofs\fR file system monitors attempts to access
directories within it and notifies the
.BR automountd "(1M) daemon. The"
daemon uses the map to locate a file system, which it then mounts at the
point of reference within the \fBautofs\fR file system. A map can be
assigned to an \fBautofs\fR mount using an entry in the
\fB/etc/auto_master\fR map or a direct map.
.sp
.LP
If the file system is not accessed within an appropriate interval (\fB10\fR
minutes by default), the
.B automountd
daemon unmounts the file system.
.sp
.LP
The file
.B /etc/auto_master
determines the locations of all
\fBautofs\fR mount points. By default, this file contains three entries:
.sp
.in +2
.nf
# Master map for automounter
#
+auto_master
/net          -hosts    -nosuid
/home         auto_home
.fi
.in -2
.sp

.sp
.LP
The
.B +auto_master
entry is a reference to an external
.B NIS
or
\fBNIS+\fR master map. If one exists, then its entries are read as if they
occurred in place of the
.B +auto_master
entry. The remaining entries in
the master file specify a directory on which an \fBautofs\fR mount will be
made followed by the automounter map to be associated with it. Optional
mount options may be supplied as an optional third field in the each entry.
These options are used for any entries in the map that do not specify mount
options explicitly. The
.B automount
command is usually run without
arguments. It compares the entries
.B /etc/auto_master
with the current
list of \fBautofs\fR mounts in
.B /etc/mnttab
and adds, removes or
updates \fBautofs\fR mounts to bring the
.B /etc/mnttab
up to date with
the
.BR /etc/auto_master .
At boot time it installs all \fBautofs\fR mounts
from the master map. Subsequently, it may be run to install \fBautofs\fR
mounts for new entries in the master map or the direct map, or to perform
unmounts for entries that have been removed from these maps.
.SS "Automount with Solaris Trusted Extensions"
.sp
.LP
If a system is configured with Solaris Trusted Extensions, additional
processing is performed to facilitate multilevel home directory access. A
list of zones whose labels are dominated by the current zone is generated
and default
.B auto_home
automount maps are generated if they do not
currently exist. These automount maps are named
\fBauto_home_\fI<zonename>\fR, where \fI<zonename>\fR is the name of each
zone's lower-level zone. An \fBautofs\fR mount of each such \fBauto_home\fR
map is then performed, regardless of whether it is explicitly or implicitly
listed in the master map. Instead of \fBautofs\fR mounting the standard
\fBauto_home\fR map, the zone uses an \fBauto_home\fR file appended with its
own zone name. Each zone's
.B auto_home
map is uniquely named so that it
can be maintained and shared by all zones using a common name server.
.sp
.LP
By default, the home directories of lower-level zones are mounted read-only
under \fB/zone/\fI<zonename>\fR/export/home\fR when each zone is booted. The
default \fBauto_home_\fI<zonename>\fR automount map specifies that path
as the source directory for an \fBlofs\fR remount onto
\fB/zone/\fI<zonename>\fR/home/\fI<username>\fR. For example, the file
.BR auto_home_public ,
as generated from a higher level zone would
contain:
.sp
.LP
+auto_home_public
.sp
.LP
*       -fstype=lofs    :/zone/public/export/home/&
.sp
.LP
When a home directory is referenced and the name does not match any other
keys in the
.B auto_home_public
map, it will match this loopback mount
specification. If this loopback match occurs and the name corresponds to a
valid user whose home directory does not exist in the public zone, the
directory is automatically created on behalf of the user.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB-t\fR \fIduration\fR
.ad
.RS 15n
.rt
Specifies a
.IR duration ,
in seconds, that a file system is to remain
mounted when not in use. The default is
.B 10
minutes.
.RE

.sp
.ne 2
.mk
.na
.B -v
.ad
.RS 15n
.rt
Verbose mode. Notifies of \fBautofs\fR mounts, unmounts, or other
non-essential information.
.RE

.SH USAGE
.SS "Map Entry Format"
.sp
.LP
A simple map entry (mapping) takes the form:
.sp
.in +2
.nf
key [ -\fImount-options\fR ] \fIlocation\fR .\|.\|.
.fi
.in -2
.sp

.sp
.LP
where
.B key
is the full pathname of the directory to mount when used in
a direct map, or the simple name of a subdirectory in an indirect map.
\fImount-options\fR is a comma-separated list of \fBmount\fR options, and
\fIlocation\fR specifies a file system from which the directory may be
mounted. In the case of a simple
.B NFS
mount, the options that can be
used are as specified in \fBmount_nfs\fR(1M), and
.I location
takes the
form:
.sp
.in +2
.nf
\fIhost\fB:\|\fIpathname\fR
.fi
.in -2
.sp

.sp
.LP
\fIhost\fR is the name of the host from which to mount the file system, and
\fIpathname\fR is the absolute pathname of the directory to mount.
.sp
.LP
Options to other file systems are documented on the other
.BR mount_*
reference manual pages, for example, \fBmount_cachefs\fR(1M).
.SS "Replicated File Systems"
.sp
.LP
Multiple
.I location
fields can be specified for replicated
.BR NFS
file systems, in which case
.B automount
and the kernel will each try to
use that information to increase availability. If the read-only flag is set
in the map entry,
.B automountd
mounts a list of locations that the
kernel may use, sorted by several criteria. Only locations available at
mount time will be mounted, and thus be available to the kernel. When a
server does not respond, the kernel will switch to an alternate server. The
sort ordering of
.B automount
is used to determine how the next server is
chosen. If the read-only flag is not set,
.B automount
will mount the
best single location, chosen by the same sort ordering, and new servers will
only be chosen when an unmount has been possible, and a remount is done.
Servers on the same local subnet are given the strongest preference, and
servers on the local net are given the second strongest preference. Among
servers equally far away, response times will determine the order if no
weighting factors (see below) are used.
.sp
.LP
If the list includes server locations using both the
.B NFS
Version 2
Protocol and the
.B NFS
Version 3 Protocol,
.B automount
will choose
only a subset of the server locations on the list, so that all entries will
be the same protocol. It will choose servers with the
.B NFS
Version 3
Protocol so long as an
.B NFS
Version 2 Protocol server on a local subnet
will not be ignored. See the\fR  for additional details.
.sp
.LP
If each
.I location
in the list shares the same
.I pathname
then a
single
.I location
may be used with a comma-separated list of
hostnames:
.sp
.in +2
.nf
\fBhostname\fB,\fBhostname\fR\|.\|.\|.\|\fB:\fR\|\fIpathname\fR
.fi
.in -2
.sp

.sp
.LP
Requests for a server may be weighted, with the weighting factor appended
to the server name as an integer in parentheses. Servers without a weighting
are assumed to have a value of zero (most likely to be selected).
Progressively higher values decrease the chance of being selected. In the
example,
.sp
.in +2
.nf
\fBman\fR -ro \fBalpha,bravo,charlie(1),delta(4)\|:\|/usr/man\fR
.fi
.in -2
.sp

.sp
.LP
hosts
.B alpha
and
.B bravo
have the highest priority; host
\fBdelta\fR has the lowest.
.sp
.LP
Server proximity takes priority in the selection process. In the example
above, if the server
.B delta
is on the same network segment as the
client, but the others are on different network segments, then \fBdelta\fR
will be selected; the weighting value is ignored. The weighting has effect
only when selecting between servers with the same network proximity. The
automounter always selects the localhost over other servers on the same
network segment, regardless of weighting.
.sp
.LP
In cases where each server has a different export point, the weighting can
still be applied. For example:
.sp
.in +2
.nf
man -ro alpha:/usr/man  bravo,charlie(1):/usr/share/man
     delta(3):/export/man
.fi
.in -2
.sp

.sp
.LP
A mapping can be continued across input lines by escaping the
.BR NEWLINE
with a backslash (\e) Comments begin with a number sign (\fB#\fR) and end at
the subsequent NEWLINE.
.SS "Map Key Substitution"
.sp
.LP
The ampersand (\fB&\fR) character is expanded to the value of the \fBkey\fR
field for the entry in which it occurs. In this case:
.sp
.in +2
.nf
\fBjane\fR \fBsparcserver\|:\|/home/&\fR
.fi
.in -2
.sp

.sp
.LP
the
.B &
expands to
.BR jane .
.SS "Wildcard Key"
.sp
.LP
The asterisk (\fB*\fR) character, when supplied as the \fBkey\fR field, is
recognized as the catch-all entry. Such an entry will match any key not
previously matched. For instance, if the following entry appeared in the
indirect map for \fB/config\fR:
.sp
.in +2
.nf
*         &\|:\|/export/config/&
.fi
.in -2
.sp

.sp
.LP
this would allow automatic mounts in \fB/config\fR of any remote file
system whose location could be specified as:
.sp
.in +2
.nf
hostname\|:\|/export/config/hostname
.fi
.in -2
.sp

.sp
.LP
Note that the wildcard key does not work in conjunction with the
\fB-browse\fR option.
.SS "Variable Substitution"
.sp
.LP
Client specific variables can be used within an
.B automount
map. For
instance, if
.B $HOST
appeared within a map,
.B automount
would expand
it to its current value for the client's host name. Supported variables
are:
.sp

.sp
.TS
tab();
lw(1.07i) lw(2.6i) lw(1.83i)
lw(1.07i) lw(2.6i) lw(1.83i)
.
\fBARCH\fRThe output of \fBarch\fRT{
The architecture name. For example, \fBsun4\fR on a sun4u machine.
T}
\fBCPU\fRThe output of \fBuname\fR \fB-p\fRThe processor type.
For example, "sparc"
\fBHOST\fRThe output of \fBuname\fR \fB-n\fRThe host name.
For example, \fBmyhost\fR.
\fBKARCH\fRThe output of \fBarch -k\fR or \fBuname -m\fRT{
The kernel architecture name or machine hardware name. For example, \fBsun4u\fR.
T}

\fBOSNAME\fRThe output of \fBuname\fR \fB-s\fRThe OS name.
For example, "SunOS"
\fBOSREL\fRThe output of \fBuname\fR \fB-r\fRThe OS release name.
For example "5.3"
\fBOSVERS\fRThe output of \fBuname\fR \fB-v\fRThe OS version.
For example, "beta1.0"
\fBNATISA\fRThe output of \fBisainfo\fR \fB-n\fRT{
The native instruction set architecture for the system.
T}
For example, "sparcv9"
\fBPLATFORM\fRThe output of \fBuname -i\fRT{
The platform name. For example,  \fBSUNW,Sun-Fire-V240\fR.
T}

.TE

.sp
.LP
If a reference needs to be protected from affixed characters, you can
surround the variable name with curly braces (\fB\|{\|}\|\fR).
.SS "Multiple Mounts"
.sp
.LP
A multiple mount entry takes the form:
.sp
.in +2
.nf
key [\fI-mount-options\fR] [\|[\fImountpoint\fR] [\fI-mount-options\fR] \fIlocation\fR.\|.\|.\|]\|.\|.\|.
.fi
.in -2
.sp

.sp
.LP
The initial \fB/\fR[\fImountpoint\fR\|] is optional for the first mount and
mandatory for all subsequent mounts. The optional
.I mountpoint
is taken
as a pathname relative to the directory named by
.BR key .
If
\fImountpoint\fR is omitted in the first occurrence, a \fImountpoint\fR of
\fB/\fR (root) is implied.
.sp
.LP
Given an entry in the indirect map for
.BR /src
.sp
.in +2
.nf
beta     -ro\e
  /           svr1,svr2:/export/src/beta  \e
  /1.0        svr1,svr2:/export/src/beta/1.0  \e
  /1.0/man    svr1,svr2:/export/src/beta/1.0/man
.fi
.in -2
.sp

.sp
.LP
All offsets must exist on the server under
.BR beta .
\fBautomount\fR will
automatically mount
.BR /src/beta ,
.BR /src/beta/1.0 ,
and
.BR /src/beta/1.0/man ,
as needed, from either
.B svr1
or
.BR svr2 ,
whichever host is nearest and responds first.
.SS "Other File System Types"
.sp
.LP
The automounter assumes
.B NFS
mounts as a default file system type.
Other file system types can be described using the \fBfstype\fR mount
option. Other mount options specific to this file system type can be
combined with the \fBfstype\fR option. The location field must contain
information specific to the file system type. If the location field begins
with a slash, a colon character must be prepended, for instance, to mount a
CD file system:
.sp
.in +2
.nf
\fBcdrom -fstype=hsfs,ro   :\|/dev/sr0\fR
.fi
.in -2
.sp

.sp
.LP
or to perform an \fBautofs\fR mount:
.sp
.in +2
.nf
\fBsrc\fR \fB-fstype\fB=autofs    auto_src\fR
.fi
.in -2
.sp

.sp
.LP
Use this procedure only if you are not using Volume Manager.
.sp
.LP
Mounts using CacheFS are most useful when applied to an entire map as map
defaults. The following entry in the master map describes cached home
directory mounts. It assumes the default location of the cache directory,
.BR /cache .
.sp
.in +2
.nf
\fB/home auto_home\fR \fB-fstype\fR \fB=cachefs,backfstype=nfs\fR
.fi
.in -2
.sp

.sp
.LP
See the 
.B NOTES
section for information on option inheritance.
.SS "Indirect Maps"
.sp
.LP
An indirect map allows you to specify mappings for the subdirectories you
wish to mount under the
.B directory
indicated on the command line. In an
indirect map, each
.B key
consists of a simple name that refers to one or
more file systems that are to be mounted as needed.
.SS "Direct Maps"
.sp
.LP
Entries in a direct map are associated directly with \fBautofs\fR mount
points. Each
.I key
is the full pathname of an \fBautofs\fR mount point.
The direct map as a whole is not associated with any single directory.
.sp
.LP
Direct maps are distinguished from indirect maps by the
.B /-
key. For
example:
.sp
.in +2
.nf
# Master map for automounter
#
+auto_master
/net            -hosts          -nosuid,nobrowse
/home           auto_home       -nobrowse
/-              auto_direct
.fi
.in -2
.sp

.SS "Included Maps"
.sp
.LP
The contents of another map can be included within a map with an entry of
the form
.sp
.in +2
.nf
+\fImapname\fR
.fi
.in -2
.sp

.sp
.LP
If
.I mapname
begins with a slash, it is assumed to be the pathname of a
local file. Otherwise, the location of the map is determined by the policy
of the name service switch according to the entry for the automounter in
\fB/etc/nsswitch.conf\fR, such as
.sp
.in +2
.nf
automount: files nis
.fi
.in -2
.sp

.sp
.LP
If the name service is
.BR files ,
then the name is assumed to be that of
a local file in
.BR /etc .
If the key being searched for is not found in
the included map, the search continues with the next entry.
.SS "Special Maps"
.sp
.LP
There are two special maps available:
.B -hosts
and
.BR -null .
The
\fB-hosts\fR map is used with the \fB/net\fR directory and assumes that the
map key is the hostname of an
.B NFS
server. The
.B automountd
daemon
dynamically constructs a map entry from the server's list of exported file
systems. References to a directory under
.B /net/hermes
will refer to the
corresponding directory relative to
.B hermes
root.
.sp
.LP
The
.B -null
map cancels a previous map for the directory indicated.
This is most useful in the
.B /etc/auto_master
for cancelling entries
that would otherwise be inherited from the
.B +auto_master
include entry.
To be effective, the
.B -null
entries must be inserted before the
included map entry.
.SS "Executable Maps"
.sp
.LP
Local maps that have the execute bit set in their file permissions will be
executed by the automounter and provided with a key to be looked up as an
argument. The executable map is expected to return the content of an
automounter map entry on its stdout or no output if the entry cannot be
determined. A direct map cannot be made executable.
.SS "Configuration and the auto_master Map"
.sp
.LP
When initiated without arguments,
.B automount
consults the master map
for a list of \fBautofs\fR mount points and their maps. It mounts any
\fBautofs\fR mounts that are not already mounted, and unmounts \fBautofs\fR
mounts that have been removed from the master map or direct map.
.sp
.LP
The master map is assumed to be called
.B auto_master
and its location
is determined by the name service switch policy. Normally the master map is
located initially as a local file
.BR /etc/auto_master .
.SS "Browsing"
.sp
.LP
The
.B automount
daemon supports browsability of indirect maps. This
allows all of the potential mount points to be visible, whether or not they
are mounted. The
.B -nobrowse
option can be added to any indirect
\fBautofs\fR map to disable browsing. For example:
.sp
.in +2
.nf
/net     -hosts      -nosuid,nobrowse
/home    auto_home
.fi
.in -2
.sp

.sp
.LP
In this case, any
.I hostnames
would only be visible in
.B /net
after
they are mounted, but all potential mount points would be visible under
.BR /home .
The
.B -browse
option enables browsability of \fBautofs\fR
file systems. This is the default for all indirect maps.
.sp
.LP
The
.B -browse
option does not work in conjunction with the wildcard
key.
.SS "Restricting Mount Maps"
.sp
.LP
Options specified for a map are used as the default options for all the
entries in that map. They are ignored when map entries specify their own
mount options.
.sp
.LP
In some cases, however, it is desirable to force \fBnosuid\fR,
.BR nodevices ,
.BR nosetuid ,
or
.B noexec
for a complete mount map
and its submounts. This can be done by specifying the additional mount
option, \fB-restrict\fR.
.sp
.in +2
.nf
 /home     auto_home       -restrict,nosuid,hard
.fi
.in -2
.sp

.sp
.LP
The
.B -restrict
option forces the inheritance of all the restrictive
options
.BR nosuid ,
.BR nodevices ,
.BR nosetuid ,
and
.B noexec
as
well as the restrict option itself. In this particular example, the
\fBnosuid\fR and \fBrestrict\fR option are inherited but the \fBhard\fR
option is not. The
.B restrict
option also prevents the execution of
"executable maps" and is enforced for auto mounts established by programs
with fewer than all privileges available in their zone.
.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 5n
.rt
Successful completion.
.RE

.sp
.ne 2
.mk
.na
.B 1
.ad
.RS 5n
.rt
An error occurred.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/auto_master
.ad
.RS 23n
.rt
Master automount map.
.RE

.sp
.ne 2
.mk
.na
.B /etc/auto_home
.ad
.RS 23n
.rt
Map to support automounted home directories.
.RE

.sp
.ne 2
.mk
.na
\fB/etc/default/autofs\fR
.ad
.RS 23n
.rt
Supplies default values for parameters for
.B automount
and
.BR automountd .
See \fBautofs\fR(4).
.RE

.sp
.ne 2
.mk
.na
\fB/etc/nsswitch.conf\fR
.ad
.RS 23n
.rt
Name service switch configuration file. See \fBnsswitch.conf\fR(4).
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.sp
.LP
\fBisainfo\fR(1), \fBls\fR(1),
.BR svcs (1),
.BR uname (1),
.BR automountd (1M),
.BR mount (1M),
\fBmount_cachefs\fR( 1M),
\fBmount_nfs\fR(1M), \fBsvcadm\fR(1M),
.BR autofs (4),
.BR attributes (5),
\fBnfssec\fR(5), \fBsmf\fR(5)
.sp
.LP
\fR
.SH NOTES
.sp
.LP
\fBautofs\fR mount points must not be hierarchically related.
\fBautomount\fR does not allow an \fBautofs\fR mount point to be created
within another \fBautofs\fR mount.
.sp
.LP
Since each direct map entry results in a new \fBautofs\fR mount such maps
should be kept short.
.sp
.LP
Entries in both direct and indirect maps can be modified at any time. The
new information is used when
.B automountd
next uses the map entry to do
a mount.
.sp
.LP
New entries added to a master map or direct map will not be useful until
the automount command is run to install them as new \fBautofs\fR mount
points. New entries added to an indirect map may be used immediately.
.sp
.LP
As of the Solaris 2.6 release, a listing (see
.BR ls (1))
of the
\fBautofs\fR directory associated with an indirect map shows all potential
mountable entries. The attributes associated with the potential mountable
entries are temporary. The real file system attributes will only be shown
once the file system has been mounted.
.sp
.LP
Default mount options can be assigned to an entire map when specified as an
optional third field in the master map. These options apply only to map
entries that have no mount options. Note that map entities with options
override the default options, as at this time, the options do not
concatenate. The concatenation feature is planned for a future release.
.sp
.LP
When operating on a map that invokes an NFS mount, the default number of
retries for the automounter is 0, that is, a single mount attempt, with no
retries. Note that this is significantly different from the default (10000)
for the \fBmount_nfs\fR(1M) utility.
.sp
.LP
The Network Information Service (NIS) was formerly known as Sun Yellow
Pages (YP). The functionality of the two remains the same.
.sp
.LP
The
.B automount
service is managed by the service management facility,
\fBsmf\fR(5), under the service identifier:
.sp
.in +2
.nf
svc:/system/filesystem/autofs:default
.fi
.in -2
.sp

.sp
.LP
Administrative actions on this service, such as enabling, disabling, or
requesting restart, can be performed using
.BR svcadm (1M).
The service's
status can be queried using the
.BR svcs (1)
command.
