usr/src/man/man1m/automountd.1m
'\" te
.\" Copyright 1989 AT&T Copyright (c) 2004, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH automountd 1M "3 Mar 2005" "SunOS 5.11" "System Administration Commands"
.SH NAME
automountd \- autofs mount/unmount daemon
.SH SYNOPSIS
.LP
.nf
\fBautomountd\fR [\fB-Tvn\fR] [\fB-D\fR \fIname=value\fR]
.fi

.SH DESCRIPTION
.sp
.LP
.B automountd
is an
.B RPC
server that answers file system mount and
unmount requests from the
.B autofs
file system. It uses local files or
name service maps to locate file systems to be mounted. These maps are
described with the
.BR automount "(1M) command."
.sp
.LP
If
.B automount
finds any non-trivial entries in either the local or
distributed automount maps and if the daemon is not running already, the
.B automountd
daemon is automatically invoked by
.BR automount (1M).
.B automountd
enables the
.B svc:/network/nfs/nlockmgr
service
(\fBlockd\fR(1M)), and the \fBsvc:/network/nfs/status\fR service
(\fBstatd\fR(1M)), if NFS mounts need to be done.
.sp
.LP
At startup, the
.B automountd
daemon is invoked as is invoked as the
.B system/filesystem/autofs:default
service. See NOTES.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -D
.I name=value
.ad
.RS 17n
.rt
Assign
.I value
to the indicated
.B automount
map substitution
variable. These assignments cannot be used to substitute variables in the
master map
.BR auto_master .
.RE

.sp
.ne 2
.mk
.na
.B -n
.ad
.RS 17n
.rt
Turn off browsing for all
.B autofs
mount points. This option overrides
the
.B "-browse autofs"
map option on the local host.
.RE

.sp
.ne 2
.mk
.na
.B -T
.ad
.RS 17n
.rt
Trace. Expand each
.B RPC
call and display it on the standard output.
.RE

.sp
.ne 2
.mk
.na
.B -v
.ad
.RS 17n
.rt
Verbose. Log status messages to the console.
.RE

.SH USAGE
.sp
.LP
See
.BR largefile (5)
for the description of the behavior of
.B automountd
when encountering files greater than or equal to 2 Gbyte (
2^31 bytes).
.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/auto_master
.ad
.RS 23n
.rt
Master map for automounter.
.RE

.sp
.ne 2
.mk
.na
.B /etc/default/autofs
.ad
.RS 23n
.rt
Supplies default values for parameters for
.B automount
and
.BR automountd .
See
.BR autofs (4).
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.sp
.LP
.BR svcs (1),
.BR automount (1M),
.BR svcadm (1M),
.BR autofs (4),
.BR attributes (5),
.BR largefile (5),
.BR smf (5)
.SH NOTES
.sp
.LP
The
.B automountd
service is managed by the service management facility,
.BR smf (5),
under the service identifier:
.sp
.in +2
.nf
svc:/system/filesystem/autofs
.fi
.in -2
.sp

.sp
.LP
Administrative actions on this service, such as enabling, disabling, or
requesting restart, can be performed using
.BR svcadm (1M).
The service's
status can be queried using
.BR svcs (1).
If it is disabled, it is enabled
by
.BR automount "(1M) unless the"
.B application/auto_enable
property is
set to
.BR false .
