usr/src/man/man1m/cachefsd.1m
'\" te
.\" Copyright (c) 2000, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH cachefsd 1M "2 October 2000" "SunOS 5.11" "System Administration Commands"
.SH NAME
cachefsd \- CacheFS daemon
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/fs/cachefs/cachefsd\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B cachefsd
server implements features of the cache filesystem
(CacheFS). It is invoked at boot time and run if the
.B /
(root) and
.B /usr
filesystems are being cached. If
.B /usr
is being cached,
.B cachefsd
is invoked by \fBinetd\fR(1M) from
.BR inetd.conf (4).
At
run time,
.B cachefsd
is invoked by the
.B inetd
mechanism in response
to an RPC request from a user command such as \fBmount_cachefs\fR(1M).
.sp
.LP
The \fBcachefsd\fR server supports the "disconnected mode" of CacheFS. In
this mode, a user can continue to read and, depending on the option
selected, write to files in a cached filesystem when the NFS server for the
cached files is not available.
.sp
.LP
The
.B cachefsd
daemon performs the following functions in support of
the CacheFS:
.RS +4
.TP
.ie t \(bu
.el o
Implements the connection policy. The daemon determines whether the NFS
server backing the cache is connected or disconnected from the cache, or is
in transition from the connected or disconnected states.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Implements "log rolling," wherein the daemon monitors a disconnected NFS
server for reconnection. After such a server returns to a connected state,
.B cachefsd
rolls any local changes to cached files (kept in a log) back
to the server.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Manages "packing," wherein \fBcachefsd\fR makes a best effort to ensure
that files in a user-specified list are available in the cache in
disconnected mode.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Supports user interfaces by supplying statistics, reporting conflicts
between the cache and the back filesystem, and supporting a list of files
for packing.
.RE
.sp
.LP
The running of
.B cachefsd
is required for the disconnected mode of
CacheFS.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -r
.ad
.RS 6n
.rt
Used for invoking \fBcachefsd\fR for the \fB/\fR filesystem.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.sp
.LP
.BR cachefspack (1M),
.BR cfsadmin (1M),
.BR mount_cachefs (1M),
.BR inetd.conf (4),
.BR attributes (5)
.sp
.LP
\fR
