usr/src/man/man1m/cachefslog.1m
'\" te
.\" Copyright (c) 1997, Sun Microsystems, Inc.  All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH cachefslog 1M "7 Feb 1997" "SunOS 5.11" "System Administration Commands"
.SH NAME
cachefslog \- Cache File System logging
.SH SYNOPSIS
.LP
.nf
\fBcachefslog\fR [\fB-f\fR \fIlogfile\fR | \fB-h\fR] \fIcachefs_mount_point\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B cachefslog
command displays where CacheFS statistics are being
logged. Optionally, it sets where CacheFS statistics are being logged, or it
halts logging for a cache specified by
.IR cachefs_mount_point .
The
.I cachefs_mount_point
argument is a mount point of a cache file system.
All file systems cached under the same cache as
.I cachefs_mount_point
will be logged.
.SH OPTIONS
.sp
.LP
The following options are supported. You must be super-user to use the
.B -f
and
.B -h
options.
.sp
.ne 2
.mk
.na
.B -f
.I logfile
.ad
.RS 14n
.rt
Specify the log file to be used.
.RE

.sp
.ne 2
.mk
.na
.B -h
.ad
.RS 14n
.rt
Halt logging.
.RE

.SH OPERANDS
.sp
.ne 2
.mk
.na
.I cachefs_mount_point
.ad
.RS 23n
.rt
A mount point of a cache file system.
.RE

.SH USAGE
.sp
.LP
See
.BR largefile (5)
for the description of the behavior of
.B cachefslog
when encountering files greater than or equal to 2 Gbyte (
2^31 bytes).
.SH EXAMPLES
.LP
.B Example 1
Checking the Logging of a directory.
.sp
.LP
The example below checks if the directory
.B /home/sam
is being
logged:

.sp
.in +2
.nf
example% cachefslog /home/sam
not logged: /home/sam\fR
.fi
.in -2
.sp

.LP
.B Example 2
Changing the
.IR logfile .
.sp
.LP
The example below changes the
.I logfile
of
.B /home/sam
to
.BR /var/tmp/samlog :

.sp
.in +2
.nf
example# cachefslog -f /var/tmp/samlog /home/sam
/var/tmp/samlog: /home/sam \fR
.fi
.in -2
.sp

.LP
.B Example 3
Verifying the change of a
.IR logfile .
.sp
.LP
The example below verifies the change of the previous example:

.sp
.in +2
.nf
example% cachefslog /home/sam
/var/tmp/samlog: /home/sam \fR
.fi
.in -2
.sp

.LP
.B Example 4
Halting the logging of a directory.
.sp
.LP
The example below halts logging for the
.B /home/sam
directory:

.sp
.in +2
.nf
example# cachefslog -h /home/sam
not logged: /home/sam\fR
.fi
.in -2
.sp

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 12n
.rt
success
.RE

.sp
.ne 2
.mk
.na
.B non-zero
.ad
.RS 12n
.rt
an error has occurred.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.sp
.LP
.BR cachefsstat (1M),
.BR cachefswssize (1M),
.BR cfsadmin (1M),
.BR attributes (5),
.BR largefile (5)
.SH DIAGNOSTICS
.sp
.ne 2
.mk
.na
.B Invalid path
.ad
.RS 16n
.rt
It is illegal to specify a path within a cache file system.
.RE

