usr/src/man/man1m/cachefspack.1m
'\" te
.\" Copyright (c) 2004, Sun Microsystems, Inc. All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH cachefspack 1M "18 Mar 2004" "SunOS 5.11" "System Administration Commands"
.SH NAME
cachefspack \- pack files and file systems in the cache
.SH SYNOPSIS
.LP
.nf
\fBcachefspack\fR [\fB-h\fR] [\fB-i\fR | \fB-p\fR | \fB-u\fR] [\fB-f\fR \fIpacking-list\fR]
     [\fB-U\fR \fIcache-directory\fR] [\fIfile\fR]...
.fi

.SH DESCRIPTION
.sp
.LP
The \fBcachefspack\fR utility is used to set up and maintain files in the
cache. This utility affords greater control over the cache, ensuring that
the specified files are in the cache whenever possible.
.sp
.LP
\fBcachefspack\fR does not pack files when the backfileystem type for the
\fBcachefs\fR mount is NFSv4. This is because only pass-through support is
available for \fBcachefs\fR with NFSv4.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB-f\fB \fIpacking-list\fR
.ad
.RS 22n
.rt
Specify a file containing a list of files and directories to be packed.
Options within subdirectories and files can also be specified. The format
and rules governing
.I packing-list
are described on the
.BR packingrules (4)
manual page. Directories are packed recursively.
Symlinks that match a regular expression on a
.B LIST
command are
followed. Symlinks encountered while recursively processing directories are
not followed.
.RE

.sp
.ne 2
.mk
.na
.B -h
.ad
.RS 22n
.rt
Help. Print a brief summary of all the options.
.RE

.sp
.ne 2
.mk
.na
.B -i
.ad
.RS 22n
.rt
View information about the packed files.
.RE

.sp
.ne 2
.mk
.na
.B -p
.ad
.RS 22n
.rt
Pack the file or files specified by
.BR file .
This is the default
behavior.
.RE

.sp
.ne 2
.mk
.na
.B -u
.ad
.RS 22n
.rt
Unpack the file or files specified by
.BR file .
.RE

.sp
.ne 2
.mk
.na
.BI "-U " cache-directory
.ad
.RS 22n
.rt
Unpack all files in the specified cache directory.
.RE

.SH OPERANDS
.sp
.LP
The following operands are supported:
.sp
.ne 2
.mk
.na
\fBfile\fR
.ad
.RS 8n
.rt
A path name of a file to be packed or unpacked.
.RE

.SH USAGE
.sp
.LP
See
.BR largefile (5)
for the description of the behavior of
\fBcachefspack\fR when encountering files greater than or equal to 2 Gbyte (
2^31 bytes).
.SH EXAMPLES
.LP
\fBExample 1\fR Packing a File in the Cache
.sp
.LP
The following example packs the file
.B projects
in the cache:

.sp
.in +2
.nf
% cachefspack \fB-p\fR projects
.fi
.in -2
.sp

.LP
\fBExample 2\fR Packint Files in the Cache
.sp
.LP
The following example packs the files
.BR projects ,
.BR updates ,
and
\fBmaster_plan\fR in the cache:

.sp
.in +2
.nf
% cachefspack \fB-p\fR projects updates master_plan
.fi
.in -2
.sp

.LP
\fBExample 3\fR Unpacking a File From the Cache
.sp
.LP
The following example unpacks the file
.B projects
from the cache:

.sp
.in +2
.nf
% cachefspack \fB-u\fR projects
.fi
.in -2
.sp

.LP
\fBExample 4\fR Unpacking Files From the Cache
.sp
.LP
The following example unpacks the files
.BR projects ,
.BR updates ,
and
\fBmaster_plan\fR from the cache:

.sp
.in +2
.nf
% cachefspack \fB-u\fR projects updates master_plan
.fi
.in -2
.sp

.LP
\fBExample 5\fR Unpacking All Files From in a Cache Directory
.sp
.LP
The following example unpacks all files in the cache directory
.BR cache1 :

.sp
.in +2
.nf
% cachefspack \fB-U\fR /cache/cache1
.fi
.in -2
.sp

.LP
\fBExample 6\fR Using a Packing List
.sp
.LP
The following example illustrates the use of a packing list to specify
files to be packed in the cache.

.sp
.LP
The contents of
.B lists.pkg
are as follows:

.sp
.in +2
.nf
IGNORE SCCS BASE /src/junk LIST *.c LIST *.h
.fi
.in -2
.sp

.sp
.LP
The following command packs all files in the
.B /src/junk
directory
which have \fB\&.c\fR and \fB\&.h\fR extensions, and do contain the string
SCCS in the file's path name:

.sp
.in +2
.nf
% cachefspack \fB-f\fR lists.pkg
.fi
.in -2
.sp

.SH EXIT STATUS
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 6n
.rt
Successful completion.
.RE

.sp
.ne 2
.mk
.na
.B >0
.ad
.RS 6n
.rt
An error occurred.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.sp
.LP
\fBcfsadmin\fR(1M), \fBmount_cachefs\fR(1M),
.BR packingrules (4),
.BR attributes (5),
.BR largefile (5)
