usr/src/man/man1m/cachefswssize.1m
'\" te
.\" Copyright (c) 1996, Sun Microsystems, Inc.  All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH cachefswssize 1M "16 Sep 1996" "SunOS 5.11" "System Administration Commands"
.SH NAME
cachefswssize \- determine working set size for cachefs
.SH SYNOPSIS
.LP
.nf
\fBcachefswssize\fR \fIlogfile\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B cachefswssize
command displays the workspace size determined from
.IR logfile .
This includes the amount of cache space needed for each
filesystem that was mounted under the cache, as well as a total.
.SH USAGE
.sp
.LP
See
.BR largefile (5)
for the description of the behavior of
.B cachefswssize
when encountering files greater than or equal to 2 Gbyte
( 2^31 bytes).
.SH EXAMPLES
.LP
.B Example 1
A sample output of \fBcachefswssize\fR.
.sp
.LP
.B example% cachefswssize /var/tmp/samlog

.sp

.sp
.TS
tab();
lw(1.83i) lw(1.83i) lw(1.83i)
lw(1.83i) lw(1.83i) lw(1.83i)
.
\fB/home/sam\fR
\fBend size:\fR\fB10688k\fR
\fBhigh water size:\fR\fB10704k\fR

\fB/foo\fR
\fBend size:\fR\fB128k\fR
\fBhigh water size:\fR\fB128k\fR

\fB/usr/dist\fR
\fBend size:\fR\fB1472k\fR
\fBhigh water size:\fR\fB1472k\fR

\fBtotal for cache\fR
\fBinitial size:\fR\fB110960k\fR
\fBend size:\fR\fB12288k\fR
\fBhigh water size:\fR\fB12304k\fR
.TE

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 12n
.rt
success
.RE

.sp
.ne 2
.mk
.na
.B non-zero
.ad
.RS 12n
.rt
an error has occurred.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.sp
.LP
.BR cachefslog (1M),
.BR cachefsstat (1M),
.BR cfsadmin (1M),
.BR attributes (5),
.BR largefile (5)
.SH DIAGNOSTICS
.sp
.ne 2
.mk
.na
.B "problems were encountered writing log file
.ad
.sp .6
.RS 4n
There were problems encountered when the kernel was writing the logfile.
The most common problem is running out of disk space.
.RE

.sp
.ne 2
.mk
.na
.B invalid log
.B file
.ad
.sp .6
.RS 4n
The logfile is not a valid logfile or was created with a newer version of
Solaris than the one where
.B cachefswssize
is running.
.RE

