usr/src/man/man1m/cachefsstat.1m
'\" te
.\" Copyright (c) 2003, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH cachefsstat 1M "9 Oct 2003" "SunOS 5.11" "System Administration Commands"
.SH NAME
cachefsstat \- Cache File System statistics
.SH SYNOPSIS
.LP
.nf
\fB/usr/bin/cachefsstat\fR [\fB-z\fR] [\fIpath\fR]...
.fi

.SH DESCRIPTION
.sp
.LP
The
.B cachefsstat
command displays statistical information about the
cache file system mounted on
.IR path .
The statistical information
includes cache hits and misses, consistency checking, and modification
operations. If
.I path
is not specified, all mounted cache file systems
are used.
.sp
.LP
.B cachefsstat
can also be used to reinitialize this information (see
.B -z
option).
.sp
.LP
The statistical information has the following format:
.sp
.in +2
.nf
<\fIcache hit rate\fR>
<\fIconsistency checks\fR>
<\fImodifies\fR>
.fi
.in -2
.sp

.sp
.LP
where:
.sp
.ne 2
.mk
.na
.I hit rate
.ad
.RS 22n
.rt
The percentage of cache hits over the total number of attempts, followed by
the actual numbers of hits and misses.
.RE

.sp
.ne 2
.mk
.na
.I consistency checks
.ad
.RS 22n
.rt
The number of consistency checks performed, followed by the number that
passed, and the number that failed.
.RE

.sp
.ne 2
.mk
.na
.I modifies
.ad
.RS 22n
.rt
The number of modify operations, including writes, creates, etc.
.RE

.SH OPTIONS
.sp
.LP
The following option is supported:
.sp
.ne 2
.mk
.na
.B -z
.ad
.RS 6n
.rt
Zero (reinitialize) statistics. Execute
.B "cachefsstat -z"
before
executing
.B cachefsstat
again to gather statistics on the cache
performance. This option can only be use by the superuser. The statistics
printed reflect those just before the statistics are reinitialized.
.RE

.SH USAGE
.sp
.LP
See
.BR largefile (5)
for the description of the behavior of
.B cachefsstat
when encountering files greater than or equal to 2 Gbyte
(2^31 bytes).
.SH EXAMPLES
.LP
.B Example 1
Using \fBcachefsstat\fR
.sp
.LP
The following example shows the
.B cachefsstat
command run on file
system
.BR /test :

.sp
.in +2
.nf
example# cachefsstat /test
  /test
       cache hit rate:      100% (0 hits, 0 misses)
       consistency checks:    0  (0 pass, 0 fail)
       modifies:              0
garbage collection:           0
.fi
.in -2
.sp

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 12n
.rt
Successful completion.
.RE

.sp
.ne 2
.mk
.na
.B non-zero
.ad
.RS 12n
.rt
An error occurred.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.sp
.LP
.BR cachefslog (1M),
.BR cachefswssize (1M),
.BR cfsadmin (1M),
.BR attributes (5),
.BR largefile (5)
