usr/src/man/man1m/captoinfo.1m
'\" te
.\" Copyright (c) 1996, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright 1989 AT&T
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH captoinfo 1M "18 May 1993" "SunOS 5.11" "System Administration Commands"
.SH NAME
captoinfo \- convert a termcap description into a terminfo description
.SH SYNOPSIS
.LP
.nf
\fBcaptoinfo\fR [\fB-1\fR] [\fB-v\fR].\|.\|. [\fB-V\fR] [\fB-w\fR \fIwidth\fR] \fIfilename\fR.\|.\|.
.fi

.SH DESCRIPTION
.sp
.LP
.B captoinfo
looks in
.I filename
for
.B termcap
descriptions.
For each one found, an equivalent
.B terminfo
description is written to
standard output, along with any comments found. A description which is
expressed as relative to another description (as specified in the
.BR "termcap tc = field" )
is reduced to the minimum superset before
being displayed.
.sp
.LP
If no
.I filename
is given, then the environment variable
.B TERMCAP
is used for the filename or entry. If
.B TERMCAP
is a full pathname to a file,  only the terminal
whose name is specified in the environment variable
.B TERM
is extracted
from that file. If the environment variable
.B TERMCAP
is
not set, then the file
.B /usr/share/lib/termcap
is read.
.SH OPTIONS
.sp
.ne 2
.mk
.na
\fB\(mi1\fR
.ad
.RS 12n
.rt
Display the fields one to a line. Otherwise, the fields are printed several
to a line, with a maximum width of 60 characters.
.RE

.sp
.ne 2
.mk
.na
.B -v
.ad
.RS 12n
.rt
Display tracing information on the standard error as the program runs.
Specifying additional
.B -v
options displays more detailed information.
.RE

.sp
.ne 2
.mk
.na
.B -V
.ad
.RS 12n
.rt
Display the version of the program in use on the standard error and then
exit.
.RE

.sp
.ne 2
.mk
.na
.BI -w " width"
.ad
.RS 12n
.rt
Change the output to
.I width
characters.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B /usr/share/lib/terminfo/?/*
.ad
.sp .6
.RS 4n
compiled terminal description database
.RE

.sp
.ne 2
.mk
.na
.B /usr/share/lib/termcap
.ad
.sp .6
.RS 4n

.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.sp
.LP
.BR infocmp (1M),
.BR curses (3CURSES),
.BR terminfo (4),
.BR attributes (5)
.SH NOTES
.sp
.LP
.B captoinfo
should be used to convert
.B termcap
entries to
.B terminfo
entries because the
.B termcap
database may not be
supplied in future releases.
