usr/src/man/man1m/catman.1m
'\" te
.\" Copyright (c) 1998 Sun Microsystems, Inc.  All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH catman 1M "27 Feb 1998" "SunOS 5.11" "System Administration Commands"
.SH NAME
catman \- create the formatted files for the reference manual
.SH SYNOPSIS
.LP
.nf
\fB/usr/bin/catman\fR [\fB-c\fR] [\fB-n\fR] [\fB-p\fR] [\fB-t\fR] [\fB-w\fR] [\fB-M\fR \fIdirectory\fR]
     [\fB-T\fR \fImacro-package\fR] [\fIsections\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The
.B catman
utility creates the preformatted versions of the on-line
manual from the
.BR nroff (1)
or
.BR sgml (5)
input files. This feature
allows easy distribution of the preformatted manual pages among a group of
associated machines (for example, with
.BR rdist (1)),
since it makes the
directories of preformatted manual pages self-contained and independent of
the unformatted entries.
.sp
.LP
.B catman
also creates the
.B windex
database file in the
directories specified by the
.B MANPATH
or the
.B -M
option. The
.B windex
database file is a three column list consisting of a keyword,
the reference page that the keyword points to, and a line of text that
describes the purpose of the utility or interface  documented on the
reference page. Each keyword is taken from the comma separated list of words
on the
.B NAME
line before the `\(mi' (dash). The reference page that the
keyword points to is the first word on the
.B NAME
line. The text after
the \(mi on the
.B NAME
line is the descriptive text in the third column.
The
.B NAME
line must be immediately preceded by the page heading line
created by the \fB\&.TH\fR macro (see \fBNOTES\fR for required format).
.sp
.LP
Each manual page is examined and those whose preformatted versions are
missing or out of date are recreated. If any changes are made, \fBcatman\fR
recreates the
.B windex
database.
.sp
.LP
If a manual page is a
.I shadow
page, that is, it sources another manual
page for its contents, a symbolic link is made in the \fBcat\fIx\fR or
\fBfmt\fIx\fR directory to the appropriate preformatted manual page.
.sp
.LP
Shadow files in an unformatted nroff source file are identified by the
first line being of the form \fB\&.so
man\fIx\fB/yyy.\fIx\fB\&.\fR
.sp
.LP
Shadow files in the
.B SGML
sources are identified by the string
.BR SHADOW_PAGE .
The file entity declared in the shadow file identifies
the file to be sourced.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -c
.ad
.RS 20n
.rt
Create unformatted nroff source files in the appropriate
.BR man
subdirectories from the
.B SGML
sources. This option will overwrite any
existing file in the
.B man
directory of the same name as the
.BR SGML
file.
.RE

.sp
.ne 2
.mk
.na
.B -n
.ad
.RS 20n
.rt
Do not create (or recreate) the
.B windex
database. If the \fB-n\fR
option is specified, the
.B windex
database is not created and the
.BR apropos ,
.BR whatis ,
.BR "man -f" ,
and
.BR "man -k"
commands will fail.
.RE

.sp
.ne 2
.mk
.na
.B -p
.ad
.RS 20n
.rt
Print what would be done instead of doing it.
.RE

.sp
.ne 2
.mk
.na
.B -t
.ad
.RS 20n
.rt
Create \fBtroff\fRed entries in the appropriate \fBfmt\fR subdirectories
instead of \fBnroff\fRing into the
.B cat
subdirectories.
.RE

.sp
.ne 2
.mk
.na
.B -w
.ad
.RS 20n
.rt
Only create the
.B windex
database that is used by
.BR whatis (1)
and
the
.BR man (1)
.B -f
and
.B -k
options.  No manual reformatting is
done.
.RE

.sp
.ne 2
.mk
.na
.BI -M " directory"
.ad
.RS 20n
.rt
Update manual pages located in the specified
.IR directory ,
(\fB/usr/share/man\fR by default). If the  \fB-M\fR option is specified, the
directory argument must not contain a `,' (comma), since a comma is used to
delineate section numbers. See
.BR man (1).
.RE

.sp
.ne 2
.mk
.na
.BI -T " macro-package"
.ad
.RS 20n
.rt
Use
.I macro-package
in place of the standard manual page macros, (
.BR man (5)
by default).
.RE

.SH OPERANDS
.sp
.LP
The following operand is supported:
.sp
.ne 2
.mk
.na
.I sections
.ad
.RS 12n
.rt
If there is one parameter not starting with a `\fB\(mi\fR\&', it is taken
to be a space separated list of manual sections to be processed by
.BR catman .
If this operand is specified, only the manual sections in the
list will be processed.  For example,
.sp
.in +2
.nf
\fBcatman 1 2 3\fR
.fi
.in -2
.sp

only updates manual sections
.BR 1 ,
.BR 2 ,
and
.BR 3 .
If specific
sections are not listed, all sections in the
.B man
directory specified
by the environment variable
.B MANPATH
are processed.
.RE

.SH ENVIRONMENT VARIABLES
.sp
.ne 2
.mk
.na
.B TROFF
.ad
.RS 11n
.rt
The name of the formatter to use when the
.B -t
flag is given. If not
set,
.BR troff (1)
is used.
.RE

.sp
.ne 2
.mk
.na
.B MANPATH
.ad
.RS 11n
.rt
A colon-separated list of directories that are processed by \fBcatman\fR
and
.BR man (1).
Each directory can be followed by a comma-separated list
of sections. If set, its value overrides
.B /usr/share/man
as the default
directory search path, and the
.B man.cf
file as the default section
search path. The
.B -M
and
.B -s
flags, in turn, override these
values.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B /usr/share/man
.ad
.RS 28n
.rt
default manual directory location
.RE

.sp
.ne 2
.mk
.na
.B /usr/share/man/man*/*.*
.ad
.RS 28n
.rt
raw nroff input files
.RE

.sp
.ne 2
.mk
.na
.B /usr/share/man/sman*/*.*
.ad
.RS 28n
.rt
raw
.B SGML
input files
.RE

.sp
.ne 2
.mk
.na
.B /usr/share/man/cat*/*.*
.ad
.RS 28n
.rt
preformatted \fBnroff\fRed manual pages
.RE

.sp
.ne 2
.mk
.na
.B /usr/share/man/fmt*/*.*
.ad
.RS 28n
.rt
preformatted \fBtroff\fRed manual pages
.RE

.sp
.ne 2
.mk
.na
.B /usr/share/man/windex
.ad
.RS 28n
.rt
table of contents and keyword database
.RE

.sp
.ne 2
.mk
.na
.B /usr/lib/makewhatis
.ad
.RS 28n
.rt
command script to make
.B windex
database
.RE

.sp
.ne 2
.mk
.na
.B /usr/share/lib/tmac/an
.ad
.RS 28n
.rt
default macro package
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWdoc
_
CSIEnabled
.TE

.SH SEE ALSO
.sp
.LP
.BR apropos (1),
.BR man (1),
.BR nroff (1),
.BR rdist (1),
.BR rm (1),
.BR troff (1),
.BR whatis (1),
.BR attributes (5),
.BR man (5),
.BR sgml (5)
.SH DIAGNOSTICS
.sp
.ne 2
.mk
.na
\fBman?/xxx.? (.so'ed from man?/yyy.?): No such file or
directory\fR
.ad
.sp .6
.RS 4n
The file outside the parentheses is missing, and is referred to by the file
inside them.
.RE

.sp
.ne 2
.mk
.na
.B "target of .so in man?/xxx.? must be relative to /usr/man
.ad
.sp .6
.RS 4n
.B catman
only allows references to filenames that are relative to the
directory
.BR /usr/man .
.RE

.sp
.ne 2
.mk
.na
.B opendir:man?: No
.B such file
.B or
.B directory
.ad
.sp .6
.RS 4n
A harmless warning message indicating that one of the directories
.B catman
normally looks for is missing.
.RE

.sp
.ne 2
.mk
.na
.B *.*: No
.B such file
.B or directory
.ad
.sp .6
.RS 4n
A harmless warning message indicating
.B catman
came across an empty
directory.
.RE

.SH WARNINGS
.sp
.LP
If a user, who has previously run
.B catman
to install the
.BR cat*
directories, upgrades the operating system, the entire
.B cat*
directory
structure should be removed prior to running
.BR catman .
See
.BR rm (1).
.sp
.LP
Do not re-run
.B catman
to re-build the
.B whatis
database unless the
complete set of
.B man*
directories is present.
.B catman
builds this
.B windex
file based on the
.B man*
directories.
.SH NOTES
.sp
.LP
To generate a valid windex index file,
.B catman
has certain
requirements. Within the individual man page file,
.B catman
requires two
macro lines to have a specific format. These are the \fB\&.TH\fR page
heading line and the \fB\&.SH NAME\fR line.
.sp
.LP
The \fB\&.TH\fR macro requires at least the first three arguments, that is,
the filename, section number, and the date.  The \fB\&.TH\fR line starts off
with the \fB\&.TH\fR macro, followed by a space, the man page filename, a
single space, the section number, another single space, and the date. The
date should appear in double quotes and is specified as "day month year,"
with the month always abbreviated to the first three letters (Jan, Feb, Mar,
and so forth).
.sp
.LP
The \fB\&.SH NAME\fR macro, also known as the
.B NAME
line, must
immediately follow the \fB\&.TH\fR line, with nothing in between those
lines. No font changes are permitted in the
.B NAME
line. The \fBNAME
\fRline is immediately followed by a line containing the man page filename;
then shadow page names, if applicable, separated by commas; a dash; and a
brief summary statement. These elements should all be on one line; no
carriage returns are permitted.
.sp
.LP
An example of proper coding of these lines is:
.sp
.in +2
.nf
\&.TH nismatch 1M "10 Apr 1998"
\&.SH NAME
nismatch, nisgrep \e- utilities for searching NIS+ tables
.fi
.in -2

