usr/src/man/man1m/cfgadm_sysctrl.1m
'\" te
.\" Copyright (c) 1999 Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH cfgadm_sysctrl 1M "10 Mar 1999" "SunOS 5.11" "System Administration Commands"
.SH NAME
cfgadm_sysctrl \- EXX00 system board administration
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/cfgadm\fR \fB-c\fR \fIfunction\fR [\fB-f\fR]
     [\fB-o\fR disable-at-boot | enable-at-boot] [\fB-n\fR | \fB-y\fR] sysctrl0:slot# ...
.fi

.LP
.nf
\fB/usr/sbin/cfgadm\fR \fB-x\fR quiesce-test sysctrl0:slot#
.fi

.LP
.nf
\fB/usr/sbin/cfgadm\fR \fB-x\fR insert-test | remove-test sysctrl0:slot# ...
.fi

.LP
.nf
\fB/usr/sbin/cfgadm\fR \fB-x\fR set-condition-test=# sysctrl0:slot# ...
.fi

.LP
.nf
\fB/usr/sbin/cfgadm\fR [\fB-l\fR]
     \fB-o\fR disable-at-boot | enable-at-boot sysctrl0:slot# ...
.fi

.SH DESCRIPTION
.sp
.LP
The
.B sysctrl
hardware specific library
.B /usr/platform/sun4u/lib/cfgadm/sysctrl.so.1
provides dynamic
reconfiguration functionality for configuring and disconnecting system boards
on
.BR E6X00 ,
.BR E5X00 ,
.BR E4X00 ,
and
.B E3X00
systems. You can
insert both
.B I/O
and
.B CPU
boards into a slot on a running system
that is configured for Solaris without rebooting. You can also disconnect and
remove both types of boards from a running system without rebooting.
.sp
.LP
System slots appear as attachment points in the device tree, one attachment
point for each actual slot in the system chassis. If a board is not in a slot,
the receptacle state is
.BR empty .
If a board is powered-off and ready to
remove, the receptacle state is
.BR disconnected .
If a board is powered-on
and is connected to the system bus, the receptacle state is
.BR connected .
.sp
.LP
 The occupant state is
.BR unconfigured " when the receptacle state is "
.B empty
or
.BR disconnected .
The occupant state is either
.BR unconfigured " or "
.B configured
when the receptacle state is
.BR connected .
.sp
.LP
In the
.B configured
state the devices on a board are available for use by
Solaris. In the
.B unconfigured
state, the devices on the board are not.
.sp
.LP
Inserting a board changes the receptacle state from
.B empty
to
.BR disconnected .
Removing a board changes the receptacle state from
.B disconnected
to
.BR empty .
Removing a board that is in the
.B connected
state crashes the operating system and can result in permanent
damage to the system.
.SH OPTIONS
.sp
.LP
Refer to
.BR cfgadm (1M)
for a more complete description options.
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -c
.I function
.ad
.sp .6
.RS 4n
Perform the state change function. Specify
.I function
as
.BR connect ,
.BR disconnect ,
.B configure
or
.BR unconfigure .
.sp
.ne 2
.mk
.na
.B configure
.ad
.RS 15n
.rt
Change the occupant state to
.BR configure .
.sp
If the receptacle state is
.BR disconnect ed,
the \fBconfigure\fR function
first attempts to connect the receptacle. The
.B configure
function walks
the
.B OBP
device tree created as part of the
.B connect
function and
creates the Solaris device tree nodes, attaching devices as required. For
\fBCPU\fR/Memory boards, \fBconfigure\fR adds \fBCPU\fRs to the
.B CPU
list
.RB "in the " powered-off " state. These are visible to the " psrinfo (1M)
and
.BR psradm (1M)
commands. Two memory attachment points are published for
CPU/memory boards. Use
.BR mount (1M)
and\fBifconfig\fR(1M) to use \fBI/O\fR
devices on the new board. To use
.BR CPU s,
use
.B "psradm -n"
to
on-line the new processors. Use
.BR cfgadm_ac (1M)
to test and configure the
memory banks.
.RE

.sp
.ne 2
.mk
.na
.B connect
.ad
.RS 15n
.rt
Change the receptacle state to
.BR connect ed.
.sp
Changing the receptacle state requires that the system bus be frozen while
the bus signals are connected and the board tested. The bus is frozen by
running a
.B quiesce
operation which stops all process activity and
suspends all drivers. Because the
.B quiesce
operation and the subsequent
resume can be time consuming, and are not supported by all drivers, the
.B -x quiesce-test
is provided. While the system bus is frozen, the
board being connected is tested by firmware. This operation takes a short time
for
.B I/O
boards and a significant time for
.BR CPU "/Memory boards due to"
CPU external cache testing. This does not provide memory testing. The user is
prompted for confirmation before proceeding with the
.BR quiesce .
Use the
.B -y
or
.B -n
option to override the prompt. The
.B connect
operation is refused if the board is marked as
.BR disabled-at-boot ,
unless
either the force flag,
.BR -f ,
or the enable at boot flag,
.B -o
.BR enable-at-boot ,
is given. See
.BR -l .
.RE

.sp
.ne 2
.mk
.na
.B disconnect
.ad
.RS 15n
.rt
 Change the receptacle state to
.BR disconnect ed.
.sp
If the occupant state is
.BR configure ,
the
.B disconnect
function first
attempts to unconfigure the occupant. The
.B disconnect
operation does not
require a
.B quiesce
operation and operates quickly. The board is
powered-off ready for removal.
.RE

.sp
.ne 2
.mk
.na
.B unconfigure
.ad
.RS 15n
.rt
Change the occupant state to
.BR unconfigure ed.
.sp
Devices on the board are made invisible to Solaris during this process. The
.B I/O
devices on an
.B I/O
board are removed from the Solaris device
tree. Any device that is still in use stops the unconfigure process and be
reported as in use. The unconfigure operation must be retried after the device
is made non-busy. For
.BR CPU /Memory
boards, the memory must have been
changed to the unconfigured state prior to issuing the board unconfigure
operation. The
.BR CPU s
on the board are off-lined, powered off and removed
from the Solaris
.B CPU
list.
.BR CPU s
that have processes bound to them
cannot be off-lined. See
.BR psradm (1M),
\fBpsrinfo\fR(1M),
.BR pbind (1M),
.RB and p_online "(2) for more information on off-lining " CPU s.
.RE

.RE

.sp
.ne 2
.mk
.na
.B -f
.ad
.sp .6
.RS 4n
 Force a block on connecting a board marked as
.B disabled-at-boot
in the non-volatile
.B disabled-board-list
variable. See
.I "Platform Notes:Sun Enterprise 6x00/5x00/4x00/3x00 Systems"
.RE

.sp
.ne 2
.mk
.na
.B -l
.ad
.sp .6
.RS 4n
List options. Supported as described in
.BR cfgadm (1M)cfgadm(1M).
.sp
The
.I type
field can be one of
.BR cpu/mem ,
.BR mem ,
.BR dual-sbus ,
.BR sbus-upa ,
.BR dual-pci ,
.BR soc+sbus ,
.BR soc+upa ,
.B disk
or
.BR unknown .
.sp
The hardware-specific info field is set as follows:\fB [disabled at boot] [non-detachable] [100 MHz capable]\fR
.sp
For
.B sbus-upa
and
.B soc+upa
type boards, the following additional
.RB "information appears first: [" "single buffered" " " ffb|double 
.B buffered ffb|no
\fBffb installed\fR] For disk type boards, the
following additional information appears first: \fB{target: # | no disk} {target: # | no disk}\fR
.RE

.sp
.ne 2
.mk
.na
.B -o
disable-at-boot | enable-at-boot\fR
.ad
.sp .6
.RS 4n
Modify the state of the non\(emvolatile
.B " disabled-board-list"
variable.
Use this the
.B -o
option in conjunction with the
.B -c
.I function
or
.B -l
option.
.sp
Use
.B "-o enable-at-boot"
with the
.B "-c connect"
to override
a block on connecting a
.B disabled-at-boot
board.
.RE

.sp
.ne 2
.mk
.na
.B -x
insert-test | remove-test\fR
.ad
.sp .6
.RS 4n
Perform a test.
.sp
 Specify
.B remove-test
to change the driver state for the specified slot from
.B disconnected
to
.B empty
without the need for physically removing the board during automated test
sequences.
.sp
Specify
.B insert-test
to change the driver state of a slot made to appear
empty using the
.B remove-test
command to the d\fBisconnected\fR state as
if it had been inserted.
.RE

.sp
.ne 2
.mk
.na
.B -x
quiesce-test sysctrl0:slot1\fR
.ad
.sp .6
.RS 4n
Perform a test.
.sp
Allows the
.B quiesce
operation required for board connect operations to
be exercised. The execution of this test confirms that, with the current
software and hardware configuration, it is possible to quiesce the system. If
a device or process cannot be quiesced, its name is printed in an error
message. Any valid board attachment point can be used with this command, but
since all systems have a slot1 the given form is recommended.
.RE

.sp
.ne 2
.mk
.na
.BR -x " set-condition-test=#"
.ad
.sp .6
.RS 4n
Perform a test.
.sp
Allows the condition of a system board attachment point to be set for testing
the policy logic for state change commands. The new setting is given as a
number indicating one of the following condition values:
.sp
.in +2
.nf
0      unknown
1      ok
2      failing
3      failed
4      unusable
.fi
.in -2
.sp

.RE

.SH OPERANDS
.sp
.LP
The following operand is supported:
.sp
.ne 2
.mk
.na
.BI sysctrl0:slot #
.ad
.RS 28n
.rt
The attachment points for boards on
.B EXX00
systems are published by
instance
.B 0
of the
.B sysctrl
driver
.RB ( sysctrl0 ).
The names of
the attachment points are numbered from
.B slot0
through
.BR slot15 .
Specify
.I #
as a number between
.B 0
and
.BR 15 ,
indicating the slot
number. This form conforms to the logical
.B ap_id
specification given in
.BR cfgadm (1M).
The corresponding physical
.BR ap_id "s are listed in the"
.B FILES
section.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B /usr/platform/sun4u/lib/cfgadm/sysctrl.so.1
.ad
.sp .6
.RS 4n
Hardware specific library
.RE

.sp
.ne 2
.mk
.na
.B /devices/central@1f,0/fhc@0,f8800000/clock-board@0,900000:slot*
.ad
.sp .6
.RS 4n
Attachment Points
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWkvm.u
.TE

.SH SEE ALSO
.sp
.LP
.BR cfgadm (1M),
.BR cfgadm_ac (1M),
.BR ifconfig (1M),
.BR mount (1M),
.BR pbind (1M),
.BR psradm (1M),
,
.BR psrinfo (1M),
.BR config_admin (3CFGADM),
.BR attributes (5)
.sp
.LP
\fISun Enterprise 6x00, 5x00, 4x00 and 3x00 Systems Dynamic Reconfiguration
User's Guide\fR
.sp
.LP
.I Platform Notes:Sun Enterprise 6x00/5x00/4x00/3x00 Systems
.SH NOTES
.sp
.LP
Refer to the \fISun Enterprise 6x00, 5x00, 4x00 and 3x00 Systems Dynamic Reconfiguration User's Guide\fR for additional details regarding dynamic
reconfiguration of EXX00 system CPU/Memory boards.
