usr/src/man/man1m/check-permissions.1m
'\" te
.\" Copyright (c) 2003 Sun Microsystems, Inc.  All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH check-permissions 1M "10 Nov 2003" "SunOS 5.11" "System Administration Commands"
.SH NAME
check-permissions \- check permissions on mail rerouting files
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/check-permissions\fR [\fIlogin\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The
.B check-permissions
script is intended as a migration aid for
.BR sendmail (1M).
It checks the
.B /etc/mail/sendmail.cf
file for all
configured alias files, and checks the alias files for
.B :include:
files. It also checks for certain
.B \&.forward
files. For each file that
.B check-permissions
checks, it verifies that none of the parent
directories are group- or world-writable. If any directories are overly
permissive, it is reported. Otherwise it reports that no unsafe directories
were found.
.sp
.LP
As to which
.B \&.forward
files are checked, it depends on the arguments
included on the command line. If no argument is given, the current user's
home directory is checked for the presence of a
.B \&.forward
file. If
any arguments are given, they are assumed to be valid logins, and the home
directory of each one is checked.
.sp
.LP
If the special argument
.B ALL
is given,  the
.B passwd
entry in the
.B /etc/nsswitch.conf
file is checked, and all password entries that can
be obtained through the switch file are checked. In large domains, this can
be time-consuming.
.SH OPERANDS
.sp
.LP
The following operands are supported:
.sp
.ne 2
.mk
.na
.I login
.ad
.RS 9n
.rt
Where
.I login
is a valid user name, checks the home directory for
.IR login .
.RE

.sp
.ne 2
.mk
.na
.B ALL
.ad
.RS 9n
.rt
Checks the home directory of
.B all
users.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/mail/sendmail.cf
.ad
.RS 25n
.rt
Defines environment for
.BR sendmail
.RE

.sp
.ne 2
.mk
.na
.B /etc/mail/aliases
.ad
.RS 25n
.rt
Ascii mail aliases file
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWsndmu
_
Interface StabilityEvolving
.TE

.SH SEE ALSO
.sp
.LP
.BR getent (1M),
.BR sendmail (1M),
.BR aliases (4),
.BR attributes (5)

