usr/src/man/man1m/chroot.1m
'\" te
.\" Copyright (c) 2004, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" Copyright 1989 AT&T
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH chroot 1M "15 Dec 2003" "SunOS 5.11" "System Administration Commands"
.SH NAME
chroot \- change root directory for a command
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/chroot\fR \fInewroot\fR \fIcommand\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B chroot
utility causes
.I command
to be executed relative to
.IR newroot .
The meaning of any initial slashes
.RB ( \|/\| )
in the path
names is changed to
.I newroot
for
.I command
and any of its child
processes. Upon execution, the initial working directory is
.IR newroot .
.sp
.LP
Notice that redirecting the output of
.I command
to a file,
.sp
.in +2
.nf
chroot\fI newroot \|command\fR >\fBx\fR
.fi
.in -2
.sp

.sp
.LP
will create the file
.B x
relative to the original root of
.IR command ,
not the new one.
.sp
.LP
The new root path name is always relative to the current root. Even if a
.B chroot
is currently in effect, the
.I newroot
argument is relative
to the current root of the running process.
.sp
.LP
This command can be run only by the super-user.
.SH RETURN VALUES
.sp
.LP
The exit status of
.B chroot
is the return value of
.IR command .
.SH EXAMPLES
.LP
.B Example 1
Using the
.B chroot
Utility
.sp
.LP
The
.B chroot
utility provides an easy way to extract
.B tar
files
(see
.BR tar (1))
written with absolute filenames to a different location.
It is necessary to copy the shared libraries used by
.B tar
(see
.BR ldd (1))
to the
.I newroot
filesystem.

.sp
.in +2
.nf
example# mkdir /tmp/lib; cd /lib
example# cp ld.so.1 libc.so.1 libcmd.so.1 libdl.so.1 \e
         libsec.so.1 /tmp/lib
example# cp /usr/bin/tar /tmp
example# dd if=/dev/rmt/0 | chroot /tmp tar xvf -
.fi
.in -2
.sp

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.sp
.LP
.BR cd (1),
.BR tar (1),
.BR chroot (2),
.BR ttyname (3C),
.BR attributes (5)
.SH NOTES
.sp
.LP
Exercise extreme caution when referencing device files in the new root file
system.
.sp
.LP
References by routines such as
.BR ttyname "(3C) to stdin, stdout, and"
stderr will find that the device associated with the file descriptor is
unknown after
.B chroot
is run.
