usr/src/man/man1m/clear_locks.1m
'\" te
.\" Copyright (c) 1996, Sun Microsystems, Inc.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\"  All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH clear_locks 1M "6 Oct 2004" "SunOS 5.11" "System Administration Commands"
.SH NAME
clear_locks \- clear locks held on behalf of an NFS client
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/clear_locks\fR [\fB-s\fR] \fIhostname\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B clear_locks
command removes all file, record, and share locks
created by the
.I hostname
and held on the current host, regardless of
which process created or owns the locks.
.sp
.LP
This command can be run only by the super-user.
.sp
.LP
This command should only be used to repair the rare case of a client
crashing and failing to clear held locks. Clearing locks held by an active
client may cause applications to fail in an unexpected manner.
.SH OPTIONS
.sp
.ne 2
.mk
.na
.B -s
.ad
.RS 6n
.rt
Remove all locks created by the current machine and held by the server
.IR hostname .
.RE

.SH OPERANDS
.sp
.LP
The following operands are supported:
.sp
.ne 2
.mk
.na
.I hostname
.ad
.RS 12n
.rt
name of host server
.RE

.SH EXIT STATUS
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 5n
.rt
Successful operation.
.RE

.sp
.ne 2
.mk
.na
.B 1
.ad
.RS 5n
.rt
If not root.
.RE

.sp
.ne 2
.mk
.na
.B 2
.ad
.RS 5n
.rt
Usage error.
.RE

.sp
.ne 2
.mk
.na
.B 3
.ad
.RS 5n
.rt
If unable to contact server
.RB ( RPC ).
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.sp
.LP
.BR fcntl (2),
.BR attributes (5)
