usr/src/man/man1m/clri.1m
'\" te
.\" Copyright 1989 AT&T  Copyright (c) 1996, Sun Microsystems, Inc.  All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH clri 1M "16 Sep 1996" "SunOS 5.11" "System Administration Commands"
.SH NAME
clri, dcopy \- clear inode
.SH SYNOPSIS
.LP
.nf
\fBclri\fR [\fB-F\fR \fIFSType\fR] [\fB-V\fR] \fIspecial\fR \fIi-number\fR
.fi

.LP
.nf
\fBdcopy\fR [\fB-F\fR \fIFSType\fR] [\fB-V\fR] \fIspecial\fR \fIi-number\fR
.fi

.SH DESCRIPTION
.sp
.LP
.B clri
writes zeros on the inodes with the decimal
.I i-number
on
the file system stored on
.IR special .
After
.BR clri ,
any blocks in
the affected file show up as missing in an  \fBfsck\fR(1M) of
.IR special .
.sp
.LP
Read and write permission is required on the specified file system device.
The inode becomes allocatable.
.sp
.LP
The primary purpose of this routine is to remove a file that for some
reason appears in no directory. If it is used to zap an inode that does
appear in a directory, care should be taken to track down the entry and
remove it. Otherwise, when the inode is reallocated to some new file, the
old entry will still point to that file. At that point, removing the old
entry will destroy the new file. The new entry will again point to an
unallocated inode, so the whole cycle is likely to be repeated again and
again.
.sp
.LP
.B dcopy
is a symbolic link to
.BR clri .
.SH OPTIONS
.sp
.ne 2
.mk
.na
.BI -F " FSType"
.ad
.RS 13n
.rt
Specify the
.I FSType
on which to operate. The
.I FSType
should
either be specified here or be determinable from
.B /etc/vfstab
by
matching
.I special
with an entry in the table, or by consulting
.BR /etc/default/fs .
.RE

.sp
.ne 2
.mk
.na
.B -V
.ad
.RS 13n
.rt
Echo the complete command line, but do not execute the command. The command
line is generated by using the options and arguments provided by the user
and adding to them information derived from
.BR /etc/vfstab .
This option
should be used to verify and validate the command line.
.RE

.SH USAGE
.sp
.LP
See
.BR largefile (5)
for the description of the behavior of
.BR clri
and
.B dcopy
when encountering files greater than or equal to 2 Gbyte (
2^31 bytes).
.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/default/fs
.ad
.RS 19n
.rt
Default local file system type
.RE

.sp
.ne 2
.mk
.na
.B /etc/vfstab
.ad
.RS 19n
.rt
List of default parameters for each file system
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.sp
.LP
.BR fsck (1M),
.BR vfstab (4),
.BR attributes (5),
.BR largefile (5)
.SH NOTES
.sp
.LP
This command might not be supported for all
.IR FSTypes .
