usr/src/man/man1m/consadm.1m
'\" te
.\" Copyright (c) 2004 Sun Microsystems, Inc.  All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH consadm 1m "27 Oct 2004" "SunOS 5.11" "System Administration Commands"
.SH NAME
consadm \- select or display devices used as auxiliary console devices
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/consadm\fR
.fi

.LP
.nf
\fB/usr/sbin/consadm\fR [\fB-a\fR \fIdevice\fR.\|.\|.] [\fB-p\fR]
.fi

.LP
.nf
\fB/usr/sbin/consadm\fR [\fB-d\fR \fIdevice\fR.\|.\|.] [\fB-p\fR]
.fi

.LP
.nf
\fB/usr/sbin/consadm\fR [\fB-p\fR]
.fi

.SH DESCRIPTION
.sp
.LP
\fBconsadm\fR selects the hardware \fIdevice\fR or devices to be used as
auxiliary console devices, or displays the current device. Only superusers
are allowed to make or display auxiliary console device selections.
.sp
.LP
Auxiliary console devices receive copies of
.B console
messages, and can
be used as the console during
.B "single user"
mode. In particular, they
receive kernel messages and messages directed to
.BR /dev/sysmsg .
On
Solaris x86 based systems they can also be used for interaction with the
bootstrap.
.sp
.LP
By default, selecting a display device to be used as an auxiliary console
device selects that device for the duration the system remains up. If the
administrator needs the selection to persist across reboots the
.BR -p
option can be specified.
.sp
.LP
\fBconsadm\fR runs a daemon in the background, monitoring auxiliary console
devices. Any devices that are disconnected (hang up, lose carrier) are
removed from the auxiliary console device list, though not from the
persistent list. While auxiliary console devices may have been removed from
the device list receiving copies of
.B console
messages, those messages
will always continue to be displayed by the default console device.
.sp
.LP
The daemon will not run if it finds there are not any auxiliary devices
configured to monitor. Likewise, after the last auxiliary console is
removed, the daemon will shut itself down. Therefore the daemon persists for
only as long as auxiliary console devices remain active.
.sp
.LP
See \fBeeprom\fR(1M) for instructions on assigning an auxiliary console
device as the system console.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB-a\fR \fIdevice\fR
.ad
.RS 13n
.rt
Adds
.I device
to the list of auxiliary console devices. Specify
\fIdevice\fR as the path name to the device or devices to be added to the
auxiliary console device list.
.RE

.sp
.ne 2
.mk
.na
\fB-d\fR \fIdevice\fR
.ad
.RS 13n
.rt
Removes
.I device
from the list of auxiliary console devices. Specify
\fIdevice\fR as the path name to the device or devices to be removed from
the auxiliary console device list.
.RE

.sp
.ne 2
.mk
.na
.B -p
.ad
.RS 13n
.rt
Prints the list of auxiliary consoles that will be auxiliary across
reboots.
.sp
When invoked with the
.B -a
or
.B -d
options , tells the application
to make the change persist across reboot.
.RE

.SH EXAMPLES
.LP
\fBExample 1\fR Adding to the list of devices that will receive console
messages
.sp
.LP
The following command adds
.B /dev/term/a
to the list of devices that
will receive console messages.

.sp
.in +2
.nf
example# \fBconsadm -a /dev/term/a\fR
.fi
.in -2
.sp

.LP
\fBExample 2\fR Removing from the list of devices that will receive console
messages
.sp
.LP
The following command removes
.B /dev/term/a
from the list of devices
that will receive console messages. This includes removal from the
persistent list.

.sp
.in +2
.nf
example# \fBconsadm -d -p /dev/term/a\fR
.fi
.in -2
.sp

.LP
\fBExample 3\fR Printing the list of devices selected as auxiliary console
devices
.sp
.LP
The following command prints the name or names of the device or devices
currently selected as auxiliary console devices.

.sp
.in +2
.nf
example# \fBconsadm\fR
.fi
.in -2
.sp

.SH ENVIRONMENT VARIABLES
.sp
.LP
See
.BR environ (5)
for descriptions of the following environment
variables that affect the execution of
.BR consadm :
.BR LC_CTYPE ,
.BR LC_MESSAGES ,
and
.BR NLSPATH .
.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 6n
.rt
Successful completion.
.RE

.sp
.ne 2
.mk
.na
\fB>\fB0\fR
.ad
.RS 6n
.rt
An error occurred.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
_
Stability LevelEvolving
.TE

.SH SEE ALSO
.sp
.LP
.BR svcs (1),
.BR eeprom (1M),
.BR svcadm (1M),
.BR syslogd (1M),
.BR kadb (1M),
.BR environ (5),
.BR attributes (5),
.BR smf (5),
\fBsysmsg\fR(7d), \fBconsole\fR(7d)
.SH NOTES
.sp
.LP
Auxiliary console devices are not usable for
.B kadb
or firmware
.BR I/O ,
do not receive panic messages, and do not receive output directed
to
.BR /dev/console .
.sp
.LP
The
.B consadm
service is managed by the service management facility,
\fBsmf\fR(5), under the service identifier:
.sp
.in +2
.nf
svc:/system/consadm
.fi
.in -2
.sp

.sp
.LP
Administrative actions on this service, such as enabling, disabling, or
requesting restart, can be performed using
.BR svcadm (1M).
The service's
status can be queried using the
.BR svcs (1)
command.
