usr/src/man/man1m/conv_lpd.1m
'\" te
.\" Copyright (c) 1996 Sun Microsystems, Inc.  All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH conv_lpd 1M "9 Sep 1996" "SunOS 5.11" "System Administration Commands"
.SH NAME
conv_lpd \- convert LPD configuration
.SH SYNOPSIS
.LP
.nf
\fBconv_lpd\fR [\fB-c\fR printers | \fB-c\fR printcap] [\fB-n\fR] \fIfile\fR
.fi

.SH DESCRIPTION
.sp
.LP
.B conv_lpd
converts
.B LPD
printer configuration information from
.I file
to a \fBprinters.conf\fR or a  \fBprintcap\fR file (see
.BR printers.conf (4)).
.I file
specifies the name of the input file,
and can be either in \fBprinters.conf\fR or  \fBprintcap\fR format. If
.I file
is in
.B printers.conf
format, it converts it to a
.B printcap
file. If  \fIfile\fR is in  \fBprintcap\fR format, it
converts it to a
.B printers.conf
file.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -c printers
|\fB -c printcap\fR
.ad
.RS 29n
.rt
Specifies the type of output file produced by the conversion. \fB-c\fR
.B printers
converts to a \fBprinters.conf\fR file.  \fB-c\fR
.B printcap
converts to a
.B printcap
file.
.B "-c printers"
is
the default.
.RE

.sp
.ne 2
.mk
.na
.B -n
.ad
.RS 29n
.rt
Preserves the namelist during the conversion.
.RE

.SH OPERANDS
.sp
.LP
The following operands are supported:
.sp
.ne 2
.mk
.na
.I file
.ad
.RS 8n
.rt
The file to be converted.
.RE

.SH EXAMPLES
.LP
.B Example 1
Converting a
.B printcap
file to a  \fBprinters.conf\fR
file.
.sp
.LP
The following example converts a
.B printcap
file to a
.B printers.conf
file.

.sp
.in +2
.nf
\fBexample% conv_lpd /etc/printcap\fR
.fi
.in -2
.sp

.LP
.B Example 2
Converting a
.B printcap
file to a \fBprinters.conf\fR
file and preserving the namelist.
.sp
.LP
The following example converts a
.B printcap
file to a
.B printers.conf
file and preserves the namelist.

.sp
.in +2
.nf
\fBexample% conv_lpd -c printers -n /etc/printcap\fR
.fi
.in -2
.sp

.LP
.B Example 3
Converting a  \fBprinters.conf\fR file to a  \fBprintcap\fR
file and preserving the namelist.
.sp
.LP
The following example converts a
.B printers.conf
file to a
.B printcap
file and preserves the namelist.

.sp
.in +2
.nf
\fBexample% conv_lpd -c printcap -n /etc/printers.conf\fR
.fi
.in -2
.sp

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 12n
.rt
Successful completion.
.RE

.sp
.ne 2
.mk
.na
.B non-zero
.ad
.RS 12n
.rt
An error occurred.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/printers.conf
.ad
.RS 22n
.rt
System printer configuration database.
.RE

.sp
.ne 2
.mk
.na
.B /etc/printcap
.ad
.RS 22n
.rt
SunOS 4.\fIx\fR printer capability database.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWpcu
.TE

.SH SEE ALSO
.sp
.LP
.BR lpset (1M),
.BR printers.conf (4),
.BR attributes (5)
