usr/src/man/man1m/conv_lp.1m
'\" te
.\" Copyright (c) 1996 Sun Microsystems, Inc.  All Rights Reserved.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH conv_lp 1M "9 Sep 1996" "SunOS 5.11" "System Administration Commands"
.SH NAME
conv_lp \- convert LP configuration
.SH SYNOPSIS
.LP
.nf
\fBconv_lp\fR [\fB-d\fR \fIdir\fR] [\fB-f\fR \fIfile\fR]
.fi

.SH DESCRIPTION
.sp
.LP
.B conv_lp
reads
.B LP
printer configuration information from a
directory and converts it to an output file for use with print client
software.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.BI -d " dir"
.ad
.RS 11n
.rt
The root (`\fB /\fR ') directory from which  \fBLP\fR configuration
information is read.   The default is root (`\fB /\fR ').
.RE

.sp
.ne 2
.mk
.na
\fB-f\fI file\fR
.ad
.RS 11n
.rt
The output file to which
.B conv_lp
writes the converted
.BR LP
configuration information.  The default is
.BR /etc/printers.conf .
.RE

.SH EXAMPLES
.LP
.B Example 1
Converting
.B LP
Configuration Information from the
Default Directory and File
.sp
.LP
The following example converts
.B LP
configuration information from
directory root (\fB/\fR) to file \fB/etc/printers.conf\fR.

.sp
.in +2
.nf
% \fBconv_lp\fR
.fi
.in -2
.sp

.LP
.B Example 2
Converting
.B LP
Configuration Information From a
Specified Directory and File
.sp
.LP
The following example converts
.B LP
configuration information from
directory
.B /export/root/client
to file
.BR /export/root/client/etc/printers.conf .

.sp
.in +2
.nf
% \fBconv_lp -d /export/root/client -f\e
   /export/root/client/etc/printers.conf\fR
.fi
.in -2
.sp

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 12n
.rt
Successful completion.
.RE

.sp
.ne 2
.mk
.na
.B non-zero
.ad
.RS 12n
.rt
An error occurred.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/printers.conf
.ad
.RS 22n
.rt
System printer configuration database.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWpcu
.TE

.SH SEE ALSO
.sp
.LP
.BR lpset (1M),
.BR printers.conf (4),
.BR attributes (5)
