usr/src/man/man1m/datadm.1m
'\" te
.\" Copyright (c) 2003, Sun Microsystems, Inc. All Rights Reserved.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH datadm 1M "18 Jun 2004" "SunOS 5.11" "System Administration Commands"
.SH NAME
datadm \- maintain DAT static registry file
.SH SYNOPSIS
.LP
.nf
\fB/usr/bin/datadm\fR [\fB-v\fR] [\fB-u\fR] [\fB-a\fR service_provider.conf]
     [\fB-r\fR service_provider.conf]
.fi

.SH DESCRIPTION
.sp
.LP
The
.B datadm
utility maintains the DAT static registry file,
\fBdat.conf\fR(4).
.sp
.LP
This administrative configuration program allows uDAPL service providers to
add and remove themselves to the \fBdat.conf\fR file.
.sp
.LP
You can add or remove interface adapters that a service provider supports
from a system after its installation. You can use
.B datadm
to update the
\fBdat.conf\fR file to reflect the current state of the system. A new set of
interface adapters for all the service providers currently installed is
regenerated.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB-a service_provider.conf\fR
.ad
.RS 28n
.rt
Enumerate each device entry in the
.BR service_provider.conf (4)
file into
a list of interface adapters, that is, interfaces to external network that
are available to uDAPL consumers.
.RE

.sp
.ne 2
.mk
.na
\fB-r service_provider.conf\fR
.ad
.RS 28n
.rt
Remove the list of interface adapters that corresponds to the device entry
in the
.BR service_provider.conf (4)
file.
.RE

.sp
.ne 2
.mk
.na
.B -u
.ad
.RS 28n
.rt
Update the \fBdat.conf\fR to reflect the current state of the system with
an up to date set of interface adapters for the service providers that are
currently listed in the DAT static registry.
.RE

.sp
.ne 2
.mk
.na
.B -v
.ad
.RS 28n
.rt
Display the DAT static registry file, \fBdat.conf\fR.
.RE

.SH EXAMPLES
.LP
\fBExample 1\fR Enumerating a Device Entry
.sp
.LP
The following example enumerates a device entry in the
\fBservice_provider.conf\fR(4) file into interface adapters in the
\fBdat.conf\fR(4) file.

.sp
.LP
Assume that
.B SUNW
has a service provider library that supports the
device
.BR tavor .
It has a
.BR service_provider.conf (4)
file installed
in the directory \fB/usr/share/dat/SUNWudaplt.conf\fR with a single entry as
follows:

.sp
.in +2
.nf
driver_name=tavor u1.2 nonthreadsafe default\e
    udapl_tavor.so.1 SUNW.1.0 ""
.fi
.in -2
.sp

.sp
.LP
\fBtavor\fR is an Infiniband Host Channel Adapter with two ports. Both IB
ports exist in a single IB partition,
.BR 0x8001 .
If an IP interface is
plumbed to each port, there are two IPoIB device instances,
.B ibd0
and
.BR ibd1 :

.sp
.in +2
.nf
# ls -l /dev/ibd*
/dev/ibd0 -> /devices/pci@1/pci15b3,5a44@0/ibport@1,8001,ipib:ibd0
/dev/ibd1 -> /devices/pci@1/pci15b3,5a44@0/ibport@2,8001,ipib:ibd1
.fi
.in -2
.sp

.sp
.LP
Running the command, \fBdatadm -a /usr/share/dat/SUNWudaplt.conf\fR appends
two new entries (if they do not already exists]) in the
\fB/etc/dat/dat.conf\fRfile:

.sp
.in +2
.nf
ibd0 u1.2 nonthreadsafe default udapl_tavor.so.1 SUNW.1.0 ""
"driver_name=tavor"
ibd1 u1.2 nonthreadsafe default udapl_tavor.so.1 SUNW.1.0 ""
"driver_name=tavor"
.fi
.in -2

.LP
\fBExample 2\fR Updating the \fBdat.conf\fR to Reflect the Current State of
the System
.sp
.LP
A new IB partition, 0x8002 is added to the above example covering port 1 of
the Host Channel Adapter. If a new IP interface is plumbed to \fBport
1/partition 0x8002\fR, there is a third IPoIB device instance: \fBibd2\fR.

.sp
.in +2
.nf
# ls -l /dev/ibd*
 /dev/ibd0 -> /devices/pci@1/pci15b3,5a44@0/ibport@1,8001,ipib:ibd0
 /dev/ibd1 -> /devices/pci@1/pci15b3,5a44@0/ibport@2,8001,ipib:ibd1
 /dev/ibd2 -> /devices/pci@1/pci15b3,5a44@0/ibport@1,8002,ipib:ibd2
.fi
.in -2
.sp

.sp
.LP
Running
.B "datadm -u"
command, updates the \fB/etc/dat/dat.conf\fR file
with a new entry added reflecting the current state of the system.

.sp
.LP
\fBdatadm -v\fR shows that there are now three entries in the
\fB/etc/dat/dat.conf\fR file:

.sp
.in +2
.nf
ibd0 u1.2 nonthreadsafe default udapl_tavor.so.1 SUNW.1.0 ""
"driver_name=tavor"
ibd1 u1.2 nonthreadsafe default udapl_tavor.so.1 SUNW.1.0 ""
"driver_name=tavor"
ibd2 u1.2 nonthreadsafe default udapl_tavor.so.1 SUNW.1.0 ""
"driver_name=tavor"
.fi
.in -2
.sp

.SH FILES
.sp
.ne 2
.mk
.na
\fB/etc/dat/dat.conf\fR
.ad
.RS 21n
.rt
DAT static registry file
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWudaplu
_
Interface StabilityEvolving
.TE

.SH SEE ALSO
.sp
.LP
.BR pkgadd (1M),
.BR pkgrm (1M),
.BR libdat (3LIB),
\fBdat.conf\fR(4),
\fBservice_provider.conf\fR(4). \fBattributes\fR(5)
