usr/src/man/man1m/devattr.1m
'\" te
.\" Copyright 1989 AT&T  Copyright (c) 1997 Sun Microsystems, Inc.  All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH devattr 1M "5 Jul 1990" "SunOS 5.11" "System Administration Commands"
.SH NAME
devattr \- display device attributes
.SH SYNOPSIS
.LP
.nf
\fBdevattr\fR [\fB-v\fR] \fIdevice\fR [\fIattribute\fR]...
.fi

.SH DESCRIPTION
.sp
.LP
.B devattr
displays the values for a device's attributes. The display
can be presented in two formats. Used without the
.B -v
option, only the
attribute values are shown. Used with the
.B -v
option, the attributes
are shown in an  \fIattribute\fB=\fIvalue\fR format. When no
attributes are given on the command line, all attributes for the specified
device are displayed in alphabetical order by attribute name. If attributes
are given on the command line, only those attributes  are shown, displayed
in command line order.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -v
.ad
.RS 6n
.rt
Specifies verbose format. Attribute values are displayed in an
\fIattribute\fB=\fIvalue\fR format.
.RE

.SH OPERANDS
.sp
.LP
The following operands are supported:
.sp
.ne 2
.mk
.na
.I attribute
.ad
.RS 13n
.rt
Defines which attribute, or attributes, should be shown. Default is to show
all attributes for a device. See the
.BR putdev (1M)
manual page for a
complete listing and description of available attributes.
.RE

.sp
.ne 2
.mk
.na
.I device
.ad
.RS 13n
.rt
Defines the device whose attributes should be displayed. Can be the
pathname of the device or the device alias.
.RE

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 5n
.rt
successful completion.
.RE

.sp
.ne 2
.mk
.na
.B 1
.ad
.RS 5n
.rt
Command syntax was incorrect, invalid option was used, or an internal error
occurred.
.RE

.sp
.ne 2
.mk
.na
.B 2
.ad
.RS 5n
.rt
Device table could not be opened for reading.
.RE

.sp
.ne 2
.mk
.na
.B 3
.ad
.RS 5n
.rt
Requested device could not be found in the device table.
.RE

.sp
.ne 2
.mk
.na
.B 4
.ad
.RS 5n
.rt
Requested attribute was not defined for the specified device.
.RE

.SH FILES
.sp
.LP
.B /etc/device.tab
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.sp
.LP
.BR getdev (1M),
.BR putdev (1M),
.BR attributes (5)
