usr/src/man/man1m/devfree.1m
'\" te
.\" Copyright 1989 AT&T  Copyright (c) 1997 Sun Microsystems, Inc.  All Rights Reserved.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH devfree 1M "5 Jul 1990" "SunOS 5.11" "System Administration Commands"
.SH NAME
devfree \- release devices from exclusive use
.SH SYNOPSIS
.LP
.nf
\fBdevfree\fR \fIkey\fR [\fIdevice\fR]...
.fi

.SH DESCRIPTION
.sp
.LP
.B devfree
releases devices from exclusive use. Exclusive use is
requested with the command
.BR devreserv .
.sp
.LP
When
.B devfree
is invoked with only the
.I key
argument, it
releases all devices that have been reserved for that
.IR key .
When
called with
.I key
and
.I device
arguments,
.B devfree
releases
the specified devices that have been reserved with that
.IR key .
.SH OPERANDS
.sp
.LP
The following operands are supported:
.sp
.ne 2
.mk
.na
.I device
.ad
.RS 10n
.rt
Defines device that this command will release from exclusive use.
.I device
can be the pathname of the device or the device alias.
.RE

.sp
.ne 2
.mk
.na
.I key
.ad
.RS 10n
.rt
Designates the unique key on which the device was reserved.
.RE

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 5n
.rt
Successful completion.
.RE

.sp
.ne 2
.mk
.na
.B 1
.ad
.RS 5n
.rt
Command syntax was incorrect, an invalid option was used, or an internal
error occurred.
.RE

.sp
.ne 2
.mk
.na
.B 2
.ad
.RS 5n
.rt
Device table or device reservation table could not be opened for reading.
.RE

.sp
.ne 2
.mk
.na
.B 3
.ad
.RS 5n
.rt
Reservation release could not be completely fulfilled because one or more
of the devices was not reserved or was not reserved on the specified key.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/device.tab
.ad
.RS 19n
.rt

.RE

.sp
.ne 2
.mk
.na
.B /etc/devlkfile
.ad
.RS 19n
.rt

.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.sp
.LP
.BR devreserv (1M),
.BR attributes (5)
.SH NOTES
.sp
.LP
The commands
.B devreserv
and
.B devfree
are used to manage the
availability of devices on a system. These commands do not place any
constraints on the access to the device. They serve only as a centralized
bookkeeping point for those who wish to use them. Processes that do not use
.B devreserv
may concurrently use a device with a process that has
reserved that device.
