usr/src/man/man1m/devinfo.1m
'\" te
.\" Copyright 1989 AT&T  Copyright (c) 1997, Sun Microsystems, Inc.  All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH devinfo 1M "8 May 1997" "SunOS 5.11" "System Administration Commands"
.SH NAME
devinfo \- print device specific information
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/devinfo\fR \fB-i\fR \fIdevice\fR
.fi

.LP
.nf
\fB/usr/sbin/devinfo\fR \fB-p\fR \fIdevice\fR
.fi

.SH DESCRIPTION
.sp
.LP
The \fBdevinfo\fR command is used to print device specific information
about disk devices on standard out. The command can only be used by the
superuser.
.SH OPTIONS
.sp
.ne 2
.mk
.na
\fB-i\fR
.ad
.RS 6n
.rt
Prints the following device information:
.RS +4
.TP
.ie t \(bu
.el o
Device name
.RE
.RS +4
.TP
.ie t \(bu
.el o
Software version (not supported and prints as \fB0\fR)
.RE
.RS +4
.TP
.ie t \(bu
.el o
Drive id number (not supported and prints as \fB0\fR)
.RE
.RS +4
.TP
.ie t \(bu
.el o
Device blocks per cylinder
.RE
.RS +4
.TP
.ie t \(bu
.el o
Device bytes per block
.RE
.RS +4
.TP
.ie t \(bu
.el o
Number of device partitions with a block size greater than zero
.RE
.RE

.sp
.ne 2
.mk
.na
\fB-p\fR
.ad
.RS 6n
.rt
Prints the following device partition information:
.RS +4
.TP
.ie t \(bu
.el o
Device name
.RE
.RS +4
.TP
.ie t \(bu
.el o
Device major and minor numbers (in hexadecimal)
.RE
.RS +4
.TP
.ie t \(bu
.el o
Partition start block
.RE
.RS +4
.TP
.ie t \(bu
.el o
Number of blocks allocated to the partition
.RE
.RS +4
.TP
.ie t \(bu
.el o
Partition flag
.RE
.RS +4
.TP
.ie t \(bu
.el o
Partition tag
.RE
.RE

.sp
.LP
This command is used by various other commands to obtain device specific
information for the making of file systems and determining partition
information. If the device cannot be opened, an error message is reported.
.SH OPERANDS
.sp
.ne 2
.mk
.na
\fIdevice\fR
.ad
.RS 10n
.rt
Device name.
.RE

.SH EXIT STATUS
.sp
.ne 2
.mk
.na
\fB0\fR
.ad
.RS 5n
.rt
Successful operation.
.RE

.sp
.ne 2
.mk
.na
\fB2\fR
.ad
.RS 5n
.rt
Operation failed.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.sp
.LP
\fBprtvtoc\fR(1M), \fBattributes\fR(5)
