usr/src/man/man1m/devnm.1m
'\" te
.\" Copyright (c) 1996, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright 1989 AT&T
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH devnm 1M "14 Sep 1992" "SunOS 5.11" "System Administration Commands"
.SH NAME
devnm \- device name
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/devnm\fR \fIname\fR [\fIname\fR]...
.fi

.SH DESCRIPTION
.sp
.LP
The
.B devnm
command identifies the special file associated with the
mounted file system where the argument
.I name
resides. One or more
\fIname\fR can be specified.
.SH EXAMPLES
.LP
\fBExample 1\fR Using the devnm Command
.sp
.LP
Assuming that
.B /usr
is mounted on
.BR /dev/dsk/c0t3d0s6 ,
the
following command :

.sp
.in +2
.nf
/usr/sbin/devnm /usr
.fi
.in -2
.sp

.sp
.LP
produces:
.sp
.in +2
.nf
/dev/dsk/c0t3d0s6 /usr
.fi
.in -2
.sp

.SH FILES
.sp
.ne 2
.mk
.na
.B /dev/dsk/*
.ad
.RS 15n
.rt

.RE

.sp
.ne 2
.mk
.na
.B /etc/mnttab
.ad
.RS 15n
.rt

.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.sp
.LP
.BR mnttab (4),
.BR attributes (5)
