usr/src/man/man1m/devprop.1m
'\" te
.\" Copyright (c) 2007, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH devprop 1M "26 Sep 2007" "SunOS 5.11" "System Administration Commands"
.SH NAME
devprop \- display device properties
.SH SYNOPSIS
.LP
.nf
\fB/sbin/devprop\fR [\fB-n\fR \fIdevice-path\fR] [\fB-vq\fR] [-\fB{b|i|l|s}\fR] [\fIproperty\fR[.\|.\|.]]
.fi

.SH DESCRIPTION
.sp
.LP
The
.B devprop
command displays named device properties from the device
tree.
.sp
.LP
If a device path is specified on the command line,
.B devprop
displays
device properties for that device node.
.sp
.LP
The output formats, while Volatile, are patterned after those of
.BR prtconf (1M).
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -b
.ad
.sp .6
.RS 4n
The properties to be output are sequences of bytes
.RB ( DI_PROP_TYPE_BYTES ).
.BR -b ,
.BR -i ,
.BR -l ,
and
.B -s
are
mutually exclusive of one another.
.RE

.sp
.ne 2
.mk
.na
.B -i
.ad
.sp .6
.RS 4n
The properties to be output are integers
.RB ( DI_PROP_TYPE_INT ).
.RE

.sp
.ne 2
.mk
.na
.B -l
.ad
.sp .6
.RS 4n
The properties to be output are 64-bit integers
.RB ( DI_PROP_TYPE_INT64 ).
.RE

.sp
.ne 2
.mk
.na
.B -s
.ad
.sp .6
.RS 4n
The properties to be output are strings
.RB ( DI_PROP_TYPE_STRING )
(the
default).
.RE

.sp
.ne 2
.mk
.na
.B -n
.I device-path
.ad
.sp .6
.RS 4n
The path to a target device node for which properties are displayed. The
default path is that of the root node (equivalent to specifying
.B -n
.BR / ).
.RE

.sp
.ne 2
.mk
.na
.B -q
.ad
.sp .6
.RS 4n
Specifies quoted output mode, in which string properties are output
surrounded by double quotation marks (\fB"\fR).
.RE

.sp
.ne 2
.mk
.na
.B -v
.ad
.sp .6
.RS 4n
Specifies verbose mode, in which the name of the property is output before
its value.
.RE

.SH OPERANDS
.sp
.LP
The following operand is supported:
.sp
.ne 2
.mk
.na
.IR property .\|.\|.\fR
.ad
.sp .6
.RS 4n
Name of the property to be displayed.
.RE

.SH EXIT STATUS
.sp
.ne 2
.mk
.na
.B 0
.ad
.sp .6
.RS 4n
No error occurred.
.RE

.sp
.ne 2
.mk
.na
.B non-zero
.ad
.sp .6
.RS 4n
An error occurred.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsr
_
Interface StabilitySee below.
.TE

.sp
.LP
The command invocation and output are both Volatile. The location of the
utility is Committed.
.SH SEE ALSO
.sp
.LP
.BR prtconf (1M),
.BR libdevinfo (3LIB),
.BR attributes (5)
