usr/src/man/man1m/df_ufs.1m
'\" te
.\" Copyright 1989 AT&T Copyright (c) 2003 Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH df_ufs 1M "25 Feb 2005" "SunOS 5.11" "System Administration Commands"
.SH NAME
df_ufs \- report free disk space on ufs file systems
.SH SYNOPSIS
.LP
.nf
\fBdf\fR \fB-F\fR ufs [\fIgeneric_options\fR] [\fB-o\fR i] [\fIdirectory\fR | \fIspecial\fR]
.fi

.SH DESCRIPTION
.sp
.LP
.B df
displays the amount of disk space occupied by
.B ufs
file
systems, the amount of used and available space, and how much of the file
system's total capacity has been used.The amount of space reported as used
and available is less than the amount of space in the file system; this is
because the system reserves a fraction of the space in the file system to
allow its file system allocation routines to work well. The amount reserved
is typically about 10%; this can be adjusted using
.BR tunefs (1M).
When
all the space on the file system except for this reserve is in use, only the
superuser can allocate new files and data blocks to existing files. When the
file system is overallocated in this way,
.B df
might report that the
file system is more than 100% utilized.If neither
.I directory
nor
.I special
is specified,
.B df
displays information for all mounted
ufs file systems.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.I generic_options
.ad
.RS 19n
.rt
.RB "Options supported by the generic " df " command. See " df (1M)
for a
description of these options.
.RE

.sp
.ne 2
.mk
.na
.B -o
.ad
.RS 19n
.rt
Specify
.B ufs
file system specific options. The available option is:
.sp
.ne 2
.mk
.na
.B i
.ad
.RS 5n
.rt
Report the number of used and free inodes. This option can not be used with
.IR generic_options .
.RE

.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/mnttab
.ad
.RS 15n
.rt
list of file systems currently mounted
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu, SUNWxcu4
.TE

.SH SEE ALSO
.sp
.LP
.BR df (1M),
.BR fsck (1M),
.BR fstyp (1M),
.BR tunefs (1M),
.BR mnttab (4),
.BR attributes (5),
.BR ufs (7FS),
.SH NOTES
.sp
.LP
.B df
calculates its results differently for mounted and unmounted file
systems. For unmounted systems, the numbers reflect the 10% reservation.
This reservation is not reflected in
.B df
output for mounted file
systems. For this reason, the available space reported by the generic
command can differ from the available space reported by this module.
.sp
.LP
.B df
might report remaining capacity even though
.B syslog
warns
.BR "filesystem full" .
This issue can occur because
.B df
only uses the
available fragment count to calculate available space, but the file system
requires contiguous sets of fragments for most allocations.
.sp
.LP
If you suspect that you have exhausted contiguous fragments on your file
system, you can use the
.BR fstyp (1M)
utility with the
.B -v
option. In
.RB "the " fstyp " output, look at the " nbfree " (number of blocks free) and"
.B nffree
(number of fragments free) fields. On unmounted filesystems,
you can use
.BR fsck (1M)
and observe the last line of output, which
reports, among other items, the number of fragments and the degree of
fragmentation. See
.BR fsck (1M).
