usr/src/man/man1m/dfmounts.1m
'\" te
.\" Copyright 1989 AT&T Copyright (c) 1995, Sun Microsystems, Inc. All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH dfmounts 1M "24 May 2005" "SunOS 5.11" "System Administration Commands"
.SH NAME
dfmounts \- display mounted resource information
.SH SYNOPSIS
.LP
.nf
\fBdfmounts\fR [\fB-F\fR \fIFSType\fR] [\fB-h\fR] [\fB-o\fR \fIspecific_options\fR]
     [\fIrestriction\fR].\|.\|.
.fi

.SH DESCRIPTION
.sp
.LP
.B dfmounts
shows the local resources shared through a distributed file
system
.I FSType
along with a list of clients that have the resource
mounted. If
.I restriction
is not specified,
.B dfmounts
shows file
systems that are currently shared on any
.B NFS
server.
.I specific_options
as well as the availability and semantics of
.I restriction
are specific to particular distributed file system
types.
.sp
.LP
If
.B dfmounts
is entered without arguments, remote resources currently
mounted on the local system are displayed, regardless of file system type.
However, the
.B dfmounts
command does not display the names of NFS
Version 4 clients.
.SS "\fBdfmounts\fR Output"
.sp
.LP
The output of
.B dfmounts
consists of an optional header line
(suppressed with the
.B -h
flag) followed by a list of lines containing
whitespace-separated fields. For each resource, the fields are:
.sp
.in +2
.nf
\fIresource server pathname clients .\|.\|.\fR
.fi
.in -2

.sp
.LP
where:
.sp
.ne 2
.mk
.na
.I resource
.ad
.RS 12n
.rt
Specifies the resource name that must be given to the
.BR mount (1M)
command.
.RE

.sp
.ne 2
.mk
.na
.I server
.ad
.RS 12n
.rt
Specifies the system from which the resource was mounted.
.RE

.sp
.ne 2
.mk
.na
.I pathname
.ad
.RS 12n
.rt
Specifies the pathname that must be given to the
.BR share "(1M) command."
.RE

.sp
.ne 2
.mk
.na
.I clients
.ad
.RS 12n
.rt
Is a comma-separated list of systems that have mounted the resource.
Clients are listed in the form
.IR domain. ,
.IR domain.system ,
or
.IR system ,
depending on the file system type.
.RE

.sp
.LP
A field can be null. Each null field is indicated by a hyphen (\(mi) unless
the remainder of the fields on the line are also null, in which case the
hyphen can be omitted.
.sp
.LP
Fields with whitespace are enclosed in quotation marks (\fB"\|"\fR).
.SH OPTIONS
.sp
.ne 2
.mk
.na
.B -F
.I FSType
.ad
.RS 23n
.rt
Specify filesystem type. Defaults to the first entry in
.BR /etc/dfs/fstypes .
.BR Note :
currently the only valid
.I FSType
is
.BR nfs .
.RE

.sp
.ne 2
.mk
.na
.B -h
.ad
.RS 23n
.rt
Suppress header line in output.
.RE

.sp
.ne 2
.mk
.na
.B -o
.I specific_options
.ad
.RS 23n
.rt
Specify options specific to the filesystem provided by the
.B -F
option.
.BR Note :
currently no options are supported.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/dfs/fstypes
.ad
.RS 20n
.rt
file system types
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.sp
.LP
.BR dfshares (1M),
.BR mount (1M),
.BR share (1M),
.BR unshare (1M),
.BR attributes (5)
