usr/src/man/man1m/dfshares.1m
'\" te
.\" Copyright 1989 AT&T  Copyright (c) 1995, Sun Microsystems, Inc.  All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH dfshares 1M "6 Nov 2000" "SunOS 5.11" "System Administration Commands"
.SH NAME
dfshares \- list available resources from remote or local systems
.SH SYNOPSIS
.LP
.nf
\fBdfshares\fR [\fB-F\fR \fIFSType\fR] [\fB-h\fR] [\fB-o\fR \fIspecific_options\fR] [\fIserver\fR]...
.fi

.SH DESCRIPTION
.sp
.LP
.B dfshares
provides information about resources available to the host
through a distributed file system of type
.IR FSType .
.I specific_options
as well as the semantics of
.I server
are specific
to particular distributed file systems.
.sp
.LP
If
.B dfshares
is entered without arguments, all resources currently
shared on the local system are displayed, regardless  of file system type.
.sp
.LP
The output of
.B dfshares
consists of an optional header line
(suppressed with the
.B -h
flag) followed by a list of lines containing
whitespace-separated fields.  For each resource, the fields are:
.sp
.in +2
.nf
\fIresource server access transport\fR
.fi
.in -2

.sp
.LP
where
.sp
.ne 2
.mk
.na
.I resource
.ad
.RS 13n
.rt
Specifies the resource name that must be given to the
.BR mount (1M)
command.
.RE

.sp
.ne 2
.mk
.na
.I server
.ad
.RS 13n
.rt
Specifies the name of the system that is making the resource available.
.RE

.sp
.ne 2
.mk
.na
.I access
.ad
.RS 13n
.rt
Specifies the access permissions granted to the client systems, either
.B ro
(for read-only) or
.B rw
(for read/write). If
.B dfshares
cannot determine access permissions, a hyphen  (\fB\(mi\fR) is displayed.
.RE

.sp
.ne 2
.mk
.na
.I transport
.ad
.RS 13n
.rt
Specifies the transport provider over which the resource is shared.
.RE

.sp
.LP
A field may be null. Each null field is indicated by a hyphen (\(mi) unless
the remainder of the fields on the line are also null; in which case, the
hyphen may be omitted.
.SH OPTIONS
.sp
.ne 2
.mk
.na
.B -F
.I FSType
.ad
.RS 23n
.rt
Specify filesystem type.  Defaults to the first entry in
.BR /etc/dfs/fstypes .
.RE

.sp
.ne 2
.mk
.na
.B -h
.ad
.RS 23n
.rt
Suppress header line in output.
.RE

.sp
.ne 2
.mk
.na
.B -o
.I specific_options
.ad
.RS 23n
.rt
Specify options specific to the filesystem provided by the
.BR -F
option.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/dfs/fstypes
.ad
.RS 20n
.rt

.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.sp
.LP
.BR dfmounts (1M),
.BR mount (1M),
.BR share (1M),
.BR unshare (1M),
.BR attributes (5)
