usr/src/man/man1m/dfshares_nfs.1m
'\" te
.\" Copyright 1989 AT&T  Copyright (c) 1995, Sun Microsystems, Inc.  All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH dfshares_nfs 1M "6 Nov 2000" "SunOS 5.11" "System Administration Commands"
.SH NAME
dfshares_nfs \- list available NFS resources from remote systems
.SH SYNOPSIS
.LP
.nf
\fBdfshares\fR [\fB-F\fR nfs] [\fB-h\fR] [\fIserver\fR]...
.fi

.SH DESCRIPTION
.sp
.LP
.B dfshares
provides information about resources available to the host
through
.B NFS.
The
.B -F
flag may be omitted if
.B NFS
is the
first file system type listed in the file
.BR /etc/dfs/fstypes .
.sp
.LP
The query may be restricted to the output of resources available from one
or more servers.
.sp
.LP
.B dfshares
without arguments displays all resources shared on the local
system, regardless of file system type.
.sp
.LP
Specifying
.I server
displays information about the resources shared by
each server.
.I Server
can be any system on the network.  If no server is
specified, then
.I server
is assumed to be the local system.
.sp
.LP
The output of
.B dfshares
consists of an optional header line
(suppressed with the
.B -h
flag) followed by a list of lines containing
whitespace-separated fields.  For each resource, the fields are:
.sp
.in +2
.nf
\fIresource server access transport\fR
.fi
.in -2

.sp
.LP
where
.sp
.ne 2
.mk
.na
.I resource
.ad
.RS 13n
.rt
Specifies the resource name that must be given to the
.BR mount (1M)
command.
.RE

.sp
.ne 2
.mk
.na
.I server
.ad
.RS 13n
.rt
Specifies the system that is making the resource available.
.RE

.sp
.ne 2
.mk
.na
.I access
.ad
.RS 13n
.rt
Specifies the access permissions granted to the client systems;  however,
.B dfshares
cannot determine this information for an
.B NFS
resource
and populates the field with a hyphen (-).
.RE

.sp
.ne 2
.mk
.na
.I transport
.ad
.RS 13n
.rt
Specifies the transport provider over which the
.I resource
is shared;
.RB "however, " dfshares " cannot determine this information for an  " NFS 
resource and populates the field with a hyphen (-).
.RE

.sp
.LP
A field may be null.  Each null field is indicated by a hyphen (-) unless
the remainder of the fields on the line are also null;  in which case, the
hyphen may be omitted.
.SH OPTIONS
.sp
.ne 2
.mk
.na
.B -F nfs
.ad
.RS 10n
.rt
Specify the
.B NFS
file system type
.RE

.sp
.ne 2
.mk
.na
.B -h
.ad
.RS 10n
.rt
Suppress header line in output.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/dfs/fstypes
.ad
.RS 20n
.rt

.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWnfscu
.TE

.SH SEE ALSO
.sp
.LP
.BR mount (1M),
.BR share (1M),
.BR unshare (1M),
.BR attributes (5)
