usr/src/man/man1m/dhcpconfig.1m
'\" te
.\" Copyright (c) 2002 by Sun Microsystems, Inc. All Rights Reserved.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH dhcpconfig 1M "16 Jun 2004" "SunOS 5.11" "System Administration Commands"
.SH NAME
dhcpconfig \- DHCP service configuration utility
.SH SYNOPSIS
.LP
.nf
\fBdhcpconfig\fR \fB-D\fR \fB-r\fR \fIresource\fR \fB-p\fR \fIpath\fR [\fB-u\fR \fIuninterpreted\fR]
     [\fB-l\fR \fIlease_length\fR] [\fB-n\fR ] [\fB-d\fR \fIDNS_domain\fR]
     [\fB-a\fR \fIDNS_server_addresses\fR] [\fB-h\fR \fIhosts_resource\fR]
     [\fB-y\fR \fIhosts_domain\fR]
.fi

.LP
.nf
\fBdhcpconfig\fR \fB-R\fR \fIserver_addresses\fR
.fi

.LP
.nf
\fBdhcpconfig\fR \fB-U\fR [\fB-f\fR] [\fB-x\fR] [\fB-h\fR]
.fi

.LP
.nf
\fBdhcpconfig\fR \fB-N\fR \fInetwork_address\fR [\fB-m\fR \fIsubnet_mask\fR] [\fB-b\fR ]
     [\fB-t\fR \fIrouter_addresses\fR] [\fB-y\fR \fINIS-domain\fR]
     [\fB-a\fR \fINIS_server_addresses\fR] [\fB-g\fR]
.fi

.LP
.nf
\fBdhcpconfig\fR \fB-C\fR \fB-r\fR \fIresource\fR \fB-p\fR \fIpath\fR [\fB-f\fR] [\fB-k\fR]
     [\fB-u\fR \fIuninterpreted\fR]
.fi

.LP
.nf
\fBdhcpconfig\fR \fB-X\fR \fIfilename\fR [\fB-m\fR \fImacro_list\fR] [\fB-o\fR \fIoption_list\fR]
     [\fB-a\fR \fInetwork_addresses\fR] [\fB-f\fR] [\fB-x\fR] [\fB-g\fR]
.fi

.LP
.nf
\fBdhcpconfig\fR \fB-I\fR \fIfilename\fR [\fB-f\fR] [\fB-g\fR]
.fi

.LP
.nf
\fBdhcpconfig\fR \fB-P\fR [\fIparameter\fR[=\fIvalue\fR],]...
.fi

.LP
.nf
\fBdhcpconfig\fR \fB-S\fR [\fB-f\fR] [\fB-e\fR | \fB-d\fR | \fB-r\fR | \fB-q\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The \fBdhcpconfig\fR command is used to configure and manage the Dynamic
Host Configuration Protocol (DHCP) service or BOOTP relay services. It is
intended for use by experienced Solaris system administrators and is
designed for ease of use in scripts. The
.B dhcpmgr
utility is
recommended for less experienced administrators or those preferring a
graphical utility to configure and manage the DHCP service or BOOTP relay
service.
.sp
.LP
The \fBdhcpconfig\fR command can be run by root, or by other users assigned
to the DHCP Management profile. See
.BR rbac (5)
and
.BR user_attr (4).
.sp
.LP
\fBdhcpconfig\fR requires one of the following function flags:
.BR \-D ,
.BR \-R ,
.BR \-U ,
.BR \-N ,
.BR \-C ,
.BR \-X ,
.BR \-I ,
.B \-P
or
.BR \-S .
.sp
.LP
The \fBdhcpconfig\fR menu driven mode is supported in Solaris 8 and
previous versions of Solaris.
.SS "Where dhcpconfig Obtains Configuration Information"
.sp
.LP
\fBdhcpconfig\fR scans various configuration files on your Solaris machine
for information it can use to assign values to options contained in macros
it adds to the
.B dhcptab
configuration table. The following table lists
information \fBdhcpconfig\fR needs, the source used, and how the information
is used:
.sp

.sp
.TS
tab() box;
lw(1.38i) |lw(2.06i) |lw(2.06i)
lw(1.38i) |lw(2.06i) |lw(2.06i)
.
\fIInformation\fR\fISource\fR\fIWhere Used\fR
_
TimezoneSystem date, timezone settings\fBLocale\fR macro
DNS parameters\fBnsswitch.conf\fR, \fB/etc/resolv.conf\fRServer macro
NIS parametersSystem domainname, \fBnsswitch.conf\fR, NISNetwork macros
SubnetmaskT{
Network interface, \fBnetmasks\fR table in nameservice
T}Network macros
.TE

.sp
.LP
If you have not set these parameters on your server machine, you should do
so before configuring the DHCP server with
.BR dhcpconfig .
Note that if
you specify options with the \fBdhcpconfig
.B \-D
command line, the
values you supply override the values obtained from the system files.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -C
.ad
.RS 23n
.rt
Convert to using a new data store, recreating the DHCP data tables in a
format appropriate to the new data store, and setting up the DHCP server to
use the new data store.
.sp
The following sub-options are required:
.sp
.ne 2
.mk
.na
\fB-p\fR \fIpath_to_data\fR
.ad
.RS 20n
.rt
The paths for \fBSUNWfiles\fR and \fBSUNWbinfiles\fR must be absolute
\fBUNIX\fR pathnames. The path for \fBSUNWnisplus\fR must be a fully
specified
.B NIS+
directory (including the tailing period.) See
.BR dhcp_modules (5).
.RE

.sp
.ne 2
.mk
.na
\fB-r\fR \fIdata_resource\fR
.ad
.RS 20n
.rt
New data store resource. One of the following must be specified:
.BR SUNWfiles ,
.BR SUNWbinfiles ,
or
.BR SUNWnisplus .
See
.BR dhcp_modules (5).
.RE

The following sub-options are optional:
.sp
.ne 2
.mk
.na
\fB-f\fR
.ad
.RS 20n
.rt
Do not prompt for confirmation. If \fB-f\fR is not used, a warning and
confirmation prompt are issued before the conversion starts.
.RE

.sp
.ne 2
.mk
.na
.B -k
.ad
.RS 20n
.rt
Keep the old DHCP data tables after successful conversion. If any problem
occurs during conversion, tables are not deleted even if
.B -k
sub-option
is not specified.
.RE

.sp
.ne 2
.mk
.na
\fB-u\fR \fIuninterpreted\fR
.ad
.RS 20n
.rt
Data which is ignored by
.BR dhcpconfig ,
but passed on to the datastore
for interpretation. The private layer provides for module-specific
configuration information through the use of the
.B RESOURCE_CONFIG
keyword. Uninterpreted data is stored within
.B RESOURCE_CONFIG
keyword
of
.BR dhcpsvc.conf (4).
The
.B -u
sub-option is not used with the
.BR SUNWfiles ,
.BR SUNWbinfiles ,
and
.B SUNWnisplus
data stores. See
.BR dhcp_modules (5).
.RE

.RE

.sp
.ne 2
.mk
.na
.B -D
.ad
.RS 23n
.rt
Configure the
.B DHCP
service.
.sp
The following sub-options are required:
.sp
.ne 2
.mk
.na
\fB-r\fR \fIdata_resource\fR
.ad
.RS 20n
.rt
One of the following must be specified:
.BR SUNWfiles ,
.BR SUNWbinfiles ,
or
.BR SUNWnisplus .
Other data stores may be
available.See
.BR dhcp_modules (5).
.RE

.sp
.ne 2
.mk
.na
\fB-p\fR \fIpath\fR
.ad
.RS 20n
.rt
The paths for \fBSUNWfiles\fR and \fBSUNWbinfiles\fR must be absolute
\fBUNIX\fR pathnames. The path for \fBSUNWnisplus\fR must be a fully
specified
.B NIS+
directory (including the tailing period.) . See
.BR dhcp_modules (5).
.RE

The following sub-options are optional:
.sp
.ne 2
.mk
.na
\fB-a\fR \fIDNS_servers\fR
.ad
.RS 21n
.rt
IP addresses of DNS servers, separated with commas.
.RE

.sp
.ne 2
.mk
.na
\fB-d\fR \fIDNS_domain\fR
.ad
.RS 21n
.rt
DNS domain name.
.RE

.sp
.ne 2
.mk
.na
\fB-h\fR \fIhosts_resource\fR
.ad
.RS 21n
.rt
Resource in which to place hosts data. Usually, the name service in use on
the server. Valid values are
.BR nisplus ,
\fBfiles\fR, or
.BR dns .
.RE

.sp
.ne 2
.mk
.na
\fB-l\fR \fIseconds\fR
.ad
.RS 21n
.rt
Lease length used for addresses not having a specified lease length, in
seconds.
.RE

.sp
.ne 2
.mk
.na
.B -n
.ad
.RS 21n
.rt
Non-negotiable leases
.RE

.sp
.ne 2
.mk
.na
\fB-y\fR \fIhosts_domain\fR
.ad
.RS 21n
.rt
DNS or NIS+ domain name to be used for hosts data. Valid only if \fBdns\fR
or
.B nisplus
is specified for
.B -h
sub-option.
.RE

.sp
.ne 2
.mk
.na
\fB-u\fR \fIuninterpreted\fR
.ad
.RS 21n
.rt
Data which is ignored by
.BR dhcpconfig ,
but passed on to the datastore
for interpretation. The private layer provides for module-specific
configuration information through the use of the
.B RESOURCE_CONFIG
keyword. Uninterpreted data is stored within
.B RESOURCE_CONFIG
keyword
of
.BR dhcpsvc.conf (4).
The
.B -u
sub-option is not used with the
.BR SUNWfiles ,
.BR SUNWbinfiles ,
and
.B SUNWnisplus
data stores. See
.BR dhcp_modules (5).
.RE

.RE

.sp
.ne 2
.mk
.na
\fB-I\fR \fIfilename\fR
.ad
.RS 23n
.rt
Import data from
.IR filename ,
containing data previously exported from a
Solaris DHCP server. Note that after importing, you may have to edit macros
to specify the correct domain names, and edit network tables to change the
owning server of addresses in imported networks. Use
.B dhtadm
and
\fBpntadm\fR to do this.
.sp
The following sub-options are supported:
.sp
.ne 2
.mk
.na
\fB-f\fR
.ad
.RS 6n
.rt
Replace any conflicting data with the data being imported.
.RE

.sp
.ne 2
.mk
.na
.B -g
.ad
.RS 6n
.rt
Signal the daemon to reload the
.B dhcptab
once the import has been
completed.
.RE

.RE

.sp
.ne 2
.mk
.na
\fB-N\fR \fInet_address\fR
.ad
.RS 23n
.rt
Configure an additional network for DHCP service.
.sp
The following sub-options are supported:
.sp
.ne 2
.mk
.na
\fB-a\fR \fINIS_server_addresses\fR
.ad
.RS 27n
.rt
List of IP addresses of NIS servers.
.RE

.sp
.ne 2
.mk
.na
.B -b
.ad
.RS 27n
.rt
Network is a point-to-point (PPP) network, therefore no broadcast address
should be configured. If \fB-\fRb is not used, the network is assumed to be
a LAN, and the broadcast address is determined using the network address and
subnet mask.
.RE

.sp
.ne 2
.mk
.na
.B -g
.ad
.RS 27n
.rt
Signal the daemon to reload the
.BR dhcptab .
.RE

.sp
.ne 2
.mk
.na
\fB-m\fR \fIxxx.xxx.xxx.xxx\fR
.ad
.RS 27n
.rt
Subnet mask for the network; if
.B -m
is not used, subnet mask is
obtained from netmasks.
.RE

.sp
.ne 2
.mk
.na
\fB-t\fR \fIrouter_addresses\fR
.ad
.RS 27n
.rt
List of router IP addresses; if not specified, router discovery flag is
set.
.RE

.sp
.ne 2
.mk
.na
\fB-y\fR \fINIS_domain_name\fR
.ad
.RS 27n
.rt
If NIS is used on this network, specify the NIS domain name.
.RE

.RE

.sp
.ne 2
.mk
.na
.B -P
.ad
.RS 23n
.rt
Configure the DHCP service parameters. Each parameter and value are
specified by the following pattern:
.sp
.in +2
.nf
\fIparameter\fR[=\fIvalue\fR],\&.\|.\|.
.fi
.in -2
.sp

Where parameter and value are:
.sp
.ne 2
.mk
.na
.I parameter
.ad
.RS 13n
.rt
One of the DHCP service parameters listed in
.BR dhcpsvc.conf (4).
If the
corresponding
.I value
is not specified, the current parameter value is
displayed. If
.I parameter
is not specified, all parameters and current
values are displayed.
.RE

.sp
.ne 2
.mk
.na
.I value
.ad
.RS 13n
.rt
Optional string to set the servers parameter to if the value is acceptable.
If the value is missing or is empty (\fB""\fR), the parameter and its
current value are deleted.
.RE

After a parameter has changed the DHCP server requires re-starting before
you can use new parameter values.
.RE

.sp
.ne 2
.mk
.na
\fB-R\fR \fIserver_addresses\fR
.ad
.RS 23n
.rt
Configure the BOOTP relay service. BOOTP or DHCP requests are forwarded to
the list of servers specified.
.sp
\fIserver_addresses\fR is a comma separated list of hostnames and/or IP
addresses.
.RE

.sp
.ne 2
.mk
.na
.B -S
.ad
.RS 23n
.rt
Control the DHCP service.
.sp
The following sub-options are supported:
.sp
.ne 2
.mk
.na
.B -d
.ad
.RS 6n
.rt
 Disable and stop the DHCP service.
.RE

.sp
.ne 2
.mk
.na
.B -e
.ad
.RS 6n
.rt
Enable and start the DHCP service.
.RE

.sp
.ne 2
.mk
.na
.B -q
.ad
.RS 6n
.rt
Display the state of the DHCP service. The state is encoded into the exit
status.
.sp
.in +2
.nf
0    DHCP service disabled and stopped
1    DHCP service enabled and stopped
2    DHCP service disabled and running
3    DHCP service enabled and running
.fi
.in -2
.sp

.RE

.sp
.ne 2
.mk
.na
.B -r
.ad
.RS 6n
.rt
Enable and restart the DHCP service.
.RE

.RE

.sp
.ne 2
.mk
.na
.B -U
.ad
.RS 23n
.rt
Unconfigure the DHCP service or BOOTP relay service.
.sp
The following sub-options are supported:
.sp
.ne 2
.mk
.na
\fB-f\fR
.ad
.RS 6n
.rt
Do not prompt for confirmation. If \fB-f\fR is not used, a warning and
confirmation prompt is issued.
.RE

.sp
.ne 2
.mk
.na
.B -h
.ad
.RS 6n
.rt
Delete hosts entries from name service.
.RE

.sp
.ne 2
.mk
.na
.B -x
.ad
.RS 6n
.rt
Delete the
.B dhcptab
and network tables.
.RE

.RE

.sp
.ne 2
.mk
.na
\fB-X\fR \fIfilename\fR
.ad
.RS 23n
.rt
Export data from the DHCP data tables, saving to
.IR filename ,
to move
the data to another Solaris DHCP server.
.sp
The following sub-options are optional:
.sp
.ne 2
.mk
.na
\fB-a\fR \fInetworks_to_export\fR
.ad
.RS 25n
.rt
List of networks whose addresses should be exported, or the keyword ALL to
specify all networks. If
.B -a
is not specified, no networks are
exported.
.RE

.sp
.ne 2
.mk
.na
.B -g
.ad
.RS 25n
.rt
Signal the daemon to reload the
.B dhcptab
after the export has been
completed.
.RE

.sp
.ne 2
.mk
.na
\fB-m\fR \fImacros_to_export\fR
.ad
.RS 25n
.rt
List of macros to export, or the keyword
.B ALL
to specify all macros.
If
.B -m
is not specified, no macros are exported.
.RE

.sp
.ne 2
.mk
.na
\fB-o\fR \fIoptions_to_export\fR
.ad
.RS 25n
.rt
List of options to export, or the keyword
.B ALL
to specify all options.
If
.B -o
is not specified, no options are exported.
.RE

.sp
.ne 2
.mk
.na
.B -x
.ad
.RS 25n
.rt
Delete the data from this server after it is exported. If
.B -x
is not
specified you are in effect copying the data.
.RE

.RE

.SH EXAMPLES
.LP
\fBExample 1\fR Configuring DHCP Service with Binary Files Data Store
.sp
.LP
The following command configures DHCP service, using the binary files data
store, in the DNS domain
.BR acme.eng ,
with a lease time of 28800 seconds
(8 hours),

.sp
.in +2
.nf
example# dhcpconfig -D -r SUNWbinfiles -p /var/dhcp -l 28800\e
             -d acme.eng -a 120.30.33.4 -h dns -y acme.eng
.fi
.in -2
.sp

.LP
\fBExample 2\fR Configuring BOOTP Relay Agent
.sp
.LP
The following command configures the DHCP daemon as a BOOTP relay agent,
which forwards BOOTP and DHCP requests to the servers having the IP
addresses 120.30.33.7 and 120.30.42.132:

.sp
.in +2
.nf
example# dhcpconfig -R 120.30.33.7,120.30.42.132
.fi
.in -2
.sp

.LP
\fBExample 3\fR Unconfiguring DHCP Service
.sp
.LP
The following command unconfigures the DHCP service, with confirmation, and
deletes the DHCP data tables and host table entries:

.sp
.in +2
.nf
example# dhcpconfig -U -x -h
.fi
.in -2
.sp

.LP
\fBExample 4\fR Configuring a Network for DHCP Service
.sp
.LP
The following command configures an additional LAN network for DHCP
service, specifying that clients should use router discovery and providing
the NIS domain name and NIS server address:

.sp
.in +2
.nf
example# dhcpconfig -N 120.30.171.0 -y east.acme.eng.com\e
             -a 120.30.33.4
.fi
.in -2
.sp

.LP
\fBExample 5\fR Converting to SUNWnisplus Data Store
.sp
.LP
The following command converts a DHCP server from using a text or binary
files data store to a NIS+ data store, deleting the old data store's DHCP
tables:

.sp
.in +2
.nf
example# dhcpconfig -C -r SUNWnisplus -p whatever.com.
.fi
.in -2
.sp

.LP
\fBExample 6\fR Exporting a Network, Macros, and Options from a DHCP
Server
.sp
.LP
The following command exports one network (\fB120.30.171.0\fR) and its
addresses, the macro
.BR 120.30.171.0 ,
and the options
.B motd
and
\fBPSptr\fRfrom a DHCP server, saves the exported data in file
.BR /export/var/120301710_data ,
and deletes the exported data from the
server.

.sp
.in +2
.nf
example# dhcpconfig -X /var/dhcp/120301710_export
     -a 120.30.171.0 -m 120.30.171.0 -o motd,PSptr
.fi
.in -2
.sp

.LP
\fBExample 7\fR Importing Data on a DHCP Server
.sp
.LP
The following command imports DHCP data from a file,
.BR /net/golduck/export/var/120301710_data ,
containing data previously
exported from a Solaris DHCP server, overwrites any conflicting data on the
importing server, and signals the daemon to reload the
.B dhcptab
once
the import is completed:

.sp
.in +2
.nf
example# dhcpconfig -I /net/golduck/export/var/120301710_data -f -g
.fi
.in -2
.sp

.LP
\fBExample 8\fR Setting DHCP Server Parameters
.sp
.LP
 The following command sets the number of minutes that the DHCP server waits before timing out when updating DNS information on DHCP clients to five minutes.

.sp
.in +2
.nf
example# example# dhcpconfig -P UPDATE_TIMEOUT=5
.fi
.in -2
.sp

.LP
\fBExample 9\fR Re-starting the DHCP server
.sp
.LP
The following command stops and re-starts the DHCP server.

.sp
.in +2
.nf
example#  example# dhcpconfig -S -r
DHCP server stopped
DHCP server started
.fi
.in -2
.sp

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWdhcsu
_
Interface StabilityEvolving
.TE

.SH SEE ALSO
.sp
.LP
.BR dhcpmgr (1M),
.BR dhtadm (1M),
.BR in.dhcpd (1M),
.BR pntadm (1M),
.BR dhcp_network (4),
.BR dhcptab (4),
.BR dhcpsvc.conf (4),
.BR nsswitch.conf (4),
.BR resolv.conf (4),
.BR user_attr (4),
.BR attributes (5),
.BR dhcp (5),
.BR dhcp_modules (5),
.BR rbac (5)
.sp
.LP
\fR
