usr/src/man/man1m/dhtadm.1m
'\" te
.\" Copyright (c) 2002 by Sun Microsystems, Inc. All Rights Reserved.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH dhtadm 1M "28 Aug 2004" "SunOS 5.11" "System Administration Commands"
.SH NAME
dhtadm \- DHCP configuration table management utility
.SH SYNOPSIS
.LP
.nf
\fBdhtadm\fR \fB-C\fR [\fB-r\fR \fIresource\fR] [\fB-p\fR \fIpath\fR] [\fB-u\fR \fIuninterpreted\fR] [\fB-g\fR]
.fi

.LP
.nf
\fBdhtadm\fR \fB-A\fR \fB-s\fR \fIsymbol_name\fR \fB-d\fR \fIdefinition\fR [\fB-r\fR \fIresource\fR]
     [\fB-p\fR \fIpath\fR] [\fB-u\fR \fIuninterpreted\fR] [\fB-g\fR]
.fi

.LP
.nf
\fBdhtadm\fR \fB-A\fR \fB-m\fR \fImacro_name\fR \fB-d\fR \fIdefinition\fR [\fB-r\fR \fIresource\fR]
     [\fB-p\fR \fIpath\fR] [\fB-u\fR \fIuninterpreted\fR] [\fB-g\fR]
.fi

.LP
.nf
\fBdhtadm\fR \fB-M\fR \fB-s\fR \fIsymbol_name\fR \fB-d\fR \fIdefinition\fR [\fB-r\fR \fIresource\fR]
     [\fB-p\fR \fIpath\fR] [\fB-u\fR \fIuninterpreted\fR] [\fB-g\fR]
.fi

.LP
.nf
\fBdhtadm\fR \fB-M\fR \fB-s\fR \fIsymbol_name\fR \fB-n\fR \fInew_name\fR [\fB-r\fR \fIresource\fR]
     [\fB-p\fR \fIpath\fR] [\fB-u\fR \fIuninterpreted\fR] [\fB-g\fR]
.fi

.LP
.nf
\fBdhtadm\fR \fB-M\fR \fB-m\fR \fImacro_name\fR \fB-n\fR \fInew_name\fR [\fB-r\fR \fIresource\fR] [\fB-p\fR \fIpath\fR]
     [\fB-u\fR \fIuninterpreted\fR] [\fB-g\fR]
.fi

.LP
.nf
\fBdhtadm\fR \fB-M\fR \fB-m\fR \fImacro_name\fR \fB-d\fR \fIdefinition\fR [\fB-r\fR \fIresource\fR]
     [\fB-p\fR \fIpath\fR] [\fB-u\fR \fIuninterpreted\fR] [\fB-g\fR]
.fi

.LP
.nf
\fBdhtadm\fR \fB-M\fR \fB-m\fR \fImacro_name\fR \fB-e\fR \fIsymbol=value\fR [\fB-r\fR \fIresource\fR]
     [\fB-p\fR \fIpath\fR] [\fB-u\fR \fIuninterpreted\fR] [\fB-g\fR]
.fi

.LP
.nf
\fBdhtadm\fR \fB-D\fR \fB-s\fR \fIsymbol_name\fR [\fB-r\fR \fIresource\fR] [\fB-p\fR \fIpath\fR]
     [\fB-u\fR \fIuninterpreted\fR] [\fB-g\fR]
.fi

.LP
.nf
\fBdhtadm\fR \fB-D\fR \fB-m\fR \fImacro_name\fR [\fB-r\fR \fIresource\fR] [\fB-p\fR \fIpath\fR]
     [\fB-u\fR \fIuninterpreted\fR] [\fB-g\fR]
.fi

.LP
.nf
\fBdhtadm\fR \fB-P\fR [\fB-r\fR \fIresource\fR] [\fB-p\fR \fIpath\fR] [\fB-u\fR \fIuninterpreted\fR] [\fB-g\fR]
.fi

.LP
.nf
\fBdhtadm\fR \fB-R\fR [\fB-r\fR \fIresource\fR] [\fB-p\fR \fIpath\fR] [\fB-u\fR \fIuninterpreted\fR] [\fB-g\fR]
.fi

.LP
.nf
\fBdhtadm\fR \fB-B\fR [\fB-v\fR] [\fIbatchfile\fR] [\fB-g\fR]
.fi

.SH DESCRIPTION
.sp
.LP
\fBdhtadm\fR manages the Dynamic Host Configuration Protocol (\fBDHCP\fR)
service configuration table,
.BR dhcptab .
You can use it to add, delete,
or modify
.B DHCP
configuration macros or options or view the table. For
a description of the table format, see
.BR dhcptab (4).)
.sp
.LP
The
.B dhtadm
command can be run by root, or by other users assigned to
the DHCP Management profile. See
.BR rbac (5)
and
.BR user_attr (4).
.sp
.LP
After you make changes with
.BR dhtadm ,
you should issue a
.BR SIGHUP
to the DHCP server, causing it to read the
.B dhcptab
and pick up the
changes. Do this using the
.B -g
option.
.SH OPTIONS
.sp
.LP
One of the following function flags must be specified with the
.BR dhtadm
command:
.BR -A ,
.BR -B ,
.BR -C ,
.BR -D ,
.BR -M ,
\fB-P\fR or
.BR -R .
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -A
.ad
.RS 27n
.rt
Add a symbol or macro definition to the
.B dhcptab
table.
.sp
The following sub-options are required:
.sp
.ne 2
.mk
.na
\fB-d\fR \fIdefinition\fR
.ad
.RS 18n
.rt
Specify a macro or symbol definition.
.sp
\fIdefinition\fR must be enclosed in single quotation marks. For macros,
use the form
.BR -d
\fB\&':\fIsymbol\fR=\fIvalue\fR:\fIsymbol\fR=\fIvalue\fR:'\fR.
Enclose a
.I value
that contains colons in double quotation marks. For
symbols, the definition is a series of fields that define a symbol's
characteristics. The fields are separated by commas. Use the form \fB-d\fR
\fB\&'\fIcontext\fR,\fIcode\fR,\fItype\fR,\fIgranularity\fR,\fImaximum\fR'\fR.
See
.BR dhcptab (4)
for information about these fields.
.RE

.sp
.ne 2
.mk
.na
\fB-m\fR \fImacro_name\fR
.ad
.RS 18n
.rt
Specify the name of the macro to be added.
.sp
The
.B -d
option must be used with the
.B -m
.RB "option. The" " -s"
option cannot be used with the
.B -m
option.
.RE

.sp
.ne 2
.mk
.na
\fB-s\fR \fIsymbol_name\fR
.ad
.RS 18n
.rt
Specify the name of the symbol to be added.
.sp
The
.B -d
option must be used with the
.B -s
.RB "option. The" " -m"
option cannot be used with the
.B -s
option.
.RE

.RE

.sp
.ne 2
.mk
.na
.B -B
.ad
.RS 27n
.rt
Batch process
.B dhtadm
commands.
.B dhtadm
reads from the specified
file or from standard input a series of
.B dhtadm
commands and execute
them within the same process. Processing many
.B dhtadm
commands using
this method is much faster than running an executable batchfile itself.
Batch mode is recommended for using
.B dhtadm
in scripts.
.sp
The following sub-option is optional:
.sp
.ne 2
.mk
.na
.B -v
.ad
.RS 6n
.rt
Display commands to standard output as they are processed.
.RE

.RE

.sp
.ne 2
.mk
.na
.B -C
.ad
.RS 27n
.rt
Create the
.B DHCP
service configuration table,
.BR dhcptab .
.RE

.sp
.ne 2
.mk
.na
.B -D
.ad
.RS 27n
.rt
Delete a symbol or macro definition.
.sp
The following sub-options are required:
.sp
.ne 2
.mk
.na
\fB-m\fR \fImacro_name\fR
.ad
.RS 18n
.rt
Delete the specified macro.
.RE

.sp
.ne 2
.mk
.na
\fB-s\fR \fIsymbol_name\fR
.ad
.RS 18n
.rt
Delete the specified symbol.
.RE

.RE

.sp
.ne 2
.mk
.na
.B -g
.ad
.RS 27n
.rt
Signal the DHCP daemon to reload the
.B dhcptab
after successful
completion of the operation.
.RE

.sp
.ne 2
.mk
.na
.B -M
.ad
.RS 27n
.rt
Modify an existing symbol or macro definition.
.sp
The following sub-options are required:
.sp
.ne 2
.mk
.na
\fB-d\fR \fIdefinition\fR
.ad
.RS 17n
.rt
Specify a macro or symbol definition to modify.
.sp
The definition must be enclosed in single quotation marks. For macros, use
the form
.BR -d
\fB\&':\fIsymbol\fR=\fIvalue\fR:\fIsymbol\fR=\fIvalue\fR:'\fR.
Enclose a
.I value
that contains colons in double quotation marks. For
symbols, the definition is a series of fields that define a symbol's
characteristics. The fields are separated by commas. Use the form \fB-d\fR
\fB\&'\fIcontext\fR,\fIcode\fR,\fItype\fR,\fIgranularity\fR,\fImaximum\fR'\fR.
See
.BR dhcptab (4)
for information about these fields.
.RE

.sp
.ne 2
.mk
.na
.B -e
.ad
.RS 17n
.rt
This sub-option uses the \fIsymbol\fR \fB=\fIvalue\fR argument. Use it
to edit a \fIsymbol\fR/\fIvalue\fR pair within a macro. To add a symbol
which does not have an associate value, enter:
.sp
.in +2
.nf
\fIsymbol\fB=_NULL_VALUE_\fR
.fi
.in -2
.sp

To delete a symbol definition from a macro, enter:
.sp
.in +2
.nf
\fIsymbol\fB=\fR
.fi
.in -2
.sp

.RE

.sp
.ne 2
.mk
.na
.B -m
.ad
.RS 17n
.rt
This sub-option uses the
.I macro_name
argument. The
.BR -n ,
.BR -d ,
or
.B -e
sub-options are legal companions for this sub-option..
.RE

.sp
.ne 2
.mk
.na
.B -n
.ad
.RS 17n
.rt
This sub-option uses the
.I new_name
argument and modifies the name of
the object specified by the
.B -m
or
.B -s
sub-option. It is not
limited to macros. . Use it to specify a new macro name or symbol name.
.RE

.sp
.ne 2
.mk
.na
.B -s
.ad
.RS 17n
.rt
This sub-option uses the
.I symbol_name
argument. Use it to specify a
symbol. The
.B -d
sub-option is a legal companion.
.RE

.RE

.sp
.ne 2
.mk
.na
.BI -p " path"
.ad
.RS 27n
.rt
Override the
.BR dhcpsvc.conf (4)
configuration value for
.B PATH=
with
.IR path .
See
.BR dhcpsvc.conf (4)
for more details regarding
.IR path .
See
.BR dhcp_modules (5)
for information regarding data storage modules for
the
.B DHCP
service.
.RE

.sp
.ne 2
.mk
.na
.B -P
.ad
.RS 27n
.rt
Print (display) the
.B dhcptab
table.
.RE

.sp
.ne 2
.mk
.na
.BI -r " data_store_resource"
.ad
.RS 27n
.rt
Override the
.BR dhcpsvc.conf (4)
configuration value for
.BR RESOURCE=
with the
.I data_store_resource
specified. See
.BR dhcpsvc.conf (4)
for
more details on resource type. See\fR for more information about adding
support for other data stores. See
.BR dhcp_modules (5)
for information
regarding data storage modules for the
.B DHCP
service.
.RE

.sp
.ne 2
.mk
.na
.B -R
.ad
.RS 27n
.rt
Remove the
.B dhcptab
table.
.RE

.sp
.ne 2
.mk
.na
.BI -u " uninterpreted"
.ad
.RS 27n
.rt
Data which is ignored by
.BR dhtadm ,
but passed to currently configured
public module, to be interpreted by the data store. The private layer
provides for module-specific configuration information through the use of
the
.B RESOURCE_CONFIG
keyword. Uninterpreted data is stored within
\fBRESOURCE_CONFIG\fR keyword of
.BR dhcpsvc.conf (4).
See
.BR dhcp_modules (5)
for information regarding data storage modules for the
DHCP service.
.RE

.SH EXAMPLES
.LP
\fBExample 1\fR Creating the \fBDHCP\fR Service Configuration Table
.sp
.LP
The following command creates the
.B DHCP
service configuration table,
.BR dhcptab :

.sp
.in +2
.nf
# dhtadm \fB-C\fR
.fi
.in -2
.sp

.LP
\fBExample 2\fR Adding a Symbol Definition
.sp
.LP
The following command adds a
.B Vendor
option symbol definition for a
new symbol called
.B MySym
to the
.B dhcptab
table in the
\fBSUNWfiles\fR resource in the \fB/var/mydhcp\fR directory:

.sp
.in +2
.nf
# dhtadm \fB-A\fR \fB-s\fR MySym
   \fB-d\fR 'Vendor=SUNW.PCW.LAN,20,IP,1,0'
   \fB-r\fR SUNWfiles \fB-p\fR /var/mydhcp
.fi
.in -2
.sp

.LP
\fBExample 3\fR Adding a Macro Definition
.sp
.LP
The following command adds the
.B aruba
macro definition to the
\fBdhcptab\fR table. Note that symbol/value pairs are bracketed with colons
(\fB:\fR).

.sp
.in +2
.nf
# dhtadm \fB-A\fR \fB-m\fR aruba \e
     \fB-d\fR ':Timeserv=10.0.0.10 10.0.0.11:DNSserv=10.0.0.1:'
.fi
.in -2
.sp

.LP
\fBExample 4\fR Modifying a Macro Definition
.sp
.LP
The following command modifies the
.B Locale
macro definition, setting
the value of the \fBUTCOffst\fR symbol to 18000 seconds. Note that any macro
definition which includes the definition of the
.B Locale
macro inherits
this change.

.sp
.in +2
.nf
# dhtadm \fB-M\fR \fB-m\fR Locale \fB-e\fR 'UTCOffst=18000'
.fi
.in -2
.sp

.LP
\fBExample 5\fR Deleting a Symbol
.sp
.LP
The following command deletes the
.B Timeserv
symbol from the
\fBaruba\fR macro. Any macro definition which includes the definition of the
\fBaruba\fR macro inherits this change.

.sp
.in +2
.nf
# dhtadm \fB-M\fR \fB-m\fR aruba \fB-e\fR 'Timeserv='
.fi
.in -2
.sp

.LP
\fBExample 6\fR Adding a Symbol to a Macro
.sp
.LP
The following command adds the
.B Hostname
symbol to the
.BR aruba
macro. Note that the
.B Hostname
symbol takes no value, and thus requires
the special value
.BR _NULL_VALUE_ .
Note also that any macro definition
which includes the definition of the
.B aruba
macro inherits this
change.

.sp
.in +2
.nf
# dhtadm \fB-M\fR \fB-m\fR aruba \fB-e\fR 'Hostname=_NULL_VALUE_'
.fi
.in -2
.sp

.LP
\fBExample 7\fR Renaming a Macro
.sp
.LP
The following command renames the
.B Locale
macro to
.BR MyLocale .
Note that any
.B Include
statements in macro definitions which include
the
.B Locale
macro also need to be changed.

.sp
.in +2
.nf
# dhtadm \fB-M\fR \fB-m\fR Locale \fB-n\fR MyLocale
.fi
.in -2
.sp

.LP
\fBExample 8\fR Deleting a Symbol Definition
.sp
.LP
The following command deletes the
.B MySym
symbol definition. Note that
any macro definitions which use
.B MySym
needs to be modified.

.sp
.in +2
.nf
# dhtadm \fB-D\fR \fB-s\fR MySym
.fi
.in -2
.sp

.LP
\fBExample 9\fR Removing a dhcptab
.sp
.LP
The following command removes the
.B dhcptab
table in the NIS+ directory
specified.

.sp
.in +2
.nf
# dhtadm \fB-R\fR \fB-r\fR SUNWnisplus \fB-p\fR Test.Nis.Plus.
.fi
.in -2
.sp

.LP
\fBExample 10\fR Printing a dhcptab
.sp
.LP
The following command prints to standard output the contents of the
\fBdhcptab\fR that is located in the data store and path indicated in the
\fBdhcpsvc.conf\fR file:.

.sp
.in +2
.nf
# dhtadm \fB-P\fR
.fi
.in -2
.sp

.LP
\fBExample 11\fR Executing dhtadm in Batch Mode
.sp
.LP
The following command runs a series of
.B dhtadm
commands contained in a
batch file and signals the daemon to reload the
.B dhcptab
once the
commands have been executed: :

.sp
.in +2
.nf
# dhtadm -B addmacros -g
.fi
.in -2
.sp

.SH EXIT STATUS
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 6n
.rt
Successful completion.
.RE

.sp
.ne 2
.mk
.na
.B 1
.ad
.RS 6n
.rt
Object already exists.
.RE

.sp
.ne 2
.mk
.na
.B 2
.ad
.RS 6n
.rt
Object does not exist.
.RE

.sp
.ne 2
.mk
.na
.B 3
.ad
.RS 6n
.rt
Non-critical error.
.RE

.sp
.ne 2
.mk
.na
.B 4
.ad
.RS 6n
.rt
Critical error.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
\fB/etc/inet/dhcpsvc.conf\fR
.ad
.RS 27n
.rt

.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
\fBATTRIBUTE TYPE\fR\fBATTRIBUTE VALUE\fR
_
AvailabilitySUNWdhcsu
_
Interface StabilityEvolving
.TE

.SH SEE ALSO
.sp
.LP
\fBdhcpconfig\fR(1M), \fBdhcpmgr\fR(1M), \fBin.dhcpd\fR(1M),
.BR dhcpsvc.conf (4),
.BR dhcp_network (4),
.BR dhcptab (4),
.BR hosts (4),
.BR user_attr (4),
.BR attributes (5),
.BR dhcp (5),
\fBdhcp_modules\fR(5)\fBrbac\fR(5)
.sp
.LP
\fR
.sp
.LP
\fR
.sp
.LP
Alexander, S., and R. Droms, \fIDHCP Options and BOOTP Vendor
Extensions\fR, RFC 1533, Lachman Technology, Inc., Bucknell University,
October 1993.
.sp
.LP
Droms, R.,
.IR "Interoperation Between DHCP and BOOTP" ,
RFC 1534, Bucknell
University, October 1993.
.sp
.LP
Droms, R.,
.IR "Dynamic Host Configuration Protocol" ,
RFC 1541, Bucknell
University, October 1993.
.sp
.LP
Wimer, W.,
.IR "Clarifications and Extensions for the Bootstrap Protocol" ,
RFC 1542, Carnegie Mellon University, October 1993.
