usr/src/man/man1m/dlmgmtd.1m
'\" te
.\" Copyright (c) 2008, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH dlmgmtd 1M "30 Jul 2008" "SunOS 5.11" "System Administration Commands"
.SH NAME
dlmgmtd \- datalink management daemon
.SH SYNOPSIS
.LP
.nf
\fB/sbin/dlmgmtd\fR
.fi

.LP
.nf
svc:/network/datalink-management:default
.fi

.SH DESCRIPTION
.sp
.LP
.B dlmgmtd
is a system daemon that handles administrative events for
network datalink interfaces. It is controlled through the service management
facility (SMF) service instance:
.sp
.in +2
.nf
svc:/network/datalink-management:default
.fi
.in -2
.sp

.sp
.LP
The daemon should not be invoked directly. It does not constitute an
administrative nor a programming interface. The administrative interface for
managing datalinks is
.BR dladm (1M).
.SH OPTIONS
.sp
.LP
The daemon has no options.
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsr
_
Interface StabilityPrivate
.TE

.SH SEE ALSO
.sp
.LP
.BR dladm (1M),
.BR attributes (5)
