usr/src/man/man1m/dminfo.1m
'\" te
.\" Copyright (c) 1993, Sun Microsystems, Inc.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH dminfo 1M "16 Apr 2008" "SunOS 5.11" "System Administration Commands"
.SH NAME
dminfo \- report information about a device entry in a device maps file
.SH SYNOPSIS
.LP
.nf
\fBdminfo\fR [\fB-v\fR] [\fB-a\fR] [\fB-f\fR \fIpathname\fR]
.fi

.LP
.nf
\fBdminfo\fR [\fB-v\fR] [\fB-a\fR] [\fB-f\fR \fIpathname\fR] \fB-n\fR \fIdev\fR \fB-\fIname\fR...
.fi

.LP
.nf
\fBdminfo\fR [\fB-v\fR] [\fB-a\fR] [\fB-f\fR \fIpathname\fR] \fB-d\fR \fIdev\fR \fB-\fIpath\fR...
.fi

.LP
.nf
\fBdminfo\fR [\fB-v\fR] [\fB-a\fR] [\fB-f\fR \fIpathname\fR] \fB-t\fR \fIdev\fR \fB-\fItype\fR...
.fi

.LP
.nf
\fBdminfo\fR [\fB-v\fR] [\fB-f\fR \fIpathname\fR] \fB-u\fR \fIdm\fR -\fIentry\fR
.fi

.SH DESCRIPTION
.sp
.LP
.B dminfo
reports and updates information about the
.BR device_maps (4)
file.
.SH OPTIONS
.sp
.LP
The following options are supported
.sp
.ne 2
.mk
.na
.B -a
.ad
.RS 18n
.rt
Succeed if any of the requested entries are found. If used with
.BR -v ,
all entries that match the requested case(s) are printed.
.RE

.sp
.ne 2
.mk
.na
.B -d
\fIdev\(mipath\fR
.ad
.RS 18n
.rt
Search by \fIdev\(mipath\fR. Search
.BR device_maps (4)
for a device
special pathname in the
.I device_list
field matching the
\fIdev\(mipath\fR argument. This option cannot be used with
.BR -n ,
.B -t
or
.BR -u .
.RE

.sp
.ne 2
.mk
.na
.B -f
.I pathname
.ad
.RS 18n
.rt
Use a device_maps file with
.I pathname
instead of
.BR /etc/security/device_maps .
.RE

.sp
.ne 2
.mk
.na
.B -n
\fIdev\(miname\fR
.ad
.RS 18n
.rt
Search by \fIdev\(miname\fR. Search
.BR device_maps (4)
for a
.I device_name
field matching \fIdev\(miname\fR. This option cannot be
used with
.BR -d ,
.B -t
or
.BR -u .
.RE

.sp
.ne 2
.mk
.na
.B -t
\fIdev\(mitype\fR
.ad
.RS 18n
.rt
Search by \fIdev\(mitype\fR. Search
.BR device_maps (4)
for a
.I device_type
field matching the given \fIdev\(mitype\fR. This option
cannot be used with
.BR -d ,
.B -n
or
.BR -u .
.RE

.sp
.ne 2
.mk
.na
.B -u
\fIdm\(mientry\fR
.ad
.RS 18n
.rt
Update the
.BR device_maps (4)
file. This option is provided to add
entries to the
.BR device_maps (4)
file. The \fIdm\(mientry\fR must be a
complete
.BR device_maps (4)
file entry. The \fIdm\(mientry\fR has fields,
as in the
.B device_maps
file. It uses the colon
.RB ( : )
as a field
separator, and white space as the
.I device_list
subfield separators. The
\fIdm\(mientry\fR is not made if any fields are missing, or if the
\fIdm\(mientry\fR would be a duplicate. The default device maps file can be
updated only by the super user.
.RE

.sp
.ne 2
.mk
.na
.B -v
.ad
.RS 18n
.rt
Verbose. Print the requested entry or entries, one line per entry, on the
standard output. If no entries are specified, all are printed.
.RE

.SH EXIT STATUS
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 5n
.rt
Successful completion.
.RE

.sp
.ne 2
.mk
.na
.B 1
.ad
.RS 5n
.rt
Request failed.
.RE

.sp
.ne 2
.mk
.na
.B 2
.ad
.RS 5n
.rt
Incorrect syntax.
.RE

.SH FILES
.sp
.LP
.B /etc/security/device_maps
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.sp
.LP
.BR bsmconv (1M),
.BR device_maps (4),
.BR attributes (5)
.SH NOTES
.sp
.LP
The functionality described in this man page is available only if the
Solaris Auditing feature has been enabled.  See
.BR bsmconv (1M)
for more
information.
