usr/src/man/man1m/domainname.1m
'\" te
.\" Copyright (c) 2004, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" Copyright 1989 AT&T
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH domainname 1M "8 Mar 2006" "SunOS 5.11" "System Administration Commands"
.SH NAME
domainname \- set or display name of the current domain
.SH SYNOPSIS
.LP
.nf
\fBdomainname\fR [\fIname-of-domain\fR]
.fi

.SH DESCRIPTION
.sp
.LP
Without an argument,
.B domainname
displays the name of the current domain
name used in RPC exchanges, usually referred to as the NIS or NIS+ domain name.
This name typically encompasses a group of
.B hosts
or
.B passwd
entries
under the same administration. The
.B domainname
command is used by various
components of Solaris to resolve names for entries such as are found in
.BR passwd ,
.B hosts
and
.BR aliases .
By default, naming services such as
.B NIS
and
.B NIS+
use
.B domainname
to resolve names.
.sp
.LP
With appropriate privileges (root or an equivalent role [see \fBrbac\fR(5)]),
you can set the name of the domain by specifying the name as an argument to the
.B domainname
command.
.sp
.LP
The domain name for various naming services can also be set by other means. For
example,
.B ypinit
can be used to specify a different domain for all
.B NIS
calls. The domain name of the machine is usually set during boot time
through the
.B domainname
command by the
.BR svc:/system/identity:domain
service. If the new domain name is not saved in the \fB/etc/defaultdomain\fR
file, the machine reverts to the old domain after it reboots.
.sp
.LP
The \fBsendmail\fR(1M) daemon, as shipped with Solaris, and the \fBsendmail\fR
implementation provided by \fBsendmail.org\fR (formerly referred to as "Berkeley
8.x sendmail") both attempt to determine a local host's fully qualified host
name at startup and both pursue follow-up actions if the initial search fails.
It is in these follow-up actions that the two implementations differ.
.sp
.LP
Both implementations use a standard Solaris or Unix system call to determine
its fully qualified host name at startup, following the name service priorities
specified in
.BR nsswitch.conf (4).
To this point, the Solaris and
.B sendmail.org
versions behave identically.
.sp
.LP
If the request for a fully qualified host name fails, the \fBsendmail.org\fR
.B sendmail
sleeps for 60 seconds, tries again, and, upon continuing failure,
resorts to a short name. The Solaris version of
.B sendmail
makes the same
initial request, but then, following initial failure, calls
.BR domainname .
If
successful, the sleep is avoided.
.sp
.LP
On a Solaris machine, if you run the
.B sendmail.org
version of sendmail,
you get the startup behavior (omitting the
.B domainname
call) described
above. If you run the Solaris
.BR sendmail ,
the
.B domainname
call is made
if needed.
.sp
.LP
If the Solaris
.B sendmail
cannot determine the fully qualified host name,
use \fBcheck-hostname\fR(1M) as a troubleshooting aid. This script can offer
guidance as to appropriate corrective action.
.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/defaultdomain
.ad
.RS 22n
.rt

.RE

.sp
.ne 2
.mk
.na
.B /etc/nsswitch.conf
.ad
.RS 22n
.rt

.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.sp
.LP
.BR NIS+ (1),
.BR nischown (1),
.BR nispasswd (1),
.BR svcs (1),
.BR check-hostname (1M),
.BR hostconfig (1M),
.BR named (1M),
.BR nisaddcred (1M),
.BR sendmail (1M),
.BR svcadm (1M),
.BR ypinit (1M),
.BR sys-unconfig (1M),
.BR aliases (4),
.BR defaultdomain (4),
.BR hosts (4),
.BR nsswitch.conf (4),
.BR passwd (4),
.BR attributes (5),
.BR rbac (5),
.BR smf (5)
.SH NOTES
.sp
.LP
The
.B domainname
service is managed by the service management facility,
.BR smf (5),
under the service identifier:
.sp
.in +2
.nf
svc:/system/identity:domain
.fi
.in -2
.sp

.sp
.LP
Administrative actions on this service, such as enabling, disabling, or
requesting restart, can be performed using
.BR svcadm (1M).
The service's
status can be queried using the
.BR svcs (1)
command.
