usr/src/man/man1m/drvconfig.1m
'\" te
.\" Copyright (c) 2002 Sun Microsystems, Inc. All
.\" Rights Reserved.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH drvconfig 1M "9 Aug 2004" "SunOS 5.11" "System Administration Commands"
.SH NAME
drvconfig \- apply permission and ownership changes to devices
.SH SYNOPSIS
.LP
.nf
\fBdrvconfig\fR [\fB-bn\fR] [\fB-a\fR \fIalias_name\fR] [\fB-c\fR \fIclass_name\fR]
     [\fB-i\fR \fIdrivername\fR] [\fB-m\fR \fImajor_num\fR] [\fB-r\fR \fIroot_dir\fR]
.fi

.SH DESCRIPTION
.sp
.LP
.BR devfsadm (1M)
is now the preferred command and should be used instead
of
.BR drvconfig .
.sp
.LP
The default operation of
.B drvconfig
is to apply permission and
ownership changes to devices. Normally, this command is run automatically
after a new driver has been installed (with
.BR add_drv (1M))
and the
system has been rebooted.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB-a\fIalias_name\fR
.ad
.RS 16n
.rt
Add the name
.I alias_name
to the list of aliases that this driver is
known by. This option, if used, must be used with the \fB-m\fR
.IR major_num ,
the
.B -b
and the
.B -i
.I drivername
options.
.RE

.sp
.ne 2
.mk
.na
.B -b
.ad
.RS 16n
.rt
Add a new major number to name binding into the kernel's internal
.B name_to_major
tables. This option is not normally used directly, but
is used by other utilities such as \fBadd_drv\fR(1M). Use of the \fB-b\fR
option requires that
.B -i
and
.B -m
.RB "be used also. No" " /devices"
entries are created.
.RE

.sp
.ne 2
.mk
.na
\fB-c\fIclass_name\fR
.ad
.RS 16n
.rt
The driver being added to the system exports the class
.IR class_name .
This option is not normally used directly, but is used by other utilities.
It is only effective when used with the
.B -b
option.
.RE

.sp
.ne 2
.mk
.na
\fB-i\fIdrivername\fR
.ad
.RS 16n
.rt
Only configure the devices for the named driver. The following options are
used by the implementation of
.BR add_drv "(1M) and"
.BR rem_drv (1M),
and
may not be supported in future versions of Solaris:
.RE

.sp
.ne 2
.mk
.na
\fB-m\fImajor_num\fR
.ad
.RS 16n
.rt
Specify the major number
.I major_num
for this driver to add to the
kernel's
.B name_to_major
binding tables.
.RE

.sp
.ne 2
.mk
.na
.B -n
.ad
.RS 16n
.rt
Do not try to load and attach any drivers, or if the
.B -i
option is
given, do not try to attach the driver named
.IR drivername .
.RE

.sp
.ne 2
.mk
.na
\fB-r\fIroot_dir\fR
.ad
.RS 16n
.rt
Perform operations under
.IR root_dir ,
rather than directly under
.BR root .
.RE

.SH EXIT STATUS
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 12n
.rt
Successful completion.
.RE

.sp
.ne 2
.mk
.na
.B non-zero
.ad
.RS 12n
.rt
An error occurred.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B /devices
.ad
.RS 23n
.rt
Device nodes directory
.RE

.sp
.ne 2
.mk
.na
.B /etc/minor_perm
.ad
.RS 23n
.rt
Minor mode permissions
.RE

.sp
.ne 2
.mk
.na
.B /etc/name_to_major
.ad
.RS 23n
.rt
Major number binding
.RE

.sp
.ne 2
.mk
.na
.B /etc/driver_classes
.ad
.RS 23n
.rt
Driver class binding file
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.sp
.LP
.BR sh (1),
.BR add_drv (1M),
.BR modinfo (1M),
.BR modload (1M),
.BR modunload (1M),
.BR rem_drv (1M),
.BR update_drv (1M),
.BR path_to_inst (4),
.BR attributes (5),
.BR devfs (7FS)
