usr/src/man/man1m/dsbitmap.1m
'\" te
.\" Copyright (c) 2007, Sun Microsystems, Inc.  All rights reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH dsbitmap 1M "2 Oct 2007" "SunOS 5.11" "System Administration Commands"
.SH NAME
dsbitmap \- size Availability Suite bitmap volumes
.SH SYNOPSIS
.LP
.nf
\fBdsbitmap\fR \fB-h\fR
.fi

.LP
.nf
\fBdsbitmap\fR \fB-p\fR \fIdata_volume\fR [\fIbitmap_volume\fR]
.fi

.LP
.nf
\fBdsbitmap\fR \fB-r\fR \fIdata_volume\fR [\fIbitmap_volume\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The
.B dsbitmap
command calculates the size of the Availability Suite
bitmap volume required for use with the specified data volume.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -h
.ad
.sp .6
.RS 4n
Prints the usage message for the
.B dsbitmap
command
.RE

.sp
.ne 2
.mk
.na
\fB-p\fR \fIdata_volume\fR \fB[\fIbitmap_volume\fR]\fR
.ad
.sp .6
.RS 4n
For the given
.IR data_volume ,
.B dsbitmap
calculates and display the
required size for the associated Availability Suite Point in Time bitmap
volume. The bitmap volume sizes for all possible Availability Suite Point in
Time set configurations are displayed. These configurations include
Independent shadow, Full size dependent shadow, and Compact dependent
shadow. If the optional
.I bitmap_volume
argument is supplied,
.B dsbitmap
determines if this volume is large enough to be used as the
bitmap volume for
.IR data_volume .
.RE

.sp
.ne 2
.mk
.na
\fB-r\fR \fIdata_volume\fR \fB[\fIbitmap_volume\fR]\fR
.ad
.sp .6
.RS 4n
For the given
.IR data_volume ,
.B dsbitmap
calculates and displays the
required size for the associated Availability Suite Remote Mirror bitmap
volume. The bitmap volume sizes for all possible Availability Suite Remote
Mirror set configurations are displayed. These configurations include Sync
replication, Async replication with memory queue, disk queue and 32 bit
refcount. If the optional
.I bitmap_volume
argument is supplied,
.B dsbitmap
determines if this volume is large enough to be used as the
bitmap volume for
.IR data_volume .
.RE

.SH USAGE
.sp
.LP
.B dsbitmap
is typically used by the system administrator during the
initial stages of configuring Sun StorageTek Availability Suite software in
order to determine the required bitmap volume sizes, and then to check if
the bitmap volumes that have been created are suitable.
.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 13n
.rt
Successful completion. If the name of a bitmap volume was specified, that
volume is sufficiently large for all potential uses.
.RE

.sp
.ne 2
.mk
.na
.B 1
.ad
.RS 13n
.rt
An error occurred.
.RE

.sp
.ne 2
.mk
.na
.B 2
.ad
.RS 13n
.rt
An invalid option was supplied on the command line.
.RE

.sp
.ne 2
.mk
.na
.B 3
.ad
.RS 13n
.rt
The specified bitmap volume is not large enough to be used as an
Availability Suite Remote Mirror bitmap for an asynchronous set with a disk
queue, but is large enough to be used for all other Remote Mirror set
configurations.
.RE

.sp
.ne 2
.mk
.na
.B 4
.ad
.RS 13n
.rt
The specified bitmap volume is not large enough to be used as an
Availability Suite Remote Mirror bitmap for any Remote Mirror set
configuration.
.RE

.sp
.ne 2
.mk
.na
.B 5
.ad
.RS 13n
.rt
The specified bitmap volume is not large enough to be used as an
Availability Suite Remote Mirror bitmap for any Remote Mirror set
configuration.
.RE

.sp
.ne 2
.mk
.na
.B 6
.ad
.RS 13n
.rt
The specified bitmap volume is not large enough to be used as an
Availability Suite Point in Time bitmap for a compact dependent shadow, but
is large enough to be used for all other Point in Time set configurations.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWscmr, SUNWscmu
_
Interface StabilityEvolving
.TE

.SH SEE ALSO
.sp
.LP
.BR iiadm (1M),
.BR sndradm (1M),
.BR attributes (5)
