usr/src/man/man1m/dscfgadm.1m
'\" te
.\" Copyright (c) 2007, Sun Microsystems, Inc.  All rights reserved.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH dscfgadm 1M "2 Oct 2007" "SunOS 5.11" "System Administration Commands"
.SH NAME
dscfgadm \- administration command for the Availability Suite configuration
location and services
.SH SYNOPSIS
.LP
.nf
\fBdscfgadm\fR \fB-i\fR
.fi

.LP
.nf
\fBdscfgadm\fR \fB-e\fR [\fB-r\fR] [\fB-p\fR]
.fi

.LP
.nf
\fBdscfgadm\fR \fB-d\fR [\fB-r\fR]
.fi

.LP
.nf
\fBdscfgadm\fR \fB-s\fR
.fi

.SH DESCRIPTION
.sp
.LP
The \fBdscfgadm\fR command controls the Availability Suite configuration
location and services by providing facilities to set the configuration
location, and to enable and disable the Availability Suite services.
.SH OPTIONS
.sp
.LP
If you do not specify any arguments to a \fBdscfgadm\fR command, the
utility interactively steps you through setting the configuration location
and starting the services. The configuration location is validated to ensure
it meets criteria such as size and file type before it is initialized for
use.
.sp
.LP
The \fBdscfgadm\fR command supports the following options.
.sp
.ne 2
.mk
.na
\fB-d\fR [\fB-r\fR ]\fR
.ad
.sp .6
.RS 4n
Disables the Availability Suite SMF services. This includes stopping
daemons and suspending any Point-in-Time Copy or Remote Mirror sets that are
currently enabled under the Availability Suite software. When executed with
no additional options, the
.B -d
option disables all Availability Suite
services. This setting is persistent across system boots.
.sp
.ne 2
.mk
.na
.B -r
.ad
.sp .6
.RS 4n
When passed to the
.B -d
or
.B -e
option, acts only on the Remote
Mirror services.
.RE

.RE

.sp
.ne 2
.mk
.na
\fB-e\fR [\fB-r\fR ] [\fB-p\fR]\fR
.ad
.sp .6
.RS 4n
Enables the Availability Suite SMF services. This includes starting daemons
and resuming any Point-in-Time Copy or Remote Mirror sets that have been
previously configured under the Availability Suite software. When executed
with no additional options, the
.B -e
option enables all Availability
Suite services. This setting is persistent across system boots.
.sp
.ne 2
.mk
.na
.B -r
.ad
.sp .6
.RS 4n
When passed to the
.B -d
or
.B -e
option, acts only on the Remote
Mirror services.
.RE

.sp
.ne 2
.mk
.na
.B -p
.ad
.sp .6
.RS 4n
When passed to the
.B -e
option, enables only the Point-in-Time Copy
service.
.RE

.RE

.sp
.ne 2
.mk
.na
.B -i
.ad
.sp .6
.RS 4n
Displays information on the Availability Suite SMF services.
.RE

.sp
.ne 2
.mk
.na
.B -s
.ad
.sp .6
.RS 4n
Allows you to set the location of the configuration database containing
information specific to Sun Cluster configurations.
.RE

.sp
.ne 2
.mk
.na
.B -x
.ad
.sp .6
.RS 4n
Displays verbose debugging information as the program is executing.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWscmr, SUNWscmu
_
Interface StabilityEvolving
.TE

.SH SEE ALSO
.sp
.LP
\fBdscfg\fR(1M), \fBiiadm\fR(1M), \fBscmadm\fR(1M), \fBsndradm\fR(1M),
.BR svadm (1M),
.BR attributes (5)
