usr/src/man/man1m/dscfglockd.1m
'\" te
.\" Copyright (c) 2007, Sun Microsystems, Inc.  All rights reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH dscfglockd 1M "2 Oct 2007" "SunOS 5.11" "System Administration Commands"
.SH NAME
dscfglockd \- Availability Suite Services lock daemon
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/dscfglockd\fR [\fB-e\fR \fIprogram\fR | \fB-f\fR \fIfile\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The
.B dscfglockd
daemon coordinates StorageTek configuration database
lock requests between nodes within a cluster.
.SH OPTIONS
.sp
.LP
The
.B dscfglockd
supports the following options:
.sp
.ne 2
.mk
.na
.B -e
.I program
.ad
.sp .6
.RS 4n
Executes the script and arguments in
.IR program .
The executable and any
arguments it needs must be supplied with suitable quoting as a single
argument to this option. This argument is processed by
.BR sh (1).
.RE

.sp
.ne 2
.mk
.na
.B -f
.I file
.ad
.sp .6
.RS 4n
Reads the list of names for peer hosts from
.IR file .
.RE

.sp
.LP
If no arguments are specified,
.B dscfglockd
acts as a local lock
daemon, but coordinates lock requests with any other daemons that might
contact the local host as part of their own configuration process.
.SH EXIT STATUS
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 13n
.rt
Daemon started successfully.
.RE

.sp
.ne 2
.mk
.na
.B >0
.ad
.RS 13n
.rt
Daemon failed to start.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B /lib/svc/method/svc-scm
.ad
.sp .6
.RS 4n
Shell script for starting and stopping
.BR dscfglockd .
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWscmr, SUNWscmu
_
Interface StabilityEvolving
.TE

.SH SEE ALSO
.sp
.LP
.BR sh (1),
.BR attributes (5)
