usr/src/man/man1m/dscfg.1m
'\" te
.\" Copyright (c) 2007, Sun Microsystems, Inc.  All rights reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH dscfg 1M "2 Oct 2007" "SunOS 5.11" "System Administration Commands"
.SH NAME
dscfg \- configuration tool for Sun StorageTek Availability Suite
software
.SH SYNOPSIS
.LP
.nf
\fBdscfg\fR
.fi

.LP
.nf
\fBdscfg\fR \fB-L\fR
.fi

.LP
.nf
\fBdscfg\fR \fB-h\fR
.fi

.LP
.nf
\fBdscfg\fR [\fB-C\fR \fIgroup\fR]
.fi

.LP
.nf
\fBdscfg\fR [\fB-C\fR \fIgroup\fR] \fB-i\fR [\fB-p\fR \fIparser_config_file\fR]
.fi

.LP
.nf
\fBdscfg\fR [\fB-C\fR \fIgroup\fR] \fB-a\fR \fIconfig_file\fR
.fi

.LP
.nf
\fBdscfg\fR [\fB-C\fR \fIgroup\fR] [\fB-l\fR]
.fi

.LP
.nf
\fBdscfg\fR [\fB-C\fR \fIgroup\fR] [\fB-l\fR] \fB-s\fR \fIconfig_location\fR
.fi

.LP
.nf
\fBdscfg\fR \fB-D\fR \fIdgname\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B dscfg
command controls the Availability Suite configuration by
providing facilities to initialize, list, format, restore the configuration
database.
.SH OPTIONS
.sp
.LP
If no options are specified,
.B dscfg
displays the current local
configuration location. The
.B dscfg
command supports the following
options:
.sp
.ne 2
.mk
.na
.B -L
.ad
.sp .6
.RS 4n
Displays the status of the lock controlling access to the configuration
database. If the configuration database is locked, the type of lock (read or
write) is displayed along with the process id of the process that holds the
lock.
.RE

.sp
.ne 2
.mk
.na
.B -h
.ad
.sp .6
.RS 4n
Displays the usage message for the
.B dscfg
command.
.RE

.sp
.ne 2
.mk
.na
.B -i
.ad
.sp .6
.RS 4n
Initializes the configuration database. As it deletes previous or current
configuration information, this option prompts you to confirm the deletion
before proceeding.
.RE

.sp
.ne 2
.mk
.na
.B -p
.I parser_config_file
.ad
.sp .6
.RS 4n
When used with the
.B -i
option,
.B dscfg
loads the parser
configuration file into the persistent configuration, it reformats the
configuration database.
.RE

.sp
.ne 2
.mk
.na
.B -a
.I config_file
.ad
.sp .6
.RS 4n
Restore the specified
.I config_file
into the configuration. This option
does not do any error checking of the file. Use of this option invalidates
the configuration file.
.RE

.sp
.ne 2
.mk
.na
.B -l
.ad
.sp .6
.RS 4n
Lists the contents of current configuration database in a format that is
suitable for the
.B -a
.RB "option. When used in combination with the" " -s"
option, it displays the contents stored in the location passed to the
.B -s
option, but does not set the configuration location.
.RE

.sp
.LP
The options below are for Sun Cluster-configured systems only.
.I group
can be either Sun Cluster device group or as '-' as local devices.
.sp
.ne 2
.mk
.na
.B -C
.I group
.ad
.sp .6
.RS 4n
Display the location of cluster configuration database.
.RE

.sp
.ne 2
.mk
.na
\fB-C\fR\ \fIgroup\fR\ \fB-i\fR
.ad
.sp .6
.RS 4n
Initializes the configuration database entries that only associated with
group specified. As it deletes previous or current configuration
information, this options prompts you to confirm the deletion before
proceeding.
.RE

.sp
.ne 2
.mk
.na
\fB-C\fR\ \fIgroup\fR\ \fB-p\fR\ \fIparser_config_file\fR
.ad
.sp .6
.RS 4n
When used with the
.B -i
option,
.B dscfg
loads the parser
configuration file into the persistent configuration, it reformats the
configuration database entries that only associated with group specified.
.RE

.sp
.ne 2
.mk
.na
\fB-C\fR\ \fIgroup\fR\ \fB-a\fR\ \fIconfig_file\fR
.ad
.sp .6
.RS 4n
Restore the specified
.I config_file
into the configuration database
entries that only associated with group specified.  This option does not do
any error checking of the file. Use of this option invalidates the
configuration file.
.RE

.sp
.ne 2
.mk
.na
\fB-C\fR\ \fIgroup\fR\ \fB-l\fR
.ad
.sp .6
.RS 4n
Lists the contents of current configuration database that is associated
with resource group specified.
.RE

.sp
.ne 2
.mk
.na
\fB-C\fR\ \fIgroup\fR\ \fB-s\fR\ \fIconfig_file_location\fR
.ad
.sp .6
.RS 4n
Specifies where the Sun Cluster configuration database resides, the
location has to be DID device.
.RE

.sp
.ne 2
.mk
.na
.B -D
.I device_group
.ad
.sp .6
.RS 4n
Checks whether the specified
.I device_group
is known by Sun Cluster and
whether it is available on this node. It displays a information that
indicates the device group's status and return values are as follows,
.sp
(use echo $? to retrieve the return value):
.sp
.ne 2
.mk
.na
.B 1
.ad
.RS 13n
.rt
Device group is in Sun Cluster and is active on this node;
.RE

.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 13n
.rt
Device group is in Sun Cluster but active on another node;
.RE

.sp
.ne 2
.mk
.na
.B -1
.ad
.RS 13n
.rt
Device group is not in Sun Cluster.
.RE

.RE

.SH USAGE
.sp
.LP
The
.B dscfg
command is typically run from other scripts, such as
package installation scripts, and from
.BR dscfgadm (1M).
It is not
intended for general use. For uses of
.B dscfg
not covered by
.BR dscfgadm ,
please refer to the \fIAvailability Suite Troubleshooting Guide\fR.
.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/dscfg_format
.ad
.sp .6
.RS 4n
parser configuration file
.RE

.sp
.ne 2
.mk
.na
.B /etc/dscfg_local
.ad
.sp .6
.RS 4n
configuration location for all entries with no cluster tags
.RE

.sp
.ne 2
.mk
.na
.B /etc/dscfg_cluster
.ad
.sp .6
.RS 4n
reference file specifying the location of the Sun Cluster configuration
database.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWscmr, SUNWscmu
_
Interface StabilityEvolving
.TE

.SH SEE ALSO
.sp
.LP
.BR dscfgadm (1M),
.BR iiadm (1M),
.BR scmadm (1M),
.BR sndradm (1M),
.BR svadm (1M),
.BR ds.log (4),
.BR attributes (5)
