usr/src/man/man1m/dsstat.1m
'\" te
.\" Copyright (c) 2007, Sun Microsystems, Inc.  All rights reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH dsstat 1M "2 Oct 2007" "SunOS 5.11" "System Administration Commands"
.SH NAME
dsstat \- report Sun StorageTek Availability Suite I/O statistics
.SH SYNOPSIS
.LP
.nf
\fBdsstat\fR \fB-m\fR \fImode\fR [\fB-r\fR \fIreport-options\fR] [\fB-d\fR \fIdisplay-options\fR]
 [\fB-s\fR \fIvolume-sets\fR] [\fB-f\fR | \fB-F\fR] [\fB-z\fR] [\fIinterval\fR [\fIcount\fR]]
.fi

.SH DESCRIPTION
.sp
.LP
The
.B dsstat
command collects and reports I/O statistics for the Sun
StorageTek Availability Suite products.
.SH OPTIONS
.sp
.LP
The
.B dsstat
supports the following options:
.sp
.ne 2
.mk
.na
.B -m
.I mode
.ad
.sp .6
.RS 4n
Specifies the mode(s) of operation. Valid modes are:
.sp
.ne 2
.mk
.na
.B cache
.ad
.sp .6
.RS 4n
Cache statistics
.RE

.sp
.ne 2
.mk
.na
.B ii
.ad
.sp .6
.RS 4n
Point-in-Time Copy statistics
.RE

.sp
.ne 2
.mk
.na
.B sndr
.ad
.sp .6
.RS 4n
Remote Mirror statistics
.RE

To display statistics for multiple services simultaneously, use the \fB-m\fR
switch to specify each of the modes required. For example:
.sp
.in +2
.nf
% \fBdsstat -m ii -m sndr\fR
% \fBdsstat -m ii -m sndr -m cache\fR
.fi
.in -2
.sp

To determine which statistics are being reported from which service, use the
.I role
field, described below. When cache statistics are requested as one
of the multiple services, the
.B rkps
and
.B wkps
statistics is further
divided into
.BR crkps ,
.BR drkps ,
.BR cwkps ,
and
.BR dwkps .
If no
.B -m
switch is specified, then
.B dsstat
displays default statistics
for all of the valid modes as described above. See "Field Descriptions," below
for descriptions of these fields.
.RE

.sp
.ne 2
.mk
.na
.B -r
.I report-options
.ad
.sp .6
.RS 4n
Specifies the volume components to be displayed. Each item is represented by
a single character, and multiple items can be selected. The
.I report-options
vary based on the mode(s) specified above. This option is
not used for
.B cache
mode.
.sp
Valid
.I report-options
for
.B ii
mode are:
.sp
.ne 2
.mk
.na
.B m
.ad
.RS 13n
.rt
Master volume statistics.
.RS +4
.TP
.ie t \(bu
.el o
For the "report-options for ii mode": \fBm\fR, \fBs\fR, \fBb\fR, \fBo\fR
.RE
.RS +4
.TP
.ie t \(bu
.el o
For the "report-options for sndr mode": \fBb\fR, \fBn\fR
.RE
.RS +4
.TP
.ie t \(bu
.el o
For the "display-options for cache mode": \fBr\fR, \fBw\fR, \fBd\fR, \fBc\fR,
.BR s ,
.B f
.RE
.RS +4
.TP
.ie t \(bu
.el o
For the "display-options for ii mode": \fBr\fR, \fBw\fR, \fBt\fR, \fBs\fR,
.BR p ,
.B f
.RE
.RE

.sp
.ne 2
.mk
.na
.B s
.ad
.RS 13n
.rt
Shadow volume statistics.
.RE

.sp
.ne 2
.mk
.na
.B b
.ad
.RS 13n
.rt
Bitmap volume statistics.
.RE

.sp
.ne 2
.mk
.na
.B o
.ad
.RS 13n
.rt
Overflow volume statistics, if attached.
.RE

Valid
.I report-options
for
.B sndr
mode are:
.sp
.ne 2
.mk
.na
.B b
.ad
.RS 13n
.rt
Bitmap volume statistics.
.RE

.sp
.ne 2
.mk
.na
.B n
.ad
.RS 13n
.rt
Network volume statistics.
.RE

.RE

.sp
.ne 2
.mk
.na
.B -d
.I display-options
.ad
.sp .6
.RS 4n
Specifies the statistics to be displayed. The types of statistics are
represented by a single character; multiple types can be specified.
.sp
For
.B cache
mode, the valid
.I display-options
are:
.sp
.ne 2
.mk
.na
.B r
.ad
.RS 13n
.rt
Detailed read statistics.
.RE

.sp
.ne 2
.mk
.na
.B w
.ad
.RS 13n
.rt
Detailed write statistics.
.RE

.sp
.ne 2
.mk
.na
.B s
.ad
.RS 13n
.rt
Summary statistics.
.RE

.sp
.ne 2
.mk
.na
.B f
.ad
.RS 13n
.rt
Cache behavior flags.
.RE

The following
.I display-options
are available only for cache mode, they
need to be combined with the mode options (\fB-m\fR)
.sp
.ne 2
.mk
.na
.B d
.ad
.RS 13n
.rt
Destaged data statistics.
.RE

.sp
.ne 2
.mk
.na
.B c
.ad
.RS 13n
.rt
Write cancellation statistics.
.RE

The default
.I display-options
for
.B cache
are
.BR sf .
.sp
For
.B ii
mode, the valid
.I display-options
are:
.sp
.ne 2
.mk
.na
.B r
.ad
.sp .6
.RS 4n
Detailed read statistics.
.RE

.sp
.ne 2
.mk
.na
.B w
.ad
.sp .6
.RS 4n
Detailed write statistics.
.RE

.sp
.ne 2
.mk
.na
.B t
.ad
.sp .6
.RS 4n
Timing statistics.
.RE

.sp
.ne 2
.mk
.na
.B s
.ad
.sp .6
.RS 4n
Summary statistics.
.RE

.sp
.ne 2
.mk
.na
.B p
.ad
.sp .6
.RS 4n
Percentage of volume requiring sync.
.RE

.sp
.ne 2
.mk
.na
.B f
.ad
.sp .6
.RS 4n
Volume type/status flags.
.RE

The default
.I display-options
for
.B ii
are
.BR spf .
For
.BR sndr
mode, the valid
.I display-options
are:
.sp
.ne 2
.mk
.na
.B r
.ad
.RS 13n
.rt
Detailed read statistics.
.RE

.sp
.ne 2
.mk
.na
.B w
.ad
.RS 13n
.rt
Detailed write statistics.
.RE

.sp
.ne 2
.mk
.na
.B t
.ad
.RS 13n
.rt
Timing statistics.
.RE

.sp
.ne 2
.mk
.na
.B s
.ad
.RS 13n
.rt
Summary statistics.
.RE

.sp
.ne 2
.mk
.na
.B p
.ad
.RS 13n
.rt
Percentage of volume requiring sync.
.RE

.sp
.ne 2
.mk
.na
.B f
.ad
.RS 13n
.rt
Volume type/status flags.
.RE

.sp
.ne 2
.mk
.na
.B q
.ad
.RS 13n
.rt
Asynchronous queue statistics.
.RE

The following
.I display-option
is only available for
.B sndr
mode, and
needs to be combined with the mode options
.RB ( -m ).
.sp
.ne 2
.mk
.na
.B q
.ad
.RS 13n
.rt
Asynchronous queue statistics.
.RE

The default
.I display-options
for
.B sndr
are
.BR spf .
.sp
Specifying the summary
.I display-option
causes
.B "r w"
.B t
.I display-options
to be ignored.
.RE

.sp
.ne 2
.mk
.na
.B -s
.I volume-sets
.ad
.RS 20n
.rt
Filters the output to include only the specified
.IR volume-sets ,
where
.I volume-sets
is a comma-delimited list of volume names. When displaying
Remote Mirror statistics, the name specified is compared to the Remote Mirror
primary volume to determine if they match. Additionally, an Remote Mirror
volume should be specified as \fI<host>\fR:\fI<volume>\fR where \fI<host>\fR
is the primary or secondary host and
.I <volume>
is the volume name by
which that host recognizes the volume set. When specifying multiple Remote
Mirror volumes sets, be aware that each volume set specified is evaluated
individually, using the rules above. When displaying Point-in-Time Copy
statistics, the volume name specified is compared to the Point-in-Time Copy
shadow volume to determine if they match.
.RE

.sp
.ne 2
.mk
.na
.B -f
.ad
.RS 20n
.rt
Output field headers at every reporting cycle.
.RE

.sp
.ne 2
.mk
.na
.B -F
.ad
.RS 20n
.rt
Output field headers once, when reporting begins.
.RE

.sp
.ne 2
.mk
.na
.B -z
.ad
.RS 20n
.rt
Suppress report lines that have zero values or no activity.
.RE

.SH OPERANDS
.sp
.LP
The
.B dsstat
command line supports the following operands:
.sp
.ne 2
.mk
.na
.I interval
.ad
.sp .6
.RS 4n
Specifies the
.I interval
for each report, in seconds. If no
.I interval
is specified, a single report with a one second \fIinterval\fR
is output.
.sp
Due to the varying number of entries in a given set and the varying number of
sets, header information might appear in the middle of a set being reported.
To avoid this, use the
.B -f
or
.B -F
options to display the header
information at the desired time.
.RE

.sp
.ne 2
.mk
.na
.I count
.ad
.sp .6
.RS 4n
Specifies the number of reports to generate. If no
.I count
is specified,
output continues until interrupted.
.RE

.SS "Field Descriptions"
.sp
.LP
Unless otherwise specified, all fields are per-second averages based on the
data collected during the specified
.IR interval .
.sp
.ne 2
.mk
.na
.B name
.ad
.RS 13n
.rt
Name of the entity being reported
.RE

.sp
.ne 2
.mk
.na
.B t
.ad
.RS 13n
.rt
Volume type
.RE

.sp
.ne 2
.mk
.na
.B s
.ad
.RS 13n
.rt
Volume status
.RE

.sp
.ne 2
.mk
.na
.B r
.ad
.RS 13n
.rt
Cache read behavior
.RE

.sp
.ne 2
.mk
.na
.B w
.ad
.RS 13n
.rt
Cache write behavior
.RE

.sp
.ne 2
.mk
.na
.B pct
.ad
.RS 13n
.rt
Percentage of volume requiring sync
.RE

.sp
.ne 2
.mk
.na
.B role
.ad
.RS 13n
.rt
Role of the item being reported
.RE

.sp
.ne 2
.mk
.na
.B tps
.ad
.RS 13n
.rt
Total number of reads + writes
.RE

.sp
.ne 2
.mk
.na
.B rtps
.ad
.RS 13n
.rt
Number of reads
.RE

.sp
.ne 2
.mk
.na
.B wtps
.ad
.RS 13n
.rt
Number of writes
.RE

.sp
.ne 2
.mk
.na
.B kps
.ad
.RS 13n
.rt
Total kilobytes read + written
.RE

.sp
.ne 2
.mk
.na
.B rkps
.ad
.RS 13n
.rt
Kilobytes read
.RE

.sp
.ne 2
.mk
.na
.B wkps
.ad
.RS 13n
.rt
Kilobytes written
.RE

.sp
.ne 2
.mk
.na
.B crkps
.ad
.RS 13n
.rt
Kilobytes read from cache
.RE

.sp
.ne 2
.mk
.na
.B drkps
.ad
.RS 13n
.rt
Kilobytes read from disk
.RE

.sp
.ne 2
.mk
.na
.B cwkps
.ad
.RS 13n
.rt
Kilobytes written to cache
.RE

.sp
.ne 2
.mk
.na
.B dwkps
.ad
.RS 13n
.rt
Kilobytes written to disk
.RE

.sp
.ne 2
.mk
.na
.B ckps
.ad
.RS 13n
.rt
Kilobytes transferred to or from cache
.RE

.sp
.ne 2
.mk
.na
.B dkps
.ad
.RS 13n
.rt
Kilobytes transferred to or from disk
.RE

.sp
.ne 2
.mk
.na
.B svt
.ad
.RS 13n
.rt
Service time per operation
.RE

.sp
.ne 2
.mk
.na
.B hit
.ad
.RS 13n
.rt
Read hits during
.IR interval
.RE

.sp
.ne 2
.mk
.na
.B ds/s
.ad
.RS 13n
.rt
Kilobytes destaged from cache
.RE

.sp
.ne 2
.mk
.na
.B cn/s
.ad
.RS 13n
.rt
Number of write cancellations
.RE

.sp
.ne 2
.mk
.na
.B q
.ad
.RS 13n
.rt
Type of asynchronous queuing being used
.RE

.sp
.ne 2
.mk
.na
.B qi
.ad
.RS 13n
.rt
Number of items currently queued
.RE

.sp
.ne 2
.mk
.na
.B qk
.ad
.RS 13n
.rt
Kilobytes currently queued
.RE

.sp
.ne 2
.mk
.na
.B qhwi
.ad
.RS 13n
.rt
High water mark of queued items
.RE

.sp
.ne 2
.mk
.na
.B qhwk
.ad
.RS 13n
.rt
High water mark of queued kilobytes
.RE

.sp
.LP
The
.B name
field displays only the last 16 characters of the name.
.sp
.LP
Valid cache behaviors for
.B cache
are:
.sp
.ne 2
.mk
.na
.B C
.ad
.RS 13n
.rt
Cache reads/writes
.RE

.sp
.ne 2
.mk
.na
.B D
.ad
.RS 13n
.rt
Disk reads/writes
.RE

.sp
.LP
Valid volume types for
.B ii
are:
.sp
.ne 2
.mk
.na
.B I
.ad
.RS 13n
.rt
Independent shadow volume
.RE

.sp
.ne 2
.mk
.na
.B D
.ad
.RS 13n
.rt
Dependent shadow volume
.RE

.sp
.LP
Valid volume status for
.B ii
is:
.sp
.ne 2
.mk
.na
.B C
.ad
.RS 13n
.rt
Copy in progress
.RE

.sp
.ne 2
.mk
.na
.B -
.ad
.RS 13n
.rt
No copy in progress
.RE

.sp
.LP
Valid volume types for
.B sndr
are:
.sp
.ne 2
.mk
.na
.B P
.ad
.RS 13n
.rt
This is the primary host of this volume set
.RE

.sp
.ne 2
.mk
.na
.B S
.ad
.RS 13n
.rt
This is the secondary host of this volume set
.RE

.sp
.LP
Valid volume status for
.B sndr
is:
.sp
.ne 2
.mk
.na
.B L
.ad
.RS 13n
.rt
Changes to this volume are being logged
.RE

.sp
.ne 2
.mk
.na
.B Q
.ad
.RS 13n
.rt
Volume are in queuing mode
.RE

.sp
.ne 2
.mk
.na
.B R
.ad
.RS 13n
.rt
Replicating changes to secondary
.RE

.sp
.ne 2
.mk
.na
.B SY
.ad
.RS 13n
.rt
Synchronization in progress. Sending data.
.RE

.sp
.ne 2
.mk
.na
.B RS
.ad
.RS 13n
.rt
Reverse synchronization in progress. Receiving data.
.RE

.sp
.ne 2
.mk
.na
.B SN
.ad
.RS 13n
.rt
Synchronization needed
.RE

.sp
.ne 2
.mk
.na
.B RN
.ad
.RS 13n
.rt
Reverse synchronization needed
.RE

.sp
.ne 2
.mk
.na
.B VF
.ad
.RS 13n
.rt
Volume failed
.RE

.sp
.ne 2
.mk
.na
.B BF
.ad
.RS 13n
.rt
Bitmap failed
.RE

.sp
.ne 2
.mk
.na
.B QF
.ad
.RS 13n
.rt
Queue failed
.RE

.sp
.LP
Valid queue types for
.B sndr
are:
.sp
.ne 2
.mk
.na
.B D
.ad
.RS 13n
.rt
Disk-based queuing enabled
.RE

.sp
.ne 2
.mk
.na
.B M
.ad
.RS 13n
.rt
Memory-based queuing enabled
.RE

.sp
.LP
Volume roles for
.B sndr
are:
.sp
.ne 2
.mk
.na
.B net
.ad
.RS 13n
.rt
Network volume statistics
.RE

.sp
.ne 2
.mk
.na
.B bmp
.ad
.RS 13n
.rt
Bitmap volume statistics
.RE

.sp
.LP
Volume roles for
.B ii
are:
.sp
.ne 2
.mk
.na
.B mst
.ad
.RS 13n
.rt
Master volume statistics
.RE

.sp
.ne 2
.mk
.na
.B shd
.ad
.RS 13n
.rt
Shadow volume statistics
.RE

.sp
.ne 2
.mk
.na
.B bmp
.ad
.RS 13n
.rt
Bitmap volume statistics
.RE

.sp
.ne 2
.mk
.na
.B ovr
.ad
.RS 13n
.rt
Overflow volume statistics
.RE

.SH EXAMPLES
.LP
.B Example 1
Report Cache Statistics
.sp
.LP
The following example shows the display of Report Cache statistics, with
detailed breakdowns of read and writes to cache/disk. Reports are generated at
five second intervals. Reporting is limited to the set
.BR /dev/rdsk/c1t1d0s0 .

.sp
.in +2
.nf
 # dsstat -m cache -d rw -s /dev/rdsk/c1t1d0s0 5
- read -             - write -
name                ckps   dkps    hit   ckps   dkps    hit
dev/rdsk/c1t1d0s0      0      0   0.00      0      0   0.00
dev/rdsk/c1t1d0s0      3   2396   0.13    983    763 100.00
dev/rdsk/c1t1d0s0   2399    799  75.00   2815   2686 100.00
dev/rdsk/c1t1d0s0   3200    800  80.00   2755   2908 100.00
dev/rdsk/c1t1d0s0   3999    799  83.33   2809   2868 100.00
dev/rdsk/c1t1d0s0   4800    800  85.71   2867   2931 100.00
.fi
.in -2

.LP
.B Example 2
Report Master, Shadow and Bitmap Statistics
.sp
.LP
Report master, shadow and bitmap statistics for Point-in-Time Copy, using
default output. Generate reports at two second intervals.

.sp
.in +2
.nf
# dsstat -m ii -r msb 2
name               t  s    pct role    kps   tps  svt
dev/rdsk/c0t1d0s5  I  C  96.15  mst  19921    38   22
dev/rdsk/c0t1d0s6               shd   9960    19   20
dev/rdsk/c0t1d0s7               bmp     39    77    2
dev/rdsk/c0t1d0s5  I  C  94.24  mst  19623    38   22
dev/rdsk/c0t1d0s6               shd   9939    19   20
dev/rdsk/c0t1d0s7               bmp     39    77    2
dev/rdsk/c0t1d0s5  I  C  92.34  mst  19969    39   22
dev/rdsk/c0t1d0s6               shd   9984    19   20
dev/rdsk/c0t1d0s7               bmp     39    78    2
.fi
.in -2

.LP
.B Example 3
Report Network Statistics for Remote Mirror
.sp
.LP
Report network statistics for Remote Mirror, using detailed read, write
statistics. Report includes volume type/status flags and percentages. Generate
reports at two second intervals. Limit reporting to the set
.BR /dev/rdsk/c0t1d0s0 .

.sp
.in +2
.nf
# dsstat -m sndr -r n -d rwpf -s /dev/rdsk/c0t1d0s0 2
name               t  s    pct role   rkps  rtps   wkps  wtps
dev/rdsk/c0t1d0s0  P  L 100.00  sec      0     0      0     0
dev/rdsk/c0t1d0s0  P SY  99.90  sec      0     0    288     9
dev/rdsk/c0t1d0s0  P SY  97.90  sec      0     0   5296   165
dev/rdsk/c0t1d0s0  P SY  95.81  sec      0     0   5184   161
dev/rdsk/c0t1d0s0  P SY  93.81  sec      0     0   5280   164
dev/rdsk/c0t1d0s0  P SY  91.71  sec      0     0   5198   162
.fi
.in -2

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 13n
.rt
Successful completion.
.RE

.sp
.ne 2
.mk
.na
.B 1
.ad
.RS 13n
.rt
Successful completion, no statistics to report.
.RE

.sp
.ne 2
.mk
.na
.B 2
.ad
.RS 13n
.rt
An invalid argument has been encountered.
.RE

.sp
.ne 2
.mk
.na
.B 3
.ad
.RS 13n
.rt
No memory is available to create
.B kstat
statistics.
.RE

.sp
.ne 2
.mk
.na
.B 4
.ad
.RS 13n
.rt
An unknown error has occurred.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWscmr, SUNWscmu
_
Interface StabilityEvolving
.TE

.SH SEE ALSO
.sp
.LP
.BR dscfg (1M),
.BR svadm (1M),
.BR ds.log (4),
.BR rdc.cf (4),
.BR attributes (5)
