usr/src/man/man1m/dumpadm.1m
'\" te
.\" Copyright (c) 2008, Sun Microsystems, Inc. All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH dumpadm 1M "10 Apr 2008" "SunOS 5.11" "System Administration Commands"
.SH NAME
dumpadm \- configure operating system crash dump
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/dumpadm\fR [\fB-nuy\fR] [\fB-c\fR \fIcontent-type\fR] [\fB-d\fR \fIdump-device\fR]
     [\fB-m\fR \fImin\fRk | \fImin\fRm | \fImin\fR%] [\fB-s\fR \fIsavecore-dir\fR]
     [\fB-r\fR \fIroot-dir\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The
.B dumpadm
program is an administrative command that manages the
configuration of the operating system crash dump facility. A crash dump is a
disk copy of the physical memory of the computer at the time of a fatal
system error. When a fatal operating system error occurs, a message
describing the error is printed to the console. The operating system then
generates a crash dump by writing the contents of physical memory to a
predetermined dump device, which is typically a local disk partition. The
dump device can be configured by way of
.BR dumpadm .
Once the crash dump
has been written to the dump device, the system will reboot.
.sp
.LP
Fatal operating system errors can be caused by bugs in the operating
system, its associated device drivers and loadable modules, or by faulty
hardware. Whatever the cause, the crash dump itself provides invaluable
information to your support engineer to aid in diagnosing the problem. As
such, it is vital that the crash dump be retrieved and given to your support
provider. Following an operating system crash, the
.BR savecore (1M)
utility is executed automatically during boot to retrieve the crash dump
from the dump device, and write it to a pair of files in your file system
named
.I unix.X
and
.IR vmcore.X ,
where X is an integer identifying the
dump. Together, these data files form the
.IR "saved crash dump" .
The
directory in which the crash dump is saved on reboot can also be configured
using
.BR dumpadm .
.sp
.LP
For systems with a UFS root file system, the default dump device is
configured to be an appropriate swap partition. Swap partitions are disk
partitions reserved as virtual memory backing store for the operating
system. Thus, no permanent information resides in swap to be overwritten by
the dump. See \fBswap\fR(1M). For systems with a ZFS root file system,
dedicated ZFS volumes are used for swap and dump areas. For further
information about setting up a dump area with ZFS,  see the \fIZFS
Administration Guide\fR. To view the current dump  configuration, use the
.B dumpadm
command with no arguments:
.sp
.in +2
.nf
example# \fBdumpadm\fR

      Dump content: kernel pages
       Dump device: /dev/dsk/c0t0d0s1 (swap)
Savecore directory: /var/crash/saturn
  Savecore enabled: yes
.fi
.in -2
.sp

.sp
.LP
When no options are specified,
.B dumpadm
prints the current crash dump
configuration. The example shows the set of default values: the dump content
is set to kernel memory pages only, the dump device is a swap disk
partition, the directory for
.B savecore
files is set to
.B /var/crash/hostname,
and
.B savecore
is set to run
automatically on reboot.
.sp
.LP
When one or more options are specified,
.B dumpadm
verifies that your
changes are valid, and if so, reconfigures the crash dump parameters and
displays the resulting configuration. You must be
.B root
to view or
change dump parameters.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -c
.I content-type
.ad
.sp .6
.RS 4n
Modify the dump configuration so that the crash dump consists of the
specified dump content. The content should be one of the following:
.sp
.ne 2
.mk
.na
.B kernel
.ad
.sp .6
.RS 4n
Kernel memory pages only.
.RE

.sp
.ne 2
.mk
.na
.B all
.ad
.sp .6
.RS 4n
All memory pages.
.RE

.sp
.ne 2
.mk
.na
.B curproc
.ad
.sp .6
.RS 4n
Kernel memory pages, and the memory pages of the process whose thread was
currently executing on the CPU on which the crash dump was initiated. If the
thread executing on that CPU is a kernel thread not associated with any user
process, only kernel pages will be dumped.
.RE

.RE

.sp
.ne 2
.mk
.na
.B -d
.I dump-device
.ad
.sp .6
.RS 4n
Modify the dump configuration to use the specified dump device. The dump
device may one of the following:
.sp
.ne 2
.mk
.na
.I dump-device
.ad
.sp .6
.RS 4n
A specific dump device specified as an absolute pathname, such as
\fB/dev/dsk/\fIcNtNdNsN\fR when the system is running a UFS root file
system. Or, specify a ZFS volume, such as
.BR /dev/zvol/dsk/rpool/dump ,
when the system is running a ZFS root file system.
.RE

.sp
.ne 2
.mk
.na
.B swap
.ad
.sp .6
.RS 4n
If the special token
.B swap
is specified as the dump device,
.B dumpadm
examines the  active swap entries and selects the most
appropriate entry to configure as the dump device. See \fBswap\fR(1M). Refer
to the
.B NOTES
below for details of the algorithm  used to select an
appropriate swap entry. When the system is first installed with a UFS root
file system,
.B dumpadm
uses the value for
.B swap
to determine the
initial dump device setting. A given ZFS volume cannot be configured for
both the swap area and the dump device.
.RE

.RE

.sp
.ne 2
.mk
.na
\fB-m\fR \fImin\fBk\fR | \fImin\fBm\fR | \fImin\fB%\fR
.ad
.sp .6
.RS 4n
Create a
.B minfree
file in the current savecore directory indicating
that
.B savecore
should maintain at least the specified amount of free
space in the file system where the savecore directory is located. The
.B min
argument can be one of the following:
.sp
.ne 2
.mk
.na
.B k
.ad
.sp .6
.RS 4n
A positive integer suffixed with the unit
.B k
specifying kilobytes.
.RE

.sp
.ne 2
.mk
.na
.B m
.ad
.sp .6
.RS 4n
A positive integer suffixed with the unit
.B m
specifying megabytes.
.RE

.sp
.ne 2
.mk
.na
.B %
.ad
.sp .6
.RS 4n
A % symbol, indicating that the
.B minfree
value should be computed as
the specified percentage of the total current size of the file system
containing the savecore directory.
.RE

The
.B savecore
command will consult the
.B minfree
file, if present,
prior to writing the dump files. If the size of these files would decrease
the amount of free disk space below the
.B minfree
threshold, no dump
files are written and an error message is logged. The administrator should
immediately clean up the savecore directory to provide adequate free space,
and re-execute the
.B savecore
command manually. The administrator can
also specify an alternate directory on the
.B savecore
command-line.
.RE

.sp
.ne 2
.mk
.na
.B -n
.ad
.sp .6
.RS 4n
Modify the dump configuration to not run
.B savecore
automatically on
reboot. This is not the recommended system configuration; if the dump device
is a swap partition, the dump data will be overwritten as the system begins
to swap. If
.B savecore
is not executed shortly after boot, crash dump
retrieval may not be possible.
.RE

.sp
.ne 2
.mk
.na
.B -r
.I root-dir
.ad
.sp .6
.RS 4n
Specify an alternate root directory relative to which
.B dumpadm
should
create files. If no
.B -r
argument is specified, the default root
directory
.B /
is used.
.RE

.sp
.ne 2
.mk
.na
.B -s
.I savecore-dir
.ad
.sp .6
.RS 4n
Modify the dump configuration to use the specified directory to save files
written by
.BR savecore .
The directory should be an absolute path and
exist on the system. If upon reboot the directory does not exist, it will be
created prior to the execution of
.BR savecore .
See the
.BR NOTES
section below for a discussion of security issues relating to access to the
savecore directory. The default savecore directory is
\fB/var/crash/\fIhostname\fR where \fIhostname\fR is the output of the
.B -n
option to the
.BR uname (1)
command.
.RE

.sp
.ne 2
.mk
.na
.B -u
.ad
.sp .6
.RS 4n
Forcibly update the kernel dump configuration based on the contents of
.BR /etc/dumpadm.conf .
Normally this option is used only on reboot when
starting
.BR svc:/system/dumpadm:default ,
when the
.B dumpadm
settings
from the previous boot must be restored. Your dump configuration is saved in
the configuration file for this purpose. If the configuration file is
missing or contains invalid values for any dump properties, the default
values are substituted. Following the update, the configuration file is
resynchronized with the kernel dump configuration.
.RE

.sp
.ne 2
.mk
.na
.B -y
.ad
.sp .6
.RS 4n
Modify the dump configuration to automatically run
.B savecore
on
reboot. This is the default for this dump setting.
.RE

.SH EXAMPLES
.LP
.B Example 1
Reconfiguring The Dump Device To A Dedicated Dump Device:
.sp
.LP
The following command reconfigures the dump device to a dedicated dump
device:

.sp
.in +2
.nf
example# dumpadm -d /dev/dsk/c0t2d0s2

           Dump content: kernel pages
            Dump device: /dev/dsk/c0t2d0s2 (dedicated)
     Savecore directory: /var/crash/saturn
       Savecore enabled: yes
.fi
.in -2
.sp

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.sp .6
.RS 4n
Dump configuration is valid and the specified modifications, if any, were
made successfully.
.RE

.sp
.ne 2
.mk
.na
.B 1
.ad
.sp .6
.RS 4n
A fatal error occurred in either obtaining or modifying the dump
configuration.
.RE

.sp
.ne 2
.mk
.na
.B 2
.ad
.sp .6
.RS 4n
Invalid command line options were specified.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B /dev/dump
.ad
.sp .6
.RS 4n
Dump device.
.RE

.sp
.ne 2
.mk
.na
.B /etc/dumpadm.conf
.ad
.sp .6
.RS 4n
Contains configuration parameters for
.BR dumpadm .
Modifiable only
through that command.
.RE

.sp
.ne 2
.mk
.na
\fIsavecore-directory\fB/minfree\fR
.ad
.sp .6
.RS 4n
Contains minimum amount of free space for
.IR savecore-directory .
See
.BR savecore (1M).
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsr
.TE

.SH SEE ALSO
.sp
.LP
.BR svcs (1),
.BR uname (1),
.BR savecore (1M),
.BR svcadm (1M),
.BR swap (1M),
.BR attributes (5),
.BR smf (5)
.SH NOTES
.sp
.LP
The system crash dump service is managed by the service management
facility,
.BR smf (5),
under the service identifier:
.sp
.in +2
.nf
svc:/system/dumpadm:default
.fi
.in -2
.sp

.sp
.LP
Administrative actions on this service, such as enabling, disabling, or
requesting restart, can be performed using
.BR svcadm (1M).
The service's
status can be queried using the
.BR svcs (1)
command.
.SS "Dump Device Selection"
.sp
.LP
When the special
.B swap
token is specified as the argument to
.B dumpadm -d
the utility will attempt to configure the most
appropriate swap device as the dump device.
.B dumpadm
configures the
largest swap block device as the dump device; if no block devices are
available for swap, the largest swap entry is configured as the dump device.
If no swap entries are present, or none can be configured as the dump
device, a warning message will be displayed. While local and remote swap
files can be configured as the dump device, this is not recommended.
.SS "Dump Device/Swap Device Interaction (UFS File Systems Only)"
.sp
.LP
In the event that the dump device is also a swap device, and the swap
device is deleted by the administrator using the
.BR "swap -d"
command, the
.B swap
command will automatically invoke
.BR dumpadm
.B -d swap
in order to attempt to configure another appropriate
swap device as the dump device. If no swap devices remain or none can be
configured as the dump device, the crash dump will be disabled and a warning
message will be displayed. Similarly, if the crash dump is disabled and the
administrator adds a new swap device using the
.B "swap -a"
command,
.B "dumpadm -d"
.B swap
will be invoked to re-enable the crash
dump using the new swap device.
.sp
.LP
Once
.B "dumpadm -d"
.B swap
has been issued, the new dump device
is stored in the configuration file for subsequent reboots. If a larger or
more appropriate swap device is added by the administrator, the dump device
.RB "is not changed; the administrator must re-execute" " dumpadm -d"
.B swap
to reselect the most appropriate device fom the new list of swap
devices.
.SS "Minimum Free Space"
.sp
.LP
If the
.B "dumpadm -m"
option is used to create a
.B minfree
file
based on a percentage of the total size of the file system containing the
savecore directory, this value is not automatically recomputed if the file
system subsequently changes size.  In this case, the administrator must
re-execute
.B "dumpadm -m"
to recompute the
.B minfree
value. If
no such file exists in the savecore directory,
.B savecore
will default
to a free space threshold of one megabyte. If no free space threshold is
desired, a minfree file containing size 0 can be created.
.SS "Security Issues"
.sp
.LP
If, upon reboot, the specified savecore directory is not present, it will
be created prior to the execution of
.B savecore
with permissions 0700
(read, write, execute by owner only) and owner
.BR root .
It is recommended
that alternate savecore directories also be created with similar
permissions, as the operating system crash dump files themselves may contain
secure information.
