usr/src/man/man1m/edquota.1m
'\" te
.\" Copyright 1989 AT&T  Copyright (c) 2003 Sun Microsystems, Inc.  All Rights Reserved.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH edquota 1M "14 Feb 2003" "SunOS 5.11" "System Administration Commands"
.SH NAME
edquota \- edit user quotas for ufs file system
.SH SYNOPSIS
.LP
.nf
\fBedquota\fR [\fB-p\fR \fIproto_user\fR] \fIusername\fR...
.fi

.LP
.nf
\fBedquota\fR \fB-t\fR
.fi

.SH DESCRIPTION
.sp
.LP
.B edquota
is a quota editor.  One or more users may be specified on the
command line. For each user a temporary file is created with an \fBASCII\fR
representation of the current disk quotas for that user for each mounted ufs
file system that has a
.B quotas
file, and an editor is then invoked on
the file. The quotas may then be modified, new quotas added, etc. Upon
leaving the editor,
.B edquota
reads the temporary file and modifies the
binary quota files to reflect the changes made.
.sp
.LP
The editor invoked is
.BR vi (1)
unless the
.B EDITOR
environment
variable specifies otherwise.
.sp
.LP
Only the super-user may edit quotas.  In order for quotas to be established
on a file system, the root directory of the file system must contain a file,
owned by root, called
.BR quotas .
(See
.BR quotaon (1M).)
.sp
.LP
.I proto_user
and
.I username
can be numeric, corresponding to the
.B UID
of a user. Unassigned UIDs may be specified; unassigned names may
not. In this way, default quotas can be established for users who are later
assigned a UID.
.sp
.LP
If no options are specified, the temporary file created will have one or
more lines of the format, where a block is considered to be a 1024 byte (1K)
block:
.sp
.in +2
.nf
fs\fI mount_point\fR blocks (soft =\fInumber\fR, \e
     hard =\fInumber\fR ) inodes (soft =\fInumber\fR, \e
     hard =\fInumber\fR)
.fi
.in -2
.sp

.sp
.LP
The
.I number
fields may be modified to reflect desired values.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -p
.ad
.RS 6n
.rt
Duplicate the quotas of the
.I proto_user
specified for each
.I username
specified. This is the normal mechanism used to initialize
quotas for groups of users.
.RE

.sp
.ne 2
.mk
.na
.B -t
.ad
.RS 6n
.rt
Edit the soft time limits for each file system. If the time limits are
zero, the default time limits in
.B /usr/include/sys/fs/ufs_quota.h
are
used. The temporary file created will have one or more lines of the form
.sp
fs
.I mount_point
blocks time limit =
.IR "number tmunit" ,
files time
.RI "limit =" " number tmunit"
.RE

.sp
.LP
.I tmunit
may be one of ``month'', ``week'', ``day'', ``hour'', ``min''
or ``sec''; characters appended to these keywords are ignored, so you may
write ``months'' or ``minutes'' if you prefer. The
.I number
and\fI tmunit\fR fields may be modified to set desired values. Time limits are
printed in the greatest possible time unit such that the value is greater
than or equal to one. If ``default'' is printed after the
.IR tmunit ,
this
indicates that the value shown is zero (the default).
.SH USAGE
.sp
.LP
See
.BR largefile (5)
for the description of the behavior of
.BR edquota
when encountering files greater than or equal to 2 Gbyte ( 2^31 bytes).
.SH FILES
.sp
.ne 2
.mk
.na
.B quotas
.ad
.RS 15n
.rt
quota file at the file system root
.RE

.sp
.ne 2
.mk
.na
.B /etc/mnttab
.ad
.RS 15n
.rt
table of mounted file systems
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.sp
.LP
.BR vi (1),
.BR quota (1M),
.BR quotacheck (1M),
.BR quotaon (1M),
.BR repquota (1M),
.BR attributes (5),
.BR largefile (5),
.BR quotactl (7I)
.SH NOTES
.sp
.LP
All
.BR UID "s can be assigned quotas."
