usr/src/man/man1m/eeprom.1m
'\" te
.\" Copyright (c) 2004, Sun Microsystems, Inc. All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH eeprom 1M "28 Mar 2007" "SunOS 5.11" "System Administration Commands"
.SH NAME
eeprom \- EEPROM display and load utility
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/eeprom\fR [\fB-\fR] [\fB-f\fR \fIdevice\fR] [\fIparameter\fR[=\fIvalue\fR]]
.fi

.SH DESCRIPTION
.sp
.LP
\fBeeprom\fR displays or changes the values of parameters in the
\fBEEPROM.\fR It processes parameters in the order given. When processing a
\fIparameter\fR accompanied by a
.IR value ,
\fBeeprom\fR makes the
indicated alteration to the
.B EEPROM;
otherwise, it displays the
\fIparameter\fR's value. When given no parameter specifiers, \fBeeprom\fR
displays the values of all
.B EEPROM
parameters. A `\|\(mi\fB\&'\fR
(hyphen) flag specifies that parameters and values are to be read from the
standard input (one \fIparameter\fR or \fIparameter\fB=\fIvalue\fR per
line).
.sp
.LP
Only the super-user may alter the
.B EEPROM
contents.
.sp
.LP
\fBeeprom\fR verifies the \fBEEPROM\fR checksums and complains if they are
incorrect.
.sp
.LP
\fIplatform-name\fR is the name of the platform implementation and can be
found using the
.B -i
option of
.BR uname (1).
.SS "SPARC"
.sp
.LP
\fBSPARC\fR based systems implement firmware password protection with
.BR eeprom ,
using the
.BR security-mode ,
\fBsecurity-password\fR and
\fBsecurity-#badlogins\fR properties.
.SS "x86"
.sp
.LP
\fBEEPROM\fR storage is simulated using a file residing in the
platform-specific boot area. The
.B /boot/solaris/bootenv.rc
file
simulates
.B EEPROM
storage.
.sp
.LP
Because x86 based systems typically implement password protection in the
system
.B BIOS,
there is no support for password protection in the
\fBeeprom\fR program. While it is possible to set the \fBsecurity-mode\fR,
\fBsecurity-password\fR and \fBsecurity-#badlogins\fR properties on x86
based systems, these properties have no special meaning or behavior on x86
based systems.
.SH OPTIONS
.sp
.ne 2
.mk
.na
\fB-f\fR \fIdevice\fR
.ad
.sp .6
.RS 4n
Use
.I device
as the
.B EEPROM
device.
.RE

.SH OPERANDS
.SS "x86 Only"
.sp
.ne 2
.mk
.na
.I acpi-user-options
.ad
.sp .6
.RS 4n
A configuration variable that controls the use of Advanced Configuration
and Power Interface (ACPI), a power management specification. The acceptable
values for this variable depend on the release of the Solaris operating
system you are using.
.sp
For all releases of Solaris 10 and Solaris 11, a value of of \fB0x0\fR
means that there will be an attempt to use ACPI if it is available on the
system. A value of
.B 0x2
disables the use of ACPI.
.sp
For the Solaris 10 1/06 release, a value of
.B 0x8
means that there will
be an attempt to use ACPI in a mode compatible with previous releases of
Solaris 10 if it is available on the system. The default for Solaris 10 1/06
is
.BR 0x8 .
.sp
For releases of Solaris 10 after the 1/06 release and for Solaris 11, the
default is
.BR 0x0 .
.sp
Most users can safely accept the default value, which enables ACPI if
available. If issues related to the use of ACPI are suspected on releases of
Solaris after Solaris 1/06, it is suggested to first try a value of
\fB0x8\fR and then, if you do not obtain satisfactory results, \fB0x02\fR.
.RE

.sp
.ne 2
.mk
.na
.I console
.ad
.sp .6
.RS 4n
Specifies the console device. Possible values are
.BR ttya ,
.BR ttyb ,
and
.BR text .
In
.B text
mode, console output goes to the frame buffer
and input comes from the keyboard. When this property is not present, the
console device falls back to the device specified by
.B input-device
and
.BR output-device .
When neither the console property or the
\fBinput-device\fR and \fBoutput-device\fR property pair are present, the
console defaults to the frame buffer and keyboard.
.RE

.SH NVRAM CONFIGURATION PARAMETERS
.sp
.LP
Not all OpenBoot systems support all parameters. Defaults vary depending on
the system and the \fBPROM\fR revision. See the output in the "Default
Value" column of the \fBprintenv\fR command, as entered at the \fBok\fR
(OpenBoot) prompt, to determine the default for your system.
.sp
.ne 2
.mk
.na
.B auto-boot?
.ad
.sp .6
.RS 4n
If
.BR true ,
boots automatically after power-on or reset. Defaults to
.BR true .
On x86, this parameter is controlled by the grub menu file. See
.BR installgrub (1M).
.RE

.sp
.ne 2
.mk
.na
.B ansi-terminal?
.ad
.sp .6
.RS 4n
Configuration variable used to control the behavior of the terminal
emulator. The value \fBfalse\fR makes the terminal emulator stop
interpreting
.B ANSI
escape sequences; instead, echoes them to the output
device. Defaults to
.BR true .
.RE

.sp
.ne 2
.mk
.na
.B boot-args
.ad
.sp .6
.RS 4n
Holds a string of arguments that are passed to the boot subsystem. For
example, you can use
.B "boot-args=' - install dhcp'"
to request a customer
jumpstart installation. See \fBboot\fR(1M),
.BR kadb (1M)
and
.BR kernel (1M).
.RE

.sp
.ne 2
.mk
.na
.B boot-command
.ad
.sp .6
.RS 4n
Command executed if
.B auto-boot?
is
.BR true .
Defaults to
.BR boot .
.RE

.sp
.ne 2
.mk
.na
.B boot-device
.ad
.sp .6
.RS 4n
Device from which to boot.
.I boot-device
may contain 0 or more device
specifiers separated by spaces. Each device specifier may be either a prom
device alias or a prom device path. The boot prom will attempt to open each
successive device specifier in the list beginning with the first device
specifier. The first device specifier that opens successfully will be used
as the device to boot from. Defaults to
.BR "disk net" .
.RE

.sp
.ne 2
.mk
.na
\fBboot-file\fR
.ad
.sp .6
.RS 4n
File to boot (an empty string lets the secondary booter choose default).
Defaults to empty string.
.RE

.sp
.ne 2
.mk
.na
\fBboot-from\fR
.ad
.sp .6
.RS 4n
Boot device and file (OpenBoot PROM version 1.\fIx\fR only). Defaults to
.BR vmunix .
.RE

.sp
.ne 2
.mk
.na
\fBboot-from-diag\fR
.ad
.sp .6
.RS 4n
Diagnostic boot device and file (OpenBoot PROM version 1.\fIx\fR only).
Defaults to
.BR le(\|)unix .
.RE

.sp
.ne 2
.mk
.na
.B boot-ncpus
.ad
.sp .6
.RS 4n
Configuration variable that controls the number of processors with which
the system should boot. By default, the system boots with maximum supported
number of processors.
.RE

.sp
.ne 2
.mk
.na
\fBcom\fIX\fR-noprobe\fR
.ad
.sp .6
.RS 4n
Where
.I X
is the number of the serial port, prevents device probe on
serial port
.IR X.
.RE

.sp
.ne 2
.mk
.na
.B diag-device
.ad
.sp .6
.RS 4n
Diagnostic boot source device. Defaults to
.BR net .
.RE

.sp
.ne 2
.mk
.na
\fBdiag-file\fR
.ad
.sp .6
.RS 4n
File from which to boot in diagnostic mode. Defaults to empty string.
.RE

.sp
.ne 2
.mk
.na
.B diag-level
.ad
.sp .6
.RS 4n
Diagnostics level. Values include
.BR off ,
.BR min ,
\fBmax\fR and
.BR menus .
There may be additional platform-specific values. When set to
\fBoff\fR, \fBPOST\fR is not called. If \fBPOST\fR is called, the value is
made available as an argument to, and is interpreted by
.B POST.
Defaults
to
.BR platform-dependent .
.RE

.sp
.ne 2
.mk
.na
.B diag-switch?
.ad
.sp .6
.RS 4n
If
.BR true ,
run in diagnostic mode. Defaults to \fBfalse\fR on most
desktop systems,
.B true
on most servers.
.RE

.sp
.ne 2
.mk
.na
.B error-reset-recovery
.ad
.sp .6
.RS 4n
Recover after an error reset trap. Defaults to platform-specific setting.
.sp
On platforms supporting this variable, it replaces the
.BR watchdog-reboot? ,
.BR watchdog-sync? ,
.BR redmode-reboot? ,
.BR redmode-sync? ,
.BR sir-sync? ,
and
.B xir-sync?
parameters.
.sp
The options are:
.sp
.ne 2
.mk
.na
.B none
.ad
.sp .6
.RS 4n
Print a message describing the reset trap and go to OpenBoot PROM's user
interface,
.B "aka OK"
prompt.
.RE

.sp
.ne 2
.mk
.na
.B sync
.ad
.sp .6
.RS 4n
Invoke OpenBoot PROM's
.B sync
word after the reset trap. Some platforms
may treat this as
.B none
after an externally initiated reset (\fBXIR\fR)
trap.
.RE

.sp
.ne 2
.mk
.na
.B boot
.ad
.sp .6
.RS 4n
Reboot after the reset trap. Some platforms may treat this as \fBnone\fR
after an
.B XIR
trap.
.RE

.RE

.sp
.ne 2
.mk
.na
\fBfcode-debug?\fR
.ad
.sp .6
.RS 4n
If
.BR true ,
include name parameter for plug-in device FCodes. Defaults
to
.BR false .
.RE

.sp
.ne 2
.mk
.na
.B hardware-revision
.ad
.sp .6
.RS 4n
System version information.
.RE

.sp
.ne 2
.mk
.na
.B input-device
.ad
.sp .6
.RS 4n
Input device used at power-on (usually
.BR keyboard ,
.BR ttya ,
or
.BR ttyb ).
Defaults to
.BR keyboard .
.RE

.sp
.ne 2
.mk
.na
.B keyboard-click?
.ad
.sp .6
.RS 4n
If
.BR true ,
enable keyboard click. Defaults to
.BR false .
.RE

.sp
.ne 2
.mk
.na
.B keyboard-layout
.ad
.sp .6
.RS 4n
A string that specifies the layout  name  for non-self-identifying
keyboards (type 7c). Invoke
.B "kbd -s"
to obtain a list  of
acceptable layout names. See
.BR kbd (1).
.RE

.sp
.ne 2
.mk
.na
.B keymap
.ad
.sp .6
.RS 4n
Keymap for custom keyboard.
.RE

.sp
.ne 2
.mk
.na
.B last-hardware-update
.ad
.sp .6
.RS 4n
System update information.
.RE

.sp
.ne 2
.mk
.na
.B load-base
.ad
.sp .6
.RS 4n
Default load address for client programs. Default value is
.BR 16384 .
.RE

.sp
.ne 2
.mk
.na
.B local-mac-address?
.ad
.sp .6
.RS 4n
If true, network drivers use their own MAC address, not the system's.
Defaults to
.BR false .
.RE

.sp
.ne 2
.mk
.na
\fBmfg-mode\fR
.ad
.sp .6
.RS 4n
Manufacturing mode argument for
.B POST.
Possible values include
\fBoff\fR or
.BR chamber .
The value is passed as an argument to
\fBPOST.\fR Defaults to \fBoff\fR.
.RE

.sp
.ne 2
.mk
.na
\fBmfg-switch?\fR
.ad
.sp .6
.RS 4n
If true, repeat system self-tests until interrupted with STOP-A. Defaults
to
.BR false .
.RE

.sp
.ne 2
.mk
.na
.B nvramrc
.ad
.sp .6
.RS 4n
Contents of NVRAMRC. Defaults to empty.
.RE

.sp
.ne 2
.mk
.na
.B network-boot-arguments
.ad
.sp .6
.RS 4n
Arguments to be used by the PROM for network booting. Defaults to an empty
string.
.B network-boot-arguments
can be used to specify the boot
protocol (RARP/DHCP) to be used and a range of system knowledge to be used
in the process.
.sp
The syntax for arguments supported for network booting is:
.sp
.in +2
.nf
[\fIprotocol\fR,] [\fIkey\fR=\fIvalue\fR,]*
.fi
.in -2
.sp

All arguments are optional and can appear in any order. Commas are required
unless the argument is at the end of the list. If specified, an argument
takes precedence over any default values, or, if booting using DHCP, over
configuration information provided by a DHCP server for those parameters.
.sp
.IR protocol ,
above, specifies the address discovery protocol to be
used.
.sp
Configuration parameters, listed below, are specified as
\fIkey\fR=\fIvalue\fR attribute pairs.
.sp
.ne 2
.mk
.na
\fBtftp-server\fR
.ad
.sp .6
.RS 4n
IP address of the TFTP server
.RE

.sp
.ne 2
.mk
.na
\fBfile\fR
.ad
.sp .6
.RS 4n
file to download using TFTP or URL for WAN boot
.RE

.sp
.ne 2
.mk
.na
.B host-ip
.ad
.sp .6
.RS 4n
IP address of the client (in dotted-decimal notation)
.RE

.sp
.ne 2
.mk
.na
.B router-ip
.ad
.sp .6
.RS 4n
IP address of the default router (in dotted-decimal notation)
.RE

.sp
.ne 2
.mk
.na
.B subnet-mask
.ad
.sp .6
.RS 4n
subnet mask (in dotted-decimal notation)
.RE

.sp
.ne 2
.mk
.na
.B client-id
.ad
.sp .6
.RS 4n
DHCP client identifier
.RE

.sp
.ne 2
.mk
.na
.B hostname
.ad
.sp .6
.RS 4n
hostname to use in DHCP transactions
.RE

.sp
.ne 2
.mk
.na
.B http-proxy
.ad
.sp .6
.RS 4n
HTTP proxy server specification (IPADDR[:PORT])
.RE

.sp
.ne 2
.mk
.na
\fBtftp-retries\fR
.ad
.sp .6
.RS 4n
maximum number of TFTP retries
.RE

.sp
.ne 2
.mk
.na
.B dhcp-retries
.ad
.sp .6
.RS 4n
maximum number of DHCP retries
.RE

If no parameters are specified (that is,
.B network-boot-arguments
is an
empty string), the PROM will use the platform-specific default address
discovery protocol.
.sp
Absence of the protocol parameter when other configuration parameters are
specified implies manual configuration.
.sp
Manual configuration requires that the client be provided with all the
information necessary for boot. If using manual configuration, information
required by the PROM to load the second-stage boot program must be provided
in
.B network-boot-arguments
while information required for the
second-stage boot program can be specified either as arguments to the
\fBboot\fR program or by means of the \fBboot\fR program's interactive
command interpreter.
.sp
Information required by the PROM when using manual configuration includes
the booting client's IP address, name of the boot file, and the address of
the server providing the boot file image. Depending on network
configuration, it might be required that the subnet mask and address of the
default router to use also be specified.
.RE

.sp
.ne 2
.mk
.na
.B oem-banner
.ad
.sp .6
.RS 4n
Custom OEM banner (enabled by setting
.B oem-banner?
to
.BR true ).
Defaults to empty string.
.RE

.sp
.ne 2
.mk
.na
.B oem-banner?
.ad
.sp .6
.RS 4n
If
.BR true ,
use custom
.B OEM
banner. Defaults to
.BR false .
.RE

.sp
.ne 2
.mk
.na
.B oem-logo
.ad
.sp .6
.RS 4n
Byte array custom OEM logo (enabled by setting
.B oem-logo?
to
.BR true ).
Displayed in hexadecimal.
.RE

.sp
.ne 2
.mk
.na
.B oem-logo?
.ad
.sp .6
.RS 4n
If
.BR true ,
use custom OEM logo (else, use Sun logo). Defaults to
.BR false .
.RE

.sp
.ne 2
.mk
.na
.B pci-mem64?
.ad
.sp .6
.RS 4n
If true, the OpenBoot PROM allocates 64-bit PCI memory addresses to a PCI
device that can support 64-bit addresses.
.sp
This variable is available on SPARC platforms only and is optional. Some
versions of SunOS do not support PCI
.B MEM64
addresses and will fail in
unexpected ways if the OpenBoot PROM allocates PCI
.B MEM64
addresses.
.sp
The default value is system-dependent. If the variable exists, the default
value is appropriate to the lowest version of the SunOS that shipped with a
specific platform.
.RE

.sp
.ne 2
.mk
.na
.B output-device
.ad
.sp .6
.RS 4n
Output device used at power-on (usually
.BR screen ,
.BR ttya ,
or
.BR ttyb ).
Defaults to
.BR screen .
.RE

.sp
.ne 2
.mk
.na
.B redmode-reboot?
.ad
.sp .6
.RS 4n
Specify
.B true
to reboot after a redmode reset trap. Defaults to
.BR true .
(Sun Enterprise 10000 only.)
.RE

.sp
.ne 2
.mk
.na
.B redmode-sync?
.ad
.sp .6
.RS 4n
Specify
.B true
to invoke OpenBoot PROM's
.B sync
word after a
redmode reset trap. Defaults to
.BR false .
(Sun Enterprise 10000 only.)
.RE

.sp
.ne 2
.mk
.na
.B rootpath
.ad
.sp .6
.RS 4n
Specifies the root device of the operating system.
.RE

.sp
.ne 2
.mk
.na
.B sbus-probe-list
.ad
.sp .6
.RS 4n
Designate which SBus slots are probed and in what order. Defaults to
.BR 0123 .
.RE

.sp
.ne 2
.mk
.na
.B screen-#columns
.ad
.sp .6
.RS 4n
Number of on-screen columns (characters/line). Defaults to
.BR 80 .
.RE

.sp
.ne 2
.mk
.na
.B screen-#rows
.ad
.sp .6
.RS 4n
Number of on-screen rows (lines). Defaults to
.BR 34 .
.RE

.sp
.ne 2
.mk
.na
.B scsi-initiator-id
.ad
.sp .6
.RS 4n
\fBSCSI\fR bus address of host adapter, range 0-7. Defaults to \fB7\fR.
.RE

.sp
.ne 2
.mk
.na
.B sd-targets
.ad
.sp .6
.RS 4n
Map
.B SCSI
disk units (OpenBoot PROM version 1.\fIx\fR only). Defaults
to
.BR 31204567 ,
which means that unit 0 maps to target
.BR 3 ,
unit 1
maps to target
.BR 1 ,
and so on.
.RE

.sp
.ne 2
.mk
.na
.B security-#badlogins
.ad
.sp .6
.RS 4n
Number of incorrect security password attempts.This property has no special
meaning or behavior on x86 based systems.
.RE

.sp
.ne 2
.mk
.na
.B security-mode
.ad
.sp .6
.RS 4n
Firmware security level (options:
.BR none ,
.BR command ,
or
\fBfull\fR). If set to \fBcommand\fR or
.BR full ,
system will prompt for
\fBPROM\fR security password. Defaults to \fBnone\fR.This property has no
special meaning or behavior on x86 based systems.
.RE

.sp
.ne 2
.mk
.na
.B security-password
.ad
.sp .6
.RS 4n
Firmware security password (never displayed). Can be set only when
\fBsecurity-mode\fR is set to \fBcommand\fR or \fBfull\fR.This property has
no special meaning or behavior on x86 based systems.
.sp
.in +2
.nf
example# eeprom security-password=
Changing PROM password:
New password:
Retype new password:
.fi
.in -2
.sp

.RE

.sp
.ne 2
.mk
.na
\fBselftest-#megs\fR
.ad
.sp .6
.RS 4n
Megabytes of
.B RAM
to test. Ignored if
.B diag-switch?
is
.BR true .
Defaults to
.BR 1 .
.RE

.sp
.ne 2
.mk
.na
.B sir-sync?
.ad
.sp .6
.RS 4n
Specify
.B true
to invoke OpenBoot PROM's
.B sync
word after a
software-initiated reset (\fBSIR\fR) trap. Defaults to
.BR false .
(Sun
Enterprise 10000 only.)
.RE

.sp
.ne 2
.mk
.na
.B skip-vme-loopback?
.ad
.sp .6
.RS 4n
If
.BR true ,
POST does not do VMEbus loopback tests. Defaults to
.BR false .
.RE

.sp
.ne 2
.mk
.na
.B st-targets
.ad
.sp .6
.RS 4n
Map
.B SCSI
tape units (OpenBoot PROM version 1.\fIx\fR only). Defaults
to
.BR 45670123 ,
which means that unit 0 maps to target
.BR 4 ,
unit 1
maps to target
.BR 5 ,
and so on.
.RE

.sp
.ne 2
.mk
.na
.B sunmon-compat?
.ad
.sp .6
.RS 4n
If
.BR true ,
display Restricted Monitor prompt (\|>). Defaults to
.BR false .
.RE

.sp
.ne 2
.mk
.na
.B testarea
.ad
.sp .6
.RS 4n
One-byte scratch field, available for read/write test. Defaults to
.BR 0 .
.RE

.sp
.ne 2
.mk
.na
.B tpe-link-test?
.ad
.sp .6
.RS 4n
Enable 10baseT link test for built-in twisted pair Ethernet. Defaults to
.BR true .
.RE

.sp
.ne 2
.mk
.na
.B ttya-mode
.ad
.sp .6
.RS 4n
\fBTTYA\fR (baud rate, #bits, parity, #stop, handshake). Defaults to
.BR 9600,8,n,1,\(mi .
.sp
Fields, in left-to-right order, are:
.sp
.ne 2
.mk
.na
.B Baud rate:
.ad
.sp .6
.RS 4n
110, 300, 1200, 4800, 9600\|.\|.\|.
.RE

.sp
.ne 2
.mk
.na
.B Data bits:
.ad
.sp .6
.RS 4n
5, 6, 7, 8
.RE

.sp
.ne 2
.mk
.na
.B Parity:
.ad
.sp .6
.RS 4n
n(none), e(even), o(odd), m(mark), s(space)
.RE

.sp
.ne 2
.mk
.na
.B Stop bits:
.ad
.sp .6
.RS 4n
1, 1.5, 2
.RE

.sp
.ne 2
.mk
.na
.B Handshake:
.ad
.sp .6
.RS 4n
\(mi(none), h(hardware:rts/cts), s(software:xon/xoff)
.RE

.RE

.sp
.ne 2
.mk
.na
.B ttyb-mode
.ad
.sp .6
.RS 4n
\fBTTYB\fR (baud rate, #bits, parity, #stop, handshake). Defaults to
.BR 9600,8,n,1,\(mi .
.sp
Fields, in left-to-right order, are:
.sp
.ne 2
.mk
.na
.B Baud rate:
.ad
.sp .6
.RS 4n
110, 300, 1200, 4800, 9600\|.\|.\|.
.RE

.sp
.ne 2
.mk
.na
.B Data bits:
.ad
.sp .6
.RS 4n
5, 6, 7, 8
.RE

.sp
.ne 2
.mk
.na
.B Stop bits:
.ad
.sp .6
.RS 4n
1, 1.5, 2
.RE

.sp
.ne 2
.mk
.na
.B Parity:
.ad
.sp .6
.RS 4n
n(none), e(even), o(odd), m(mark), s(space)
.RE

.sp
.ne 2
.mk
.na
.B Handshake:
.ad
.sp .6
.RS 4n
\(mi(none), h(hardware:rts/cts), s(software:xon/xoff)
.RE

.RE

.sp
.ne 2
.mk
.na
.B ttya-ignore-cd
.ad
.sp .6
.RS 4n
If
.BR true ,
operating system ignores carrier-detect on TTYA. Defaults to
.BR true .
.RE

.sp
.ne 2
.mk
.na
.B ttyb-ignore-cd
.ad
.sp .6
.RS 4n
If
.BR true ,
operating system ignores carrier-detect on TTYB. Defaults to
.BR true .
.RE

.sp
.ne 2
.mk
.na
\fBttya-rts-dtr-off\fR
.ad
.sp .6
.RS 4n
If
.BR true ,
operating system does not assert DTR and RTS on TTYA.
Defaults to
.BR false .
.RE

.sp
.ne 2
.mk
.na
\fBttyb-rts-dtr-off\fR
.ad
.sp .6
.RS 4n
If
.BR true ,
operating system does not assert DTR and RTS on TTYB.
Defaults to
.BR false .
.RE

.sp
.ne 2
.mk
.na
.B use-nvramrc?
.ad
.sp .6
.RS 4n
If
.BR true ,
execute commands in
.B NVRAMRC
during system start-up.
Defaults to
.BR false .
.RE

.sp
.ne 2
.mk
.na
.B verbosity
.ad
.sp .6
.RS 4n
Controls the level of verbosity of PROM messages. Can be one of
.BR debug ,
.BR max ,
.BR normal ,
.BR min ,
or
.BR none .
Defaults to
.BR normal .
.RE

.sp
.ne 2
.mk
.na
.B version2?
.ad
.sp .6
.RS 4n
If \fBtrue\fR, hybrid (1.\fIx\fR/2.\fIx\fR) PROM comes up in version
2.\fIx\fR. Defaults to \fBtrue\fR.
.RE

.sp
.ne 2
.mk
.na
.B watchdog-reboot?
.ad
.sp .6
.RS 4n
If
.BR true ,
reboot after watchdog reset. Defaults to
.BR false .
.RE

.sp
.ne 2
.mk
.na
.B watchdog-sync?
.ad
.sp .6
.RS 4n
Specify
.B true
to invoke OpenBoot PROM's
.B sync
word after a
watchdog reset trap. Defaults to
.BR false .
( Sun Enterprise 10000
only.)
.RE

.sp
.ne 2
.mk
.na
.B xir-sync?
.ad
.sp .6
.RS 4n
Specify
.B true
to invoke OpenBoot PROM's
.B sync
word after an
\fBXIR\fR trap. Defaults to
.BR false .
(Sun Enterprise 10000 only.)
.RE

.SH EXAMPLES
.LP
\fBExample 1\fR Changing the Number of Megabytes of RAM.
.sp
.LP
The following example demonstrates the method for changing from one to two
the number of megabytes of
.B RAM
that the system will test.

.sp
.in +2
.nf
example# \fBeeprom selftest-#megs\fR
selftest-#megs=1

example# eeprom selftest-#megs=2

example# \fBeeprom selftest-#megs\fR
selftest-#megs=2
.fi
.in -2
.sp

.LP
\fBExample 2\fR Setting the \fBauto-boot?\fR Parameter to \fBtrue\fR.
.sp
.LP
The following example demonstrates the method for setting the
\fBauto-boot?\fR parameter to \fBtrue\fR.

.sp
.in +2
.nf
example# \fBeeprom auto-boot?=true\fR
.fi
.in -2
.sp

.sp
.LP
When the
.B eeprom
command is executed in user mode, the parameters with
a trailing question mark (?) need to be enclosed in double quotation marks
(" ") to prevent the shell from interpreting the question mark. Preceding
the question mark with an escape character (\fB\e\fR) will also prevent the
shell from interpreting the question mark.

.sp
.in +2
.nf
\fBexample% eeprom "auto-boot?"=true\fR
.fi
.in -2
.sp

.LP
\fBExample 3\fR Using \fBnetwork-boot-arguments\fR
.sp
.LP
To use DHCP as the boot protocol and a hostname of
.BR abcd.example.com
for network booting, set these values in
.B network-boot-arguments
as:

.sp
.in +2
.nf
example# \fBeeprom network-boot-arguments="dhcp,hostname=abcd.example.com"\fR
.fi
.in -2
.sp

.sp
.LP
\&.\|.\|.then boot using the command:

.sp
.in +2
.nf
ok \fBboot net\fR
.fi
.in -2
.sp

.sp
.LP
Note that network boot arguments specified from the PROM command line cause
the contents of
.B network-boot-arguments
to be ignored. For example,
with
.B network-boot-arguments
.RB "set as shown above, the" " boot"
command:

.sp
.in +2
.nf
ok \fBboot net:dhcp\fR
.fi
.in -2
.sp

.sp
.LP
\&.\|.\|.causes DHCP to be used, but the \fBhostname\fR specified in
\fBnetwork-boot-arguments\fR will not be used during network boot.

.LP
\fBExample 4\fR Setting System Console to Auxiliary Device
.sp
.LP
The command below assigns the device
.B /dev/term/a
as the system
console device. You would make such an assignment prior to using
.BR tip (1)
to establish a
.B tip
connection to a host.

.sp
.LP
On a SPARC machine:

.sp
.in +2
.nf
# \fBeeprom output-device=/dev/term/a\fR
.fi
.in -2
.sp

.sp
.LP
On an x86 machine:

.sp
.in +2
.nf
# \fBeeprom console=ttya\fR
.fi
.in -2
.sp

.sp
.LP
On a SPARC machine, the preceding command would be sufficient for assigning
the console to an auxiliary device. For an x86 machine, you might, in
addition, need to set the characteristics of the serial line, for which you
would have to consult the BIOS documentation for that machine. Also, on some
x86 machines, you might use a device other than device
.BR a ,
as shown
above. For example, you could set console to
.B ttyb
if the second serial
port is present.

.SH FILES
.sp
.ne 2
.mk
.na
.B /boot/solaris/bootenv.rc
.ad
.sp .6
.RS 4n
File storing
.B eeprom
values on x86 machines.
.RE

.sp
.ne 2
.mk
.na
.B /dev/openprom
.ad
.sp .6
.RS 4n
Device file
.RE

.sp
.ne 2
.mk
.na
\fB/usr/platform/\fIplatform-name\fB/sbin/eeprom\fR
.ad
.sp .6
.RS 4n
Platform-specific version of
.BR eeprom .
Use
.B "uname -i"
to
obtain
.IR platform-name .
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.sp
.LP
.BR passwd (1),
.BR sh (1),
.BR svcs (1),
.BR tip (1),
.BR uname (1),
.BR boot (1M),
.BR kadb (1M),
.BR kernel (1M),
.BR init (1M),
.BR svcadm (1M),
.BR attributes (5),
.BR smf (5)
.sp
.LP
\fIOpenBoot 3.x Command Reference Manual\fR
.sp
.LP
\fR
