usr/src/man/man1m/efdaemon.1m
'\" te
.\" Copyright (c) 2004, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH efdaemon 1M "10 Aug 2004" "SunOS 5.11" "System Administration Commands"
.SH NAME
efdaemon \- embedded FCode interpreter daemon
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/efcode/sparcv9/efdaemon\fR [\fB-d\fR]
.fi

.SH DESCRIPTION
.sp
.LP
.BR efdaemon ,
the embedded
.B FCode
interpreter daemon, invokes the
embedded
.B FCode
interpreter when the daemon receives an interpretation
request. A new session of the interpreter is started for each unique request
by invoking the script
.BR /usr/lib/efcode/efcode .
.sp
.LP
.B efdaemon
is used on selected platforms as part of the processing of
some dynamic reconfiguration events.
.SH OPTIONS
.sp
.LP
The following option is supported:
.sp
.ne 2
.mk
.na
.B -d
.ad
.RS 6n
.rt
Set debug output. Log debug messages as
.B LOG_DEBUG
level messages by
using
.BR syslog() .
See
.BR syslog (3C).
.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B /dev/fcode
.ad
.sp .6
.RS 4n
.B FCode
interpreter pseudo device, which is a portal for receipt of
.B FCode
interpretation requests
.RE

.sp
.ne 2
.mk
.na
.B /usr/lib/efcode/efcode
.ad
.sp .6
.RS 4n
Shell script that invokes the embedded
.B FCode
interpreter
.RE

.sp
.ne 2
.mk
.na
.B /usr/lib/efcode/interpreter
.ad
.sp .6
.RS 4n
Embedded
.B FCode
interpreter
.RE

.sp
.ne 2
.mk
.na
.B /usr/lib/efcode/sparcv9/interpreter
.ad
.sp .6
.RS 4n
Embedded
.B FCode
interpreter
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWefcx, SUNWefcux, SUNWefcr, SUNWefclx
.TE

.SH SEE ALSO
.sp
.LP
.BR svcs (1),
.BR prtconf (1M),
.BR svcadm (1M),
.BR syslog (3C),
.BR attributes (5),
.BR smf (5)
.SH NOTES
.sp
.LP
The
.B efdaemon
service is managed by the service management facility,
.BR smf (5),
under the service identifier:
.sp
.in +2
.nf
svc:/platform/sun4u/efdaemon:default
.fi
.in -2
.sp

.sp
.LP
Administrative actions on this service, such as enabling, disabling, or
requesting restart, can be performed using
.BR svcadm (1M).
The service's
status can be queried using the
.BR svcs (1)
command.
