usr/src/man/man1m/etrn.1m
'\" te
.\" Copyright (c) 2004, Sun Microsystems, Inc.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH etrn 1M "10 Aug 2004" "SunOS 5.11" "System Administration Commands"
.SH NAME
etrn \- start mail queue run
.SH SYNOPSIS
.LP
.nf
\fBetrn\fR [\fB-b\fR] [\fB-v\fR] \fIserver-host\fR [\fIclient-hosts\fR]
.fi

.SH DESCRIPTION
.sp
.LP
SMTP's
.B ETRN
command allows an SMTP client and server to interact,
giving the server an opportunity to start the processing of its queues for
messages to go to a given host. This is meant to be used in start-up
conditions, as well as for mail nodes that have transient connections to
their service providers.
.sp
.LP
The
.B etrn
utility initiates an SMTP session with the host
.I server-host
and sends one or more
.B ETRN
commands as follows: If
no
.I client-hosts
are specified,
.B etrn
looks up every host name for
which
.BR sendmail (1M)
accepts email and, for each name, sends an
.B ETRN
command with that name as the argument. If any
.I client-hosts
are specified,
.B etrn
uses each of these as arguments for successive
.B ETRN
commands.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -b
.ad
.RS 6n
.rt
System boot special case. Make sure localhost is accepting SMTP connections
before initiating the SMTP session with server-host.
.sp
This option is useful because it prevents race conditions between
.BR sendmail (1M)
accepting connections and
.I server-host
attempting to
deliver queued mail. This check is performed automatically if no
.I client-hosts
are specified.
.RE

.sp
.ne 2
.mk
.na
.B -v
.ad
.RS 6n
.rt
The normal mode of operation for
.B etrn
is to do all of its work
silently. The
.B -v
option makes it verbose, which causes
.B etrn
to
display its conversations with the remote SMTP server.
.RE

.SH ENVIRONMENT VARIABLES
.sp
.LP
No environment variables are used. However, at system start-up,
.B svc:/network/smtp:sendmail
reads
.BR /etc/default/sendmail .
In this
file, if the variable
.B ETRN_HOSTS
is set,
.B svc:/network/smtp:sendmail
parses this variable and invokes
.BR etrn
appropriately.
.B ETRN_HOSTS
should be of the form:
.sp
.in +2
.nf
"s1:c1.1,c1.2        s2:c2.1 s3:c3.1,c3.2,c3.3"
.fi
.in -2
.sp

.sp
.LP
That is, white-space separated groups of
.I server:client
where
.I client
can be one or more comma-separated names. The
.I :client
part is optional.
.I server
is the name of the server to prod; a mail
queue run is requested for each
.I client
name. This is comparable to
running:
.sp
.in +2
.nf
/usr/lib/sendmail -qR \fIclient\fR
.fi
.in -2
.sp

.sp
.LP
on the host
.IR server .
.SH EXAMPLES
.LP
.B Example 1
Using
.BR etrn
.sp
.LP
Inserting the line:

.sp
.in +2
.nf
ETRN_HOSTS="s1.domain.com:clnt.domain.com s2.domain.com:clnt.domain.com"
.fi
.in -2
.sp

.sp
.LP
.RB "in " /etc/default/sendmail " results in " svc:/network/smtp:sendmail 
invoking
.B etrn
such that
.B ETRN
commands are sent to both
.B s1.domain.com
and
.BR s2.domain.com ,
with both having
.B clnt.domain.com
as the
.B ETRN
argument.

.sp
.LP
The line:

.sp
.in +2
.nf
ETRN_HOSTS="server.domain.com:client1.domain.com,client2.domain.com"
.fi
.in -2
.sp

.sp
.LP
results in two
.B ETRN
commands being sent to
.BR server.domain.com ,
one with the argument
.BR client1.domain.com ,
the other with the argument
.BR client2.domain.com .

.sp
.LP
The line:

.sp
.in +2
.nf
ETRN_HOSTS="server1.domain.com server2.domain.com"
.fi
.in -2
.sp

.sp
.LP
results in set of a
.B ETRN
commands being sent to both
.B server1.domain.com
and
.BR server2.domain.com ;
each set contains one
.B ETRN
command for each host name for which
.BR sendmail "(1M) accepts"
email, with that host name as the argument.

.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/mail/sendmail.cf
.ad
.RS 25n
.rt
.B sendmail
configuration file
.RE

.sp
.ne 2
.mk
.na
.B /etc/default/sendmail
.ad
.RS 25n
.rt
Variables used by
.BR svc:/network/smtp:sendmail
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWsndmu
_
Interface StabilityStable
.TE

.SH SEE ALSO
.sp
.LP
.BR sendmail (1M),
.BR attributes (5)
.sp
.LP
RFC 1985
.SH NOTES
.sp
.LP
Not all SMTP servers support
.BR ETRN .
