usr/src/man/man1m/fdetach.1m
'\" te
.\" Copyright 1989 AT&T Copyright (c) 1997 Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH fdetach 1M "5 Jul 1990" "SunOS 5.11" "System Administration Commands"
.SH NAME
fdetach \- detach a name from a STREAMS-based file descriptor
.SH SYNOPSIS
.LP
.nf
\fBfdetach\fR \fIpath\fR
.fi

.SH DESCRIPTION
.sp
.LP
The \fBfdetach\fR command detaches a \fBSTREAMS-based\fR file descriptor
from a name in the file system. Use the
.I path
operand to specify the
path name of the object in the file system name space, which was previously
attached. See \fBfattach\fR(3C).
.sp
.LP
The user must be the owner of the file or a user with the appropriate
privileges. All subsequent operations on
.I path
will operate on the
underlying file system entry and not on the
.B STREAMS
file. The
permissions and status of the entry are restored to the state they were in
before the
.B STREAMS
file was attached to the entry.
.SH OPERANDS
.sp
.LP
The following operands are supported:
.sp
.ne 2
.mk
.na
.I path
.ad
.RS 8n
.rt
Specifies the path name of the object in the file system name space, which
was previously attached.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.sp
.LP
.BR fattach (3C),
.BR fdetach (3C),
.BR attributes (5),
.BR streamio (7I)
.sp
.LP
\fR
