usr/src/man/man1m/fdisk.1m
'\" te
.\" Copyright (c) 2008, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH fdisk 1M "2 Jul 2009" "SunOS 5.11" "System Administration Commands"
.SH NAME
fdisk \- create or modify fixed disk partition table
.SH SYNOPSIS
.LP
.nf
\fBfdisk\fR [\fB-o\fR \fIoffset\fR] [\fB-s\fR \fIsize\fR] [\fB-P\fR \fIfill_patt\fR] [\fB-S\fR \fIgeom_file\fR]
     [\fB-w\fR | \fB-r\fR | \fB-d\fR | \fB-n\fR | \fB-I\fR | \fB-B\fR | \fB-t\fR | \fB-T\fR | \fB-g\fR | \fB-G\fR | \fB-R\fR | \fB-E\fR]
     [-\fB-F\fR \fIfdisk_file\fR] [ [\fB-v\fR] \fB-W\fR {\fIfdisk_file\fR | \(mi}]
     [\fB-h\fR] [\fB-b\fR \fImasterboot\fR]
     [\fB-A\fR \fIid\fR : \fIact\fR : \fIbhead\fR : \fIbsect\fR : \fIbcyl\fR : \fIehead\fR : \fIesect\fR :
         \fIecyl\fR : \fIrsect\fR : \fInumsect\fR]
     [\fB-D\fR \fIid\fR : \fIact\fR : \fIbhead:\fR \fIbsect\fR : \fIbcyl\fR : \fIehead:\fR \fIesect\fR :
         \fIecyl\fR : \fIrsect\fR : \fInumsect\fR] \fIrdevice\fR
.fi

.SH DESCRIPTION
.sp
.LP
This command is used to do the following:
.RS +4
.TP
.ie t \(bu
.el o
Create and modify an
.B fdisk
partition table on x86 systems
.RE
.RS +4
.TP
.ie t \(bu
.el o
Create and modify an
.B fdisk
partition table on removable media on
SPARC or x86 systems
.RE
.RS +4
.TP
.ie t \(bu
.el o
Install the master boot record that is put in the first sector of the fixed
disk on x86 systems only
.RE
.sp
.LP
This table is used by the first-stage bootstrap (or firmware) to identify
parts of the disk reserved for different operating systems, and to identify
.RI "the partition containing the second-stage bootstrap (the" " active"
Solaris partition). The
.I rdevice
argument must be used to specify the
raw device associated with the fixed disk, for example,
.BR /dev/rdsk/c0t0d0p0 .
.sp
.LP
The program can operate in three different modes. The first is interactive
mode. In interactive mode, the program displays the partition table as it
exists on the disk, and then presents a menu allowing the user to modify the
table. The menu, questions, warnings, and error messages are intended to be
self-explanatory.
.sp
.LP
In interactive mode, if there is no partition table on the disk, the user
is given the options of creating a default partitioning or specifying the
initial table values. The default partitioning allocates the entire disk for
the Solaris system and makes the Solaris system partition active. In either
case, when the initial table is created,
.B fdisk
also writes out the
first-stage bootstrap (x86 only) code along with the partition table. In
this mode, (x86 only) when creating an  entry for a non-EFI partition on a
disk that is larger than 2 TB (terabytes),
.B fdisk
warns that the
maximum size of the partition is 2 TB. Under these conditions percentages
displayed by
.B fdisk
are based on 2 TB.
.sp
.LP
The second mode of operation is used for automated entry addition, entry
deletion, or replacement of the entire
.B fdisk
table. This mode can add
or delete an entry described on the command line. In this mode the entire
.B fdisk
table can be read in from a file replacing the original table.
.B fdisk
can also be used to create this file. There is a command line
option that will cause
.BR fdisk " to replace any "
.B fdisk
table with the
default of the whole disk for the Solaris system.
.sp
.LP
The third mode of operation is used for disk diagnostics. In this mode, a
section of the disk can be filled with a user-specified pattern and mode
sections of the disk can also be read or written.
.LP
Note -
.sp
.RS 2
The third mode of operation is not currently supported for extended
partitions
.RE
.sp
.LP
When
.B fdisk
creates a partition, the space is allocated in the
.B fdisk
partition table, but the allocated disk space is not
initialized.
.BR newfs (1M)
is required to create and write file system
metadata to the new partition, and
.BR format (1M)
is required to write the
VTOC or EFI/GPT metadata.
.SS "Menu Options"
.sp
.LP
The menu options for interactive mode given by the
.B fdisk
program
are:
.sp
.ne 2
.mk
.na
.B Create a partition
.ad
.sp .6
.RS 4n
This option allows the user to create a new partition. The maximum number
of partitions is 4. The program will ask for the type of the partition
(SOLARIS, MS-DOS, UNIX, or other). It will then ask for the size of the
partition as a percentage of the disk. The user may also enter the letter
.B c
at this point, in which case the program will ask for the starting
cylinder number and size of the partition in cylinders. If a
.B c
is not
entered, the program will determine the starting cylinder number where the
partition will fit. In either case, if the partition would overlap an
existing partition or will not fit, a message is displayed and the program
returns to the original menu.
.RE

.sp
.ne 2
.mk
.na
.B Change Active (Boot from) partition
.ad
.sp .6
.RS 4n
This option allows the user to specify the partition where the first-stage
bootstrap will look for the second-stage bootstrap, otherwise known as the
.I active
partition.
.RE

.sp
.ne 2
.mk
.na
.B Delete a partition
.ad
.sp .6
.RS 4n
This option allows the user to delete a previously created partition. Note
that this will destroy all data in that partition.
.RE

.sp
.ne 2
.mk
.na
.B "Change between Solaris and Solaris2 Partition IDs
.ad
.sp .6
.RS 4n
This option allows the user to switch between the current
.B fdisk
operating system partition identifier and the previous one. This does not
affect any data in the disk partition and is provided for compatibility with
older software.
.RE

.sp
.ne 2
.mk
.na
.B Edit/View extended partitions
.ad
.sp .6
.RS 4n
This option provides the extended partition menu to the user. Use the
extended partition menu to add and delete logical drives, change the sysid
of the logical drives, and display logical drive information. To commit the
changes made in the extended partition, you must return to the main menu
using the extended partition submenu option
.BR r .
There is also an option
to display the list of options that the extended partition submenu supports.
Given below is the list:
.sp
.ne 2
.mk
.na
.B a
.ad
.RS 5n
.rt
Add a logical drive.
.sp
Use this submenu option to add a logical drive. There are three pieces of
information that are required: The beginning cylinder, the size (in
cylinders or in human readable form - KB, MB, or GB), and the partition ID.
While specifying the partition ID, there is an option
.RB ( I )
that you can
use to list the supported partitions.
.RE

.sp
.ne 2
.mk
.na
.B d
.ad
.RS 5n
.rt
Delete a logical drive.
.sp
Use this submenu option to delete a logical drive. The only input required
is the number of the logical drive that is to be deleted.
.RE

.sp
.ne 2
.mk
.na
.B h
.ad
.RS 5n
.rt
Display the help menu.
.sp
This submenu option displays the supported operations in the extended
partition submenu.
.RE

.sp
.ne 2
.mk
.na
.B i
.ad
.RS 5n
.rt
Change the id of the logical drive.
.sp
Use this submenu option to change the system ID of the existing logical
drives. A list of supported system IDs is displayed when you use the
.B I
option when in this submenu.
.RE

.sp
.ne 2
.mk
.na
.B p
.ad
.RS 5n
.rt
Display the logical drive layout.
.sp
Displays the logical drive information to stdout. This output reflects any
changes made during the current run of the
.B fdisk
program. The changes
are not committed to the disk until return to the main menu (using the
submenu
.BR r )
and choose the option to commit the changes to the disk.
.RE

.sp
.ne 2
.mk
.na
.B r
.ad
.RS 5n
.rt
Return to the main
.B fdisk
menu.
.sp
Exit the extended partition submenu and return to the main menu.
.RE

.RE

.sp
.LP
Use the following options to include your modifications to the partition
table at this time or to cancel the session without modifying the table:
.sp
.ne 2
.mk
.na
.B Exit
.ad
.RS 10n
.rt
This option writes the new version of the table created during this session
with
.B fdisk
out to the fixed disk, and exits the program.
.RE

.sp
.ne 2
.mk
.na
.B Cancel
.ad
.RS 10n
.rt
This option exits without modifying the partition table.
.RE

.SH OPTIONS
.sp
.LP
The following options apply to
.BR fdisk :
.sp
.ne 2
.mk
.na
.B -A
.I id:act:bhead:bsect:bcyl:ehead:esect:ecyl:rsect:numsect
.ad
.sp .6
.RS 4n
Add a partition as described by the argument (see the
.B -F
option below
for the format). Use of this option will zero out the
.B VTOC
on the
Solaris partition if the
.B fdisk
table changes.
.RE

.sp
.ne 2
.mk
.na
.B -b
.I master_boot
.ad
.sp .6
.RS 4n
Specify the file
.I master_boot
as the master boot program. The default
master boot program is
.BR /usr/lib/fs/ufs/mboot .
.RE

.sp
.ne 2
.mk
.na
.B -B
.ad
.sp .6
.RS 4n
Default to one Solaris partition that uses the whole disk. On an x86
machine, if the disk is larger than 2 TB (terabytes), the default size of
the Solaris partition will be limited to 2 TB.
.RE

.sp
.ne 2
.mk
.na
.B -d
.ad
.sp .6
.RS 4n
Turn on verbose
.I debug
mode. This will cause
.B fdisk
to print its
state on stderr as it is used. The output from this option should not be
used with
.BR -F .
.RE

.sp
.ne 2
.mk
.na
.B -D
.I id:act:bhead:bsect:bcyl:ehead:esect:ecyl:rsect:numsect
.ad
.sp .6
.RS 4n
Delete a partition as described by the argument (see the
.B -F
option
below for the format). Note that the argument must be an exact match or the
entry will not be deleted! Use of this option will zero out the
.B VTOC
on the Solaris partition if the
.B fdisk
table changes.
.RE

.sp
.ne 2
.mk
.na
.B -E
.ad
.sp .6
.RS 4n
Create an
.B EFI
partition that uses the entire disk.
.RE

.sp
.ne 2
.mk
.na
.B -F
.I fdisk_file
.ad
.sp .6
.RS 4n
Use fdisk file
.I fdisk_file
to initialize table. Use of this option
will zero out the
.B VTOC
on the Solaris partition if the
.B fdisk
table changes.
.sp
The
.I fdisk_file
contains four specification lines for the primary
partitions followed by specification lines for the logical drives. You must
have four lines for the primary partitions if there is at least one logical
drive. In this case, if the number of primary partitions to be configured is
less than four, the remaining lines should be filled with zeros.
.sp
Each line is composed of entries that are position-dependent, are separated
by whitespace or colons, and have the following format:
.sp
.I "id act bhead bsect bcyl ehead esect ecyl rsect numsect
.sp
\&.\|.\|.where the entries have the following values:
.sp
.ne 2
.mk
.na
.I id
.ad
.RS 11n
.rt
This is the type of partition and the correct numeric values may be found
in
.BR fdisk.h .
.RE

.sp
.ne 2
.mk
.na
.I act
.ad
.RS 11n
.rt
This is the active partition flag;
.B 0
means not active and
.BR 128
means active. For logical drives, this flag will always be set to 0 even if
specified as 128 by the user.
.RE

.sp
.ne 2
.mk
.na
.I bhead
.ad
.RS 11n
.rt
This is the head where the partition starts. If this is set to
.BR 0 ,
.B fdisk
will correctly fill this in from other information.
.RE

.sp
.ne 2
.mk
.na
.I bsect
.ad
.RS 11n
.rt
This is the sector where the partition starts. If this is set to
.BR 0 ,
.B fdisk
will correctly fill this in from other information.
.RE

.sp
.ne 2
.mk
.na
.I bcyl
.ad
.RS 11n
.rt
This is the cylinder where the partition starts. If this is set to
.BR 0 ,
.B fdisk
will correctly fill this in from other information.
.RE

.sp
.ne 2
.mk
.na
.I ehead
.ad
.RS 11n
.rt
This is the head where the partition ends. If this is set to
.BR 0 ,
.B fdisk
will correctly fill this in from other information.
.RE

.sp
.ne 2
.mk
.na
.I esect
.ad
.RS 11n
.rt
This is the sector where the partition ends. If this is set to
.BR 0 ,
.B fdisk
will correctly fill this in from other information.
.RE

.sp
.ne 2
.mk
.na
.I ecyl
.ad
.RS 11n
.rt
This is the cylinder where the partition ends. If this is set to
.BR 0 ,
.B fdisk
will correctly fill this in from other information.
.RE

.sp
.ne 2
.mk
.na
.I rsect
.ad
.RS 11n
.rt
The relative sector from the beginning of the disk where the partition
starts. This must be specified and can be used by
.B fdisk
to fill in
other fields. For logical drives, you must make sure that there are at least
63 free sectors before the
.I rsect
specified for a logical drive.
.RE

.sp
.ne 2
.mk
.na
.I numsect
.ad
.RS 11n
.rt
The size in sectors of this disk partition. This must be specified and can
be used by
.B fdisk
to fill in other fields.
.RE

.RE

.sp
.ne 2
.mk
.na
.B -g
.ad
.sp .6
.RS 4n
Get the label geometry for disk and display on stdout (see the
.B -S
option for the format).
.RE

.sp
.ne 2
.mk
.na
.B -G
.ad
.sp .6
.RS 4n
Get the physical geometry for disk and display on stdout (see the
.B -S
option for the format).
.RE

.sp
.ne 2
.mk
.na
.B -h
.ad
.sp .6
.RS 4n
Issue verbose message; message will list all options and supply an
explanation for each.
.RE

.sp
.ne 2
.mk
.na
.B -I
.ad
.sp .6
.RS 4n
Forgo device checks. This is used to generate a file image of what would go
on a disk without using the device. Note that you must use
.B -S
with
this option (see above).
.RE

.sp
.ne 2
.mk
.na
.B -n
.ad
.sp .6
.RS 4n
Don't update
.B fdisk
table unless explicitly specified by another
option. If no other options are used,
.B -n
will only write the master
boot record to the disk. In addition, note that
.B fdisk
will not come up
in interactive mode if the
.B -n
option is specified.
.RE

.sp
.ne 2
.mk
.na
.B -o
.I offset
.ad
.sp .6
.RS 4n
Block offset from start of disk. This option is used for
.BR -P ,
.BR -r ,
and
.BR -w .
Zero is assumed when this option is not used.
.RE

.sp
.ne 2
.mk
.na
.B -P
.I fill_patt
.ad
.sp .6
.RS 4n
Fill disk with pattern
.IR fill_patt .
.I fill_patt
can be decimal or
hex and is used as number for constant long word pattern. If
.I fill_patt
is
.BR # ,
then pattern is block # for each block. Pattern is put in each
block as long words and fills each block (see
.B -o
and
.BR -s ).
.RE

.sp
.ne 2
.mk
.na
.B -r
.ad
.sp .6
.RS 4n
Read from disk and write to stdout. See
.B -o
and
.BR -s ,
which
specify the starting point and size of the operation.
.RE

.sp
.ne 2
.mk
.na
.B -R
.ad
.sp .6
.RS 4n
Treat disk as read-only. This is for testing purposes.
.RE

.sp
.ne 2
.mk
.na
.B -s
.I size
.ad
.sp .6
.RS 4n
Number of blocks to perform operation on (see
.BR -o ).
.RE

.sp
.ne 2
.mk
.na
.B -S
.I geom_file
.ad
.sp .6
.RS 4n
Set the label geometry to the content of the
.IR geom_file .
The
.I geom_file
contains one specification line. Each line is delimited by a
new-line character (\fB\en\fR). If the first character of a line is an
asterisk (*), the line is treated as a comment. Each line is composed of
entries that are position-dependent, are separated by white space, and have
the following format:
.sp
.in +2
.nf
\fIpcyl ncyl acyl bcyl nheads nsectors sectsiz\fR
.fi
.in -2
.sp

where the entries have the following values:
.sp
.ne 2
.mk
.na
.I pcyl
.ad
.RS 12n
.rt
This is the number of physical cylinders for the drive.
.RE

.sp
.ne 2
.mk
.na
.I ncyl
.ad
.RS 12n
.rt
This is the number of usable cylinders for the drive.
.RE

.sp
.ne 2
.mk
.na
.I acyl
.ad
.RS 12n
.rt
This is the number of alt cylinders for the drive.
.RE

.sp
.ne 2
.mk
.na
.I bcyl
.ad
.RS 12n
.rt
This is the number of offset cylinders for the drive (should be zero).
.RE

.sp
.ne 2
.mk
.na
.I nheads
.ad
.RS 12n
.rt
The number of heads for this drive.
.RE

.sp
.ne 2
.mk
.na
.I nsectors
.ad
.RS 12n
.rt
The number of sectors per track.
.RE

.sp
.ne 2
.mk
.na
.I sectsiz
.ad
.RS 12n
.rt
The size in bytes of a sector.
.RE

.RE

.sp
.ne 2
.mk
.na
.B -t
.ad
.sp .6
.RS 4n
Adjust incorrect slice table entries so that they will not cross partition
table boundaries.
.RE

.sp
.ne 2
.mk
.na
.B -T
.ad
.sp .6
.RS 4n
Remove incorrect slice table entries that span partition table
boundaries.
.RE

.sp
.ne 2
.mk
.na
.B -v
.ad
.sp .6
.RS 4n
Output the HBA (virtual) geometry dimensions. This option must be used in
conjunction with the
.B -W
flag. This option will work for platforms
which support virtual geometry. (x86 only)
.RE

.sp
.ne 2
.mk
.na
.B -w
.ad
.sp .6
.RS 4n
Write to disk and read from stdin. See
.B -o
and
.BR -s ,
which specify
the starting point and size of the operation.
.RE

.sp
.ne 2
.mk
.na
.B -W
\fB\(mi\fR
.ad
.sp .6
.RS 4n
Output the disk table to
.BR stdout .
.RE

.sp
.ne 2
.mk
.na
.B -W
.I fdisk_file
.ad
.sp .6
.RS 4n
Create an
.BR fdisk " file "
.I fdisk_file
from disk table. This can be
used with the
.B -F
option below.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B /dev/rdsk/c0t0d0p0
.ad
.RS 25n
.rt
Raw device associated with the fixed disk.
.RE

.sp
.ne 2
.mk
.na
.B /usr/lib/fs/ufs/mboot
.ad
.RS 25n
.rt
Default master boot program.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Architecturex86 and SPARC
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.sp
.LP
.BR uname (1),
.BR fmthard (1M),
.BR format (1M),
.BR newfs (1M),
.BR prtvtoc (1M),
.BR attributes (5)
.SH DIAGNOSTICS
.sp
.LP
Most messages will be self-explanatory. The following may appear
immediately after starting the program:
.sp
.ne 2
.mk
.na
.BR Fdisk :
\fBcannot open\fR <\fBdevice\fR>\fR
.ad
.sp .6
.RS 4n
This indicates that the device name argument is not valid.
.RE

.sp
.ne 2
.mk
.na
.BR Fdisk :
.B "unable to get device parameters for device
<\fBdevice\fR>\fR
.ad
.sp .6
.RS 4n
This indicates a problem with the configuration of the fixed disk, or an
error in the fixed disk driver.
.RE

.sp
.ne 2
.mk
.na
.BR Fdisk :
.B error reading partition table
.ad
.sp .6
.RS 4n
This indicates that some error occurred when trying initially to read the
fixed disk. This could be a problem with the fixed disk controller or
driver, or with the configuration of the fixed disk.
.RE

.sp
.ne 2
.mk
.na
.BR Fdisk :
.B error writing boot record
.ad
.sp .6
.RS 4n
This indicates that some error occurred when trying to write the new
partition table out to the fixed disk. This could be a problem with the
fixed disk controller, the disk itself, the driver, or the configuration of
the fixed disk.
.RE

