usr/src/man/man1m/ff.1m
'\" te
.\" Copyright 1989 AT&T  Copyright (c) 1997, Sun Microsystems, Inc.  All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ff 1M "10 Feb 1997" "SunOS 5.11" "System Administration Commands"
.SH NAME
ff \- list file names and statistics for a file system
.SH SYNOPSIS
.LP
.nf
\fBff\fR [\fB-F\fR \fIFSType\fR] [\fB-V\fR] [\fIgeneric_options\fR] [\fB-o\fR \fIspecific_options\fR] \fIspecial\fR...
.fi

.SH DESCRIPTION
.sp
.LP
.B ff
prints the pathnames and inode numbers of files in the file system
which resides on the special device
.IR special .
Other information about
the files may be printed using options described below.  Selection criteria
may be used to instruct
.B ff
to only print information for certain
files. If no selection criteria are specified, information for all files
considered will be printed (the default); the
.B -i
option may be used to
limit files to those whose inodes are specified.
.sp
.LP
Output is sorted in ascending inode number order.   The default line
produced by
.B ff
is:
.sp
.LP
.I path-name
\|i-number
.sp
.LP
The maximum information the command will provide is:
.sp
.LP
.I path-name
\|i-number \|size \|uid
.SH OPTIONS
.sp
.ne 2
.mk
.na
.B -F
.ad
.RS 19n
.rt
Specify the
.I FSType
on which to operate. The
.I FSType
should
either be specified here or be determinable from
.B /etc/vfstab
by
matching the
.I special
with an entry in the table, or by consulting
.BR /etc/default/fs .
.RE

.sp
.ne 2
.mk
.na
.B -V
.ad
.RS 19n
.rt
Echo the complete command line, but do not execute the command. The command
line is generated by using the options and arguments provided by the user
and adding to them information derived from
.BR /etc/vfstab .
This option
may be used to verify and validate the command line.
.RE

.sp
.ne 2
.mk
.na
.I generic_options
.ad
.RS 19n
.rt
Options that are supported by most FSType-specific modules of the command.
The following options are available:
.sp
.ne 2
.mk
.na
.B -I
.ad
.RS 18n
.rt
Do not print the i-node number after each path name.
.RE

.sp
.ne 2
.mk
.na
.B -l
.ad
.RS 18n
.rt
Generate a supplementary list of all path names for multiply-linked
files.
.RE

.sp
.ne 2
.mk
.na
\fB-p\fI prefix\fR
.ad
.RS 18n
.rt
The specified
.I prefix
will be added to each generated path name. The
default is `.' (dot).
.RE

.sp
.ne 2
.mk
.na
.B -s
.ad
.RS 18n
.rt
Print the file size, in bytes, after each path name.
.RE

.sp
.ne 2
.mk
.na
.B -u
.ad
.RS 18n
.rt
Print the owner's login name after each path name.
.RE

.sp
.ne 2
.mk
.na
\fB-a\fR \fB-\fIn\fR
.ad
.RS 18n
.rt
Select if the file has been accessed in
.I n
days.
.RE

.sp
.ne 2
.mk
.na
\fB-m\fR \fB-\fIn\fR
.ad
.RS 18n
.rt
Select if the file has been written or created in
.I n
days.
.RE

.sp
.ne 2
.mk
.na
\fB-c\fR \fB-\fIn\fR
.ad
.RS 18n
.rt
Select if file's status has been changed in
.I n
days.
.RE

.sp
.ne 2
.mk
.na
\fB-n\fI file\fR
.ad
.RS 18n
.rt
Select if the file has been modified more recently than the argument
.BR file .
.RE

.sp
.ne 2
.mk
.na
.BI -i " i-node-list"
.ad
.RS 18n
.rt
Generate names for only those i-nodes specified in
.IR i-node-list .
.I i-node-list
is a list of numbers separated by commas (with no
intervening spaces).
.RE

.RE

.sp
.ne 2
.mk
.na
.B -o
.ad
.RS 19n
.rt
Specify  \fIFSType\fR-specific options in a comma separated (without
spaces) list of suboptions and keyword-attribute pairs for interpretation by
the \fIFSType\fR-specific module of the command.
.RE

.SH OPERANDS
.sp
.ne 2
.mk
.na
.I special
.ad
.RS 11n
.rt
A special device.
.RE

.SH USAGE
.sp
.LP
See
.BR largefile (5)
for the description of the behavior of
.B ff
when
encountering files greater than or equal to 2 Gbyte ( 2^31 bytes).
.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/default/fs
.ad
.RS 19n
.rt
default local file system type. Default values can be set for the following
flags in
.BR /etc/default/fs .
For example: \fBLOCAL=ufs\fR
.sp
.ne 2
.mk
.na
.B LOCAL
.ad
.RS 9n
.rt
The default partition for a command if no FSType is specified.
.RE

.RE

.sp
.ne 2
.mk
.na
.B /etc/vfstab
.ad
.RS 19n
.rt
list of default parameters for each file system
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.sp
.LP
.BR find (1),
.BR ncheck (1M),
.BR stat (2),
.BR vfstab (4),
.BR attributes (5),
.BR largefile (5)
Manual pages for the
\fIFSType\fR-specific modules of \fBff\fR.
.SH NOTES
.sp
.LP
This command may not be supported for all
.IR FSTypes .
.sp
.LP
The
.BR -a ,
.BR -m ,
and
.B -c
flags examine the
.BR st_atime ,
.BR st_mtime ,
and
.B st_ctime
fields of the
.B stat
structure
respectively. (See
.BR stat (2).)
