usr/src/man/man1m/ff_ufs.1m
'\" te
.\" Copyright 1989 AT&T  Copyright (c) 1997, Sun Microsystems, Inc.  All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ff_ufs 1M "10 Feb 1997" "SunOS 5.11" "System Administration Commands"
.SH NAME
ff_ufs \- list file names and statistics for a ufs file system
.SH SYNOPSIS
.LP
.nf
\fBff\fR \fB-F\fR ufs [\fIgeneric_options\fR] [\fB-o\fR a,m,s] \fIspecial\fR...
.fi

.SH DESCRIPTION
.sp
.LP
.B ff
prints the pathnames and inode numbers of files in the file system
which resides on the special device
.IR special .
.sp
.LP
See  \fBff\fR(1M) for information regarding the \fBff\fR command. See
.B OPTIONS
for information regarding the ufs-specific options.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -o
.ad
.RS 6n
.rt
Specify
.B ufs
file system specific options. The following options
available are:
.sp
.ne 2
.mk
.na
.B a
.ad
.RS 5n
.rt
Print the `\fI\&.\fR' and `\fI\&.\|.\fR' directory entries.
.RE

.sp
.ne 2
.mk
.na
.B m
.ad
.RS 5n
.rt
Print mode information.  This option must be specified in conjunction with
the \fB-i \fIi-node-list\fR option (see \fBff\fR(1M)).
.RE

.sp
.ne 2
.mk
.na
.B s
.ad
.RS 5n
.rt
Print only special files and files with set-user-ID mode.
.RE

.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.sp
.LP
.BR find (1),
.BR ff (1M),
.BR ncheck (1M),
.BR attributes (5)
