usr/src/man/man1m/fiocompress.1m
'\" te
.\" Copyright (c) 2008, Sun Microsystems, Inc. All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH fiocompress 1M "10 Dec 2008" "SunOS 5.11" "System Administration Commands"
.SH NAME
fiocompress \- file compression utility
.SH SYNOPSIS
.LP
.nf
\fB/sbin/fiocompress\fR \fB-c\fR [\fB-m\fR] [\fB-b\fR \fIblock_size\fR] \fIinput_file\fR \fIoutput_file\fR
.fi

.LP
.nf
\fB/sbin/fiocompress\fR \fB-d\fR \fIinput_file\fR \fIoutput_file\fR
.fi

.SH DESCRIPTION
.sp
.LP
The \fBfiocompress\fR utility is a file compression tool that works
together with the \fBdcfs\fR(7FS) file system to perform per-file
compression. You can use \fBfiocompress\fR to decompress a compressed file
or mark a compressed file as compressed, causing automatic decompression on
read. The primary use of \fBfiocompress\fR is to compress files in the boot
archive.
.sp
.LP
Note that this utility is not a Committed interface. See
.BR attributes (5).
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB-b\fR \fIblock_size\fR
.ad
.sp .6
.RS 4n
Specify a block size for compression. The default block size is 8192.
.RE

.sp
.ne 2
.mk
.na
.B -c
.ad
.sp .6
.RS 4n
Compress the specified file.
.RE

.sp
.ne 2
.mk
.na
.B -d
.ad
.sp .6
.RS 4n
Decompress the specified file.
.RE

.sp
.ne 2
.mk
.na
.B -m
.ad
.sp .6
.RS 4n
Mark the compressed file for automatic decompression on read. Can be used
only in conjunction with
.BR -c .
.RE

.SH EXIT STATUS
.sp
.ne 2
.mk
.na
.B 0
.ad
.sp .6
.RS 4n
The command completed successfully.
.RE

.sp
.ne 2
.mk
.na
.B -1
.ad
.sp .6
.RS 4n
The command exited due to an error.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsr
_
Interface StabilityPrivate
.TE

.SH SEE ALSO
.sp
.LP
.BR boot (1M),
.BR bootadm (1M),
\fBdcfs\fR(7FS), \fBufs\fR(7FS),
.BR attributes (5)
.SH NOTES
.sp
.LP
This compression/decompression utility works only with files stored in a
UFS file system.
.sp
.LP
There is no obvious way to determine whether a given file is compressed,
other than copying the file and comparing the number of disk blocks of the
copy against the original.
