usr/src/man/man1m/fmadm.1m
'\" te
.\" Copyright (c) 2008, Sun Microsystems, Inc. All Rights Reserved.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH fmadm 1M "22 Oct 2008" "SunOS 5.11" "System Administration Commands"
.SH NAME
fmadm \- fault management configuration tool
.SH SYNOPSIS
.LP
.nf
\fBfmadm\fR [\fB-q\fR] [\fIsubcommand\fR [\fIarguments\fR]]
.fi

.SH DESCRIPTION
.sp
.LP
The \fBfmadm\fR utility can be used by administrators and service personnel
to view and modify system configuration parameters maintained by the Solaris
Fault Manager, \fBfmd\fR(1M). \fBfmd\fR receives telemetry information
relating to problems detected by the system software, diagnoses these
problems, and initiates proactive self-healing activities such as disabling
faulty components.
.sp
.LP
\fBfmadm\fR can be used to:
.RS +4
.TP
.ie t \(bu
.el o
view the set of diagnosis engines and agents that are currently
participating in fault management,
.RE
.RS +4
.TP
.ie t \(bu
.el o
view the list of system components that have been diagnosed as faulty,
and
.RE
.RS +4
.TP
.ie t \(bu
.el o
perform administrative tasks related to these entities.
.RE
.sp
.LP
The Fault Manager attempts to automate as many activities as possible, so
use of \fBfmadm\fR is typically not required. When the Fault Manager needs
help from a human administrator, service repair technician, or Sun, it
produces a message indicating its needs. It also refers you to a knowledge
article on Sun's web site, http://www.sun.com/msg/. The web site might ask
you to use \fBfmadm\fR or one of the other fault management utilities to
gather more information or perform additional tasks. The documentation for
\fBfmd\fR(1M), \fBfmdump\fR(1M), and \fBfmstat\fR(1M) describe more about
tools to observe fault management activities.
.sp
.LP
The \fBfmadm\fR utility requires the user to possess the \fBSYS_CONFIG\fR
privilege. Refer to the \fR for more information about how to configure
Solaris privileges. The \fBfmadm\fR \fBload\fR subcommand requires that the
user possess all privileges.
.SS "SUBCOMMANDS"
.sp
.LP
\fBfmadm\fR accepts the following subcommands. Some of the subcommands
accept or require additional options and operands:
.sp
.ne 2
.mk
.na
\fBfmadm acquit\fR \fIfmri\fR \fB|\fR \fIlabel\fR [\fIuuid\fR]\fR
.ad
.sp .6
.RS 4n
Notify the Fault Manager that the specified resource is not to be
considered to be a suspect in the fault event identified by \fIuuid\fR, or
if no UUID is specified, then in any fault or faults that have been
detected. The \fBfmadm acquit\fR subcommand should be used only at the
direction of a documented Sun repair procedure. Administrators might need to
apply additional commands to re-enable a previously faulted resource.
.RE

.sp
.ne 2
.mk
.na
\fBfmadm acquit\fR \fIuuid\fR
.ad
.sp .6
.RS 4n
Notify the Fault Manager that the fault event identified by \fIuuid\fR can
be safely ignored. The \fBfmadm acquit\fR subcommand should be used only at
the direction of a documented Sun repair procedure. Administrators might
need to apply additional commands to re-enable any previously faulted
resources.
.RE

.sp
.ne 2
.mk
.na
\fBfmadm config\fR
.ad
.sp .6
.RS 4n
Display the configuration of the Fault Manager itself, including the module
name, version, and description of each component module. Fault Manager
modules provide services such as automated diagnosis, self-healing, and
messaging for hardware and software present on the system.
.RE

.sp
.ne 2
.mk
.na
\fBfmadm faulty\fR [\fB-afgiprsv\fR] [\fB-n\fR \fImax\fR] [\fB-u\fR
\fIuid\fR]\fR
.ad
.sp .6
.RS 4n
Display status information for resources that the Fault Manager currently
believes to be faulty.
.sp
The following options are supported:
.sp
.ne 2
.mk
.na
\fB-a\fR
.ad
.RS 10n
.rt
Display all faults. By default, the \fBfmadm faulty\fR command only lists
output for resources that are currently present and faulty. If you specify
the \fB-a\fR option, all resource information cached by the Fault Manager is
listed, including faults which have been automatically corrected or where no
recovery action is needed. The listing includes information for resources
that might no longer be present in the system.
.RE

.sp
.ne 2
.mk
.na
\fB-f\fR
.ad
.RS 10n
.rt
Display faulty \fBfru's\fR (Field replaceable units).
.RE

.sp
.ne 2
.mk
.na
\fB-g\fR
.ad
.RS 10n
.rt
Group together faults which have the same fru, class and fault message.
.RE

.sp
.ne 2
.mk
.na
\fB-i\fR
.ad
.RS 10n
.rt
Display persistent cache identifier for each resource in the Fault
Manager.
.RE

.sp
.ne 2
.mk
.na
\fB-n\fR \fImax\fR
.ad
.RS 10n
.rt
If faults or resources are grouped together with the \fB-a\fR or \fB-g\fR
options, limit the output to \fImax\fR entries.
.RE

.sp
.ne 2
.mk
.na
\fB-p\fR
.ad
.RS 10n
.rt
Pipe output through pager with form feed between each fault.
.RE

.sp
.ne 2
.mk
.na
\fB-r\fR
.ad
.RS 10n
.rt
Display Fault Management Resource with their Identifier (FMRI) and their
fault management state.
.RE

.sp
.ne 2
.mk
.na
\fB-s\fR
.ad
.RS 10n
.rt
Display 1 line fault summary for each fault event.
.RE

.sp
.ne 2
.mk
.na
\fB-u\fR \fIuid\fR
.ad
.RS 10n
.rt
Only display fault with given \fBuid\fR.
.RE

.sp
.ne 2
.mk
.na
\fB-v\fR
.ad
.RS 10n
.rt
Display full output.
.RE

The percentage certainty is displayed if a fault has multiple suspects,
either of different classes or on different \fBfru\fR's. If more than one
resource is on the same \fBfru\fR and it is not 100% certain that the fault
is associated with the \fBfru\fR, the maximum percentage certainty of the
possible suspects on the \fBfru\fR is displayed.
.RE

.sp
.LP
The Fault Manager associates the following states with every resource for
which telemetry information has been received:
.sp
.ne 2
.mk
.na
\fBok\fR
.ad
.sp .6
.RS 4n
The resource is present and in use and has no known problems so far as the
Fault Manager is concerned.
.RE

.sp
.ne 2
.mk
.na
\fBunknown\fR
.ad
.sp .6
.RS 4n
The resource is not present or not usable but has no known problems. This
might indicate the resource has been disabled or deconfigured by an
administrator. Consult appropriate management tools for more information.
.RE

.sp
.ne 2
.mk
.na
\fBfaulted\fR
.ad
.sp .6
.RS 4n
The resource is present but is not usable because one or more problems have
been diagnosed by the Fault Manager. The resource has been disabled to
prevent further damage to the system.
.RE

.sp
.ne 2
.mk
.na
\fBdegraded\fR
.ad
.sp .6
.RS 4n
The resource is present and usable, but one or more problems have been
diagnosed in the resource by the Fault Manager.
.sp
If all affected resources are in the same state, this is reflected in the
message at the end of the list. Otherwise the state is given after each
affected resource.
.RE

.sp
.ne 2
.mk
.na
\fBfmadm flush\fR \fIfmri\fR
.ad
.sp .6
.RS 4n
Flush the information cached by the Fault Manager for the specified
resource, named by its FMRI. This subcommand should only be used when
indicated by a documented Sun repair procedure. Typically, the use of this
command is not necessary as the Fault Manager keeps its cache up-to-date
automatically. If a faulty resource is flushed from the cache,
administrators might need to apply additional commands to enable the
specified resource.
.RE

.sp
.ne 2
.mk
.na
\fBfmadm load\fR \fIpath\fR
.ad
.sp .6
.RS 4n
Load the specified Fault Manager module. \fIpath\fR must be an absolute
path and must refer to a module present in one of the defined directories
for modules. Typically, the use of this command is not necessary as the
Fault Manager loads modules automatically when Solaris initially boots or as
needed. 
.RE

.sp
.ne 2
.mk
.na
\fBfmadm unload\fR \fImodule\fR
.ad
.sp .6
.RS 4n
Unload the specified Fault Manager module. Specify \fImodule\fR using the
basename listed in the \fBfmadm config\fR output. Typically, the use of this
command is not necessary as the Fault Manager loads and unloads modules
automatically based on the system configuration
.RE

.sp
.ne 2
.mk
.na
\fBfmadm repaired\fR \fIfmri\fR \fB|\fR \fIlabel\fR
.ad
.sp .6
.RS 4n
Notify the Fault Manager that a repair procedure has been carried out on
the specified resource. The \fBfmadm repaired\fR subcommand should be used
only at the direction of a documented Sun repair procedure. Administrators
might need to apply additional commands to re-enable a previously faulted
resource.
.RE

.sp
.ne 2
.mk
.na
\fBfmadm replaced\fR \fIfmri\fR \fB|\fR \fIlabel\fR
.ad
.sp .6
.RS 4n
Notify the Fault Manager that the specified resource has been replaced.
This command should be used in those cases where the Fault Manager is unable
to automatically detect the replacement. The \fBfmadm replaced\fR subcommand
should be used only at the direction of a documented Sun repair procedure.
Administrators might need to apply additional commands to re-enable a
previously faulted resource.
.RE

.sp
.ne 2
.mk
.na
\fBfmadm reset\fR [\fB-s\fR \fIserd\fB]\fR \fImodule\fR
.ad
.sp .6
.RS 4n
Reset the specified Fault Manager module or module subcomponent. If the
\fB-s\fR option is present, the specified Soft Error Rate Discrimination
(SERD) engine is reset within the module. If the \fB-s\fR option is not
present, the entire module is reset and all persistent state associated with
the module is deleted. The \fBfmadm reset\fR subcommand should only be used
at the direction of a documented Sun repair procedure. The use of this
command is typically not necessary as the Fault Manager manages its modules
automatically. 
.RE

.sp
.ne 2
.mk
.na
\fBfmadm rotate\fR \fBerrlog | fltlog\fR
.ad
.sp .6
.RS 4n
The \fBrotate\fR subcommand is a helper command for \fBlogadm\fR(1M), so
that \fBlogadm\fR can rotate live log files correctly. It is not intended to
be invoked directly. Use one of the following commands to cause the
appropriate logfile to be rotated, if the current one is not zero in size:
.sp
.in +2
.nf
# \fBlogadm -p now -s 1b /var/fm/fmd/errlog\fR
# \fBlogadm -p now -s 1b /var/fm/fmd/fltlog\fR
.fi
.in -2
.sp

.RE

.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB-q\fR
.ad
.RS 6n
.rt
Set quiet mode. \fBfmadm\fR does not produce messages indicating the result
of successful operations to standard output.
.RE

.SH OPERANDS
.sp
.LP
The following operands are supported:
.sp
.ne 2
.mk
.na
\fIcmd\fR
.ad
.RS 8n
.rt
The name of a subcommand listed in \fBSUBCOMMANDS\fR.
.RE

.sp
.ne 2
.mk
.na
\fIargs\fR
.ad
.RS 8n
.rt
One or more options or arguments appropriate for the selected
\fIsubcommand\fR, as described in \fBSUBCOMMANDS\fR.
.RE

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
\fB0\fR
.ad
.RS 5n
.rt
Successful completion.
.RE

.sp
.ne 2
.mk
.na
\fB1\fR
.ad
.RS 5n
.rt
An error occurred. Errors include a failure to communicate with \fBfmd\fR
or insufficient privileges to perform the requested operation.
.RE

.sp
.ne 2
.mk
.na
\fB2\fR
.ad
.RS 5n
.rt
Invalid command-line options were specified.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWfmd
_
Interface StabilitySee below.
.TE

.sp
.LP
The command-line options are Committed. The human-readable output is
not-an-interface.
.SH SEE ALSO
.sp
.LP
\fBfmd\fR(1M), \fBfmdump\fR(1M), \fBfmstat\fR(1M), \fBlogadm\fR(1M),
\fBsyslogd\fR(1M), \fBattributes\fR(5)
.sp
.LP
\fR
.sp
.LP
http://www.sun.com/msg/
