usr/src/man/man1m/fmd.1m
'\" te
.\" Copyright (c) 2004, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH fmd 1M "17 Nov 2004" "SunOS 5.11" "System Administration Commands"
.SH NAME
fmd \- fault manager daemon
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/fm/fmd/fmd\fR [\fB-V\fR] [\fB-f\fR \fIfile\fR] [\fB-o\fR \fIopt\fR=\fIval\fR] [\fB-R\fR \fIdir\fR]
.fi

.SH DESCRIPTION
.sp
.LP
.B fmd
is a daemon that runs in the background on each Solaris system.
.B fmd
receives telemetry information relating to problems detected by
the system software, diagnoses these problems, and initiates proactive
self-healing activities such as disabling faulty components. When
appropriate, the fault manager also sends a message to the
.BR syslogd (1M)
service to notify an administrator that a problem has been detected. The
message directs administrators to a knowledge article on Sun's web site,
http://www.sun.com/msg/, which explains more about the problem impact and
appropriate responses.
.sp
.LP
Each problem diagnosed by the fault manager is assigned a Universal Unique
Identifier
.RB ( UUID ).
The
.B UUID
uniquely identifes this particular
problem across any set of systems. The
.BR fmdump (1M)
utility can be used
to view the list of problems diagnosed by the fault manager, along with
their
.BR UUID s
and knowledge article message identifiers. The
.BR fmadm (1M)
utility can be used to view the resources on the system
believed to be faulty. The
.BR fmstat (1M)
utility can be used to report
statistics kept by the fault manager. The fault manager is started
automatically when Solaris boots, so it is not necessary to use the
.B fmd
command directly. Sun's web site explains more about what
capabilities are currently available for the fault manager on Solaris.
.SH OPTIONS
.sp
.LP
The following options are supported
.sp
.ne 2
.mk
.na
.B -f
.I file
.ad
.RS 16n
.rt
Read the specified configuration
.I file
prior to searching for any of
the default fault manager configuration files.
.RE

.sp
.ne 2
.mk
.na
\fB-o\fR \fIopt\fB=\fIvalue\fR
.ad
.RS 16n
.rt
Set the specified fault manager option to the specified value. Fault
manager options are currently a Private interface; see
.BR attributes (5)
for information about Private interfaces.
.RE

.sp
.ne 2
.mk
.na
.B -R
.I dir
.ad
.RS 16n
.rt
Use the specified root directory for all pathnames evaluated by the fault
manager, instead of the default root
.RB ( / ).
.RE

.sp
.ne 2
.mk
.na
.B -V
.ad
.RS 16n
.rt
Print the fault manager's version to stdout and exit.
.RE

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 6n
.rt
Successful completion
.RE

.sp
.ne 2
.mk
.na
.B 1
.ad
.RS 6n
.rt
An error occurred which prevented the fault manager from initializing, such
as failure to open the telemetry transport.
.RE

.sp
.ne 2
.mk
.na
.B 2
.ad
.RS 6n
.rt
Invalid command-line options were specified.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/fm/fmd
.ad
.RS 20n
.rt
Fault manager configuration directory
.RE

.sp
.ne 2
.mk
.na
.B /usr/lib/fm/fmd
.ad
.RS 20n
.rt
Fault manager library directory
.RE

.sp
.ne 2
.mk
.na
.B /var/fm/fmd
.ad
.RS 20n
.rt
Fault manager log directory
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWfmd
_
Interface StabilityEvolving
.TE

.SH SEE ALSO
.sp
.LP
.BR svcs (1),
.BR fmadm (1M),
.BR fmdump (1M),
.BR fmstat (1M),
.BR syslogd (1M),
.BR attributes (5),
.BR smf (5)
.sp
.LP
http://www.sun.com/msg/
.SH NOTES
.sp
.LP
The Fault Manager is managed by the service management facility,
.BR smf (5),
under the service identifier:
.sp
.in +2
.nf
 svc:/system/fmd:default
.fi
.in -2
.sp

.sp
.LP
The service's status can be queried using the
.BR svcs (1)
command.
Administrators should not disable the Fault Manager service.
