usr/src/man/man1m/fmstat.1m
'\" te
.\" Copyright (c) 2005, Sun Microsystems, Inc. All Rights Reserved.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH fmstat 1M "16 Jun 2009" "SunOS 5.11" "System Administration Commands"
.SH NAME
fmstat \- report fault management module statistics
.SH SYNOPSIS
.LP
.nf
\fBfmstat\fR [\fB-astTz\fR] [\fB-d\fR u | d ] [\fB-m\fR \fImodule\fR] [\fIinterval\fR [\fIcount\fR]]
.fi

.SH DESCRIPTION
.sp
.LP
The
.B fmstat
utility can be used by administrators and service
personnel to report statistics associated with the Solaris Fault Manager,
.BR fmd (1M)
and its associated set of modules. The Fault Manager runs in
the background on each Solaris system. It receives telemetry information
relating to problems detected by the system software, diagnoses these
problems, and initiates proactive self-healing activities such as disabling
faulty components.
.sp
.LP
You can use
.B fmstat
to view statistics for diagnosis engines and
agents that are currently participating in fault management. The
documentation for \fBfmd\fR(1M), \fBfmadm\fR(1M), and \fBfmdump\fR(1M)
describes more about tools to observe fault management activities.
.sp
.LP
If the
.B -m
option is present or the
.B -t
option is present,
.B fmstat
reports any statistics kept by the specified fault management
module. The module list can be obtained using
.BR "fmadm config" .
.sp
.LP
If the
.B -m
option is not present,
.B fmstat
reports the following
statistics for each of its client modules:
.sp
.ne 2
.mk
.na
.B module
.ad
.RS 11n
.rt
The name of the fault management module, as reported by \fBfmadm
config\fR.
.RE

.sp
.ne 2
.mk
.na
.B ev_recv
.ad
.RS 11n
.rt
The number of telemetry events received by the module.
.RE

.sp
.ne 2
.mk
.na
.B ev_acpt
.ad
.RS 11n
.rt
The number of events accepted by the module as relevant to a diagnosis.
.RE

.sp
.ne 2
.mk
.na
.B wait
.ad
.RS 11n
.rt
The average number of telemetry events waiting to be examined by the
module.
.RE

.sp
.ne 2
.mk
.na
.B svc_t
.ad
.RS 11n
.rt
The average service time for telemetry events received by the module, in
milliseconds.
.RE

.sp
.ne 2
.mk
.na
.B %w
.ad
.RS 11n
.rt
The percentage of time that there were telemetry events waiting to be
examined by the module.
.RE

.sp
.ne 2
.mk
.na
.B %b
.ad
.RS 11n
.rt
The percentage of time that the module was busy processing telemetry
events.
.RE

.sp
.ne 2
.mk
.na
.B open
.ad
.RS 11n
.rt
The number of active cases (open problem investigations) owned by the
module.
.RE

.sp
.ne 2
.mk
.na
.B solve
.ad
.RS 11n
.rt
The total number of cases solved by this module since it was loaded.
.RE

.sp
.ne 2
.mk
.na
.B memsz
.ad
.RS 11n
.rt
The amount of dynamic memory currently allocated by this module.
.RE

.sp
.ne 2
.mk
.na
.B bufsz
.ad
.RS 11n
.rt
The amount of persistent buffer space currently allocated by this module.
.RE

.sp
.LP
The \fBfmstat\fR utility requires the user to posses the \fBSYS_CONFIG\fR
privilege. Refer to the\fR  for more information about how to configure
Solaris privileges.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -a
.ad
.RS 13n
.rt
Print all statistics for a module, including those kept on its behalf by
.BR fmd .
If the
.B -a
option is not present, only those statistics kept
by the module are reported. If the
.B -a
option is used without the
.B -m
.IR module ,
a set of global statistics associated with \fBfmd\fR
are displayed.
.RE

.sp
.ne 2
.mk
.na
.B -d u
|
.B d
.ad
.RS 13n
.rt
Display a time stamp.
.sp
Specify
.B u
for a printed representation of the internal representation
of time. See
.BR time (2).
Specify
.B d
for standard date format. See
.BR date (1).
.RE

.sp
.ne 2
.mk
.na
.B -m
.I module
.ad
.RS 13n
.rt
Print a report on the statistics associated with the specified fault
management module, instead of the default statistics report. Modules can
publish an arbitrary set of statistics to help Sun service the fault
management software itself. The module statistics constitute a Private
interface. See
.BR attributes (5)
for information on Sun's rules for
Private interfaces. Scripts should not be written that depend upon the
values of fault management module statistics as they can change without
notice.
.RE

.sp
.ne 2
.mk
.na
.B -s
.ad
.RS 13n
.rt
Print a report on Soft Error Rate Discrimination (SERD) engines associated
with the module instead of the default module statistics report. A SERD
engine is a construct used by fault management software to determine if a
statistical threshold measured as
.I N
events in some time
.I T
has
been exceeded. The
.B -s
option can only be used in combination with the
.B -m
option.
.RE

.sp
.ne 2
.mk
.na
.B -t
.ad
.RS 13n
.rt
Print a report on the statistics associated with each fault management
event transport. Each fault management module can provide the implementation
of one or more event transports.
.RE

.sp
.ne 2
.mk
.na
.B -T
.ad
.RS 13n
.rt
Print a table of the authority information associated with each fault
management event transport. If the
.B -m
option is present, only
transports associated with the specified module are displayed.
.RE

.sp
.ne 2
.mk
.na
.B -z
.ad
.RS 13n
.rt
Omit statistics with a zero value from the report associated with the
specified fault management module. The
.B -z
option can only be used in
combination with the
.B -m
option.
.RE

.SH OPERANDS
.sp
.LP
The following operands are supported:
.sp
.ne 2
.mk
.na
.I count
.ad
.RS 12n
.rt
Print only count reports, and then exit.
.RE

.sp
.ne 2
.mk
.na
.I interval
.ad
.RS 12n
.rt
Print a new report every
.I interval
seconds.
.RE

.sp
.LP
If no
.I interval
and no
.I count
are specified, a single report is
printed and \fBfmstat\fR exits. If an \fIinterval\fR is specified but no
.I count
is specified, \fBfmstat\fR prints reports every \fIinterval\fR
seconds indefinitely until the command is interrupted.
.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 5n
.rt
Successful completion.
.RE

.sp
.ne 2
.mk
.na
.B 1
.ad
.RS 5n
.rt
A fatal error occurred. A fatal error could be the failure to communicate
with \fBfmd\fR(1M). It could also be that insufficient privileges were
available to perform the requested operation.
.RE

.sp
.ne 2
.mk
.na
.B 2
.ad
.RS 5n
.rt
Invalid command-line options were specified.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWfmd
_
Interface StabilitySee below.
.TE

.sp
.LP
The command-line options are Evolving. The human-readable default report is
Unstable. The human-readable module report is Private.
.SH SEE ALSO
.sp
.LP
.BR fmadm (1M),
.BR fmd (1M),
.BR fmdump (1M),
.BR attributes (5)
.sp
.LP
\fR
