usr/src/man/man1m/fmthard.1m
'\" te
.\" Copyright 1989 AT&T Copyright (c) 2002, Sun Microsystems, Inc. All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH fmthard 1M "25 Sep 2008" "SunOS 5.11" "System Administration Commands"
.SH NAME
fmthard \- populate label on hard disks
.SH SYNOPSIS
.SS "SPARC"
.LP
.nf
\fBfmthard\fR \fB-d\fR \fIdata\fR | \fB-n\fR \fIvolume_name\fR | \fB-s\fR \fIdatafile\fR [\fB-i\fR] /dev/rdsk/c?
     [t?] d?s2
.fi

.SS "x86"
.LP
.nf
\fBfmthard\fR \fB-d\fR \fIdata\fR | \fB-n\fR \fIvolume_name\fR | \fB-s\fR \fIdatafile\fR [\fB-i\fR] /dev/rdsk/c?
     [t?] d?s2
.fi

.SH DESCRIPTION
.sp
.LP
The \fBfmthard\fR command updates the \fBVTOC\fR (Volume Table of Contents)
on hard disks and, on x86 systems, adds boot information to the Solaris
\fBfdisk\fR partition. One or more of the options \fB-s\fR \fIdatafile\fR,
.B -d
.IR data ,
or
.B -n
\fIvolume_name\fR must be used to request
modifications to the disk label. To print disk label contents, see
.BR prtvtoc (1M).
The
\fB/dev/rdsk/c\fI?\fR[\fBt\fI?\fR]\fBd\fI?\fBs2\fR
file must be the character special file of the device where the new label
is to be installed. On x86 systems, \fBfdisk\fR(1M) must be run on the drive
before
.BR fmthard .
.sp
.LP
If you are using an x86 system, note that the term ``partition'' in this
page refers to
.I slices
within the x86 \fBfdisk\fR partition on x86
machines. Do not confuse the partitions created by \fBfmthard\fR with the
partitions created by
.BR fdisk .
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB-d\fR \fIdata\fR
.ad
.sp .6
.RS 4n
The
.I data
argument of this option is a string representing the
information for a particular partition in the current VTOC. The string must
be of the format \fIpart:tag:flag:start:size\fR where
.I part
is the
partition number,
.I tag
is the
.B ID
TAG of the partition, \fIflag\fR
is the set of permission flags,
.I start
is the starting sector number of
the partition, and
.I size
is the number of sectors in the partition. See
the description of the \fIdatafile\fR below for more information on these
fields.
.RE

.sp
.ne 2
.mk
.na
.B -i
.ad
.sp .6
.RS 4n
This option allows the command to create the desired
.B VTOC
table, but
prints the information to standard output instead of modifying the
\fBVTOC\fR on the disk.
.RE

.sp
.ne 2
.mk
.na
\fB-n\fR \fIvolume_name\fR
.ad
.sp .6
.RS 4n
This option is used to give the disk a
.I volume_name
up to 8 characters
long.
.RE

.sp
.ne 2
.mk
.na
\fB-s\fR \fIdatafile\fR
.ad
.sp .6
.RS 4n
This option is used to populate the
.B VTOC
according to a
\fIdatafile\fR created by the user. If the \fIdatafile\fR is \fB\(mi\fR (a
hyphen), \fBfmthard\fR reads from standard input. The \fIdatafile\fR format
is described below. This option causes all of the disk partition timestamp
fields to be set to zero.
.sp
Every
.B VTOC
generated by \fBfmthard\fR will also have partition 2, by
convention, that corresponds to the whole disk. If the input in
\fIdatafile\fR does not specify an entry for partition 2, a default
partition 2 entry will be created automatically in
.B VTOC
with the tag
\fBV_BACKUP\fR and size equal to the full size of the disk.
.sp
The \fIdatafile\fR contains one specification line for each partition,
starting with partition 0. Each line is delimited by a new-line character
(\fB\en\fR). If the first character of a line is an asterisk (*), the line
is treated as a comment. Each line is composed of entries that are
position-dependent, separated by white space and having the following
format:
.sp
\fIpartition tag flag starting_sector size_in_sectors\fR
.sp
where the entries have the following values:
.sp
.ne 2
.mk
.na
.I partition
.ad
.sp .6
.RS 4n
The partition number. Currently, for Solaris SPARC, a disk can have up to 8
partitions, \fB0\fR\(mi\fB7\fR. Even though the \fIpartition\fR field has 4
bits, only 3 bits are currently used. For x86, all 4 bits are used to allow
slices \fB0\fR\(mi\fB15\fR. Each Solaris \fBfdisk\fR partition can have up
to 16 slices.
.RE

.sp
.ne 2
.mk
.na
.I tag
.ad
.sp .6
.RS 4n
The partition tag: a decimal number. The following are reserved codes:
.B 0
.RB ( V_UNASSIGNED ),
.B 1
.RB ( V_BOOT ),
.B 2
(\fBV_ROOT\fR), \fB3\fR
.RB ( V_SWAP ),
.B 4
.RB ( V_USR ),
.B 5
(\fBV_BACKUP\fR), \fB6\fR
.RB ( V_STAND ),
.B 7
.RB ( V_VAR ),
and
.B 8
.RB ( V_HOME ).
.RE

.sp
.ne 2
.mk
.na
\fIflag\fR
.ad
.sp .6
.RS 4n
The flag allows a partition to be flagged as unmountable or read only, the
masks being:
.BR "V_UNMNT 0x01" ,
and
.BR "V_RONLY 0x10" .
For mountable
partitions use
.BR 0x00 .
.RE

.sp
.ne 2
.mk
.na
.I starting_sector
.ad
.sp .6
.RS 4n
The sector number (decimal) on which the partition starts.
.RE

.sp
.ne 2
.mk
.na
.I size_in_sectors
.ad
.sp .6
.RS 4n
The number (decimal) of sectors occupied by the partition.
.RE

You can save the output of a
.B prtvtoc
command to a file, edit the
file, and use it as the \fIdatafile\fR argument to the
.B -s
option.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.sp
.LP
.BR uname (1),
.BR format (1M),
.BR prtvtoc (1M),
.BR attributes (5)
.SS "x86 Only"
.sp
.LP
.BR fdisk (1M),
.BR installgrub (1M)
.SH NOTES
.sp
.LP
Special care should be exercised when overwriting an existing
.BR VTOC ,
as incorrect entries could result in current data being inaccessible. As a
precaution, save the old
.BR VTOC .
.sp
.LP
For disks under two terabytes, \fBfmthard\fR cannot write a
.B VTOC
on
an unlabeled disk. Use \fBformat\fR(1M) for this purpose.
