usr/src/man/man1m/fpsd.1m
'\" te
.\" Copyright (c) 2008, Sun Microsystems, Inc. All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH fpsd 1M "7 Aug 2008" "SunOS 5.11" "System Administration Commands"
.SH NAME
fpsd \- Fp-scrubber daemon
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/fps/fpsd\fR
.fi

.SH DESCRIPTION
.sp
.LP
.B fpsd
is a user-level daemon that periodically runs non-intrusive
tests to validate proper functioning of FPU (Floating Point Unit) hardware
in the system. A fault management action is initiated by means of
.BR fmd (1M),
in case an error is detected by the test.
.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.sp .6
.RS 4n
Successful completion.
.RE

.sp
.ne 2
.mk
.na
.B non-zero
.ad
.sp .6
.RS 4n
An error occurred.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWfsu
_
Interface StabilityUncommitted
.TE

.SH SEE ALSO
.sp
.LP
.BR svcs (1),
.BR fmd (1M),
.BR svcadm (1M),
.BR svccfg (1M),
.BR attributes (5),
.BR smf (5)
.SH NOTES
.sp
.LP
The
.B fpsd
service is managed by the service management facility,
.BR smf (5),
under the service identifier:
.sp
.in +2
.nf
svc:/system/fpsd:default
.fi
.in -2
.sp

.sp
.LP
You can use \fBsvccfg\fR(1M) to change the default \fBfpsd\fR behavior:
.sp
.in +2
.nf
Property Name            Type     Description
-------------            ----     -----------
config/exclude_cpus      astring  comma delimited list of
                                   CPU IDs to be excluded
                                   from proactive testing.
.fi
.in -2
.sp

.sp
.LP
Administrative actions on this service, such as enabling, disabling, or
requesting restart, can be performed using
.BR svcadm (1M).
The service's
status can be queried using the
.BR svcs (1)
command.
.sp
.LP
Disabling the service can increase system's vulnerability to silent data
corruption, if a fault were to develop in an FPU within the system.
