usr/src/man/man1m/fsck_cachefs.1m
'\" te
.\" Copyright (c) 2002, Sun Microsystems, Inc.  All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH fsck_cachefs 1M "9 Oct 2002" "SunOS 5.11" "System Administration Commands"
.SH NAME
fsck_cachefs \- check integrity of data cached with CacheFS
.SH SYNOPSIS
.LP
.nf
\fBfsck\fR \fB-F\fR cachefs [\fB-m\fR] [\fB-o\fR noclean] \fIcache_directory\fR
.fi

.SH DESCRIPTION
.sp
.LP
The CacheFS version of the \fBfsck\fR command checks the integrity of a
cache directory.This utility corrects any CacheFS problems it finds by
default. There is no interactive mode. The most likely invocation of
\fBfsck\fR for CacheFS file systems is at boot time from an entry in the
\fB/etc/vfstab\fR file. See  \fBvfstab\fR(4).
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -m
.ad
.RS 14n
.rt
Check, but do not repair.
.RE

.sp
.ne 2
.mk
.na
.B -o noclean
.ad
.RS 14n
.rt
Force a check on the cache even if there is no reason to suspect there is a
problem.
.RE

.SH EXAMPLES
.LP
\fBExample 1\fR Using \fBfsck_cachefs\fR to Force a Check on the Cache
Directory
.sp
.LP
The following example forces a check on the cache directory
.BR /cache3 :

.sp
.in +2
.nf
example% fsck -F cachefs -o noclean /cache3
.fi
.in -2
.sp

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.sp
.LP
\fBcfsadmin\fR(1M), \fBfsck\fR(1M), \fBmount_cachefs\fR(1M),
.BR vfstab (4),
.BR attributes (5)
