usr/src/man/man1m/fsck_ufs.1m
'\" te
.\" Copyright (c) 2003, Sun Microsystems, Inc.  All Rights Reserved
.\" Copyright 1989 AT&T
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH fsck_ufs 1M "2 Aug 2005" "SunOS 5.11" "System Administration Commands"
.SH NAME
fsck_ufs \- file system consistency check and interactive repair
.SH SYNOPSIS
.LP
.nf
\fBfsck\fR \fB-F\fR ufs [\fIgeneric-options\fR] [\fIspecial\fR]...
.fi

.LP
.nf
\fBfsck\fR \fB-F\fR ufs [\fIgeneric-options\fR] [\fB-o\fR \fIspecific-options\fR]
     [\fIspecial\fR]...
.fi

.SH DESCRIPTION
.sp
.LP
The \fBfsck\fR utility audits and interactively repairs inconsistent
conditions on file systems. A file system to be checked may be specified by
giving the name of the block or character
.I special
device or by giving
the name of its mount point if a matching entry exists in
.BR /etc/vfstab .
.sp
.LP
The
.I special
parameter represents the character special device, for
example,
.BR /dev/rdsk/c1t0d0s7 ,
on which the file system resides. The
character special device, not the block special device should be used. The
\fBfsck\fR utility will not work if the block device is mounted, unless the
file system is error-locked.
.sp
.LP
If no
.I special
device is specified, all \fBufs\fR file systems
specified in the \fBvfstab\fR with a \fBfsckdev\fR entry will be checked. If
the
.B -p
(``preen'') option is specified, \fBufs\fR file systems with an
\fBfsckpass\fR number greater than \fB1\fR are checked in parallel. See
.BR fsck (1M).
.sp
.LP
In the case of correcting serious inconsistencies, by default, \fBfsck\fR
asks for confirmation before making a repair and waits for the operator to
respond either
.B yes
or
.BR no .
If the operator does not have write
permission on the file system, \fBfsck\fR will default to a
.B -n
(no
corrections) action. See \fBfsck\fR(1M).
.sp
.LP
Repairing some file system inconsistencies can result in loss of data. The
amount and severity of data loss can be determined from the diagnostic
output.
.sp
.LP
The \fBfsck\fR utility automatically corrects innocuous inconsistencies
such as unreferenced inodes, too-large link counts in inodes, missing blocks
in the free list, blocks appearing in the free list and also in files, or
incorrect counts in the super block. It displays a message for each
inconsistency corrected that identifies the nature of the correction on the
file system which took place. After successfully correcting a file system,
\fBfsck\fR prints the number of files on that file system, the number of
used and free blocks, and the percentage of fragmentation.
.sp
.LP
Inconsistencies checked include:
.RS +4
.TP
.ie t \(bu
.el o
Blocks claimed by more than one inode or the free list.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Blocks claimed by an inode or the free list outside the range of the file
system.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Incorrect link counts.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Incorrect directory sizes.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Bad inode format.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Blocks not accounted for anywhere.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Directory checks, file pointing to unallocated inode, inode number out of
range, and absence of `\fB\&.\fR' and `\fB\&.\|.\fR' as the first two
entries in each directory.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Super Block checks: more blocks for inodes than there are in the file
system.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Bad free block list format.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Total free block and/or free inode count incorrect.
.RE
.sp
.LP
Orphaned files and directories (allocated but unreferenced) are, with the
operator's concurrence, reconnected by placing them in the \fBlost+found\fR
directory. The name assigned is the inode number. If the \fBlost+found\fR
directory does not exist, it is created. If there is insufficient space in
the \fBlost+found\fR directory, its size is increased.
.sp
.LP
An attempt to mount a \fBufs\fR file system with the \fB-o
nolargefiles\fR option will fail if the file system has ever contained a
large file (a file whose size is greater than or equal to 2 Gbyte). Invoking
\fBfsck\fR resets the file system state if no large files are present in the
file system. A successful mount of the file system after invoking \fBfsck\fR
indicates the absence of large files in the file system. An unsuccessful
mount attempt indicates the presence of at least one large file. See
.BR mount_ufs (1M).
.SH OPTIONS
.sp
.LP
The
.I generic-options
consist of the following options:
.sp
.ne 2
.mk
.na
.B -m
.ad
.RS 12n
.rt
Check but do not repair. This option checks that the file system is
suitable for mounting, returning the appropriate exit status. If the file
system is ready for mounting, \fBfsck\fR displays a message such as:
.sp
.ne 2
.mk
.na
\fR
.ad
.sp .6
.RS 4n
\fBufs fsck: sanity check: /dev/rdsk/c0t3d0s1 okay\fR
.RE

.RE

.sp
.ne 2
.mk
.na
.BR -n \||\|\fBN\fR
.ad
.RS 12n
.rt
Assume a
.B no
response to all questions asked by
.BR fsck ;
do not
open the file system for writing.
.RE

.sp
.ne 2
.mk
.na
.B -V
.ad
.RS 12n
.rt
Echo the expanded command line, but do not execute the command. This option
may be used to verify and to validate the command line.
.RE

.sp
.ne 2
.mk
.na
.B -v
.ad
.RS 12n
.rt
Enables verbose output. Might not be supported by all filesystem-specific
\fBfsck\fR implementations.
.RE

.sp
.ne 2
.mk
.na
.BR -y \||\|\fBY\fR
.ad
.RS 12n
.rt
Assume a
.B yes
response to all questions asked by
.BR fsck .
.RE

.sp
.LP
See generic \fBfsck\fR(1M) for the details for specifying
.IR special .
.sp
.ne 2
.mk
.na
\fB-o\fR \fIspecific-options\fR
.ad
.RS 23n
.rt
Specify \fBufs\fR file system specific options. These options can be any
combination of the following separated by commas (with no intervening
spaces).
.sp
.ne 2
.mk
.na
\fBb=\fIn\fR
.ad
.RS 7n
.rt
Use block
.I n
as the super block for the file system. Block 32 is
always one of the alternate super blocks. Determine the location of other
super blocks by running \fBnewfs\fR(1M) with the
.B -Nv
options
specified.
.RE

.sp
.ne 2
.mk
.na
\fBf\fR
.ad
.RS 7n
.rt
Force checking of file systems regardless of the state of their super block
clean flag.
.RE

.sp
.ne 2
.mk
.na
.B p
.ad
.RS 7n
.rt
Check and fix the file system non-interactively ("preen"). Exit immediately
if there is a problem requiring intervention. This option is required to
enable parallel file system checking.
.RE

.sp
.ne 2
.mk
.na
.B w
.ad
.RS 7n
.rt
Check writable file systems only.
.RE

.RE

.SH FILES
.sp
.ne 2
.mk
.na
\fB/etc/vfstab\fR
.ad
.RS 15n
.rt
list of default parameters for each file system
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.sp
.LP
.BR clri (1M),
\fBfsck\fR(1M), \fBfsdb_ufs\fR(1M), \fBfsirand\fR(1M),
\fBfstyp\fR(1M), \fBmkfs\fR(1M), \fBmkfs_ufs\fR(1M), \fBmount_ufs\fR(1M),
.BR mountall (1M),
\fBnewfs\fR(1M), \fBreboot\fR(1M), \fBvfstab\fR(4),
.BR attributes (5),
\fBlargefile\fR(5), \fBufs\fR(7FS)
.SH WARNINGS
.sp
.LP
The operating system buffers file system data. Running \fBfsck\fR on a
mounted file system can cause the operating system's buffers to become out
of date with respect to the disk. For this reason, the file system should be
\fIunmounted\fR when \fBfsck\fR is used. If this is not possible, care
should be taken that the system is quiescent and that it is rebooted
immediately after \fBfsck\fR is run. Quite often, however, this will not be
sufficient. A panic will probably occur if running \fBfsck\fR on a file
system modifies the file system.
.SH NOTES
.sp
.LP
It is usually faster to check the character special device than the block
special device.
.sp
.LP
Running \fBfsck\fR on file systems larger than 2 Gb fails if the user
chooses to use the block interface to the device:
.sp
.ne 2
.mk
.na
\fBfsck /dev/dsk/c?t?d?s?\fR
.ad
.RS 26n
.rt

.RE

.sp
.LP
rather than the raw (character special) device:
.sp
.ne 2
.mk
.na
\fBfsck /dev/rdsk/c?t?d?s?\fR
.ad
.RS 27n
.rt

.RE

