usr/src/man/man1m/fsck_udfs.1m
'\" te
.\" Copyright (c) 2000 Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH fsck_udfs 1M "5 September 2000" "SunOS 5.11" "System Administration Commands"
.SH NAME
fsck_udfs \- file system consistency check and interactive repair
.SH SYNOPSIS
.LP
.nf
\fBfsck\fR \fB-F\fR udfs [\fIgeneric_options\fR] [\fIspecial \|.\|.\|.\fR]
.fi

.LP
.nf
\fBfsck\fR \fB-F\fR udfs [\fIgeneric_options\fR] [\fB-o\fR \fIspecific_options\fR]
     [\fIspecial \|.\|.\|.\fR]
.fi

.SH DESCRIPTION
.sp
.LP
.B fsck
audits and interactively repairs inconsistent conditions on file
systems. A file system to be checked can be specified by giving the name of
the block or character special device or by giving the name of its mount
point if a matching entry exists in
.BR /etc/vfstab .
.sp
.LP
.I special
represents the character special device, for example,
.BR /dev/rdsk/c0t2d0s0 ,
on which the file system resides. The character
special device, not the block special device should be used.
.B fsck
does
not work on a mounted block device.
.sp
.LP
If no special device is specified, all
.B udfs
file systems specified in
the
.BR vfstab " file with a "
.B fsckdev
entry are checked. If the
.B -p
.RB ( preen ") option is specified, " udfs " file systems with an"
.B fsckpass
number greater than
.B 1
are checked in parallel. See
.BR fsck (1M).
.sp
.LP
In the case of correcting serious inconsistencies, by default,
.B fsck
asks for confirmation before making a repair and waits for the operator to
respond with either
.B yes
or
.BR no .
If the operator does not have
write permission on the file system,
.B fsck
defaults to the
.B -n
(no
corrections) option. See
.BR fsck (1M).
.sp
.LP
Repairing some file system inconsistencies can result in loss of data. The
amount and severity of data loss can be determined from the diagnostic
output.
.sp
.LP
.B fsck
automatically corrects innocuous inconsistencies. It displays a
message for each corrected inconsistency that identifies the nature of the
correction which took place on the file system. After successfully
correcting a file system,
.B fsck
prints the number of files on that file
system and the number of used and free blocks.
.sp
.LP
Inconsistencies checked are as follows:
.RS +4
.TP
.ie t \(bu
.el o
Blocks claimed by more than one file or the free list
.RE
.RS +4
.TP
.ie t \(bu
.el o
Blocks claimed by a file or the free list outside the range of the file
system
.RE
.RS +4
.TP
.ie t \(bu
.el o
Incorrect link counts in file entries
.RE
.RS +4
.TP
.ie t \(bu
.el o
Incorrect directory sizes
.RE
.RS +4
.TP
.ie t \(bu
.el o
Bad file entry format
.RE
.RS +4
.TP
.ie t \(bu
.el o
Blocks not accounted for anywhere
.RE
.RS +4
.TP
.ie t \(bu
.el o
Directory checks, file pointing to unallocated file entry and absence of a
parent directory entry
.RE
.RS +4
.TP
.ie t \(bu
.el o
Descriptor checks, more blocks for files than there are in the file system

.RE
.RS +4
.TP
.ie t \(bu
.el o
Bad free block list format
.RE
.RS +4
.TP
.ie t \(bu
.el o
Total free block count incorrect
.RE
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.I generic_options
.ad
.RS 23n
.rt
The following
.I generic_options
are supported:
.sp
.ne 2
.mk
.na
.B -m
.ad
.RS 11n
.rt
Check but do not repair. This option checks to be sure that the file system
is suitable for mounting, and returns the appropriate exit status. If the
file system is ready for mounting,
.B fsck
displays a message such as:
.sp
.in +2
.nf
udfs fsck: sanity check: /dev/rdsk/c0t2d0s0 okay
.fi
.in -2
.sp

.RE

.sp
.ne 2
.mk
.na
.B -n
|
.B -N
.ad
.RS 11n
.rt
Assume a
.B no
response to all questions asked by
.BR fsck ;
do not
open the file system for writing.
.RE

.sp
.ne 2
.mk
.na
.B -V
.ad
.RS 11n
.rt
Echo the expanded command line, but do not execute the command. This option
can be used to verify and to validate the command line.
.RE

.sp
.ne 2
.mk
.na
.B -y
|
.B -Y
.ad
.RS 11n
.rt
Assume a
.B yes
response to all questions asked by
.BR fsck .
.RE

.RE

.sp
.ne 2
.mk
.na
.B -o
.I specific_options
.ad
.RS 23n
.rt
Specify
.B udfs
file system specific options in a comma-separated list
with no intervening spaces. The following
.I specific_options
are
available:
.sp
.ne 2
.mk
.na
.B f
.ad
.RS 5n
.rt
Force checking of file systems regardless of the state of their logical
volume integrity state.
.RE

.sp
.ne 2
.mk
.na
.B p
.ad
.RS 5n
.rt
Check and fix the file system non-interactively
.RB ( preen ).
Exit
immediately if there is a problem that requires intervention. This option is
required to enable parallel file system checking.
.RE

.sp
.ne 2
.mk
.na
.B w
.ad
.RS 5n
.rt
Check writable file systems only.
.RE

.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/vtstab
.ad
.RS 15n
.rt
List of default parameters for each file system.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWudf
.TE

.SH SEE ALSO
.sp
.LP
.BR fsck (1M),
.BR fsdb_udfs (1M),
.BR fstyp (1M),
.BR mkfs (1M),
.BR mkfs_udfs (1M),
.BR mountall (1M),
.BR reboot (1M),
.BR vfstab (4),
.BR attributes (5)
.SH WARNINGS
.sp
.LP
The operating system buffers file system data. Running
.B fsck
on a
mounted file system can cause the operating system's buffers to become out
of date with respect to the disk. For this reason, use
.B fsck
only when
the file system is unmounted. If this is not possible, take care that the
system is quiescent and that it is rebooted immediately after running
.BR fsck .
A panic will probably occur if running
.B fsck
on a file
system that modifies the file system while it is mounted.
.sp
.LP
If an unmount of the file system is not done before the system is shut
down, the file system might become corrupted. In this case, a file system
check needs to be completed before the next mount operation.
.SH DIAGNOSTICS
.sp
.ne 2
.mk
.na
.B not writable
.ad
.sp .6
.RS 4n
You cannot write to the device.
.RE

.sp
.ne 2
.mk
.na
.B Currently Mounted on
.ad
.sp .6
.RS 4n
The device is already mounted and cannot run
.BR fsck .
.RE

.sp
.ne 2
.mk
.na
.B FILE SYSTEM WAS MODIFIED
.ad
.sp .6
.RS 4n
File system has been modified to bring it to a consistent state.
.RE

.sp
.ne 2
.mk
.na
.B Can't read allocation extent
.ad
.sp .6
.RS 4n
Cannot read the block containing allocation extent.
.RE

.sp
.ne 2
.mk
.na
.B Bad tag on alloc extent
.ad
.sp .6
.RS 4n
Invalid tag detected when expecting an allocation extent.
.RE

.sp
.ne 2
.mk
.na
.B Volume sequence tag error
.ad
.sp .6
.RS 4n
Invalid tag detected in the volume sequence.
.RE

.sp
.ne 2
.mk
.na
.B Space bitmap tag error
.ad
.sp .6
.RS 4n
Invalid tag detected in the space bitmap.
.RE

.sp
.ne 2
.mk
.na
.B UNEXPECTED INCONSISTENCY; RUN fsck MANUALLY
.ad
.sp .6
.RS 4n
Use
.B fsck
in interactive mode.
.RE

