usr/src/man/man1m/fsdb.1m
'\" te
.\" Copyright 1989 AT&T  Copyright (c) 1996, Sun Microsystems, Inc.  All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH fsdb 1M "16 Sep 1996" "SunOS 5.11" "System Administration Commands"
.SH NAME
fsdb \- file system debugger
.SH SYNOPSIS
.LP
.nf
\fBfsdb\fR [\fB-F\fR \fIFSType\fR] [\fB-V\fR] [\fB-o\fR \fIFSType-specific_options\fR] \fIspecial\fR
.fi

.SH DESCRIPTION
.sp
.LP
.B fsdb
is a file system debugger that allows for the manual repair of a
file system after a crash.
.I special
is a special device used to
indicate the file system to be debugged.
.B fsdb
is intended for
experienced users only.
.I FSType
is the file system type to be debugged.
Since different
.I FSTypes
have different structures and hence different
debugging capabilities, the manual pages for the \fIFSType-\fRspecific
.B fsdb
should be consulted for a more detailed description of the
debugging capabilities.
.SH OPTIONS
.sp
.ne 2
.mk
.na
.B -F
.ad
.RS 6n
.rt
Specify the
.I FSType
on which to operate.  The
.I FSType
should
either be specified here or be determinable from
.B /etc/vfstab
by
matching the
.I special
with an entry in the table, or by consulting
.BR /etc/default/fs .
.RE

.sp
.ne 2
.mk
.na
.B -V
.ad
.RS 6n
.rt
Echo the complete command line, but do not execute the command. The command
line is generated by using the options and arguments provided by the user
and adding to them information derived from
.BR /etc/vfstab .
This option
may be used to verify and validate the command line.
.RE

.sp
.ne 2
.mk
.na
.B -o
.ad
.RS 6n
.rt
Specify  \fIFSType-\fRspecific options.
.RE

.SH USAGE
.sp
.LP
See
.BR largefile (5)
for the description of the behavior of \fBfsdb\fR
when encountering files greater than or equal to 2 Gbyte ( 2^31 bytes).
.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/default/fs
.ad
.RS 19n
.rt
default local file system type. Default values can be set for the following
flags in
.BR /etc/default/fs .
For example: \fBLOCAL=ufs\fR
.sp
.ne 2
.mk
.na
.B LOCAL:
.ad
.RS 10n
.rt
The default partition for a command if no FSType is specified.
.RE

.RE

.sp
.ne 2
.mk
.na
.B /etc/vfstab
.ad
.RS 19n
.rt
list of default parameters for each file system
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.sp
.LP
.BR vfstab (4),
.BR attributes (5),
.BR largefile (5)
Manual pages for
the \fIFSType\fR-specific modules of \fBfsdb\fR.
.SH NOTES
.sp
.LP
This command may not be supported for all
.IR FSTypes .
