usr/src/man/man1m/fsirand.1m
'\" te
.\" Copyright (c) 1996, Sun Microsystems, Inc.  All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH fsirand 1M "16 Sep 1996" "SunOS 5.11" "System Administration Commands"
.SH NAME
fsirand \- install random inode generation numbers
.SH SYNOPSIS
.LP
.nf
\fBfsirand\fR [\fB-p\fR] \fIspecial\fR
.fi

.SH DESCRIPTION
.sp
.LP
.B fsirand
installs random inode generation numbers on all the inodes on
device
.IR special ,
and also installs a file system
.B ID
in the
superblock. This helps increase the security of file systems exported by
.B NFS.
.sp
.LP
.B fsirand
must be used only on an unmounted file system that has been
checked with
.BR fsck (1M)
The only exception is that it can be used on the
root file system in single-user mode, if the system is immediately re-booted
afterwards.
.SH OPTIONS
.sp
.ne 2
.mk
.na
.B -p
.ad
.RS 6n
.rt
Print out the generation numbers for all the inodes, but do not change the
generation numbers.
.RE

.SH USAGE
.sp
.LP
See
.BR largefile (5)
for the description of the behavior of
.B fsirand
when encountering files greater than or equal to 2 Gbyte ( 2^31 bytes).
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.sp
.LP
.BR fsck (1M),
.BR attributes (5),
.BR largefile (5)
