usr/src/man/man1m/fsstat.1m
'\" te
.\" Copyright (c) 2007, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH fsstat 1M "5 Jan 2007" "SunOS 5.11" "System Administration Commands"
.SH NAME
fsstat \- report file system statistics
.SH SYNOPSIS
.LP
.nf
\fBfsstat\fR [\fB-a|f|i|n|v\fR] [\fB-T\fR | u|d] {\fB-F\fR | {\fIfstype\fR|\fIpath\fR}.\|.\|.}
     [\fIinterval\fR [\fIcount\fR]]
.fi

.SH DESCRIPTION
.sp
.LP
.B fsstat
reports kernel file operation activity by the file system type
.RI ( fstype )
or by the path name, which is converted to a mount point. The
first set of lines of output reports all activity since:
.RS +4
.TP
.ie t \(bu
.el o
The file system module was loaded (in the case of
.IR fstype )
.RE
.RS +4
.TP
.ie t \(bu
.el o
The file system was mounted (in the case of mount point)
.RE
.sp
.LP
Statistics are gathered at the file system independent layer at both the
.I fstype
and the mount point levels. However, not all file system types
are represented in the gathering of statistics. (See the NOTES section of
this man page.)
.sp
.LP
The output of
.B fsstat
is dependent on the mode (option) requested. All
statistic fields are displayed using "smart numbers" which automatically
scale the units in a human readable form that fits in a maximum of 5
characters. For example:
.sp
.ne 2
.mk
.na
.B 100
.ad
.RS 11n
.rt
is displayed as 100
.RE

.sp
.ne 2
.mk
.na
.B 2048
.ad
.RS 11n
.rt
is displayed as 2K
.RE

.sp
.ne 2
.mk
.na
.B 3000000
.ad
.RS 11n
.rt
is displayed as 2.86M
.RE

.sp
.LP
The unit modifiers are: K (Kbyte), M (Mbyte), G (Gbyte), T (terabyte), P
(petabyte), and E (exabyte).
.sp
.LP
During the execution of
.BR fsstat ,
the state of the system can change.
If relevant, a state change message is included in the
.B fsstat
output
in one of the following forms:
.sp
.in +2
.nf
<<mount point no longer available: {path}>>
<<file system module no longer loaded: {fstype}>>
.fi
.in -2
.sp

.sp
.LP
After the state change messages are displayed,
.B fsstat
continues to
display the statistics as directed. If all of the
.I fstypes
and mount
points that
.B fsstat
was reporting on are no longer available, then
.B fsstat
exits.
.sp
.LP
The user is required to specify the
.B -F
option (all available file
system types) or a list of one or more
.I fstypes
and/or mount points.
.sp
.LP
The default report shows general file system activity. This display
combines similar operations into general categories as follows:
.sp
.ne 2
.mk
.na
.B new file
.ad
.RS 15n
.rt
Number of creation operations for file system objects (for example, files,
directories, symlinks, etc.)
.RE

.sp
.ne 2
.mk
.na
.B name remov
.ad
.RS 15n
.rt
Number of name removal operations
.RE

.sp
.ne 2
.mk
.na
.B name chng
.ad
.RS 15n
.rt
Number of name change operations
.RE

.sp
.ne 2
.mk
.na
.B attr get
.ad
.RS 15n
.rt
Number of object attribute retrieval operations
.RE

.sp
.ne 2
.mk
.na
.B attr set
.ad
.RS 15n
.rt
Number of object attribute change operations
.RE

.sp
.ne 2
.mk
.na
.B lookup ops
.ad
.RS 15n
.rt
Number of object lookup operations
.RE

.sp
.ne 2
.mk
.na
.B rddir ops
.ad
.RS 15n
.rt
Number of read directory operations
.RE

.sp
.ne 2
.mk
.na
.B read ops
.ad
.RS 15n
.rt
Number of data read operations
.RE

.sp
.ne 2
.mk
.na
.B read bytes
.ad
.RS 15n
.rt
Bytes transferred by data read operations
.RE

.sp
.ne 2
.mk
.na
.B write ops
.ad
.RS 15n
.rt
Number of data write operations
.RE

.sp
.ne 2
.mk
.na
.B write bytes
.ad
.RS 15n
.rt
Bytes transferred by data write operations
.RE

.sp
.LP
The entity being reported on (\fIfstype\fR or mount point) is displayed in
the last column.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -a
.ad
.RS 10n
.rt
Report the activity for kernel attribute operations. The following
statistics are reported:
.sp
.ne 2
.mk
.na
.B getattr
.ad
.RS 11n
.rt
Number of file attribute retrieval calls
.RE

.sp
.ne 2
.mk
.na
.B setattr
.ad
.RS 11n
.rt
Number of file attribute modification calls
.RE

.sp
.ne 2
.mk
.na
.B getsec
.ad
.RS 11n
.rt
Number of file security attribute retrieval calls
.RE

.sp
.ne 2
.mk
.na
.B setsec
.ad
.RS 11n
.rt
Number of file security attribute modification calls
.RE

The entity being reported on (\fIfstype\fR or mount point) is displayed in
the last column.
.RE

.sp
.ne 2
.mk
.na
.B -f
.ad
.RS 10n
.rt
Report the full activity for all kernel file operations. Each file
operation is listed in the left column. The following statistics are
reported for each operation:
.sp
.ne 2
.mk
.na
.B #ops
.ad
.RS 9n
.rt
Number of calls for this operation
.RE

.sp
.ne 2
.mk
.na
.B bytes
.ad
.RS 9n
.rt
Average transfer size in bytes (only applies to read, write, readdir)
.RE

The entity being reported on (\fIfstype\fR or mount point) is displayed in
the first row.
.RE

.sp
.ne 2
.mk
.na
.B -i
.ad
.RS 10n
.rt
Reports the activity for kernel I/O operations. The following statistics
are reported:
.sp
.ne 2
.mk
.na
.B read ops
.ad
.RS 15n
.rt
Number of data read calls
.RE

.sp
.ne 2
.mk
.na
.B read bytes
.ad
.RS 15n
.rt
Number of bytes read
.RE

.sp
.ne 2
.mk
.na
.B write ops
.ad
.RS 15n
.rt
Number of data write calls
.RE

.sp
.ne 2
.mk
.na
.B write bytes
.ad
.RS 15n
.rt
Number of bytes written
.RE

.sp
.ne 2
.mk
.na
.B rddir ops
.ad
.RS 15n
.rt
Number of read directory calls
.RE

.sp
.ne 2
.mk
.na
.B rddir bytes
.ad
.RS 15n
.rt
Number of bytes read by reading directories
.RE

.sp
.ne 2
.mk
.na
.B rwlock ops
.ad
.RS 15n
.rt
Number of internal file system lock operations
.RE

.sp
.ne 2
.mk
.na
.B rwulock ops
.ad
.RS 15n
.rt
Number of internal file system unlock operations
.RE

The entity being reported on (\fIfstype\fR or mount point) is displayed in
the last column.
.RE

.sp
.ne 2
.mk
.na
.B -n
.ad
.RS 10n
.rt
Reports the activity for kernel naming operations. The following statistics
are reported:
.sp
.ne 2
.mk
.na
.B lookup
.ad
.RS 11n
.rt
Number of file name retrieval calls
.RE

.sp
.ne 2
.mk
.na
.B creat
.ad
.RS 11n
.rt
Number of file creation calls
.RE

.sp
.ne 2
.mk
.na
.B remov
.ad
.RS 11n
.rt
Number of file remove calls
.RE

.sp
.ne 2
.mk
.na
.B link
.ad
.RS 11n
.rt
Number of link calls
.RE

.sp
.ne 2
.mk
.na
.B renam
.ad
.RS 11n
.rt
Number of file renaming calls
.RE

.sp
.ne 2
.mk
.na
.B mkdir
.ad
.RS 11n
.rt
Number of directory creation calls
.RE

.sp
.ne 2
.mk
.na
.B rmdir
.ad
.RS 11n
.rt
Number of directory removal calls
.RE

.sp
.ne 2
.mk
.na
.B rddir
.ad
.RS 11n
.rt
Number of directory read calls
.RE

.sp
.ne 2
.mk
.na
.B symlink
.ad
.RS 11n
.rt
Number of symlink creation calls
.RE

.sp
.ne 2
.mk
.na
.B rdlink
.ad
.RS 11n
.rt
Number of symlink read calls
.RE

The entity being reported on (\fIfstype\fR or mount point) is displayed in
the last column.
.RE

.sp
.ne 2
.mk
.na
.B -v
.ad
.RS 10n
.rt
Reports the activity for calls to the virtual memory operations. The
following statistics are reported.
.sp
.ne 2
.mk
.na
.B map
.ad
.RS 10n
.rt
Number of calls mapping a file
.RE

.sp
.ne 2
.mk
.na
.B addmap
.ad
.RS 10n
.rt
Number of calls setting additional mapping to a mapped file
.RE

.sp
.ne 2
.mk
.na
.B delmap
.ad
.RS 10n
.rt
Number of calls deleting mapping to a file
.RE

.sp
.ne 2
.mk
.na
.B getpag
.ad
.RS 10n
.rt
Number of calls retrieving a page of data from a file
.RE

.sp
.ne 2
.mk
.na
.B putpag
.ad
.RS 10n
.rt
Number of calls writing a page of data to a file
.RE

.sp
.ne 2
.mk
.na
.B pagio
.ad
.RS 10n
.rt
Number of calls to transfer pages in file system swap files
.RE

The entity being reported on (fstype or mount point) is displayed in the
last column.
.RE

.sp
.ne 2
.mk
.na
.B -F
.ad
.RS 10n
.rt
Report on all available file system types.
.RE

.sp
.ne 2
.mk
.na
\fB-T\fR \fIu\fR|\fId\fR
.ad
.RS 10n
.rt
Display a time stamp.
.sp
Specify
.I u
for a printed representation of the internal representation
of time (see
.BR time (2))
Specify
.I d
for the standard date format.
(See
.BR date (1)).
The time stamp is only used when an interval is set.
.RE

.SH OPERANDS
.sp
.LP
The following operands are supported:
.sp
.ne 2
.mk
.na
.I count
.ad
.RS 12n
.rt
Display only
.I count
reports.
.RE

.sp
.ne 2
.mk
.na
.I fstype
.ad
.RS 12n
.rt
Explicitly specify the file system type(s) to be reported. The file system
module must be loaded.
.RE

.sp
.ne 2
.mk
.na
.I interval
.ad
.RS 12n
.rt
Report once each
.I interval
seconds.
.RE

.sp
.ne 2
.mk
.na
.I path
.ad
.RS 12n
.rt
Specify the path(s) of the mount point(s) to be reported. If path is not a
mount point, the mount point containing path will be determined and
displayed in the output.
.RE

.sp
.LP
If no
.I interval
and no
.I count
are specified, a single report is
printed and \fBfsstat\fR exits. If an
.I interval
is specified but no
.I count
is specified,
.B fsstat
prints reports every \fIinterval\fR
seconds indefinitely until the command is interrupted.
.SH EXAMPLES
.LP
.B Example 1
Displaying General Activity
.sp
.LP
The following example shows general activity for all file system types.

.sp
.in +2
.nf
\fB$ fsstat -F\fR
 new  name   name  attr   attr lookup rddir  read read  write write
 file remov  chng   get    set    ops   ops   ops bytes   ops bytes
  313K  214K 38.5K 2.16M 56.2K  8.36M 52.8K 19.7M 39.9G 18.8M 39.1G ufs
     0     0     0 2.95K     0  3.81K   282 2.52K  466K     0     0 proc
     0     0     0     0     0      0     0     0     0     0     0 nfs
    10     8     2    86     9     98    15   413  103M 8.43K 1.05G zfs
    13    14     4    98    16    125    10 1.01K  258M 15.9K  127M lofs
8.73K 3.29K 5.25K 55.3K    37  1.20M    44 37.9K 38.3M 47.2K 35.9M tmpfs
     0     0     0 4.93K     0      0     0 1.08K  913K     0     0 mntfs
     3     2     1   503     3    897    13   122 25.8K   128  272K nfs3
    10     8     0   615    10  10.1K    18    61 45.6K   292 2.26M nfs4
.fi
.in -2
.sp

.LP
.B Example 2
Displaying Naming Activity
.sp
.LP
The following example shows the naming activity for ufs, nfs, nfs3, nfs4,
and tmpfs:

.sp
.in +2
.nf
\fB$ fsstat -n ufs nfs nfs3 nfs4 tmpfs\fR
lookup creat remov  link renam mkdir rmdir rddir symlnk rdlnk
3.57M  3.10K   586     6    24   115   100 30.2K      5  330K ufs
    0      0     0     0     0     0     0     0      0     0 nfs
18.3K      3     5     0     0     0     0 1.03K      2   346 nfs3
  535      0     0     0     0     0     0    46      0     4 nfs4
  146     24    15     0     0     4     0     4      0     0 tmpfs
.fi
.in -2
.sp

.LP
.B Example 3
Displaying Attribute Activity
.sp
.LP
The following example shows the attribute activity for the FS type ufs and
the mounted file systems "/" and "/export/home" every three seconds for
every third iteration:

.sp
.in +2
.nf
\fB# fsstat -a ufs / /export/home 3 3\fR
getattr setattr getsec setsec
  378K    91.9K  11.8K      0 ufs
  367K    82.3K  11.6K      0 /
 11.3K     9.6K    198      0 /export/home
 4.97K    2.27K    163      0 ufs
 3.94K    1.36K    162      0 /
 1.03K      927      1      0 /export/home
 2.30K    1.06K     73      0 ufs
 1.95K      766     71      0 /
   361      317      2      0 /export/home
 2.33K    1.06K     78      0 ufs
 1.64K      451     77      0 /
   711      631      1      0 /export/home
.fi
.in -2
.sp

.LP
.B Example 4
Displaying File Operation Statistics
.sp
.LP
The following example shows the statistics for each file operation for "/"
(using the
.B -f
option):

.sp
.in +2
.nf
\fB$ fsstat -f /\fR
Mountpoint: /
 operation  #ops  bytes
      open 8.54K
     close  9.8K
      read 43.6K  65.9M
     write 1.57K  2.99M
     ioctl 2.06K
     setfl     4
   getattr 40.3K
   setattr    38
    access 9.19K
    lookup  203K
    create   595
    remove    56
      link     0
    rename     9
     mkdir    19
     rmdir     0
   readdir 2.02K  2.27M
   symlink     4
  readlink 8.31K
     fsync   199
  inactive 2.96K
       fid     0
    rwlock 47.2K
  rwunlock 47.2K
      seek 29.1K
       cmp 42.9K
    frlock 4.45K
     space     8
    realvp 3.25K
   getpage  104K
   putpage 2.69K
       map 13.2K
    addmap 34.4K
    delmap 33.4K
      poll   287
      dump     0
  pathconf    54
    pageio     0
   dumpctl     0
   dispose 23.8K
getsecattr   697
setsecattr     0
   shrlock     0
   vnevent     0
.fi
.in -2
.sp

.SH ENVIRONMENT VARIABLES
.sp
.LP
See
.BR environ (5)
for descriptions of the following environment
variables that affect the execution of
.BR fsstat :
.BR LANG ,
.BR LC_ALL ,
.BR LC_CTYPE ,
.BR LC_MESSAGES ,
.BR LC_TIME ,
and
.BR NLSPATH .
.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 5n
.rt
Successful completion.
.RE

.sp
.ne 2
.mk
.na
.B 1
.ad
.RS 5n
.rt
A fatal error occurred. A fatal error could be a failed system call or
another internal error.
.RE

.sp
.ne 2
.mk
.na
.B 2
.ad
.RS 5n
.rt
Invalid command-line options were specified.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
_
CSIEnabled
_
Interface StabilitySee below.
.TE

.sp
.LP
The command-line options are Unstable. The human-readable output is not
considered an interface.
.SH SEE ALSO
.sp
.LP
.BR date (1),
.BR time (2),
.BR attributes (5)
.SH NOTES
.sp
.LP
.RB "All display options (" -a ", " -f ,
.BR -i ,
.BR -n ,
.BR -v )
are
mutually exclusive. Entering more than one of these options will result in
an error.
.sp
.LP
The
.IR fstype " and "
.I path
operands must appear after the option, but
before the
.I interval
or
.I count
on the command line. For example,
"\fBfsstat -a\fR \fIfstype interval\fR". Preference is given to
.I fstype
so that if a user wishes to see the statistics for a directory
that has the same name as an
.I fstype
(for example, ufs), then the path
must be specified unambiguously (for example, ./ufs). Similarly, in order to
define a file with a numeric name (for example, "10") from an interval or
count operand, the name should be prefixed accordingly (for example,
\&./10).
.sp
.LP
When an interval is used, headers repeat after more than 12 lines of
statistics have been displayed and the set of lines to be displayed in the
current interval have completed.
.sp
.LP
Statistics are not displayed for all pseudo-filesystems. The output
displayed with the
.B -F
option shows which of the loaded filesystem
types are supported.
.sp
.LP
Unbundled file systems may not be recognized by
.BR fsstat .
.sp
.LP
The command-line options are classified as Unstable and could change. The
output is not considered to be an interface. The construction of higher
level software tools depend on either the command-line options or the output
of
.B fsstat
is not recommended.
