usr/src/man/man1m/ftpaddhost.1m
'\" te
.\" Copyright (C) 2003, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ftpaddhost 1M "1 May 2003" "SunOS 5.11" "System Administration Commands"
.SH NAME
ftpaddhost \- set up a virtual FTP host
.SH SYNOPSIS
.LP
.nf
\fBftpaddhost\fR \fB-c\fR | \fB-l\fR [\fB-b\fR] [\fB-x\fR \fIxferlog\fR] \fIhostname\fR \fIroot_dir\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B ftpaddhost
script is executed by the super user to set up virtual
FTP hosts. The
.B ftpaddhost
command configures the virtual host
.I hostname
under directory
.IR root_dir .
The value of
.IR hostname
can be an IP address or the name of a host.
.SH OPTIONS
.sp
.LP
The
.B ftpaddhost
script supports the following options:
.sp
.ne 2
.mk
.na
.B -b
.ad
.RS 14n
.rt
Create a banner for the virtual host. This option is useful to confirm that
the virtual host is working.
.RE

.sp
.ne 2
.mk
.na
.B -c
.ad
.RS 14n
.rt
Configure complete virtual hosting. This option allows each virtual host to
have its own version of the
.BR ftpaccess ,
.BR ftpconversions ,
.BR ftpgroups ,
.BR ftphosts ,
and
.B ftpusers
files. The master
version of each of these configuration files is copied from the
.B /etc/ftpd
directory and placed in the
\fB/etc/ftpd/virtual-ftpd/\fIhostname\fR directory. If the
.B /etc/ftpusers
file exists it is appended to the virtual \fBftpusers\fR
file. If a virtual host lacks its own version of a configuration file, the
master version is used.
.RE

.sp
.ne 2
.mk
.na
.B -l
.ad
.RS 14n
.rt
Configure limited virtual hosting. This  option allows a small number of
parameters to be configured differently for a  virtual host. See the
.B virtual
keyword on the
.BR ftpaccess (4)
manual page.
.RE

.sp
.ne 2
.mk
.na
.B -x
.I xferlog
.ad
.RS 14n
.rt
Create a logfile entry such that the transfer logs for the virtual host are
written to the specified file. An absolute path must be specified for the
.I xferlog
file.
.RE

.SH OPERANDS
.sp
.LP
The following operands are supported:
.sp
.ne 2
.mk
.na
.I hostname
.ad
.RS 12n
.rt
The host name or IP address of the virtual server.
.RE

.sp
.ne 2
.mk
.na
.I root_dir
.ad
.RS 12n
.rt
The absolute pathname of the directory under which the virtual server is
set up.
.RE

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 6n
.rt
Successful completion
.RE

.sp
.ne 2
.mk
.na
.B 1
.ad
.RS 6n
.rt
Improper usage of the command
.RE

.sp
.ne 2
.mk
.na
.B 2
.ad
.RS 6n
.rt
Command failed
.RE

.SH FILES
.sp
.ne 2
.mk
.na
\fB/etc/ftpd/virtual-ftpd/\fIhostname\fR
.ad
.sp .6
.RS 4n
The configuration files directory for the virtual host
.IR hostname .
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWftpu
_
Interface StabilityEvolving
.TE

.SH SEE ALSO
.sp
.LP
.BR ftpconfig (1M),
.BR in.ftpd (1M),
.BR ftpaccess (4),
.BR ftpconversions (4),
.BR ftpgroups (4),
.BR ftphosts (4),
.BR ftpusers (4),
.BR xferlog (4),
.BR attributes (5)
