usr/src/man/man1m/ftpconfig.1m
'\" te
.\" Copyright (C) 2002, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ftpconfig 1M "1 May 2003" "SunOS 5.11" "System Administration Commands"
.SH NAME
ftpconfig \- set up anonymous FTP
.SH SYNOPSIS
.LP
.nf
\fBftpconfig\fR [\fIftpdir\fR]
.fi

.LP
.nf
\fBftpconfig\fR \fB-d\fR \fIftpdir\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B ftpconfig
script is executed by the super user to set up anonymous
FTP. Anonymous FTP allows users to remotely log on to the FTP server by
specifying the user name
.B ftp
or
.B anonymous
and the user's email
address as password. The anonymous users are logged on to the FTP Server and
given access to a restricted file area with its own file system root. See
.BR chroot (2).
The FTP area has  its own minimal system files.
.sp
.LP
This command will copy and set up all the components needed to operate an
anonymous FTP server, including creating the
.I ftp
user account, creating
device nodes, copying
.B /usr/lib
files, and copying timezone data.  The
.B passwd
and
.B group
files set up have been stripped down to prevent
malicious users from finding login names on the server.  The anonymous file
area will be placed under
.BR ftpdir .
If the
.I ftp
user account already
exists, then the current FTP area is used, and the system files in it are
updated. All other files are left untouched. This command should be run to
update the anonymous FTP area's configuration whenever a system patch is
installed, or the system is upgraded.
.SH OPTIONS
.sp
.ne 2
.mk
.na
.B -d
.ad
.RS 7n
.rt
Create a new or update an existing
.I ftpdir
without creating or updating
the
.I ftp
user account. Use this option when creating guest FTP user
accounts.
.RE

.SH OPERANDS
.sp
.LP
The following operands are supported:
.sp
.ne 2
.mk
.na
.I ftpdir
.ad
.RS 10n
.rt
The absolute pathname of the directory under which the anonymous FTP area is
set up.
.RE

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 6n
.rt
Successful completion
.RE

.sp
.ne 2
.mk
.na
.B 1
.ad
.RS 6n
.rt
Improper usage of the command
.RE

.sp
.ne 2
.mk
.na
.B 2
.ad
.RS 6n
.rt
Command failed
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWftpu
_
Interface StabilityEvolving
.TE

.SH SEE ALSO
.sp
.LP
.BR ftpaddhost (1M),
.BR in.ftpd (1M),
.BR useradd (1M),
.BR chroot (2),
.BR attributes (5)
