usr/src/man/man1m/ftprestart.1m
'\" te
.\" Copyright (C) 2003, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ftprestart 1M "1 May 2003" "SunOS 5.11" "System Administration Commands"
.SH NAME
ftprestart \- restart previously shutdown FTP Servers
.SH SYNOPSIS
.LP
.nf
\fBftprestart\fR [\fB-V\fR]
.fi

.SH DESCRIPTION
.sp
.LP
Use the
.B ftprestart
command to restart an FTP Server previously shut
down by means of
.BR ftpshut (1M).
The
.B ftprestart
command reads the
.B shutdown
capability from the
.BR ftpaccess (4)
file to determine the
path of the shutdown message files. It then reenables the FTP Server by
removing any shutdown message files in the anonymous and virtual FTP Server
area, as well as the system wide shutdown message file.
.SH OPTIONS
.sp
.LP
The
.B ftprestart
command supports the following options:
.sp
.ne 2
.mk
.na
.B -V
.ad
.RS 6n
.rt
Display program copyright and version information, then terminate.
.RE

.SH EXAMPLES
.LP
.B Example 1
Sample Output from
.B ftprestart
.sp
.LP
The following example shows sample output from the
.B ftprestart
command:

.sp
.in +2
.nf
example% \fBftprestart\fR
ftprestart: /export/home/ftp/etc/ftpd/shutdown.msg removed.
ftprestart: /export/home/virtual1/etc/ftpd/shutdown.msg removed.
ftprestart: /etc/ftpd/shutdown.msg removed.
.fi
.in -2
.sp

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 6n
.rt
Successful completion.
.RE

.sp
.ne 2
.mk
.na
.B >0
.ad
.RS 6n
.rt
An error occurred.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/ftpd/ftpaccess
.ad
.RS 24n
.rt

.RE

.sp
.ne 2
.mk
.na
.B /etc/ftpd/ftpservers
.ad
.RS 24n
.rt

.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWftpu
_
Interface StabilityExternal
.TE

.SH SEE ALSO
.sp
.LP
.BR ftpshut (1M),
.BR in.ftpd (1M),
.BR ftpaccess (4),
.BR ftpservers (4),
.BR attributes (5)
