usr/src/man/man1m/ftpshut.1m
'\" te
.\" Copyright (C) 2003, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ftpshut 1M "1 May 2003" "SunOS 5.11" "System Administration Commands"
.SH NAME
ftpshut \- close down the FTP Servers at a given time
.SH SYNOPSIS
.LP
.nf
\fBftpshut\fR [\fB-V\fR] [\fB-v\fR] [\fB-l\fR \fImin\fR] [\fB-d\fR \fImin\fR] \fItime\fR
     [\fIwarning-message\fR]...
.fi

.SH DESCRIPTION
.sp
.LP
The
.B ftpshut
command provides an automated shutdown procedure that the
superuser can use to notify FTP users when the FTP Server is shutting
down.
.sp
.LP
Ten minutes before shutdown, or immediately if the value of
.I time
is
less than ten minutes, any new FTP Server connections will be disabled. You
may adjust the shutdown of new FTP Server connections by means of the
.B -l
option.
.sp
.LP
 Five minutes before shutdown, or immediately if the value of
.I time
is less than five minutes, all current FTP connections will be disconnected.
You may adjust the shutdown of current FTP connections by means of the
.B -d
option.
.sp
.LP
.RB " The " ftpshut " command creates shutdown message files that the FTP Server uses to determine when to shutdown. Separate shutdown message files are created in the anonymous and virtual host FTP Server areas, in addition to the system wide shutdown message file. Once the shutdown occurs, the server continues to refuse connections until the appropriate shutdown message file is removed. This normally is done by using the " ftprestart (1M)
command. The location of the shutdown message file is specified by the
.B
shutdown
capability in the
.B ftpaccess
file.
.sp
.LP
The following magic cookies are available:
.sp
.ne 2
.mk
.na
.B %s
.ad
.RS 6n
.rt
The time system is going to shut down.
.RE

.sp
.ne 2
.mk
.na
.B %r
.ad
.RS 6n
.rt
The time new connections will be denied.
.RE

.sp
.ne 2
.mk
.na
.B %d
.ad
.RS 6n
.rt
The time current connections will be dropped.
.RE

.sp
.ne 2
.mk
.na
.B %C
.ad
.RS 6n
.rt
The current working directory.
.RE

.sp
.ne 2
.mk
.na
.B %E
.ad
.RS 6n
.rt
The maintainer's email address as defined in the
.B ftpaccess
file.
.RE

.sp
.ne 2
.mk
.na
.B %F
.ad
.RS 6n
.rt
The free space in the partition of
.BR CWD ,
in kilobytes.
.RE

.sp
.ne 2
.mk
.na
.B %L
.ad
.RS 6n
.rt
The local host name.
.RE

.sp
.ne 2
.mk
.na
.B %M
.ad
.RS 6n
.rt
The maximum allowed number of users in this class.
.RE

.sp
.ne 2
.mk
.na
.B %N
.ad
.RS 6n
.rt
The current number of users in this class.
.RE

.sp
.ne 2
.mk
.na
.B %R
.ad
.RS 6n
.rt
The remote host name.
.RE

.sp
.ne 2
.mk
.na
.B %T
.ad
.RS 6n
.rt
The local time (form Thu Nov 15 17:12:42 1990).
.RE

.sp
.ne 2
.mk
.na
.B %U
.ad
.RS 6n
.rt
The username given at login time.
.RE

.SH OPTIONS
.sp
.LP
The
.B ftpshut
command supports the following options:
.sp
.ne 2
.mk
.na
.B -V
.ad
.RS 10n
.rt
Display program copyright and version information, then terminate.
.RE

.sp
.ne 2
.mk
.na
.B -d
.I min
.ad
.RS 10n
.rt
The time ahead of shutdown, in minutes, that existing connections will be
disconnected upon completion of their current or next (if idle) FTP
request.
.RE

.sp
.ne 2
.mk
.na
.B -l
.I min
.ad
.RS 10n
.rt
The time ahead of shutdown, in minutes, that new connections will be
refused.
.RE

.sp
.ne 2
.mk
.na
.B -v
.ad
.RS 10n
.rt
Verbose. Output the pathname of the shutdown message files created.
.RE

.SH OPERANDS
.sp
.LP
The
.B ftpshut
command supports the following operands:
.sp
.ne 2
.mk
.na
.I time
.ad
.RS 19n
.rt
The
.I time
at which
.B ftpshut
will bring the FTP Servers down.
.I time
can have a value of
.BR now ,
which indicates an immediate
shutdown. Alternatively,
.I time
can specify a future time in one of two
formats: \fB+\fInumber\fR or
.IR HHMM .
The first form brings the FTP
Server down in
.I number
minutes. The second brings the FTP Server down
at the time of day indicated, using a 24-hour clock format. When using the
absolute time format, you can only specify times between now and 23:59.
.RE

.sp
.ne 2
.mk
.na
.I warning-message
.ad
.RS 19n
.rt
The message to display that warns of the imminent shutdown. The
.I warning-message
will be formatted at 70 characters wide.
.B ftpshut
knows the actual string length of the magic cookies. If no warning-message
is supplied, the default message "\fBSystem shutdown at %s\fR" is used.
.RE

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 6n
.rt
Successful completion.
.RE

.sp
.ne 2
.mk
.na
.B >0
.ad
.RS 6n
.rt
An error occurred.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/ftpd/ftpaccess
.ad
.RS 24n
.rt

.RE

.sp
.ne 2
.mk
.na
.B /etc/ftpd/ftpservers
.ad
.RS 24n
.rt

.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWftpu
_
Interface StabilityExternal
.TE

.SH SEE ALSO
.sp
.LP
.BR in.ftpd (1M),
.BR ftprestart (1M),
.BR shutdown (1M),
.BR ftpaccess (4),
.BR ftpservers (4),
.BR attributes (5)
