usr/src/man/man1m/fuser.1m
'\" te
.\" Copyright 1989 AT&T Copyright (c) 2003 Sun Microsystems, Inc. All Rights Reserved.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH fuser 1M "21 Oct 2003" "SunOS 5.11" "System Administration Commands"
.SH NAME
fuser \- identify users of files and devices
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/fuser\fR [\fB-c\fR | \fB-d\fR | \fB-f\fR] [\fB-nu\fR] [\fB-k\fR | \fB-s\fR \fIsig\fR] \fIfiles\fR
     [ [\fB- \fR] [\fB-c\fR | \fB-d\fR | \fB-f\fR] [\fB-nu\fR] [\fB-k\fR | \fB-s\fR \fIsig\fR] \fIfiles\fR] ...
.fi

.SH DESCRIPTION
.sp
.LP
The \fBfuser\fR utility displays the process \fBID\fRs of the processes
that are using the
.I files
specified as arguments.
.sp
.LP
Each process
.B ID
is followed by a letter code. These letter codes are
interpreted as follows. If the process is using the file as
.sp
.ne 2
.mk
.na
.B c
.ad
.RS 5n
.rt
Indicates that the process is using the file as its current directory.
.RE

.sp
.ne 2
.mk
.na
.B m
.ad
.RS 5n
.rt
Indicates that the process is using a file mapped with
.BR mmap (2).
See
.BR mmap (2)
for details.
.RE

.sp
.ne 2
.mk
.na
.B n
.ad
.RS 5n
.rt
Indicates that the process is holding a non-blocking mandatory lock on the
file.
.RE

.sp
.ne 2
.mk
.na
.B o
.ad
.RS 5n
.rt
Indicates that the process is using the file as an open file.
.RE

.sp
.ne 2
.mk
.na
.B r
.ad
.RS 5n
.rt
Indicates that the process is using the file as its root directory.
.RE

.sp
.ne 2
.mk
.na
.B t
.ad
.RS 5n
.rt
Indicates that the process is using the file as its text file.
.RE

.sp
.ne 2
.mk
.na
.B y
.ad
.RS 5n
.rt
Indicates that the process is using the file as its controlling terminal.
.RE

.sp
.LP
For block special devices with mounted file systems, all processes using
any file on that device are listed. For all types of files (text files,
executables, directories, devices, and so forth), only the processes using
that file are reported.
.sp
.LP
For all types of devices,
.B fuser
also displays any known kernel
consumers that have the device open. Kernel consumers are displayed in one
of the following formats:
.sp
.in +2
.nf
[\fImodule_name\fR]
[\fImodule_name\fR,dev_path=\fIpath\fR]
[\fImodule_name\fR,dev=(\fImajor\fR,\fIminor\fR)]
[\fImodule_name\fR,dev=(\fImajor\fR,\fIminor\fR),dev_path=\fIpath\fR]
.fi
.in -2
.sp

.sp
.LP
If more than one group of files are specified, the options may be
respecified for each additional group of files. A lone dash cancels the
options currently in force.
.sp
.LP
The process IDs are printed as a single line on the standard output,
separated by spaces and terminated with a single new line. All other output
is written on standard error.
.sp
.LP
Any user can run fuser, but only the superuser can terminate another user's
process.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -c
.ad
.RS 10n
.rt
Reports on files that are mount points for file systems, and any files
within that mounted file system.
.RE

.sp
.ne 2
.mk
.na
.B -d
.ad
.RS 10n
.rt
Report device usage information for all minor nodes bound to the same
device node as the specified minor node. This option does not report file
usage for files within a mounted file system.
.RE

.sp
.ne 2
.mk
.na
.B -f
.ad
.RS 10n
.rt
Prints a report for the named file, not for files within a mounted file
system.
.RE

.sp
.ne 2
.mk
.na
.B -k
.ad
.RS 10n
.rt
Sends the
.B SIGKILL
signal to each process. Since this option spawns
kills for each process, the kill messages may not show up immediately (see
.BR kill (2)).
No signals will be sent to kernel file consumers.
.RE

.sp
.ne 2
.mk
.na
.B -n
.ad
.RS 10n
.rt
Lists only processes with non-blocking mandatory locks on a file.
.RE

.sp
.ne 2
.mk
.na
.B -s
.I sig
.ad
.RS 10n
.rt
Sends a signal to each process. The
.I sig
option argument specifies one
of the symbolic names defined in the
.B <signal.h>
header, or a decimal
integer signal number. If
.I sig
is a symbolic name, it is recognized in
a case-independent fashion, without the
.B SIG
prefix. The \fB-k\fR
option is equivalent to
.B "-s KILL"
or
.BR "-s 9" .
No signals
will be sent to kernel file consumers.
.RE

.sp
.ne 2
.mk
.na
.B -u
.ad
.RS 10n
.rt
Displays the user login name in parentheses following the process
.BR ID .
.RE

.SH EXAMPLES
.LP
.B Example 1
Reporting on the Mount Point and Files
.sp
.LP
The following example reports on the mount point and files within the
mounted file system.

.sp
.in +2
.nf
example% \fBfuser -c /export/foo\fR
.fi
.in -2
.sp

.LP
.B Example 2
Restricting Output when Reporting on the Mount Point and
Files
.sp
.LP
The following example reports on the mount point and files within the
mounted file system, but the output is restricted to processes that hold
non-blocking mandatory locks.

.sp
.in +2
.nf
example% \fBfuser -cn /export/foo\fR
.fi
.in -2
.sp

.LP
.B Example 3
Sending SIGTERM to Processes Holding a Non-blocking
Mandatory Lock
.sp
.LP
The following command sends
.B SIGTERM
to any processes that hold a
non-blocking mandatory lock on file
.BR /export/foo/my_file .

.sp
.in +2
.nf
example% \fBfuser -fn -s term /export/foo/my_file\fR
.fi
.in -2
.sp

.SH ENVIRONMENT VARIABLES
.sp
.LP
See
.BR environ (5)
for descriptions of the following environment
variables that affect the execution of
.BR fuser :
.BR LANG ,
.B LC_ALL
.BR LC_CTYPE ,
.BR LC_MESSAGES ,
and
.BR NLSPATH .
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
_
Interface StabilityStandard
.TE

.SH SEE ALSO
.sp
.LP
.BR ps (1),
.BR mount (1M),
.BR kill (2),
.BR mmap (2),
.BR signal (3C),
.BR attributes (5),
.BR environ (5),
.BR standards (5)
.SH NOTES
.sp
.LP
Because
.B fuser
works with a snapshot of the system image, it may miss
processes that begin using a file while
.B fuser
is running. Also,
processes reported as using a file may have stopped using it while
.B fuser
was running. These factors should discourage the use of the
.B -k
option.
