usr/src/man/man1m/fwflash.1m
'\" te
.\" Copyright (c) 2008, Sun Microsystems, Inc. All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH fwflash 1M "4 Nov 2008" "SunOS 5.11" "System Administration Commands"
.SH NAME
fwflash \- firmware query and update utility
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/fwflash\fR  [\fB-l\fR [\fB-c\fR \fIdevice_class\fR | \fBALL\fR ]]
     | [\fB-v\fR] | [\fB-h\fR]
.fi

.LP
.nf
\fBfwflash\fR  [\fB-f\fR \fIfile1\fR,\fIfile2\fR,\fIfile3\fR,.\|.\|. | \fB-r\fR \fIfile\fR]
     [\fB-y\fR] [\fB-d\fR \fIdevice_path\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The \fBfwflash\fR command writes a binary image file to supported flashable
devices attached to a Solaris host. It also provides the ability to read
firmware to a file if supported by the device. Because changing the firmware
in a device can have significant impact on the stability of a system, only
users with the privilege
.B All
are allowed to execute this command.
Users authorized to run \fBfwflash\fR can be granted the "Firmware Flash
Update" Rights Profile.
.sp
.LP
The first form of the command, above, provides information about devices.
It lists all devices currently available on the system that are supported by
\fBfwflash\fR for firmware upgrade. You can filter the list operation, to
display only specified classes of devices. The second form of the command
provides the operations to read or write the firmware images to specific
devices.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB-c\fR \fIdevice_class\fR
.ad
.sp .6
.RS 4n
An optional parameter, valid only when used with the
.B -l
option. This
option causes the command to list only devices of a specific class type.
Currently supported classes are
.BR IB ,
.BR ses ,
.BR sesgen ,
or
.BR ALL .
If
.B -c
is not specified for the
.BR -l "option, the class"
defaults to
.BR ALL .
.RE

.sp
.ne 2
.mk
.na
\fB-d\fR \fIdev_path\fR
.ad
.sp .6
.RS 4n
The
.I dev_path
is absolute path name of the device that the user wants
to modify with the \fB-f\fRor \fB-r\fR operation. If the device cannot be
found, the command fails. If the
.B -d
option is specified, then either
\fB-f\fR or \fB-r\fR must also be specified.
.RE

.sp
.ne 2
.mk
.na
\fB-f\fR \fIfile1\fR,\fIfile2\fR,\fIfile3\fR,.\|.\|.\fR
.ad
.sp .6
.RS 4n
Specify the path to one or more binary firmware image files you want to
write to the device. \fBfwflash\fR will verify that each file is a valid
firmware image for the specified device. If it is not, the command fails
with an appropriate error message.
.sp
If multiple firmware image files are specified, each image is verified and
flashed to the device in the order given on the command line. If any of the
specified files cannot be successfully flashed, then an appropriate message
is displayed.
.sp
After a new firmware image is flashed to a device, a reboot is required to
correctly activate the new firmware.
.RE

.sp
.ne 2
.mk
.na
.B -h
.ad
.sp .6
.RS 4n
Display the command line usage message for \fBfwflash\fR.
.RE

.sp
.ne 2
.mk
.na
.B -l
.ad
.sp .6
.RS 4n
List the devices on a system available for firmware upgrade and display
information specific to each device or device class.
.sp
For InfiniBand (IB) devices, the list operation  displays the \fBguid\fRs
(Globally Unique Identifier) currently set for the HCA, as well as the
current firmware revision installed. There are four separate \fBguid\fRs on
the HCA; two of them can be set with the same value.
.sp
For SCSI Enclosure Services (\fBses\fR or
.BR sgen )
devices, an
identifying target-port worldwide name is displayed, if available.
.RE

.sp
.ne 2
.mk
.na
\fB-r\fR \fIfile\fR
.ad
.sp .6
.RS 4n
Specify the path to a file to create when reading the firmware from the
device. The \fB-f\fR and
.B -r
options are mutually exclusive.
.sp
Not all flashable devices support reading firmware images back from the
device. At present, only InfiniBand (IB) devices are supported for this
operation. A message will be displayed if the selected device does not
support this operation.
.RE

.sp
.ne 2
.mk
.na
.B -v
.ad
.sp .6
.RS 4n
Display \fBfwflash\fR version information and exit.
.RE

.sp
.ne 2
.mk
.na
.B -y
.ad
.sp .6
.RS 4n
Valid only when a flash read (\fB-r\fR) or write (\fB-f\fR) operation is
specified. This option causes \fBfwflash\fR not to prompt for confirmation
during operation and operate non-interactively. Note that there is no option
that allows you to forcibly flash an incompatible firmware image onto a
device.
.RE

.SH EXAMPLES
.LP
\fBExample 1\fR Entering Command Without Arguments
.sp
.LP
The following command shows \fBfwflash\fR when the command is entered
without arguments.

.sp
.in +2
.nf
example# \fBfwflash\fR
Usage:
Usage:
      fwflash [-l [-c device_class | ALL]] | [-v] | [-h]
      fwflash [-f file1,file2,file3,.\|.\|. | -r file] [-y] -d device_path

      -l              list flashable devices in this system
      -c device_class limit search to a specific class
                      eg IB for InfiniBand, ses for SCSI Enclosures
      -v              print version number of fwflash utility
      -h              print this usage message

      -f file1,file2,file3,.\|.\|.
                      firmware image file list to flash
      -r file         file to dump device firmware to
      -y              answer Yes/Y/y to prompts
      -d device_path  pathname of device to be flashed

      If -d device_path is specified, then one of -f <files>
      or -r <file> must also be specified

      If multiple firmware images are required to be flashed
      they must be listed together, separated by commas. The
      images will be flashed in the order specified.
.fi
.in -2
.sp

.LP
\fBExample 2\fR Listing Devices Available to Flash
.sp
.LP
The following command lists the devices available to be flashed.

.sp
.in +2
.nf
example# \fBfwflash -l\fR
List of available devices:
Device[0],  /devices/pci@0,0/pci8086,3595@2/pci8086,32a@0,2/\e
            pci15b3,5a46@c/pci15b3,5a44@0:devctl
    Class [IB]
        GUID: System Image - 0002c901081e33b3
              Node         - 0000000000003446
              Port 1       - 0002c901081e33b1
              Port 2       - 0002c901081e33b2
        Firmware revision: 3.3.0002
        No hardware information available for this device

Device[1],  /devices/pci@0,0/pci8086,3597@4/pci15b3,6278@0:devctl
    Class [IB]
        GUID: System Image - 0002c9010a99e3b3
              Node         - 0002c9010a99e3b0
              Port 1       - 0002c9010a99e3b1
              Port 2       - 0002c9010a99e3b2
        Firmware revision: 4.8.00c8
        Product           : MTLP25208-CF256T (Lion cub)
        PSID              : MT_00B0000001
.fi
.in -2
.sp

.sp
.LP
Alternatively, for a SAS Expander presented as a SCSI Enclosure Services
device , we might see output such as this:

.sp
.in +2
.nf
example# \fBfwflash -l\fR
List of available devices:
Device[0] /devices/pci@0/pci@0/pci@2/scsi@0/ses@3,0:ses
  Class [sgen]
        Target port WWN  : 500605b00002453d
        Vendor           : SUN
        Product          : 16Disk Backplane
        Firmware revision: 5021
.fi
.in -2
.sp

.LP
\fBExample 3\fR Flash Upgrading an IB HCA Device
.sp
.LP
The following command flash upgrades an IB HCA device.

.sp
.in +2
.nf
example# \fBfwflash -f ./version.3.2.0000 \e
   -d /devices/pci@0,0/pci8086,3597@4/pci15b3,6278@0:devctl\fR
About to update firmware on:
  /devices/pci@0,0/pci8086,3597@4/pci15b3,6278@0:devctl
Continue (Y/N): \fBY\fR

Updating . . . . . . . . . . . .
Done.  New image will be active after the system is rebooted.
.fi
.in -2
.sp

.sp
.LP
Note that you are prompted before the upgrading proceeds and that it is
mandatory that you reboot your host to activate the new firmware image.

.sp
.LP
The following command adds the
.B -y
option to the command.

.sp
.in +2
.nf
example# \fBfwflash -y -f ./version.3.2.0000 \e
   -d /devices/pci@0,0/pci8086,3597@4/pci15b3,6278@0:devctl\fR
About to update firmware on:
  /devices/pci@0,0/pci8086,3597@4/pci15b3,6278@0:devctl

Updating . . . . . . . . . . . .
Done.  New image will be active after the system is rebooted.
.fi
.in -2
.sp

.LP
\fBExample 4\fR Reading Device Firmware to File
.sp
.LP
The command shown below reads the device firmware to a file. The command
uses the
.B -y
option so that read occurs without prompting.

.sp
.in +2
.nf
example# \fBfwflash -y -r /firmware.bin \e
   -d /devices/pci@1d,700000/pci@1/pci15b3,5a44@0:devctl\fR
About to read firmware on:
         /devices/pci@1d,700000/pci@1/pci15b3,5a44@0:devctl
to filename: /firmware.bin

Reading . . .
Done.
.fi
.in -2
.sp

.LP
\fBExample 5\fR When No Flashable Devices Are Found
.sp
.LP
The command output shown below informs the user that there are no supported
flashable devices found in the system:

.sp
.in +2
.nf
example# \fBfwflash -l\fR
fwflash: No flashable devices attached with the ses driver in this system
fwflash: No flashable devices attached with the sgen driver in this system
fwflash: No flashable devices attached with the tavor driver in this system
fwflash: No flashable devices in this system
.fi
.in -2
.sp

.sp
.LP
Each plugin found in \fB/usr/lib/fwflash/identify\fR is loaded in turn, and
walks the system device tree, determining whether any currently-attached
devices can be flashed. For the list of device types and drivers that are
currently supported, please see the
.B NOTES
section below.

.SH RETURN VALUES
.sp
.LP
The \fBfwflash\fR command returns the following values:
.sp
.ne 2
.mk
.na
.B 0
.ad
.sp .6
.RS 4n
Success
.RE

.sp
.ne 2
.mk
.na
.B 1
.ad
.sp .6
.RS 4n
Failure
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWfwflash
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
.BR attributes (5),
.BR hermon (7D),
.BR ses (7D),
.BR tavor (7D)
.sp
.LP
The InfiniBand Trade Association website, http://www.infinibandta.org
.sp
.LP
The SCSI Storage Interfaces committee website, http://www.t10.org
.sp
.LP
.I SCSI Primary Commands-4, SPC4
.sp
.LP
.I SCSI Enclosure Services-2, SES2
.sp
.LP
.I Serial Attached SCSI-2, SAS2
.SH NOTES
.sp
.LP
The \fBfwflash\fR command supports:
.RS +4
.TP
.ie t \(bu
.el o
InfiniBand Host Channel Adapters (IB HCAs) containing either the AMD or the
Intel parallel flash parts.
.RE
.RS +4
.TP
.ie t \(bu
.el o
SCSI Enclosure Services devices such as SAS Expanders, attached with
.BR ses (7D)
drivers.
.RE
