usr/src/man/man1m/fwtmp.1m
'\" te
.\" Copyright 1989 AT&T  Copyright (c) 1999 Sun Microsystems, Inc.  All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH fwtmp 1M "22 Feb 1999" "SunOS 5.11" "System Administration Commands"
.SH NAME
fwtmp, wtmpfix \- manipulate connect accounting records
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/acct/fwtmp\fR [\fB-ic\fR]
.fi

.LP
.nf
\fB/usr/lib/acct/wtmpfix\fR [\fIfile\fR]...
.fi

.SH DESCRIPTION
.sp
.LP
.B fwtmp
reads from the standard input and writes to the standard
output, converting binary records of the type found in \fB/var/adm/wtmpx\fR
to formatted ASCII records. The ASCII version is useful when it is necessary
to edit  bad records.
.sp
.LP
.B wtmpfix
examines the standard input or named files in
.BR utmpx
format, corrects the time/date stamps to make the entries consistent, and
writes to the standard output. A hyphen (\fB\(mi\fR) can be used in place of
.I file
to indicate the standard input. If time/date corrections are not
performed, \fBacctcon\fR(1M) will fault when it encounters certain
date-change records.
.sp
.LP
Each time the date is set, a pair of date change records are written to
.BR /var/adm/wtmpx .
The first record is the old date denoted by the string
"\fBold time\fR" placed in the \fBline\fR field and the flag
.B OLD_TIME
placed in the
.B type
field of the
.BR utmpx
structure. The second record specifies the new date and is denoted by the
string
.B "new time"
placed in the
.B line
field and the flag
.B NEW_TIME
placed in the
.B type
field. \fBwtmpfix\fR
uses these records to synchronize all time stamps in the file.
.sp
.LP
In addition to correcting time/date stamps,
.B wtmpfix
will check the
validity of the
.B name
field to ensure that it consists solely of
alphanumeric characters or spaces. If it encounters a name that is
considered invalid, it will change the login name to
.B INVALID
and write a diagnostic to the standard error. In
this way, \fBwtmpfix\fR reduces the chance that \fBacctcon\fR will fail when
processing connect accounting records.
.SH OPTIONS
.sp
.ne 2
.mk
.na
.B -ic
.ad
.RS 7n
.rt
Denotes that input is in ASCII form, and output is to be written in binary
form.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B /var/adm/wtmpx
.ad
.RS 18n
.rt
history of user access and administration information
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWaccu
.TE

.SH SEE ALSO
.sp
.LP
.BR acctcom (1),
.BR ed (1),
.BR acct (1M),
.BR acctcms (1M),
.BR acctcon (1M),
.BR acctmerg (1M),
.BR acctprc (1M),
.BR acctsh (1M),
.BR runacct (1M),
.BR acct (2),
.BR acct.h (3HEAD),
.BR utmpx (4),
.BR attributes (5)
.sp
.LP
\fR
