usr/src/man/man1m/getdev.1m
'\" te
.\" Copyright 1989 AT&T  Copyright (c) 1997 Sun Microsystems, Inc.  All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH getdev 1M "5 Jul 1990" "SunOS 5.11" "System Administration Commands"
.SH NAME
getdev \- lists devices based on criteria
.SH SYNOPSIS
.LP
.nf
\fBgetdev\fR [\fB-ae\fR] [\fIcriteria\fR].\|.\|. [\fIdevice\fR].\|.\|.
.fi

.SH DESCRIPTION
.sp
.LP
.B getdev
generates a list of devices that match certain criteria. The
criteria includes a list of attributes (given in expressions) and a list of
devices. If no  criteria are given, all devices are included in the list.
.sp
.LP
Devices must satisfy at least one of the criteria in the list unless the
.B -a
option is used. Then, only those devices which match all of the
criteria in a list will be included.
.sp
.LP
Devices which are defined on the command line and which match the criteria
are included in the generated list. However, if the
.B -e
option is used,
the list becomes a set of devices to be
.I excluded
from the list. See
.B OPTIONS
and
.BR OPERANDS .
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -a
.ad
.RS 6n
.rt
Specifies that a device must match all criteria to be included in the list
generated by this command. The option has no effect if no criteria are
defined.
.RE

.sp
.ne 2
.mk
.na
.B -e
.ad
.RS 6n
.rt
Specifies that the list of devices which follows on the command line should
be
.I excluded
from the list generated by this command. Without the
.B -e
the named devices are
.I included
in the generated list. The
flag has no effect if no devices are defined.
.RE

.SH OPERANDS
.sp
.LP
The following operands are supported:
.sp
.ne 2
.mk
.na
.I criteria
.ad
.RS 12n
.rt
Defines the criteria that a device must match to be included in the
generated list.
.I criteria
is specified by expressions.
.sp
There are four possible expression types which the criteria specified in
the
.I criteria
argument may follow:
.sp
.ne 2
.mk
.na
\fIattribute\fB=\fIvalue\fR
.ad
.RS 20n
.rt
Selects all devices whose attribute
.I attribute
is defined and is equal
to
.IR value .
.RE

.sp
.ne 2
.mk
.na
\fIattribute\fB!=\fIvalue\fR
.ad
.RS 20n
.rt
Selects all devices whose attribute
.I attribute
is defined and does not
equal
.IR value .
.RE

.sp
.ne 2
.mk
.na
.IB attribute :*
.ad
.RS 20n
.rt
Selects all devices which have the attribute
.I attribute
defined.
.RE

.sp
.ne 2
.mk
.na
.IB attribute !:*
.ad
.RS 20n
.rt
Selects all devices which do not have the attribute
.IR attribute
defined.
.RE

See the
.BR putdev (1M)
manual page for a complete listing and description
of available attributes.
.RE

.sp
.ne 2
.mk
.na
.I device
.ad
.RS 12n
.rt
Defines the devices which should be included in the generated list. This
can be the pathname of the device or the device alias.
.RE

.SH EXIT STATUS
.sp
.LP
The  following  exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 5n
.rt
Successful completion.
.RE

.sp
.ne 2
.mk
.na
.B 1
.ad
.RS 5n
.rt
Command syntax was incorrect, invalid option was used, or an internal error
occurred.
.RE

.sp
.ne 2
.mk
.na
.B 2
.ad
.RS 5n
.rt
Device table could not be opened for reading.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/device.tab
.ad
.RS 19n
.rt

.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.sp
.LP
.BR devattr (1M),
.BR getdgrp (1M),
.BR putdev (1M),
.BR putdgrp (1M),
.BR attributes (5)
