usr/src/man/man1m/getdevpolicy.1m
'\" te
.\" Copyright (c) 2004, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH getdevpolicy 1M "9 Apr 2004" "SunOS 5.11" "System Administration Commands"
.SH NAME
getdevpolicy \- inspect the system's device policy
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/getdevpolicy\fR [\fIdevice\fR\&.\|.\|.]
.fi

.SH DESCRIPTION
.sp
.LP
Without arguments,
.B getdevpolicy
outputs the device policy in effect
to standard output.
.sp
.LP
With arguments, each argument is treated as a pathname to a device and the
device policy in effect for that specific device is printed preceeded by the
supplied pathname.
.SH USAGE
.sp
.LP
 The device policy adds access restrictions over and above the file
permissions.
.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 12n
.rt
Successful completion.
.RE

.sp
.ne 2
.mk
.na
.B non-zero
.ad
.RS 12n
.rt
An error occurred.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
_
Interface StabilitySee below
.TE

.sp
.LP
The invocation is evolving. The output is unstable.
.SH SEE ALSO
.sp
.LP
.BR add_drv (1M),
.BR rem_drv (1M),
.BR update_drv (1M),
.BR attributes (5),
.BR privileges (5),
.BR devfs (7FS)
