usr/src/man/man1m/getdgrp.1m
'\" te
.\" Copyright (c) 1996, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" Copyright 1989 AT&T
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH getdgrp 1M "5 Jul 1990" "SunOS 5.11" "System Administration Commands"
.SH NAME
getdgrp \- lists device groups which contain devices that match criteria
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/getdgrp\fR [\fB-ael\fR] [\fIcriteria\fR].\|.\|. [\fIdgroup\fR].\|.\|.
.fi

.SH DESCRIPTION
.sp
.LP
.B getdgrp
generates a list of device groups that contain devices
matching the given criteria. The criteria is given in the form of
expressions.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -a
.ad
.RS 6n
.rt
Specifies that a device must match all criteria to be included in the list
generated by this command. The option has no effect if no criteria are
defined.
.RE

.sp
.ne 2
.mk
.na
.B -e
.ad
.RS 6n
.rt
Specifies that the list of device groups on the command line should be
.I excluded
from the list generated by this command. Without the
.B -e
option the named device groups are
.I included
in  the
generated list. The flag has no effect if no devices are defined.
.RE

.sp
.ne 2
.mk
.na
.B -l
.ad
.RS 6n
.rt
Specifies that all device groups (subject to the
.B -e
option and the
.I dgroup
list) should be listed even if they contain no valid device
members. This option has no affect if
.I criteria
is specified on the
command line.
.RE

.SH OPERANDS
.sp
.LP
The following operands are supported:
.sp
.ne 2
.mk
.na
.I criteria
.ad
.RS 12n
.rt
Defines criteria that a device must match before a device group to which it
belongs can be included in the generated list. Specify
.I criteria
as an
expression or a list of expressions which a device must meet for its group
to be included in the list generated by
.BR getdgrp .
If no criteria are
given, all device groups are included in the list.
.sp
Devices must satisfy at least one of the criteria in the list. However,
the \fB-a\fR option can be used to define that a "logical and" operation
should be performed. Then, only those groups containing devices which match
all of the criteria in a list will be included.
.sp
There are four possible expressions types which the criteria specified in
the
.I criteria
argument may follow:
.sp
.ne 2
.mk
.na
\fIattribute\fB=\fIvalue\fR
.ad
.RS 20n
.rt
Selects all device groups with a member whose attribute
.I attribute
is
defined and is equal to
.IR value .
.RE

.sp
.ne 2
.mk
.na
\fIattribute\fB!=\fIvalue\fR
.ad
.RS 20n
.rt
Selects all device groups with a member whose attribute
.I attribute
is
defined and does not equal
.IR value .
.RE

.sp
.ne 2
.mk
.na
\fIattribute\fB:*\fR
.ad
.RS 20n
.rt
Selects all device groups with a member which has the attribute
.I attribute
defined.
.RE

.sp
.ne 2
.mk
.na
\fIattribute\fB!:*\fR
.ad
.RS 20n
.rt
Selects all device groups with a member  which does not have the attribute
.I attribute
defined.
.RE

See \fBputdev\fR(1M) for a complete listing and description of available
attributes.
.RE

.sp
.ne 2
.mk
.na
.I dgroup
.ad
.RS 12n
.rt
Defines a set of device groups which should be included in or excluded from
the generated list. Device groups that are defined and which contain devices
matching the criteria are included.
.sp
If the
.B -e
option is used, this list defines a set of device groups
to be excluded. When the
.B -e
option is used and
.I criteria
is
also defined, the generated list will include device groups containing
devices which match the criteria and are not in the command line list.
.RE

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 5n
.rt
Successful completion of the task.
.RE

.sp
.ne 2
.mk
.na
.B 1
.ad
.RS 5n
.rt
Command syntax was incorrect, invalid option was used, or an internal error
occurred.
.RE

.sp
.ne 2
.mk
.na
.B 2
.ad
.RS 5n
.rt
Device table or device group table could not be opened for reading.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/device.tab
.ad
.RS 19n
.rt

.RE

.sp
.ne 2
.mk
.na
.B /etc/dgroup.tab
.ad
.RS 19n
.rt

.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.sp
.LP
.BR devattr (1M),
.BR getdev (1M),
.BR putdev (1M),
.BR putdgrp (1M),
.BR attributes (5)
