usr/src/man/man1m/getdev.1m
'\" te
.\" Copyright 1989 AT&T  Copyright (c) 1997 Sun Microsystems, Inc.  All Rights Reserved.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH getdev 1M "5 Jul 1990" "SunOS 5.11" "System Administration Commands"
.SH NAME
getdev \- lists devices based on criteria
.SH SYNOPSIS
.LP
.nf
\fBgetdev\fR [\fB-ae\fR] [\fIcriteria\fR].\|.\|. [\fIdevice\fR].\|.\|.
.fi

.SH DESCRIPTION
.sp
.LP
\fBgetdev\fR generates a list of devices that match certain criteria. The
criteria includes a list of attributes (given in expressions) and a list of
devices. If no  criteria are given, all devices are included in the list.
.sp
.LP
Devices must satisfy at least one of the criteria in the list unless the
\fB-a\fR option is used. Then, only those devices which match all of the
criteria in a list will be included.
.sp
.LP
Devices which are defined on the command line and which match the criteria
are included in the generated list. However, if the \fB-e\fR option is used,
the list becomes a set of devices to be \fIexcluded\fR from the list. See
\fBOPTIONS\fR and  \fBOPERANDS\fR.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB-a\fR
.ad
.RS 6n
.rt
Specifies that a device must match all criteria to be included in the list
generated by this command. The option has no effect if no criteria are
defined.
.RE

.sp
.ne 2
.mk
.na
\fB-e\fR
.ad
.RS 6n
.rt
Specifies that the list of devices which follows on the command line should
be \fIexcluded\fR from the list generated by this command. Without the
\fB-e\fR the named devices are \fIincluded\fR in the generated list. The
flag has no effect if no devices are defined.
.RE

.SH OPERANDS
.sp
.LP
The following operands are supported:
.sp
.ne 2
.mk
.na
\fIcriteria\fR
.ad
.RS 12n
.rt
Defines the criteria that a device must match to be included in the
generated list. \fIcriteria\fR is specified by expressions.
.sp
There are four possible expression types which the criteria specified in
the \fIcriteria\fR argument may follow:
.sp
.ne 2
.mk
.na
\fIattribute\fB=\fIvalue\fR
.ad
.RS 20n
.rt
Selects all devices whose attribute \fIattribute\fR is defined and is equal
to \fIvalue\fR.
.RE

.sp
.ne 2
.mk
.na
\fIattribute\fB!=\fIvalue\fR
.ad
.RS 20n
.rt
Selects all devices whose attribute \fIattribute\fR is defined and does not
equal \fIvalue\fR.
.RE

.sp
.ne 2
.mk
.na
\fIattribute\fB:*\fR
.ad
.RS 20n
.rt
Selects all devices which have the attribute \fIattribute\fR defined.
.RE

.sp
.ne 2
.mk
.na
\fIattribute\fB!:*\fR
.ad
.RS 20n
.rt
Selects all devices which do not have the attribute \fIattribute\fR
defined.
.RE

See the \fBputdev\fR(1M) manual page for a complete listing and description
of available attributes.
.RE

.sp
.ne 2
.mk
.na
\fIdevice\fR
.ad
.RS 12n
.rt
Defines the devices which should be included in the generated list. This
can be the pathname of the device or the device alias.
.RE

.SH EXIT STATUS
.sp
.LP
The  following  exit values are returned:
.sp
.ne 2
.mk
.na
\fB0\fR
.ad
.RS 5n
.rt
Successful completion.
.RE

.sp
.ne 2
.mk
.na
\fB1\fR
.ad
.RS 5n
.rt
Command syntax was incorrect, invalid option was used, or an internal error
occurred.
.RE

.sp
.ne 2
.mk
.na
\fB2\fR
.ad
.RS 5n
.rt
Device table could not be opened for reading.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
\fB/etc/device.tab\fR
.ad
.RS 19n
.rt

.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.sp
.LP
\fBdevattr\fR(1M), \fBgetdgrp\fR(1M), \fBputdev\fR(1M), \fBputdgrp\fR(1M),
\fBattributes\fR(5)
