usr/src/man/man1m/gettable.1m
'\" te
.\" Copyright 1989 AT&T  Copyright (c) 1997 Sun Microsystems, Inc.  All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH gettable 1M "14 Sep 1992" "SunOS 5.11" "System Administration Commands"
.SH NAME
gettable \- get DoD Internet format host table from a host
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/gettable\fR \fIhost\fR
.fi

.SH DESCRIPTION
.sp
.LP
.B gettable
is a simple program used to obtain the DoD Internet host
table from a "hostname" server. The specified  \fIhost\fR is queried for the
table. The table is placed in the file
.BR hosts.txt .
.sp
.LP
.B gettable
operates by opening a
.B TCP
connection to the port
indicated in the service specification for "hostname". A request is then
made for all names and the resultant information is placed in the output
file.
.sp
.LP
.B gettable
is best used in conjunction with the
.BR htable (1M)
program which converts the DoD Internet host table format to that used by
the network library lookup routines.
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWnisu
.TE

.SH SEE ALSO
.sp
.LP
.BR htable (1M),
.BR attributes (5)
Harrenstien, Ken, Mary Stahl, and
Elizabeth Feinler,\fR  \fBHOSTNAME\fR
.IR Server ,
.B RFC
953,
Network Information Center,
.B SRI
International, Menlo Park, California,
October 1985.
.SH NOTES
.sp
.LP
Should allow requests for only part of the database.
