usr/src/man/man1m/getty.1m
'\" te
.\" Copyright 1989 AT&T  Copyright (c) 1997 Sun Microsystems, Inc.  All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH getty 1M "14 Sep 1992" "SunOS 5.11" "System Administration Commands"
.SH NAME
getty \- set terminal type, modes, speed, and line discipline
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/saf/ttymon\fR [\fB-h\fR] [\fB-t\fR \fItimeout\fR] \fIline\fR
     [\fIspeed\fR [\fItype\fR [\fIlinedisc\fR]]]
.fi

.LP
.nf
\fB/usr/lib/saf/ttymon\fR \fB-c\fR \fIfile\fR
.fi

.SH DESCRIPTION
.sp
.LP
.B getty
sets terminal type, modes, speed, and line discipline.
.B getty
is a symbolic link to
.BR /usr/lib/saf/ttymon .
It is included
for compatibility with previous releases  for the few applications that
still call
.B getty
directly.
.sp
.LP
.B getty
can only be executed by the super-user, (a process with the
user
.BR "ID root" ).
Initially
.B getty
prints the login prompt,
waits for the user's login name, and then invokes the
.B login
command.
.B getty
attempts to adapt the system to the terminal speed by using the
options and arguments specified on the command line.
.sp
.LP
Without optional arguments,
.B getty
specifies the following: The
.I speed
of the interface is set to 300 baud, either parity is allowed,
.B NEWLINE
characters are converted to carriage return-line feed, and tab
expansion is performed on the standard output.
.B getty
types the login
prompt before reading the user's name a character at a time. If a null
character (or framing error)  is received, it is assumed to be the result of
the user pressing the
.B BREAK
key. This will cause
.B getty
to
attempt the next
.I speed
.RB "in the series. The series that" " getty"
tries is determined by what it finds in
.B /etc/ttydefs
\&.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -h
.ad
.RS 14n
.rt
If the
.B -h
flag is not set, a hangup will be forced by setting the
speed to zero before setting the speed to the default or a specified
speed.
.RE

.sp
.ne 2
.mk
.na
.BI -t " timeout"
.ad
.RS 14n
.rt
Specifies that
.B getty
should exit if the open on the line succeeds and
no one types anything in
.I timeout
seconds.
.RE

.sp
.ne 2
.mk
.na
.BI -c " file"
.ad
.RS 14n
.rt
The
.B -c
option is no longer supported. Instead use
.B /usr/sbin/sttydefs -l
to list the contents of the
.B /etc/ttydefs
file and perform a validity check on the file.
.RE

.SH OPERANDS
.sp
.LP
The following operands are supported:
.sp
.ne 2
.mk
.na
.I line
.ad
.RS 21n
.rt
The name of a
.B TTY
line in
.B /dev
to which
.B getty
is to
attach itself.
.B getty
uses this string as the name of a file in the
.B /dev
directory to open for reading and writing.
.RE

.sp
.ne 2
.mk
.na
.I speed
.ad
.RS 21n
.rt
The
.I speed
argument is a label to a speed and
.B TTY
definition
in the file
.BR /etc/ttydefs .
This definition tells
.B getty
at what
speed to run initially,  what the initial
.B TTY
settings are, and what
speed to try next, (should the user press the
.B BREAK
key to indicate
that the speed is inappropriate). The default
.I speed
is 300 baud.
.RE

.sp
.ne 2
.mk
.na
.I type
and
.IR linedisc
.ad
.RS 21n
.rt
These options are obsolete and will be ignored.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/ttydefs
.ad
.RS 16n
.rt

.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsr
.TE

.SH SEE ALSO
.sp
.LP
.BR ct (1C),
.BR login (1),
.BR sttydefs (1M),
.BR ttymon (1M),
.BR ioctl (2),
.BR attributes (5),
.BR tty (7D)
