usr/src/man/man1m/gettable.1m
'\" te
.\" Copyright 1989 AT&T  Copyright (c) 1997 Sun Microsystems, Inc.  All Rights Reserved.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH gettable 1M "14 Sep 1992" "SunOS 5.11" "System Administration Commands"
.SH NAME
gettable \- get DoD Internet format host table from a host
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/gettable\fR \fIhost\fR
.fi

.SH DESCRIPTION
.sp
.LP
\fBgettable\fR is a simple program used to obtain the DoD Internet host
table from a "hostname" server. The specified  \fIhost\fR is queried for the
table. The table is placed in the file
.BR hosts.txt .
.sp
.LP
\fBgettable\fR operates by opening a \fBTCP\fR connection to the port
indicated in the service specification for "hostname". A request is then
made for all names and the resultant information is placed in the output
file.
.sp
.LP
\fBgettable\fR is best used in conjunction with the
.BR htable (1M)
program which converts the DoD Internet host table format to that used by
the network library lookup routines.
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWnisu
.TE

.SH SEE ALSO
.sp
.LP
.BR htable (1M),
.BR attributes (5)
Harrenstien, Ken, Mary Stahl, and
Elizabeth Feinler,\fR  \fBHOSTNAME\fR
.IR Server ,
\fBRFC\fR 953,
Network Information Center,
.B SRI
International, Menlo Park, California,
October 1985.
.SH NOTES
.sp
.LP
Should allow requests for only part of the database.
