usr/src/man/man1m/groupmod.1m
'\" te
.\" Copyright 1989 AT&T  Copyright (c) 1997, Sun Microsystems, Inc.  All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH groupmod 1M "27 Aug 2008" "SunOS 5.11" "System Administration Commands"
.SH NAME
groupmod \- modify a group definition on the system
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/groupmod\fR [\fB-g\fR \fIgid\fR [\fB-o\fR]] [\fB-n\fR \fIname\fR] \fIgroup\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B groupmod
command modifies the definition of the specified group
by modifying the appropriate entry in the
.B /etc/group
file.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -g
.I gid
.ad
.RS 11n
.rt
Specify the new group
.B ID
for the group. This group
.B ID
must be a
non-negative decimal integer less than
.BR MAXUID ,
as defined in
\fB<param.h>\fR\&. The group \fBID\fR defaults to the next available
(unique) number above 99. (Group IDs from 0-99 are reserved by SunOS for
future applications.)
.RE

.sp
.ne 2
.mk
.na
.B -n
.I name
.ad
.RS 11n
.rt
Specify the new name for the group.  The
.I name
argument is a string of
no more than eight bytes consisting of characters from the set of lower case
alphabetic characters and numeric characters.  A warning message will be
written if these restrictions are not met.  A future Solaris release may
refuse to accept group fields that do not meet these requirements.  The
.I name
argument must contain at least one character and must not include
a colon (\fB:\fR) or \fBNEWLINE\fR (\fB\en\fR).
.RE

.sp
.ne 2
.mk
.na
.B -o
.ad
.RS 11n
.rt
Allow the
.I gid
to be duplicated (non-unique).
.RE

.SH OPERANDS
.sp
.LP
The following operands are supported:
.sp
.ne 2
.mk
.na
.I group
.ad
.RS 9n
.rt
An existing group name to be modified.
.RE

.SH EXIT STATUS
.sp
.LP
The
.B groupmod
utility exits with one of the following values:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 6n
.rt
Success.
.RE

.sp
.ne 2
.mk
.na
.B 2
.ad
.RS 6n
.rt
Invalid command syntax. A usage message for the
.B groupmod
command is
displayed.
.RE

.sp
.ne 2
.mk
.na
.B 3
.ad
.RS 6n
.rt
An invalid argument was provided to an option.
.RE

.sp
.ne 2
.mk
.na
.B 4
.ad
.RS 6n
.rt
.I gid
is not unique (when the
.B -o
option is not used).
.RE

.sp
.ne 2
.mk
.na
.B 6
.ad
.RS 6n
.rt
.I group
does not exist.
.RE

.sp
.ne 2
.mk
.na
.B 9
.ad
.RS 6n
.rt
.I name
already exists as a group name.
.RE

.sp
.ne 2
.mk
.na
.B 10
.ad
.RS 6n
.rt
Cannot update the
.B /etc/group
file.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/group
.ad
.RS 14n
.rt
group file
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.sp
.LP
.BR users (1B),
.BR groupadd (1M),
.BR groupdel (1M),
.BR logins (1M),
.BR useradd (1M),
.BR userdel (1M),
.BR usermod (1M),
.BR group (4),
.BR attributes (5)
.SH NOTES
.sp
.LP
The
.B groupmod
utility only modifies group definitions in the
.B /etc/group
file. If a network name service such as
.B NIS
or
.B NIS+
is being used to supplement the local
.B /etc/group
file with
additional entries,
.B groupmod
cannot change information supplied by the
network name service. The
.B groupmod
utility will, however, verify the
uniqueness of group name and group
.B ID
against the external name
service.
.sp
.LP
.B groupmod
fails if a group entry (a single line in
.BR /etc/group )
exceeds 2047 characters.
