usr/src/man/man1m/groupdel.1m
'\" te
.\" Copyright 1989 AT&T  Copyright (c) 1997, Sun Microsystems, Inc.  All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH groupdel 1M "27 Aug 2008" "SunOS 5.11" "System Administration Commands"
.SH NAME
groupdel \- delete a group definition from the system
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/groupdel\fR \fIgroup\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B groupdel
utility deletes a group definition from the system. It
deletes the appropriate entry from the
.B /etc/group
file.
.SH OPERANDS
.sp
.ne 2
.mk
.na
.I group
.ad
.RS 9n
.rt
An existing group name to be deleted.
.RE

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 6n
.rt
Success.
.RE

.sp
.ne 2
.mk
.na
.B 2
.ad
.RS 6n
.rt
Invalid command syntax. A usage message for the
.B groupdel
command is
displayed.
.RE

.sp
.ne 2
.mk
.na
.B 6
.ad
.RS 6n
.rt
\fIgroup\fR does not exist.
.RE

.sp
.ne 2
.mk
.na
.B 10
.ad
.RS 6n
.rt
Cannot update the
.B /etc/group
file.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/group
.ad
.RS 14n
.rt
system file containing group definitions
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.sp
.LP
.BR users (1B),
.BR groupadd (1M),
.BR groupmod (1M),
.BR logins (1M),
.BR useradd (1M),
.BR userdel (1M),
.BR usermod (1M),
.BR attributes (5)
.SH NOTES
.sp
.LP
The
.B groupdel
utility only deletes a group definition that is in the
local
.B /etc/group
file. If a network nameservice such as
.B NIS
or
\fBNIS+\fR is being used to supplement the local \fB/etc/group\fR file with
additional entries,
.B groupdel
cannot change information supplied by the
network nameservice.
.sp
.LP
\fBgroupdel\fR fails if a group entry (a single line in
.BR /etc/group )
exceeds 2047 characters.
