usr/src/man/man1m/gssd.1m
'\" te
.\" Copyright (c) 2004, Sun Microsystems, Inc. All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH gssd 1M "25 Apr 2007" "SunOS 5.11" "System Administration Commands"
.SH NAME
gssd \- generates and validates GSS-API tokens for kernel RPC
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/gss/gssd\fR
.fi

.SH DESCRIPTION
.sp
.LP
\fBgssd\fR is the user mode daemon that operates between the kernel
rpc and the Generic Security Service Application Program Interface
(\fBGSS-API\fR) to generate and validate \fBGSS-API\fR security tokens. In
addition,
.B gssd
maps the
.B GSS-API
principal names to the local
user and group ids. By default, all groups that the requested user belongs
to will be included in the grouplist credential.
.B gssd
is invoked by
the Internet daemon \fBinetd\fR(1m) the first time that the kernel \fBRPC\fR
requests
.B GSS-API
services.
.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 6n
.rt
Successful completion.
.RE

.sp
.ne 2
.mk
.na
\fB>\fB0\fR
.ad
.RS 6n
.rt
An error occurred.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWgssk
_
Interface StabilityEvolving
.TE

.SH SEE ALSO
.sp
.LP
.BR kill (1),
.BR pkill (1),
.BR svcs (1),
.BR inetadm (1M),
.BR inetd (1M),
.BR gsscred (1M),
.BR svcadm (1M),
\fBgsscred.conf\fR(4),
\fBresolv.conf\fR(4),
.BR attributes (5),
\fBsmf\fR(5)
.sp
.LP
.I RFC 2078
.SH NOTES
.sp
.LP
The following signal has the specified effect when sent to the server
process using the
.BR kill (1)
command:
.sp
.ne 2
.mk
.na
.B SIGHUP
.ad
.RS 10n
.rt
\fBgssd\fR rereads the
.BR gsscred.conf (4)
options.
.RE

.sp
.LP
When one of the mechanisms being used is Kerberos, then the \fBgssd\fR
process must be restarted after adding or changing the \fBresolv.conf\fR(4)
file.
.sp
.LP
The
.B gssd
service is managed by the service management facility,
\fBsmf\fR(5), under the service identifier:
.sp
.in +2
.nf
svc:/network/rpc/gss:default
.fi
.in -2
.sp

.sp
.LP
Administrative actions on this service, such as enabling, disabling, or
requesting restart, can be performed using
.BR svcadm (1M).
Responsibility
for initiating and restarting this service is delegated to
.BR inetd (1M).
Use \fBinetadm\fR(1M) to make configuration changes and to view
configuration information for this service. The service's status can be
queried using the
.BR svcs (1)
command.
