usr/src/man/man1m/hal-find.1m
'\" te
.\" Copyright (c) 2006, Sun Microsystems, Inc. All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH hal-find 1M "22 Aug 2006" "SunOS 5.11" "System Administration Commands"
.SH NAME
hal-find, hal-find-by-capability, hal-find-by-property \- search HAL global
device list
.SH SYNOPSIS
.LP
.nf
\fBhal-find-by-capability\fR \fB--capability\fR \fIcapability\fR [\fB--help\fR]
 [\fB--verbose\fR] [\fB--version\fR]
.fi

.LP
.nf
\fBhal-find-by-property\fR  \fB--key\fR \fIkey\fR \fB--string\fR \fIvalue\fR [\fB--help\fR]
 [\fB--verbose\fR] [\fB--version\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The \fBhal-find\fR commands, \fBhal-find-by-capability\fR and
\fBhal-find-by-property\fR, search the Hardware Abstraction Layer (HAL)
device list by specified criteria and displays results on the standard
output. \fBhal-find-by-capability\fR searches by capability, such as
\fBvolume\fR or \fBblock\fR. \fBhal-find-by-property\fR searches by
property, such as \fBblock.is_volume\fR or \fBvolume.disc.has_audio\fR.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB--capability\fR \fIcapability\fR
.ad
.RS 27n
.rt
HAL device capability to search for.
.RE

.sp
.ne 2
.mk
.na
\fB--help\fR
.ad
.RS 27n
.rt
Display list of options.
.RE

.sp
.ne 2
.mk
.na
\fB--key\fR \fIkey\fR
.ad
.RS 27n
.rt
The \fIkey\fR to the property that is the basis of the search.
.RE

.sp
.ne 2
.mk
.na
\fB--string\fR \fIvalue\fR
.ad
.RS 27n
.rt
The string \fIvalue\fR associated with the property that is the basis of
the search.
.RE

.sp
.ne 2
.mk
.na
\fB--verbose\fR
.ad
.RS 27n
.rt
Verbose mode.
.RE

.sp
.ne 2
.mk
.na
\fB--version\fR
.ad
.RS 27n
.rt
Display version and exit.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWhalr
_
Interface StabilityVolatile
.TE

.SH SEE ALSO
.sp
.LP
\fBhald\fR(1M), \fBattributes\fR(5), \fBhal\fR(5)
