usr/src/man/man1m/hal-device.1m
'\" te
.\" Copyright (c) 2006, Sun Microsystems, Inc. All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH hal-device 1M "25 Aug 2006" "SunOS 5.11" "System Administration Commands"
.SH NAME
hal-device \- manage HAL devices
.SH SYNOPSIS
.LP
.nf
\fBhal-device\fR  [\fB-h\fR] [\fB--a\fR \fIudi\fR |  \fB--r\fR \fIudi\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The Hardware Abstraction Layer (HAL) provides a view of the various
hardware attached to a system. The
.B hal-device
command enables you to
manage devices that conform to the HAL standard. Specifically,
.B hal-device
lets you add or remove a device to or from the HAL global
device list. Device properties are read from stdin in \fBlshal(1M)\fR
syntax.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.BR -a ,
.B --add
.I udi
.ad
.RS 20n
.rt
Add device specified by Universal Device Identifier
.I udi
to HAL's
global device list.
.RE

.sp
.ne 2
.mk
.na
.B -h
.ad
.RS 20n
.rt
Display usage information.
.RE

.sp
.ne 2
.mk
.na
.BR -r ,
.B --remove
.I udi
.ad
.RS 20n
.rt
Remove device specified by Universal Device Identifier
.I udi
from HAL's
global device list.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWhalr
_
Interface StabilityVolatile
.TE

.SH SEE ALSO
.sp
.LP
.BR hald (1M),
.BR attributes (5),
.BR hal (5)
