usr/src/man/man1m/hal-fdi-validate.1m
'\" te
.\" Copyright (c) 2006, Sun Microsystems, Inc. All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH hal-fdi-validate 1M "28 Aug 2006" "SunOS 5.11" "System Administration Commands"
.SH NAME
hal-fdi-validate \- validate HAL device information files
.SH SYNOPSIS
.LP
.nf
\fBhal-fdi-validate\fR  [\fB-f\fR \fIdtd\fR] \fIfile\fR [\fIfile\fR].\|.\|.
.fi

.SH DESCRIPTION
.sp
.LP
The
.B hal-fdi-validate
command validates one or more device information
files. See
.BR fdi (4).
The standard DTD file will be used unless the
.B -f
option is used to specify a different file.
.SH OPTIONS
.sp
.LP
The following option is supported:
.sp
.ne 2
.mk
.na
.B -f
.I dtd
.ad
.RS 10n
.rt
Specify path to a DTD file.
.RE

.SH OPERANDS
.sp
.LP
The
.B hal-fdi-validate
command accepts the following operand(s):
.sp
.ne 2
.mk
.na
\fIfile\fR [\fIfile\fR.\|.\|.]\fR
.ad
.RS 18n
.rt
One or more DTD files to be validated.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWhalr
_
Interface StabilityVolatile
.TE

.SH SEE ALSO
.sp
.LP
.BR hald (1M),
.BR fdi (4),
.BR attributes (5),
.BR hal (5)
