usr/src/man/man1m/hal-find.1m
'\" te
.\" Copyright (c) 2006, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH hal-find 1M "22 Aug 2006" "SunOS 5.11" "System Administration Commands"
.SH NAME
hal-find, hal-find-by-capability, hal-find-by-property \- search HAL global
device list
.SH SYNOPSIS
.LP
.nf
\fBhal-find-by-capability\fR \fB--capability\fR \fIcapability\fR [\fB--help\fR]
 [\fB--verbose\fR] [\fB--version\fR]
.fi

.LP
.nf
\fBhal-find-by-property\fR  \fB--key\fR \fIkey\fR \fB--string\fR \fIvalue\fR [\fB--help\fR]
 [\fB--verbose\fR] [\fB--version\fR]
.fi

.SH DESCRIPTION
.sp
.LP
.RB "The " hal-find " commands, " hal-find-by-capability " and"
.BR hal-find-by-property ,
search the Hardware Abstraction Layer (HAL)
device list by specified criteria and displays results on the standard
output.
.B hal-find-by-capability
searches by capability, such as
.B volume
or
.BR block .
.B hal-find-by-property
searches by
property, such as
.B block.is_volume
or
.BR volume.disc.has_audio .
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B --capability
.I capability
.ad
.RS 27n
.rt
HAL device capability to search for.
.RE

.sp
.ne 2
.mk
.na
.B --help
.ad
.RS 27n
.rt
Display list of options.
.RE

.sp
.ne 2
.mk
.na
.B --key
.I key
.ad
.RS 27n
.rt
The
.I key
to the property that is the basis of the search.
.RE

.sp
.ne 2
.mk
.na
.B --string
.I value
.ad
.RS 27n
.rt
The string
.I value
associated with the property that is the basis of
the search.
.RE

.sp
.ne 2
.mk
.na
.B --verbose
.ad
.RS 27n
.rt
Verbose mode.
.RE

.sp
.ne 2
.mk
.na
.B --version
.ad
.RS 27n
.rt
Display version and exit.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWhalr
_
Interface StabilityVolatile
.TE

.SH SEE ALSO
.sp
.LP
.BR hald (1M),
.BR attributes (5),
.BR hal (5)
