usr/src/man/man1m/halt.1m
'\" te
.\" Copyright (c) 2004 Sun Microsystems, Inc. All Rights Reserved.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH halt 1M "2 Nov 2004" "SunOS 5.11" "System Administration Commands"
.SH NAME
halt, poweroff \- stop the processor
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/halt\fR [\fB-dlnqy\fR]
.fi

.LP
.nf
\fB/usr/sbin/poweroff\fR [\fB-dlnqy\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The
.B halt
and \fBpoweroff\fR utilities write any pending information
to the disks and then stop the processor. The \fBpoweroff\fR utility has the
machine remove power, if possible.
.sp
.LP
The
.B halt
and \fBpoweroff\fR utilities normally log the system
shutdown to the system log daemon,
.BR syslogd (1M),
and place a shutdown
record in the login accounting file
.BR /var/adm/wtmpx .
These actions are
inhibited if the
.B -n
or
.B -q
options are present.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -d
.ad
.RS 6n
.rt
Force a system crash dump before rebooting. See \fBdumpadm\fR(1M) for
information on configuring system crash dumps.
.RE

.sp
.ne 2
.mk
.na
.B -l
.ad
.RS 6n
.rt
Suppress sending a message to the system log daemon,
.BR syslogd (1M),
about who executed
.BR halt .
.RE

.sp
.ne 2
.mk
.na
.B -n
.ad
.RS 6n
.rt
Prevent the \fBsync\fR(1M) before stopping.
.RE

.sp
.ne 2
.mk
.na
.B -q
.ad
.RS 6n
.rt
Quick halt. No graceful shutdown is attempted.
.RE

.sp
.ne 2
.mk
.na
.B -y
.ad
.RS 6n
.rt
Halt the system, even from a dialup terminal.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B /var/adm/wtmpx
.ad
.RS 18n
.rt
History of user access and administration information.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.sp
.LP
.BR dumpadm (1M),
.BR init (1M),
.BR reboot (1M),
.BR shutdown (1M),
.BR sync (1M),
.BR syslogd (1M),
.BR inittab (4),
.BR attributes (5),
.BR smf (5)
.SH NOTES
.sp
.LP
The
.B halt
and \fBpoweroff\fR utilities do not cleanly shutdown
\fBsmf\fR(5) services. Execute the scripts in \fB/etc/rcnum.d\fR or execute
shutdown actions in
.BR inittab (4).
To ensure a complete shutdown of
system services, use
.BR shutdown (1M)
or
.BR init (1M)
to reboot a
Solaris system.
