usr/src/man/man1m/hextoalabel.1m
'\" te
.\" Copyright (c) 2007, Sun Microsystems Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH hextoalabel 1M "20 Jul 2007" "SunOS 5.11" "System Administration Commands"
.SH NAME
hextoalabel \- convert an internal text label to its human readable
equivalent
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/hextoalabel\fR [\fIinternal-text-sensitivity-label\fR]
.fi

.LP
.nf
\fB/usr/sbin/hextoalabel\fR \fB-c\fR [\fIinternal-text-clearance\fR]
.fi

.SH DESCRIPTION
.sp
.LP
.B hextoalabel
converts an internal text label into its human readable
equivalent and writes the result to the standard output file. This internal
form is often hexadecimal. If no option is supplied, the label is assumed to
be a sensitivity label.
.sp
.LP
If no internal text label is specified, the label is read from the standard
input file. The expected use of this command is emergency repair of labels
that are stored in internal databases.
.SH OPTIONS
.sp
.ne 2
.mk
.na
.B -c
.ad
.RS 6n
.rt
Identifies the internal text label as a clearance.
.RE

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 5n
.rt
On success.
.RE

.sp
.ne 2
.mk
.na
.B 1
.ad
.RS 5n
.rt
On failure, and writes diagnostics to the standard error file.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWtsu
_
Interface StabilitySee below.
.TE

.sp
.LP
The command output is Committed for systems with the same
.B label_encodings
file. The command invocation is Committed for systems
that implement the DIA MAC policy.
.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/security/tsol/label_encodings
.ad
.sp .6
.RS 4n
The label encodings file contains the classification names, words,
constraints, and values for the defined labels of this system.
.RE

.SH SEE ALSO
.sp
.LP
.BR atohexlabel (1M),
.BR label_to_str (3TSOL),
.BR str_to_label (3TSOL),
.BR label_encodings (4),
.BR attributes (5)
.sp
.LP
.I "How to Get a Readable Label From Its Hexadecimal Form
in \fISolaris
Trusted Extensions Administrator\&'s Procedures\fR
.SH NOTES
.sp
.LP
The functionality described on this manual page is available only if the
system is configured with Trusted Extensions.
.sp
.LP
This file is part of the Defense Intelligence Agency (DIA) Mandatory Access
Control (MAC) policy. This file might not be applicable to other MAC
policies that might be developed for future releases of Solaris Trusted
Extensions software.
