usr/src/man/man1m/host.1m
'\" te
.\" Copyright (C) 2004  Internet Systems Consortium, Inc. ("ISC")
.\" Copyright (C) 2000-2003  Internet Software Consortium.
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND ISC DISCLAIMS ALL WARRANTIES WITH
.\" REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF MERCHANTABILITY
.\" AND FITNESS. IN NO EVENT SHALL ISC BE LIABLE FOR ANY SPECIAL, DIRECT,
.\" INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES WHATSOEVER RESULTING FROM
.\" LOSS OF USE, DATA OR PROFITS, WHETHER IN AN ACTION OF CONTRACT, NEGLIGENCE
.\" OR OTHER TORTIOUS ACTION, ARISING OUT OF OR IN CONNECTION WITH THE USE OR
.\" PERFORMANCE OF THIS SOFTWARE.
.\"
.\" Portions Copyright (c) 2004, Sun Microsystems, Inc. All Rights Reserved.
.TH host 1M "24 Dec 2008" "SunOS 5.11" "System Administration Commands"
.SH NAME
host \- DNS lookup utility
.SH SYNOPSIS
.LP
.nf
\fBhost\fR [\fB-aCdilrTvw\fR] [\fB-c\fR \fIclass\fR] [\fB-N\fR \fIndots\fR] [\fB-R\fR \fInumber\fR]
     [\fB-t\fR \fItype\fR] [\fB-W\fR \fIwait\fR]  [\fB-4\fR | \fB-6\fR] `a\fIname\fR [\fIserver\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The
.B host
utility performs simple DNS lookups. It is normally used to
convert names to IP addresses and IP addresses to names. When no arguments
or options are given,
.B host
prints a short summary of its command line
arguments and options.
.sp
.LP
The
.I name
argument is the domain name that is to be looked up. It can
also be a dotted-decimal IPv4 address or a colon-delimited IPv6 address, in
which case
.B host
by default performs a reverse lookup for that address.
The optional
.I server
argument is either the name or IP address of the
name server that
.B host
should query instead of the server or servers
listed in
.BR /etc/resolv.conf .
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -4
.ad
.RS 13n
.rt
Use only IPv4 transport. By default, both IPv4 and IPv6 transports can be
used. Options
.B -4
and
.B -6
are mutually exclusive.
.RE

.sp
.ne 2
.mk
.na
.B -6
.ad
.RS 13n
.rt
Use only IPv6 transport. By default, both IPv4 and IPv6 transports can be
used. Options
.B -4
and
.B -6
are mutually exclusive.
.RE

.sp
.ne 2
.mk
.na
.B -a
.ad
.RS 13n
.rt
Equivalent to setting the
.B -v
option and asking
.B host
to make a
query of type
.BR ANY .
.RE

.sp
.ne 2
.mk
.na
.B -c
.I class
.ad
.RS 13n
.rt
Make a DNS query of class
.IR class .
This can be used to lookup Hesiod or
Chaosnet class resource records. The default class is IN (Internet).
.RE

.sp
.ne 2
.mk
.na
.B -C
.ad
.RS 13n
.rt
Attempt to display the SOA records for zone
.I name
from all the listed
authoritative name servers for that zone. The list of name servers is
defined by the NS records that are found for the zone.
.RE

.sp
.ne 2
.mk
.na
.B -d
.ad
.RS 13n
.rt
Generate verbose output. This option is equivalent to
.BR -v .
These two
options are provided for backward compatibility. In previous versions, the
.B -d
option switched on debugging traces and
.B -v
enabled verbose
output.
.RE

.sp
.ne 2
.mk
.na
.B -i
.ad
.RS 13n
.rt
Specifies that reverse lookups of IPv6 addresses should use the IP6.INT
domain as defined in RFC 1886. The default is to use RFC 3152 domain
IP6.ARPA.
.RE

.sp
.ne 2
.mk
.na
.B -l
.ad
.RS 13n
.rt
List mode. This option makes
.B host
perform a zone transfer for zone
.IR name ,
displaying the NS, PTR and address records (A/AAAA). If combined
with
.BR -a ,
all records will be displayed. The argument is provided for
compatibility with previous implementations. Options
.B -la
is equivalent
to making a query of type
.BR AXFR .
.RE

.sp
.ne 2
.mk
.na
.B -N
.I ndots
.ad
.RS 13n
.rt
Set the number of dots that have to be in
.I name
for it to be
considered absolute. The default value is that defined using the ndots
statement in
.BR /etc/resolv.conf ,
or 1 if no ndots statement is present.
Names with fewer dots are interpreted as relative names and will be searched
for in the domains listed in the
.B search
or
.B domain
directive in
.BR /etc/resolv.conf .
.RE

.sp
.ne 2
.mk
.na
.B -r
.ad
.RS 13n
.rt
.RB "Make a non-recursive query. Setting this option clears the" " RD"
(recursion desired) bit in the query made by
.BR host .
The name server
receiving the query does not attempt to resolve
.IR name .
The
.BR -r
option enables
.B host
to mimic the behaviour of a name server by making
non-recursive queries and expecting to receive answers to those queries that
are usually referrals to other name servers.
.RE

.sp
.ne 2
.mk
.na
.B -R
.I number
.ad
.RS 13n
.rt
Change the number of UDP retries for a lookup. The
.I number
argument
indicates how many times
.B host
will repeat a query that does not get
answered. The default number of retries is 1. If
.I number
is negative or
zero, the number of retries will default to 1.
.RE

.sp
.ne 2
.mk
.na
.B -t
.I type
.ad
.RS 13n
.rt
Select the query type. The
.I type
argument can be any recognised query
type:
.BR CNAME ,
.BR NS ,
.BR SOA ,
.BR SIG ,
.BR KEY ,
and
.BR AXFR ,
among others. When no query type is specified, \fBhost\fR
automatically selects an appropriate query type. By default it looks for A,
AAAA, and MX records, but if the
.B -C
option is specified, queries are
made for SOA records. If
.I name
is a dotted-decimal IPv4 address or
colon-delimited IPv6 address,
.B host
queries for PTR records.
.sp
If a query type of IXFR is chosen the starting serial number can be
specified by appending an equal followed by the starting serial number (for
example:
.BR "-t IXFR=12345678" ).
.RE

.sp
.ne 2
.mk
.na
.B -T
.ad
.RS 13n
.rt
Use a TCP connection when querying the name server. TCP is automatically
selected for queries that require it, such as zone transfer (\fBAXFR\fR)
requests. By default
.B host
uses UDP when making queries.
.RE

.sp
.ne 2
.mk
.na
.B -v
.ad
.RS 13n
.rt
Generate verbose output. This option is equivalent to
.BR -d .
.RE

.sp
.ne 2
.mk
.na
.B -w
.ad
.RS 13n
.rt
Wait forever for a reply. The time to wait for a response will be set to
the number of seconds given by the hardware's maximum value for an integer
quantity.
.RE

.sp
.ne 2
.mk
.na
.B -W
.I wait
.ad
.RS 13n
.rt
Wait for
.I wait
seconds for a reply.  If
.I wait
is less than one,
the wait interval is set to one second.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/resolv.conf
.ad
.RS 20n
.rt
Resolver configuration file
.RE

.SH ATTRIBUTES
.sp
.LP
See for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWbind
_
Interface StabilityExternal
.TE

.SH SEE ALSO
.sp
.LP
.BR dig (1M),
.BR named (1M),
.BR attributes (5)
.sp
.LP
.IR "RFC 1035" ,
.IR "RFC 1886" ,
.I RFC 3152
