usr/src/man/man1m/hotplug.1m
'\" te
.\" Copyright (c) 2009, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH hotplug 1M "27 Oct 2009" "SunOS 5.11" "System Administration Commands"
.SH NAME
hotplug \- configure hotplug connectors and ports
.SH SYNOPSIS
.LP
.nf
\fBhotplug\fR list [\fB-l\fR] [\fB-v\fR] [\fIpath\fR [\fIconnection\fR]]
.fi

.LP
.nf
\fBhotplug\fR online \fIpath\fR \fIport\fR
.fi

.LP
.nf
\fBhotplug\fR offline [\fB-f\fR] [\fB-q\fR] \fIpath\fR \fIport\fR
.fi

.LP
.nf
\fBhotplug\fR enable \fIpath\fR \fIconnector\fR
.fi

.LP
.nf
\fBhotplug\fR disable [\fB-f\fR] [\fB-q\fR] \fIpath\fR \fIport\fR
.fi

.LP
.nf
\fBhotplug\fR poweron \fIpath\fR \fIconnector\fR
.fi

.LP
.nf
\fBhotplug\fR poweroff [\fB-f\fR] [\fB-q\fR] \fIpath\fR \fIconnector\fR
.fi

.LP
.nf
\fBhotplug\fR set \fB-o\fR \fIoptions\fR \fIpath\fR \fIconnector\fR
.fi

.LP
.nf
\fBhotplug\fR get \fB-o\fR \fIoptions\fR \fIpath\fR \fIconnector\fR
.fi

.LP
.nf
\fBhotplug\fR \fB-?\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B hotplug
command is used to manage hotplug connections. A
connection can be a connector or port. A hotplug connector is a
representation of a physical point in the system where components can be
inserted or removed. A hotplug port is a representation of a logical point
in the system device tree where the connection of a device to the system is
managed.
.sp
.LP
The
.B hotplug
command only supports hotplug operations on hotplug
connectors for PCI Express buses and PCI buses that implement the Standard
PCI Hotplug feature. Hotplug ports on PCI Expresss and PCI buses in systems
with PCI Express fabrics are also supported. Additional buses may be
supported in the future.
.sp
.LP
The
.B hotplug
command operates on the following kinds of objects:
.sp
.ne 2
.mk
.na
.B path
.ad
.sp .6
.RS 4n
Hotplug connectors and ports are integrated into the Solaris device tree.
The names of connectors and ports are unique relative only to their bus
controller. A device path is required to uniquely reference a connector or
port.
.RE

.sp
.ne 2
.mk
.na
.B connector
.ad
.sp .6
.RS 4n
If a hardware component supports being physically inserted or removed, then
a hotplug connector represents the location where this action may occur.
When a connector exists, it has a hierarchy of ports and device nodes that
depend upon it.
.RE

.sp
.ne 2
.mk
.na
.B port
.ad
.sp .6
.RS 4n
All device nodes can be virtually hotplugged, even if their hardware does
not support physical hotplugging. A hotplug port exists between a device
node and its parent node in the system device tree. It represents the
location where the device node and its dependents can be managed.
.RE

.sp
.ne 2
.mk
.na
.B connection
.ad
.sp .6
.RS 4n
A hotplug connection is a generic term to refer to either a hotplug
connector or a hotplug port.
.RE

.sp
.LP
Hotplug connectors and ports are managed according to a state model. The
.B hotplug
command can list information about the hotplug connections in
a system, or it can initiate change of state operations on specific hotplug
connections.
.sp
.LP
Hotplug connectors can be in the following states:
.sp
.ne 2
.mk
.na
.B empty
.ad
.sp .6
.RS 4n
A component is not physically inserted in the connector.
.RE

.sp
.ne 2
.mk
.na
.B present
.ad
.sp .6
.RS 4n
A component is physically inserted in the connector, but the component is
powered off. The component is not in use.
.RE

.sp
.ne 2
.mk
.na
.B powered
.ad
.sp .6
.RS 4n
A component is physically inserted in the connector, and the component is
powered on. The component is disabled and is not in use.
.RE

.sp
.ne 2
.mk
.na
.B enabled
.ad
.sp .6
.RS 4n
A component is physically inserted in the connector. The component is
powered on and has been probed and tested. The component is enabled and
devices that represent its functions can be used.
.RE

.sp
.LP
Hotplug ports can be in the following states:
.sp
.ne 2
.mk
.na
.B port-empty
.ad
.sp .6
.RS 4n
No device exists for the hotplug port.
.RE

.sp
.ne 2
.mk
.na
.B port-present
.ad
.sp .6
.RS 4n
A device exists for the hotplug port, but the device has not been probed
and it has no attached device driver. The device is not in use.
.RE

.sp
.ne 2
.mk
.na
.B offline
.ad
.sp .6
.RS 4n
A device exists for the hotplug port, and the device has been probed. A
device driver is not attached, and the device is not in use.
.RE

.sp
.ne 2
.mk
.na
.B online
.ad
.sp .6
.RS 4n
A device exists for the hotplug port, and its device driver is fully
attached. The device is in use.
.RE

.sp
.ne 2
.mk
.na
.B maintenance
.ad
.sp .6
.RS 4n
A device exists for the hotplug port, and its device driver is fully
attached. The device is in use, but not fully operational. A maintenance or
fault management operation is affecting the device.
.RE

.sp
.LP
The
.B hotplug
command can also access bus private properties for each
hotplug connector. The current values of bus private properties can be
displayed. New values for each bus private property can be set directly.
.SH SUB-COMMANDS
.sp
.LP
The following subcommands are supported:
.sp
.ne 2
.mk
.na
.B list
.ad
.sp .6
.RS 4n
Show information for hotplug connectors, ports, and their associated
devices. Hotplug connectors and hotplug ports are integrated into the
Solaris device tree hierarchy. The
.B list
subcommand therefore displays
the hierarchy of device nodes with additional information included to show
the locations of hotplug connectors and hotplug ports. The names of hotplug
connectors are enclosed in square brackets, and the names of hotplug ports
are enclosed in angled brackets. The current state of each hotplug
connection is displayed next to its name.
.RE

.sp
.ne 2
.mk
.na
.B online
.ad
.sp .6
.RS 4n
Change the state of a hotplug port to the
.B online
state.
.RE

.sp
.ne 2
.mk
.na
.B offline
.ad
.sp .6
.RS 4n
Change the state of a hotplug port to the
.B offline
state.
.RE

.sp
.ne 2
.mk
.na
.B enable
.ad
.sp .6
.RS 4n
Change the state of a hotplug connector to the
.B enabled
state. All of
the hotplug connector's dependent ports will be automatically probed and
initialized into the
.B online
state.
.RE

.sp
.ne 2
.mk
.na
.B disable
.ad
.sp .6
.RS 4n
Change the state of a hotplug connector from the
.B enabled
state to the
.B powered
state. All dependent ports that are in the
.B online
state
will first be transitioned to the
.B port-present
state.
.RE

.sp
.ne 2
.mk
.na
.B poweron
.ad
.sp .6
.RS 4n
Change the state of a hotplug connector from the
.B present
state to the
.B powered
state.
.RE

.sp
.ne 2
.mk
.na
.B poweroff
.ad
.sp .6
.RS 4n
Change the state of a hotplug connector from the
.B powered
or
.B enabled
state to the
.B present
state. All dependent ports that are
in the
.B online
state will first be transitioned to the
.B port-present
state, and will then be removed.
.RE

.sp
.ne 2
.mk
.na
.B set
.ad
.sp .6
.RS 4n
Set bus-specific properties for a hotplug connector. The specified option
string is a bus specific string of name and value pairs, as could be parsed
by
.BR getsubopt "(3C). The names and values will be passed directly to the"
bus controller that manages the specified hotplug connector to perform a
bus-specific function.
.RE

.sp
.ne 2
.mk
.na
.B get
.ad
.sp .6
.RS 4n
Display the current values of bus specific properties for a hotplug
connector. The specified option string is a bus specific string of named
properties, as could be parsed by
.BR getsubopt (3C).
The names will be
passed directly to the bus controller to specify which properties should be
returned. The current values of each named property will then be
displayed.
.RE

.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.BR -l ,
.B --list-path
.ad
.sp .6
.RS 4n
Show full paths to connections and device nodes. By default, the \fBlist\fR
subcommand shows hotplug connectors, ports, and devices in the format of a
tree. This option enables the display of full paths to each connection and
device node.
.RE

.sp
.ne 2
.mk
.na
.BR -v ,
.B --verbose
.ad
.sp .6
.RS 4n
Show verbose usage details. By default, the
.B list
subcommand shows
only hotplug connectors, ports, and devices. This option enables the display
of more detailed information about how the devices are currently consumed.
Examples include mounted filesystems or plumbed network interfaces
associated with individual devices.
.RE

.sp
.ne 2
.mk
.na
.BR -f ,
.B --force
.ad
.sp .6
.RS 4n
Force the operation. Some change state operations that impact resources
currently in use will fail with a warning. A forced operation will attempt
to ignore these warnings and proceed.
.sp
This option should be used with extreme caution.
.RE

.sp
.ne 2
.mk
.na
.BR -q ,
.B --query
.ad
.sp .6
.RS 4n
Query the operation. Instead of actually performing a change state
operation, perform a test to predict if the operation would succeed or fail.
If it would fail, show the error messages that would be expected if the
operation had really been attempted.
.sp
It is not possible to predict every failure. An operation that succeeds
during a query could still fail for another reason when actually
attempted.
.sp
This option will not actually change the state of the system.
.RE

.sp
.ne 2
.mk
.na
\fB-o\fR \fIoptions\fR, \fB--\fR=\fIoptions\fR
.ad
.sp .6
.RS 4n
Specify bus-specific properties for a
.B set
or
.B get
command. The
options string conforms to the
.BR getsubopt "(3C) syntax convention."
.sp
For the
.B get
subcommand, there are two special options that can be
used. The special options value of
.B help
will display all supported
properties and their possible values. The special options value of \fBall\fR
will display the current value of all supported properties.
.sp
For the
.B set
subcommand, there is one special option that can be used.
The special options value of
.B help
will display all supported
properties which can be set and their possible values.
.sp
See "Notes" section for the properties supported by bus controllers.
.RE

.sp
.ne 2
.mk
.na
.BR -? ,
.B --help
.ad
.sp .6
.RS 4n
Display a brief help message on proper use of the command.
.RE

.SH EXAMPLES
.LP
.B Example 1
Showing All Hotplug Connections
.sp
.LP
The following command shows all hotplug connections:

.sp
.in +2
.nf
# \fBhotplug list -v\fR
pci@0,0
        <pci.2,1> (ONLINE)
         pci108e,534a@2,1
                 [pci30] (EMPTY)
        <pci.e,0> (ONLINE)
         pci10de,5d@e
                 <pci.b,0> (ONLINE)
                 display@b
                 [NEM0] (ENABLED)
                 <pci.a,0> (ONLINE)
                 pci108e,534a@a,0
                         { Network interface nge0 }
                         { nge0: hosts IP addresses: 10.0.0.1 }
                 <pci.a,1> (MAINTENANCE)
                 pci108e,534a@a,1
                 [NEM1] (EMPTY)
         <pci.c,0> (OFFLINE)
                pci108e,534a@4
.fi
.in -2
.sp

.sp
.LP
To show the full paths of hotplug connections and devices, enter the
following command:

.sp
.in +2
.nf
# \fBhotplug list -l\fR
/pci@0,0 <pci.2,1> (ONLINE)
/pci@0,0/pci108e,534a@2,1 [pci30] (EMPTY)
/pci@0,0 pci.e,0> (ONLINE)
/pci@0,0/pci10de,5d@e <pci.b,0> (ONLINE)
/pci@0,0/pci10de,5d@e/display@b
/pci@0,0/pci10de,5d@e [NEM0] (ENABLED)
/pci@0,0/pci10de,5d@e <pci.a,0> (ONLINE)
/pci@0,0/pci10de,5d@e/pci108e,534a@a,0
/pci@0,0/pci10de,5d@e <pci.a,1> (MAINTENANCE)
/pci@0,0/pci10de,5d@e/pci108e,534a@a,0
/pci@0,0/pci10de,5d@e [NEM1] (EMPTY)
/pci@0,0 pci.c,0> (OFFLINE)
/pci@0,0/pci108e,534a@4
.fi
.in -2
.sp

.LP
.B Example 2
Reporting Failure During State Change Operation
.sp
.LP
If a change of state operation fails, an explanation is displayed to
describe the failure. An attempt to offline a hotplug port with dependent
devices that are currently in use by the system might fail as follows:

.sp
.in +2
.nf
# \fBhotplug offline /pci@0,0/pci10de,5d@e pci.a,0\fR
ERROR: devices or resources are busy.
pci108e,534a@a,0:
    { Network interface nge0 }
    { nge0: hosts IP addresses: 10.0.0.1 }
    { Plumbed IP Address }
.fi
.in -2
.sp

.LP
.B Example 3
Displaying Bus-Specific Properties and Values
.sp
.LP
The following command displays all supported bus-specific properties and
their possible values:

.sp
.in +2
.nf
# \fBhotplug get -o help /pci@0,0 pci.2,1\fR
power_led=<on|off|blink>
fault_led=<on|off|blink>
active_led=<on|off|blink>
attn_led=<on|off|blink>
card_type=<type description>
board_type=<type description>
.fi
.in -2
.sp

.LP
.B Example 4
Displaying Bus-Specific Options
.sp
.LP
The following command displays the card type and the current state of the
Power LED of a PCI hotplug connector:

.sp
.in +2
.nf
# \fBhotplug get -o card_type,power_led /pci@0,0 pci.2,1\fR
card_type=fibre
power_led=on
.fi
.in -2
.sp

.LP
.B Example 5
Setting a Bus-Specific Property
.sp
.LP
The following command turns on the attention LED of a PCI hotplug
connector:

.sp
.in +2
.nf
# \fBhotplug set -o attn_led=on /pci@0,0 pci.2,1\fR
.fi
.in -2
.sp

.SH EXIT STATUS
.sp
.ne 2
.mk
.na
.B 0
.ad
.sp .6
.RS 4n
Successful completion.
.RE

.sp
.ne 2
.mk
.na
.B 1
.ad
.sp .6
.RS 4n
Invalid command line options were specified.
.RE

.sp
.ne 2
.mk
.na
.B 2
.ad
.sp .6
.RS 4n
The specified path or connection does not exist.
.RE

.sp
.ne 2
.mk
.na
.B 3
.ad
.sp .6
.RS 4n
A fatal error occurred. One or more error messages are displayed on
standard error.
.RE

.sp
.ne 2
.mk
.na
.B 4
.ad
.sp .6
.RS 4n
The hotplug service is not available.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
.BR cfgadm (1M),
.BR hotplugd (1M),
.BR getsubopt (3C),
.BR attributes (5)
.SH DIAGNOSTICS
.sp
.LP
The following error message is displayed on systems that do not have any
supported I/O buses:
.sp
.in +2
.nf
ERROR: there are no connections to display.
(See hotplug(1m) for more information.)
.fi
.in -2
.sp

.sp
.LP
If this error message is seen, note that the system might still have other
I/O devices that support hotplugging, through the \fBcfgadm\fR(1M) command
instead of
.BR hotplug .
.SH NOTES
.sp
.LP
The
.B hotplug
service (FMRI
.BR svc:/system/hotplug )
must be enabled
as a prerequisite for using the
.B hotplug
command. See
.BR hotplugd (1M).
.sp
.LP
The authorization
.B solaris.hotplug.modify
must be granted in order to
perform change-of-state operations. Alternatively, the rights profile
"Hotplug Management" can be granted, which includes that authorization.
.sp
.LP
Verbose usage information is gathered from the RCM framework. Its format
and content is subject to change.
.sp
.LP
The following bus specific properties are supported in PCI bus
controllers:
.sp
.ne 2
.mk
.na
.B power_led
| \fBfault_led\fR | \fBattn_led\fR |
.B active_led
.ad
.sp .6
.RS 4n
States of a specific LED of a slot. The value could be
.BR on ,
.BR off ,
or
.BR blink .
.sp
They can all be used with
.B get
subcommand, but only property
.B attn_led
can be used with
.B set
subcommand.
.RE

.sp
.ne 2
.mk
.na
.B card_type
|
.B board_type
.ad
.sp .6
.RS 4n
Type of a card or board of a slot.
.sp
They can all be used with
.B get
subcommand, but neither can be used
with
.B set
subcommand.
.RE

