usr/src/man/man1m/hotplugd.1m
'\" te
.\" Copyright (c) 2009, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH hotplugd 1M "21 Aug 2009" "SunOS 5.11" "System Administration Commands"
.SH NAME
hotplugd \- hotplug daemon
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/hotplugd\fR [\fB-d\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The hotplug daemon,
.BR hotplugd ,
provides user-level services for the
management of hotplug connections. It is a system daemon started by the
Service Management Facility (see
.BR smf (5)).
Its fault management
resource identifier (FMRI) is:
.sp
.in +2
.nf
svc:/system/hotplug:default
.fi
.in -2
.sp

.sp
.LP
Note that
.B hotplugd
is a Consolidation Private interface. See
.BR attributes (5).
.sp
.LP
The
.BR hotplug "(1M) command and any other client program that uses the"
.BR libhotplug (3LIB)
library to query information about hotplug
connections or initiate hotplug commands depends upon this daemon. The
hotplug daemon is a door server which services requests from all
.BR libhotplug (3LIB)
clients. The door interface is private.
.sp
.LP
Client applications use the \fBlibhotplug\fR(3LIB) interface to administer
hotplug connections. \fBlibhotplug\fR(3LIB) uses the door interface to
administer hotplug connections through the hotplug daemon service. The
hotplug daemon acts as a central location to serialize all hotplug
operations and coordinate activities with all other parts of the system.
.SH OPTIONS
.sp
.LP
The following option is supported:
.sp
.ne 2
.mk
.na
.BR -d ,
.B --debug
.ad
.sp .6
.RS 4n
Run the daemon in standalone debug mode. Messages will be displayed on the
controlling terminal instead of to syslog. And increased verbosity will be
enabled to display more details about the internal operations of the
daemon.
.RE

.SH EXAMPLES
.LP
.B Example 1
Enabling the Hotplug Service
.sp
.LP
The following command enables the hotplug service:

.sp
.in +2
.nf
# \fBsvcadm enable svc:/system/hotplug:default\fR
.fi
.in -2
.sp

.LP
.B Example 2
Disabling the Hotplug Service
.sp
.LP
The following command disables the hotplug service:

.sp
.in +2
.nf
# \fBsvcadm disable svc:/system/hotplug:default\fR
.fi
.in -2
.sp

.SH ERRORS
.sp
.LP
The hotplug daemon uses
.BR syslog "(3C) to report status and error"
messages. All of the messages are logged with the
.B LOG_DAEMON
facility.
Error messages are logged with the
.B LOG_ERR
and
.BR LOG_NOTICE
priorities, and informational messages are logged with the \fBLOG_INFO\fR
priority. The default entries in the
.B /etc/syslog.conf
file log all of
the hotplug daemon error messages to the
.B /var/adm/messages
log.
.SH FILES
.sp
.ne 2
.mk
.na
.B /var/run/hotplugd_door
.ad
.sp .6
.RS 4n
Hotplug daemon door
.RE

.sp
.ne 2
.mk
.na
.B /var/run/hotplugd_pid
.ad
.sp .6
.RS 4n
Hotplug daemon lock file
.RE

.sp
.ne 2
.mk
.na
.B /usr/lib/hotplugd
.ad
.sp .6
.RS 4n
Hotplug daemon binary
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu, SUNWcsr
_
Interface StabilityConsolidation Private
.TE

.SH SEE ALSO
.sp
.LP
.BR svcs (1),
.BR hotplug (1M),
.BR svcadm (1M),
.BR syslog (3C),
.BR libhotplug (3LIB),
.BR syslog.conf (4),
.BR attributes (5),
.BR smf (5)
.SH NOTES
.sp
.LP
The
.B hotplugd
service is managed by the service management facility,
.BR smf (5),
under the fault management resource identifier (FMRI):
.sp
.in +2
.nf
svc:/system/hotplug:default
.fi
.in -2
.sp

.sp
.LP
Administrative actions on this service, such as enabling, disabling, or
requesting restart, can be performed using
.BR svcadm (1M).
The service's
status can be queried using the
.BR svcs (1)
command. To administer the
service, the authorization
.B solaris.smf.manage.hotplug
must be granted.
Alternatively, the rights profile "Hotplug Management" can be granted.
.sp
.LP
The hotplug service must be enabled for the
.BR hotplug "(1M) command and"
any other \fBlibhotplug\fR(3LIB) client applications to function properly.
