usr/src/man/man1m/htable.1m
'\" te
.\" Copyright 1989 AT&T  Copyright (c) 1997 Sun Microsystems, Inc.  All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH htable 1M "14 Sep 1992" "SunOS 5.11" "System Administration Commands"
.SH NAME
htable \- convert DoD Internet format host table
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/htable\fR \fIfilename\fR
.fi

.SH DESCRIPTION
.sp
.LP
.B htable
converts a host table in the format specified by
.B RFC
952
to the format used by the network library routines.  Three files are created
as a result of running
.BR htable :
.BR hosts ,
.BR networks ,
and
.BR gateways .
The
.B hosts
file is used by the
.BR gethostbyname (3NSL)
routines in mapping host names to addresses.  The
.B networks
file is used by the
.BR getnetbyname "(3SOCKET) routines in"
mapping network names to numbers. The
.B gateways
file is used by the
routing daemon to identify "passive" Internet gateways.
.sp
.LP
If any of the files
.BR localhosts ,
.BR localnetworks ,
or
.B localgateways
are present in the current directory, the file's
contents is prepended to the output file without interpretation.  This
allows sites to maintain local aliases and entries which are not normally
present in the master database.
.sp
.LP
.B htable
is best used in conjunction with the
.BR gettable (1M)
program which retrieves the DoD Internet host table from a host.
.SH FILES
.sp
.ne 2
.mk
.na
.B localhosts
.ad
.RS 17n
.rt

.RE

.sp
.ne 2
.mk
.na
.B localnetworks
.ad
.RS 17n
.rt

.RE

.sp
.ne 2
.mk
.na
.B localgateways
.ad
.RS 17n
.rt

.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWnisu
.TE

.SH SEE ALSO
.sp
.LP
.BR gettable (1M),
.BR gethostbyname (3NSL),
.BR getnetbyname (3SOCKET),
.BR attributes (5)
Harrenstien, Ken, Mary Stahl, and Elizabeth Feinler,
.IR "DoD Internet Host Table Specification" ,
.B RFC
952, Network
Information Center,
.B SRI
International, Menlo Park, California, October
1985.
.SH NOTES
.sp
.LP
.B htable
does not properly calculate the
.B gateways
file.
