usr/src/man/man1m/id.1m
'\" te
.\" Copyright (c) 1992, X/Open Company Limited  All Rights Reserved
.\" Portions Copyright (c) 2006, Sun Microsystems, Inc.  All Rights Reserved
.\"
.\" Sun Microsystems, Inc. gratefully acknowledges The Open Group for
.\" permission to reproduce portions of its copyrighted documentation.
.\" Original documentation from The Open Group can be obtained online
.\" at http://www.opengroup.org/bookstore/.
.\"
.\" The Institute of Electrical and Electronics Engineers and The Open Group,
.\" have given us permission to reprint portions of their documentation.
.\"
.\" In the following statement, the phrase "this text" refers to portions
.\" of the system documentation.
.\"
.\" Portions of this text are reprinted and reproduced in electronic form in
.\" the Sun OS Reference Manual, from IEEE Std 1003.1, 2004 Edition, Standard
.\" for Information Technology -- Portable Operating System Interface (POSIX),
.\" The Open Group Base Specifications Issue 6, Copyright (C) 2001-2004 by the
.\" Institute of Electrical and Electronics Engineers, Inc and The Open Group.
.\" In the event of any discrepancy between these versions and the original
.\" IEEE and The Open Group Standard, the original IEEE and The Open Group
.\" Standard is the referee document.
.\"
.\" The original Standard can be obtained online at
.\" http://www.opengroup.org/unix/online.html.
.\"
.\" This notice shall appear on any product containing this material.
.\"
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH id 1M "28 Nov 2006" "SunOS 5.11" "System Administration Commands"
.SH NAME
id \- return user identity
.SH SYNOPSIS
.LP
.nf
\fB/usr/bin/id\fR [\fB-p\fR] [\fIuser\fR]
.fi

.LP
.nf
\fB/usr/bin/id\fR \fB-a\fR [\fB-p\fR] [\fIuser\fR]
.fi

.LP
.nf
\fB/usr/bin/id\fR \fB-G\fR [\fB-n\fR] [\fIuser\fR]
.fi

.LP
.nf
\fB/usr/bin/id\fR \fB-g\fR [\fB-nr\fR] [\fIuser\fR]
.fi

.LP
.nf
\fB/usr/bin/id\fR \fB-u\fR [\fB-nr\fR] [\fIuser\fR]
.fi

.LP
.nf
\fB/usr/xpg4/bin/id\fR [\fB-p\fR] [\fIuser\fR]
.fi

.LP
.nf
\fB/usr/xpg4/bin/id\fR \fB-a\fR [\fB-p\fR] [\fIuser\fR]
.fi

.LP
.nf
\fB/usr/xpg4/bin/id\fR \fB-G\fR [\fB-n\fR] [\fIuser\fR]
.fi

.LP
.nf
\fB/usr/xpg4/bin/id\fR \fB-g\fR [\fB-nr\fR] [\fIuser\fR]
.fi

.LP
.nf
\fB/usr/xpg4/bin/id\fR \fB-u\fR [\fB-nr\fR] [\fIuser\fR]
.fi

.SH DESCRIPTION
.sp
.LP
If no
.I user
operand is provided, the
.B id
utility writes the user
and group \fBID\fRs and the corresponding user and group names of the
invoking process to standard output. If the effective and real \fBID\fRs do
not match, both are written. If multiple groups are supported by the
underlying system,
.B /usr/xpg4/bin/id
also writes the supplementary
group affiliations of the invoking process.
.sp
.LP
If a
.I user
operand is provided and the process has the appropriate
privileges, the user and group \fBID\fRs of the selected user are written.
In this case, effective \fBID\fRs are assumed to be identical to real
\fBID\fRs. If the selected user has more than one allowable group membership
listed in the group database,
.B /usr/xpg4/bin/id
writes them in the same
manner as the supplementary groups described in the preceding paragraph.
.SS "Formats"
.sp
.LP
The following formats are used when the
.B LC_MESSAGES
locale category
specifies the "C" locale. In other locales, the strings \fBuid\fR,
.BR gid ,
.BR euid ,
.BR egid ,
and
.B groups
may be replaced with
more appropriate strings corresponding to the locale.
.sp
.in +2
.nf
"uid=%u(%s) gid=%u(%s)\en" <\fIreal user ID\fR>, <\fIuser-name\fR>,
    <\fIreal group ID\fR>, <\fIgroup-name\fR>
.fi
.in -2
.sp

.sp
.LP
If the effective and real user \fBID\fRs do not match, the following are
inserted immediately before the \fB\en\fR character in the previous
format:
.sp
.in +2
.nf
" euid=%u(%s)"
.fi
.in -2
.sp

.sp
.LP
with the following arguments added at the end of the argument list:
.sp
.in +2
.nf
<\fIeffective user ID\fR>, <\fIeffective user-name\fR>
.fi
.in -2
.sp

.sp
.LP
If the effective and real group \fBID\fRs do not match, the following is
inserted directly before the \fB\en\fR character in the format string (and
after any addition resulting from the effective and real user
.BR ID "s not"
matching):
.sp
.in +2
.nf
" egid=%u(%s)"
.fi
.in -2
.sp

.sp
.LP
with the following arguments added at the end of the argument list:
.sp
.in +2
.nf
<\fIeffectivegroup-ID\fR>, <\fIeffectivegroupname\fR>
.fi
.in -2
.sp

.sp
.LP
If the process has supplementary group affiliations or the selected user is
allowed to belong to multiple groups, the first is added directly before the
.B NEWLINE
character in the format string:
.sp
.in +2
.nf
" groups=%u(%s)"
.fi
.in -2
.sp

.sp
.LP
with the following arguments added at the end of the argument list:
.sp
.in +2
.nf
<\fIsupplementary group ID\fR>, <\fIsupplementary group name\fR>
.fi
.in -2
.sp

.sp
.LP
and the necessary number of the following added after that for any
remaining supplementary group
.BR ID s:
.sp
.in +2
.nf
",%u(%s)"
.fi
.in -2
.sp

.sp
.LP
and the necessary number of the following arguments added at the end of the
argument list:
.sp
.in +2
.nf
<\fIsupplementary group ID\fR>, <\fIsupplementary group name\fR>
.fi
.in -2
.sp

.sp
.LP
If any of the user
.BR ID ,
group
.BR ID ,
effective user
.BR ID ,
effective group
.B ID
or supplementary/multiple group \fBID\fRs cannot be
mapped by the system into printable user or group names, the corresponding
(\fB%s\fR) and name argument is omitted from the corresponding format
string.
.sp
.LP
When any of the options are specified, the output format is as described
under OPTIONS.
.SH OPTIONS
.sp
.LP
The following options are supported by both
.B /usr/bin/id
and
.BR /usr/xpg4/bin/id .
The
.B -p
and
.B -a
options are invalid if
specified with any of the
.BR -G ,
.BR -g ,
or
.B -u
options.
.sp
.ne 2
.mk
.na
.B -p
.ad
.RS 6n
.rt
Reports additionally the current project membership of the invoking
process. The project is reported using the format:
.sp
.in +2
.nf
"projid=%u(%s)"
.fi
.in -2
.sp

which is inserted prior to the \fB\en\fR character of the default format
described in the
.B Formats
section. The arguments
.sp
.in +2
.nf
<\fIproject ID\fR>,<\fIproject name\fR>
.fi
.in -2
.sp

are appended to the end of the argument list.  If the project \fBID\fR
cannot be mapped by the system into a printable project name, the
corresponding
.B (%s)
and name argument is omitted from the corresponding
format string.
.RE

.sp
.ne 2
.mk
.na
.B -a
.ad
.RS 6n
.rt
Reports user name, user
.B ID
and all the groups to which the user
belongs.
.RE

.sp
.ne 2
.mk
.na
.B -G
.ad
.RS 6n
.rt
Outputs all different group \fBID\fRs (effective, real and supplementary)
only, using the format \fB"%u\en"\fR. If there is more than one distinct
group affiliation, output each such affiliation, using the format \fB"
%u"\fR, before the \fBNEWLINE\fR character is output.
.RE

.sp
.ne 2
.mk
.na
.B -g
.ad
.RS 6n
.rt
Outputs only the effective group
.BR ID ,
using the format
\fB"%u\en"\fR.
.RE

.sp
.ne 2
.mk
.na
.B -n
.ad
.RS 6n
.rt
Outputs the name in the format \fB"%s"\fR instead of the numeric \fBID\fR
using the format \fB"%u"\fR.
.RE

.sp
.ne 2
.mk
.na
.B -r
.ad
.RS 6n
.rt
Outputs the real
.B ID
instead of the effective
.BR ID .
.RE

.sp
.ne 2
.mk
.na
.B -u
.ad
.RS 6n
.rt
Outputs only the effective user \fBID\fR, using the format \fB"%u\en"\fR.
.RE

.SH OPERANDS
.sp
.LP
The following operand is supported:
.sp
.ne 2
.mk
.na
.I user
.ad
.RS 8n
.rt
The user (login) name for which information is to be written.
.RE

.SH ENVIRONMENT VARIABLES
.sp
.LP
See
.BR environ (5)
for descriptions of the following environment
variables that affect the execution of
.BR id :
.BR LANG ,
.BR LC_ALL ,
.BR LC_CTYPE ,
.BR LC_MESSAGES ,
and
.BR NLSPATH .
.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 6n
.rt
Successful completion.
.RE

.sp
.ne 2
.mk
.na
.B >0
.ad
.RS 6n
.rt
An error occurred.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.SS "/usr/bin/id"
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu, SUNWcar
_
Interface StabilityStable
.TE

.SS "/usr/xpg4/bin/id"
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWxcu4
_
Interface StabilityStandard
.TE

.SH SEE ALSO
.sp
.LP
.BR fold (1),
.BR logname (1),
.BR who (1),
.BR getgid (2),
.BR getgroups (2),
.BR getprojid (2),
.BR getuid (2),
.BR attributes (5),
.BR environ (5),
.BR standards (5)
.SH NOTES
.sp
.LP
Output produced by the
.B -G
option and by the default case could
potentially produce very long lines on systems that support large numbers of
supplementary groups.
