usr/src/man/man1m/idmapd.1m
'\" te
.\" Copyright (c) 2007, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH idmapd 1M "5 June 2007" "SunOS 5.11" "System Administration Commands"
.SH NAME
idmapd \- Native Identity Mapping service daemon
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/idmapd\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B idmapd
daemon maps Windows Security Identifiers (SIDs) to POSIX
Identifiers (UIDs/GIDs) and conversely.
.sp
.LP
The
.BR idmap (1M)
utility provides a front end to the
.B
idmapd
daemon.
.SH FILES
.sp
.ne 2
.mk
.na
.B /var/idmap/idmap.db
.ad
.sp .6
.RS 4n
Database in which to store local name-based ID mapping rules. The contents
of the database are private. The database should not be accessed or modified
directly.
.RE

.sp
.ne 2
.mk
.na
.B /var/run/idmap/idmap.db
.ad
.sp .6
.RS 4n
Database in which to cache ID mappings that are generated by ephemeral ID
mapping and by name-based mapping. The contents of the database are private.
The database should not be accessed or modified directly.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
_
Interface StabilitySee below.
.TE

.sp
.LP
Interface stability for these components is as follows:
.sp
.ne 2
.mk
.na
.B svc:/system/idmap
.ad
.sp .6
.RS 4n
Committed
.RE

.sp
.ne 2
.mk
.na
.B /var/idmap/idmap.db
.ad
.sp .6
.RS 4n
Project Private
.RE

.sp
.ne 2
.mk
.na
.B /var/run/idmap/idmap.db
.ad
.sp .6
.RS 4n
Project Private
.RE

.SH SEE ALSO
.sp
.LP
.BR svcs (1),
.BR idmap (1M),
.BR svcadm (1M),
.BR svccfg (1M),
.BR defaultdomain (4),
.BR attributes (5),
.BR smf (5)
.SH NOTES
.sp
.LP
The
.B idmapd
service is managed by the service management facility
(SMF). The service identifier for the
.B idmapd
service is
.BR svc:/system/idmap .
.sp
.LP
Use the
.B svcadm
command to perform administrative actions on this
service, such as enabling, disabling, or restarting the service. These
actions require the
.B solaris.smf.manage.idmap
authorization. Use the
.B svcs
command to query the service's status.
.sp
.LP
The functionality of this daemon might change in a future release of the
Solaris operating system.
