usr/src/man/man1m/idsconfig.1m
'\" te
.\" Copyright (C) 2001, Sun Microsystems, Inc. All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH idsconfig 1M "18 Oct 2001" "SunOS 5.11" "System Administration Commands"
.SH NAME
idsconfig \- prepare an iPlanet Directory Server (iDS) to be populated with
data and serve LDAP clients
.SH SYNOPSIS
.LP
.nf
\fB /usr/lib/ldap/idsconfig\fR [\fB-v\fR] [\fB-i\fR \fIinput_configfile\fR]
     [\fB-o\fR \fIoutput_configfile\fR]
.fi

.SH DESCRIPTION
.sp
.LP
Use the
.B idsconfig
tool to set up an iPlanet Directory Server (iDS). You
can specify the input configuration file with the
.B -i
option on the
command line. Alternatively, the tool will prompt the user for configuration
information. The input configuration  file is created by
.B idsconfig
with
the
.B -o
option on a previous run.
.sp
.LP
The first time a server is set up, the user is prompted for all the required
information. Future installations on that machine can use the configuration
file previously generated by
.B idsconfig
using the
.B -o
option.
.sp
.LP
The output configuration file contains the directory administrator's password
in clear text. Thus, if you are creating an output configuration file, take
appropriate security precautions.
.sp
.LP
You should back up the directory server's configuration and data prior to
running this command.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -i
.I input_configfile
.ad
.RS 24n
.rt
Specify the file name for
.B idsconfig
to use as a configuration file.
This file will be read by
.BR idsconfig ,
and the values  in the file will be
used to configure the server.  Do not manually edit
.IR input_configfile .
The \fIinput_configfile\fR is only partially validated, as \fBidsconfig\fR
assumes that the file was created by a previous invocation of the command.
.RE

.sp
.ne 2
.mk
.na
.B -o
.I output_configfile
.ad
.RS 24n
.rt
Create a configuration file.
.RE

.sp
.ne 2
.mk
.na
.B -v
.ad
.RS 24n
.rt
Verbose output.
.RE

.SH OPERANDS
.sp
.LP
The following operands are supported:
.sp
.ne 2
.mk
.na
.I input_configfile
.ad
.RS 21n
.rt
Name of configuration file for
.B idsconfig
to use.
.RE

.sp
.ne 2
.mk
.na
.I output_configfile
.ad
.RS 21n
.rt
Configuration file created by
.BR idsconfig .
.RE

.SH EXAMPLES
.LP
.B Example 1
Prompting the User for Input
.sp
.LP
In the following example, the user is prompted for information to set up
iDS.

.sp
.in +2
.nf
example# \fBidsconfig\fR
.fi
.in -2
.sp

.LP
.B Example 2
Creating an Output Configuration File
.sp
.LP
In the following example, the user is prompted for information to set up iDS,
and an output configuration file,
.BR config.1 ,
is created when completed.

.sp
.in +2
.nf
example# \fBidsconfig -o config.1\fR
.fi
.in -2
.sp

.LP
.B Example 3
Setting up iDS Using the Specified Configuration File
.sp
.LP
In the following example, iDS is set up by using the values specified in the
configuration file,
.BR config.1 .
The verbose mode is specified, so detailed
information will print to the screen.

.sp
.in +2
.nf
example# \fBidsconfig -v -i config.1\fR
.fi
.in -2
.sp

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 6n
.rt
Successful completion.
.RE

.sp
.ne 2
.mk
.na
.B >0
.ad
.RS 6n
.rt
An error occurred.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWnisu
_
Interface StabilityEvolving
.TE

.SH SEE ALSO
.sp
.LP
.BR ldap (1),
.BR ldapadd (1),
.BR ldapdelete (1),
.BR ldaplist (1),
.BR ldapmodify (1),
.BR ldapmodrdn (1),
.BR ldapsearch (1),
.BR ldap_cachemgr (1M),
.BR ldapaddent (1M),
.BR ldapclient (1M),
.BR suninstall (1M),
.BR resolv.conf (4),
.BR attributes (5)
