usr/src/man/man1m/ifparse.1m
'\" te
.\" Copyright (C) 2001, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ifparse 1M "9 May 2001" "SunOS 5.11" "System Administration Commands"
.SH NAME
ifparse \- parse
.B ifconfig
command line
.SH SYNOPSIS
.LP
.nf
\fB/sbin/ifparse\fR [\fB-fs\fR] \fIaddr_family\fR \fIcommands\fR
.fi

.SH DESCRIPTION
.sp
.LP
.RB "Use the " ifparse " command to parse the " ifconfig (1M)
command line
options and output substrings, one per line, as appropriate. If no options
are specified,
.BR ifparse " returns the entire "
.B ifconfig
command line
as a series of substrings, one per line.
.SH OPTIONS
.sp
.LP
The
.B ifparse
command supports the following options:
.sp
.ne 2
.mk
.na
.B -f
.ad
.RS 6n
.rt
Lists only substrings of the
.B ifconfig
command line that are relevant
to IP network multipath failover
.RE

.sp
.ne 2
.mk
.na
.B -s
.ad
.RS 6n
.rt
 Lists only substrings of the
.B ifconfig
command line that are not relevant to IP network multipath failover
.RE

.SH OPERANDS
.sp
.LP
The \fBifparse\fR command
.B does not
support the \fIinterface\fR
operand of the
.B ifconfig
command.
.SH EXAMPLES
.LP
.B Example 1
Parsing Command Line Options Relevant to Failover
.sp
.LP
The following example shows the use of the
.B ifparse
command to parse
the command line options relevant to IP network multipath failover:

.sp
.in +2
.nf
example# \fBifparse -f inet 1.2.3.4 up group one addif 1.2.3.5 -failover up\fR
set 1.2.3.4 up
.fi
.in -2
.sp

.LP
.B Example 2
Parsing Command Line Options That Are Not Relevant to
Failover
.sp
.LP
The following example shows the use of the
.B ifparse
command to parse
the command line options that are not relevant to IP network multipath
failover:

.sp
.in +2
.nf
example# \fBifparse -s inet 1.2.3.4 up group one addif 1.2.3.5 -failover up\fR
group one
addif 1.2.3.5 -failover up
.fi
.in -2
.sp

.LP
.B Example 3
Parsing the Command Line For All Options
.sp
.LP
The following example shows the use of the
.B ifparse
command to parse
the command line for all
.B ifconfig
options:

.sp
.in +2
.nf
example# \fBifparse inet 1.2.3.4 up group one addif 1.2.3.5 -failover up\fR
group one
set 1.2.3.4 up
addif 1.2.3.5 -failover up
.fi
.in -2
.sp

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsr
_
Stability LevelObsolete
.TE

.SH SEE ALSO
.sp
.LP
.BR ifconfig (1M),
.BR attributes (5)
.SH DIAGNOSTICS
.sp
.LP
usage:
.B -fs
<addr_family> <commands>
.RS +4
.B Description:
.sp
.LP
This message indicates an invalid command line.
.RE

.sp
.LP
.BR ifparse :
Not enough space
.RS +4
.B Description:
.sp
.LP
This message indicates insufficient memory.
.RE

.sp
.LP
.BR ifparse :
dhcp not supported for inet6
.RS +4
.B Description:
.sp
.LP
DHCP operations are not supported for the
.B inet6
address family.
.RE

.sp
.LP
.BR ifparse :
Operation <operation> not supported for <addr_family>
.RS +4
.B Description:
.sp
.LP
Most operations cannot be used with all address families. For example, the
.B broadcast
operation is not supported on the
.B inet6
address
family.
.RE

.sp
.LP
.BR ifparse :
no argument for <operation>
.RS +4
.B Description:
.sp
.LP
Some operations, for example
.BR broadcast ,
require an argument.
.RE

.SH NOTES
.sp
.LP
The
.B ifparse
command is classified as an obsolete interface. It will
likely be removed in a future release. You should not develop applications
that depend upon this interface.
