usr/src/man/man1m/iicpshd.1m
'\" te
.\" Copyright (c) 2007, Sun Microsystems, Inc. All rights reserved.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH iicpshd 1M "2 Oct 2007" "SunOS 5.11" "System Administration Commands"
.SH NAME
iicpshd \- copy Availability Suite Point-in-Time shadow volume
.SH SYNOPSIS
.LP
.nf
\fBiicpshd\fR [\fB-s\fR] \fIold_shadow\fR \fInew_shadow\fR...
.fi

.SH DESCRIPTION
.sp
.LP
The
.B iicpshd
command copies an Availability Suite Instant Image shadow
volume, updating the bit map header and Availability Suite configuration to
reflect the new shadow volume.
.sp
.LP
No checks on the current use of either the old or new shadow volumes are
made. The
.B iicpshd
command should only be run when the Instant Image
shadow set using the old shadow volume is suspended.
.SH OPTIONS
.sp
.LP
The
.B iicpshd
command supports the following option:
.sp
.ne 2
.mk
.na
.B -s
.ad
.RS 13n
.rt
Update the StorageTek configuration information for the Point-in-Time
shadow set, but do
.B not
copy data from the old shadow volume to the new
shadow volume.
.RE

.SH OPERANDS
.sp
.LP
A
.B iicpshd
command line has the following operands:
.sp
.ne 2
.mk
.na
.I old_shadow new_shadow
.ad
.sp .6
.RS 4n
.B iicpshd
copies the data of the old Availability Suite Instant Image
shadow volume to the new shadow volume and updates the bit map header and
configuration data.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWiir, SUNWiiu
_
Interface StabilityEvolving
.TE

.SH SEE ALSO
.sp
.LP
.BR iiadm (1M),
.BR iicpbmp (1M),
.BR attributes (5)
.SH WARNINGS
.sp
.LP
.B iicpshd
should be run only when the system is in single-user mode.
When you run
.BR iicpshd ,
the command makes no attempt to check if a
Point-in-Time set is in use. Running
.B iicpshd
with the
.B -s
flag
while Point-in-Time is using the old shadow volume can result in shadow
volume data loss. If you use the
.B -s
option, you must manually copy the
data on the old shadow volume to the new shadow volume.
