usr/src/man/man1m/imqdbmgr.1m
'\" te
.\" Copyright (c) 2004, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH imqdbmgr 1M "29 Mar 2004" "SunOS 5.11" "System Administration Commands"
.SH NAME
imqdbmgr \- manage a plugged-in JDBC-compliant Message Queue data store
.SH SYNOPSIS
.LP
.nf
\fB/usr/bin/imqdbmgr\fR \fIsubcommand\fR \fIargument\fR [ [\fIoption\fR\&.\|.\|.]]
.fi

.LP
.nf
\fB/usr/bin/imqdbmgr\fR \fB-h\fR | \fB-help\fR
.fi

.LP
.nf
\fB/usr/bin/imqdbmgr\fR \fB-v\fR | \fB-version\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B imqdbmgr
utility creates and manages a Java DataBase Connectivity
(\fBJDBC\fR) compliant database used for Message Queue persistent storage.

.sp
.LP
The database can be either embedded or external. To use a JDBC-compliant
database (and the
.B imdbmgr
utility), you need to first set a number of
JDBC-related properties in the broker instance configuration file. See the
.I "Sun Java System Message Queue Administrator's Guide
for additional
information.
.sp
.LP
.B imqdbmgr
supports four management subcommands. These
\fIsubcommand\fRs, and their corresponding \fIargument\fRs and \fIoption\fRs
follow the
.B imqdbmgr
command on the command line. See
.B USAGE
and
.BR OPTIONS .
.sp
.LP
The following subcommands are supported:
.sp
.ne 2
.mk
.na
.B create
.ad
.RS 12n
.rt
Create a Message Queue database schema.
.RE

.sp
.ne 2
.mk
.na
.B delete
.ad
.RS 12n
.rt
Delete Message Queue database tables in the current data store.
.RE

.sp
.ne 2
.mk
.na
.B recreate
.ad
.RS 12n
.rt
Delete Message Queue database tables and recreate Message Queue database
schema in the curent data store.
.RE

.sp
.ne 2
.mk
.na
.B reset
.ad
.RS 12n
.rt
Reset the database table lock to allow other processes to access database
tables.
.RE

.sp
.LP
The
.B imqdbmgr
subcommands support the following arguments:
.sp
.ne 2
.mk
.na
.B all
.ad
.RS 10n
.rt
Indicates the subcommand applies to the data store, as well as the database
tables.
.RE

.sp
.ne 2
.mk
.na
.B lck
.ad
.RS 10n
.rt
Indicates the subcommand applies to the database table lock.
.RE

.sp
.ne 2
.mk
.na
.B oldtbl
.ad
.RS 10n
.rt
Indicates the subcommand applies to an older version of the database
tables.
.RE

.sp
.ne 2
.mk
.na
.B tbl
.ad
.RS 10n
.rt
Indicates the subcommand applies to the database tables only.
.RE

.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -b
.I brokerName
.ad
.RS 21n
.rt
Specify the broker instance name and corresponding instance configuration
properties. If this option is not specified, the default broker instance is
assumed.
.sp
Use this option with the
.BR create ,
.BR delete ,
.BR recreate ,
or
.B reset
subcommands.
.RE

.sp
.ne 2
.mk
.na
\fB-D\fR \fIproperty\fR=\fIvalue\fR
.ad
.RS 21n
.rt
Set system property
.I property
to
.IR value .
.sp
Use this option with the
.BR create ,
.BR delete ,
.BR recreate ,
or
.B reset
subcommands.
.RE

.sp
.ne 2
.mk
.na
.B -h
|
.B -help
.ad
.RS 21n
.rt
Display usage help. Execute nothing else on the command line.
.RE

.sp
.ne 2
.mk
.na
.B -p
.I password
.ad
.RS 21n
.rt
Specify the database password.
.sp
Use this option with the
.BR create ,
.BR delete ,
.BR recreate ,
or
.B reset
subcommands.
.RE

.sp
.ne 2
.mk
.na
.B -u
.I userName
.ad
.RS 21n
.rt
Specify the database user name.
.sp
Use this option with the
.BR create ,
.BR delete ,
.BR recreate ,
or
.B reset
subcommands.
.RE

.sp
.ne 2
.mk
.na
.B -v
|
.B -version
.ad
.RS 21n
.rt
Display version information. Execute nothing else on the command line.
.RE

.SH USAGE
.sp
.LP
The following subcommands and associated arguments are supported:
.sp
.ne 2
.mk
.na
.B create all
.ad
.sp .6
.RS 4n
Create a new embedded data store and Message Queue database schema for a
specified or default broker instance.
.RE

.sp
.ne 2
.mk
.na
\fBcreate tbl [-u\fR \fIuserName\fR] [\fB-p\fR \fIpassword\fR]\fR
.ad
.sp .6
.RS 4n
Create Message Queue database schema in an existing data store for a
specified or default broker instance.
.RE

.sp
.ne 2
.mk
.na
\fBdelete tbl [-u\fR \fIuserName\fR] [\fB-p\fR \fIpassword\fR]\fR
.ad
.sp .6
.RS 4n
Delete Message Queue database tables in the current data store for a
specified or default broker instance.
.RE

.sp
.ne 2
.mk
.na
\fBdelete oldtbl [-u\fR \fIuserName\fR] [\fB-p\fR \fIpassword\fR]\fR
.ad
.sp .6
.RS 4n
Delete the earlier version of Message Queue database tables. Used after the
data store has been automatically migrated to the current version of Message
Queue.
.RE

.sp
.ne 2
.mk
.na
\fBrecreate tbl [-u\fR \fIuserName\fR] [\fB-p\fR \fIpassword\fR]\fR
.ad
.sp .6
.RS 4n
Delete Message Queue database tables and recreate Message Queue database
schema in the current data store for a specified or default broker instance.

.RE

.sp
.ne 2
.mk
.na
.B reset lck
.ad
.sp .6
.RS 4n
Reset the database table lock to allow other processes to access database
tables.
.RE

.SH ENVIRONMENT VARIABLES
.sp
.LP
The following environment variables affect the execution of this command:

.sp
.ne 2
.mk
.na
.B IMQ_JAVAHOME
.ad
.RS 16n
.rt
Specify the Java 2 compatible runtime. When this environment variable is
not set it defaults to
.BR /usr/j2se .
.RE

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 6n
.rt
Successful completion.
.RE

.sp
.ne 2
.mk
.na
.B >0
.ad
.RS 6n
.rt
An error occurred.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
\fB/var/imq/instances/\fIbrokerName\fR/dbstore\fR
.ad
.sp .6
.RS 4n
Recommended directory in which to create an embedded database.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWiqu
.TE

.SH SEE ALSO
.sp
.LP
.BR imqadmin (1M),
.BR imqbrokerd (1M),
.BR imqcmd (1M),
.BR imqusermgr (1M),
.BR imqkeytool (1M),
.BR imqobjmgr (1M),
.BR attributes (5)
.sp
.LP
.I "Sun Java System Message Queue Administrator's Guide
