usr/src/man/man1m/imqusermgr.1m
'\" te
.\" Copyright (c) 2004, Sun Microsystems, Inc. All Rights Reserved.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH imqusermgr 1M "23 Mar 2004" "SunOS 5.11" "System Administration Commands"
.SH NAME
imqusermgr \- command utility for managing a Message Queue user repository
.SH SYNOPSIS
.LP
.nf
\fB/usr/bin/imqusermgr\fR \fIsubcommand\fR [[\fIoption\fR]\&.\|.\|.]
.fi

.LP
.nf
\fB/usr/bin/imqusermgr\fR \fB-h\fR
.fi

.LP
.nf
\fB/usr/bin/imqusermgr\fR \fB-v\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B imqusermgr
utility manages a file-based user repository to
authenticate and authorize users of a Message Queue message server.
.sp
.LP
.B imqusermgr
provides subcommands for adding, deleting, updating, and
listing user entries in the repository.
.sp
.LP
.B imqusermgr
supports four management subcommands. These
\fIsubcommand\fRs, and their corresponding \fIoption\fRs follow the
.B imqusermgr
command on the command line. See
.B USAGE
and
.BR OPTIONS .
.sp
.LP
The following subcommands are supported:
.sp
.ne 2
.mk
.na
.B add
.ad
.RS 10n
.rt
Add a new user and associated password to the repository.
.RE

.sp
.ne 2
.mk
.na
.B delete
.ad
.RS 10n
.rt
Delete a user from the repository.
.RE

.sp
.ne 2
.mk
.na
.B list
.ad
.RS 10n
.rt
Display information users in the repository.
.RE

.sp
.ne 2
.mk
.na
.B update
.ad
.RS 10n
.rt
Update the password or state of a user in the repository.
.RE

.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -a
.I active_state
.ad
.RS 19n
.rt
Specify if user's state is active or inactive. An inactive user cannot
create connections to the Message Queue message server.
.sp
Valid values for
.I active_state
are
.B true
or
.B false.
Specify
.B true
for active or
.B false
for inactive. the default is
.BR true .
.sp
Use this option with the
.B update
subcommmand.
.RE

.sp
.ne 2
.mk
.na
.B -f
.ad
.RS 19n
.rt
Perform action without user confirmation.
.sp
Use this option with the
.B delete
and
.B update
subcommmands.
.RE

.sp
.ne 2
.mk
.na
.B -g
.I group
.ad
.RS 19n
.rt
Specify the group of the user.
.sp
Valid values for group are
.BR admin ,
.BR user ,
and
.BR anonymous .
.sp
Use this option with the
.B add
subcommmand.
.RE

.sp
.ne 2
.mk
.na
.B -h
.ad
.RS 19n
.rt
 Display usage help. Exceute nothing else on the command line.
.RE

.sp
.ne 2
.mk
.na
.B -i
.I brokerName
.ad
.RS 19n
.rt
Specify the broker instance user repository to which the command applied. If
you do not specify
.IR brokerName ,
the default
.I brokerName
is
assumed.
.sp
Use this option with the
.BR add ,
.BR delete ,
.BR list ,
and
.B update
subcommmands.
.RE

.sp
.ne 2
.mk
.na
.B -p
.I password
.ad
.RS 19n
.rt
Specify user password.
.sp
Use this option with the
.B add
and
.B update
subcommmands.
.RE

.sp
.ne 2
.mk
.na
.B -s
.ad
.RS 19n
.rt
Silent mode. Display no output
.sp
Use this option with the
.BR add ,
.BR delete ,
and
.BR update
subcommands.
.RE

.sp
.ne 2
.mk
.na
.B -u
.I userName
.ad
.RS 19n
.rt
Specify user name.
.sp
.I userName
cannot contain the following characters: asterisk
.RB ( * ),
colon
.RB ( : ),
NEWLINE, or RETURN.
.sp
Use this option with the
.BR add ,
.BR delete ,
.B update
and
.B list
subcommands.
.RE

.sp
.ne 2
.mk
.na
.B -v
.ad
.RS 19n
.rt
Display version information. Exceute nothing else on the command line.
.RE

.SH USAGE
.sp
.LP
The following subcommands and corresponding options are supported:
.sp
.ne 2
.mk
.na
.B add -u
.I userName
.B -p
.I password
[\fB-g\fR
\fIgroup\fR] [\fB-s\fR] [\fB-i\fR \fIbrokerName\fR]\fR
.ad
.sp .6
.RS 4n
Add a new user and associated password to the repository, and optionally
specify the user's group.
.RE

.sp
.ne 2
.mk
.na
.B delete -u
.I userName
[\fB-s\fR] [\fB-f\fR] [\fB-i\fR
\fIbrokerName\fR]\fR
.ad
.sp .6
.RS 4n
Delete a user from the repository.
.RE

.sp
.ne 2
.mk
.na
\fB list [-u\fR \fIuser_name\fR] [\fB-i\fR \fIbrokerName\fR]\fR
.ad
.sp .6
.RS 4n
Display information about the specified user in the repository. If no user
is specified, all users are displayed.
.RE

.sp
.ne 2
.mk
.na
.B update -u
.I userName
.B -p
.I password
[\fB-a\fR
\fIstate\fR] [\fB-s\fR] [\fB-f\fR] [\fB-i\fR \fIbrokerName\fR]\fR
.ad
.br
.na
.B update -u
.I userName
.B -a
.I state
[\fB-p\fR
\fIpassword\fR] [\fB-s\fR] [\fB-f\fR] [\fB-i\fR \fIbrokerName\fR]\fR
.ad
.sp .6
.RS 4n
Update the password or state (or both) of a user.
.RE

.SH ENVIRONMENT VARIABLES
.sp
.LP
The following environment variables affect the execution of this command:
.sp
.ne 2
.mk
.na
.B IMQ_JAVAHOME
.ad
.RS 16n
.rt
Specify the Java 2 compatible runtime. When this environment variable is not
set, it defaults to
.BR /usr/j2se .
.RE

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 6n
.rt
Successful completion.
.RE

.sp
.ne 2
.mk
.na
.B >0
.ad
.RS 6n
.rt
An error occurred.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/imq/passwd
.ad
.RS 19n
.rt
Flat-file user repository.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWiqu
.TE

.SH SEE ALSO
.sp
.LP
.BR imqadmin (1M),
.BR imqbrokerd (1M),
.BR imqcmd (1M),
.BR imqdbmgr (1M),
.BR imqkeytool (1M),
.BR imqobjmgr (1M),
.BR attributes (5)
.sp
.LP
.I "Sun Java System Message Queue Administrator's Guide
