usr/src/man/man1m/imqusermgr.1m
'\" te
.\" Copyright (c) 2004, Sun Microsystems, Inc. All Rights Reserved.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH imqusermgr 1M "23 Mar 2004" "SunOS 5.11" "System Administration Commands"
.SH NAME
imqusermgr \- command utility for managing a Message Queue user repository
.SH SYNOPSIS
.LP
.nf
\fB/usr/bin/imqusermgr\fR \fIsubcommand\fR [[\fIoption\fR]\&.\|.\|.]
.fi

.LP
.nf
\fB/usr/bin/imqusermgr\fR \fB-h\fR
.fi

.LP
.nf
\fB/usr/bin/imqusermgr\fR \fB-v\fR
.fi

.SH DESCRIPTION
.sp
.LP
The \fBimqusermgr\fR utility manages a file-based user repository to
authenticate and authorize users of a Message Queue message server.
.sp
.LP
\fBimqusermgr\fR provides subcommands for adding, deleting, updating, and
listing user entries in the repository.
.sp
.LP
\fBimqusermgr\fR supports four management subcommands. These
\fIsubcommand\fRs, and their corresponding \fIoption\fRs follow the
\fBimqusermgr\fR command on the command line. See \fBUSAGE\fR and
\fBOPTIONS\fR.
.sp
.LP
The following subcommands are supported:
.sp
.ne 2
.mk
.na
\fBadd\fR
.ad
.RS 10n
.rt
Add a new user and associated password to the repository.
.RE

.sp
.ne 2
.mk
.na
\fBdelete\fR
.ad
.RS 10n
.rt
Delete a user from the repository.
.RE

.sp
.ne 2
.mk
.na
\fBlist\fR
.ad
.RS 10n
.rt
Display information users in the repository.
.RE

.sp
.ne 2
.mk
.na
\fBupdate\fR
.ad
.RS 10n
.rt
Update the password or state of a user in the repository.
.RE

.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB-a\fR \fIactive_state\fR
.ad
.RS 19n
.rt
Specify if user's state is active or inactive. An inactive user cannot
create connections to the Message Queue message server.
.sp
Valid values for \fIactive_state\fR are \fBtrue\fR or \fBfalse.\fR Specify
\fBtrue\fR for active or \fBfalse\fR for inactive. the default is
\fBtrue\fR.
.sp
Use this option with the \fBupdate\fR subcommmand.
.RE

.sp
.ne 2
.mk
.na
\fB-f\fR
.ad
.RS 19n
.rt
Perform action without user confirmation.
.sp
Use this option with the \fBdelete\fR and \fBupdate\fR subcommmands.
.RE

.sp
.ne 2
.mk
.na
\fB-g\fR \fIgroup\fR
.ad
.RS 19n
.rt
Specify the group of the user.
.sp
Valid values for group are \fBadmin\fR, \fBuser\fR, and \fBanonymous\fR.
.sp
Use this option with the \fBadd\fR subcommmand.
.RE

.sp
.ne 2
.mk
.na
\fB-h\fR
.ad
.RS 19n
.rt
 Display usage help. Exceute nothing else on the command line.
.RE

.sp
.ne 2
.mk
.na
\fB-i\fR \fIbrokerName\fR
.ad
.RS 19n
.rt
Specify the broker instance user repository to which the command applied. If
you do not specify \fIbrokerName\fR, the default \fIbrokerName\fR is
assumed.
.sp
Use this option with the \fBadd\fR, \fBdelete\fR, \fBlist\fR, and
\fBupdate\fR subcommmands.
.RE

.sp
.ne 2
.mk
.na
\fB-p\fR \fIpassword\fR
.ad
.RS 19n
.rt
Specify user password.
.sp
Use this option with the \fBadd\fR and \fBupdate\fR subcommmands.
.RE

.sp
.ne 2
.mk
.na
\fB-s\fR
.ad
.RS 19n
.rt
Silent mode. Display no output
.sp
Use this option with the \fBadd\fR, \fBdelete\fR, and \fBupdate\fR
subcommands.
.RE

.sp
.ne 2
.mk
.na
\fB-u\fR \fIuserName\fR
.ad
.RS 19n
.rt
Specify user name.
.sp
\fIuserName\fR cannot contain the following characters: asterisk (\fB*\fR),
colon (\fB:\fR), NEWLINE, or RETURN.
.sp
Use this option with the \fBadd\fR, \fBdelete\fR, \fBupdate\fR and
\fBlist\fR subcommands.
.RE

.sp
.ne 2
.mk
.na
\fB-v\fR
.ad
.RS 19n
.rt
Display version information. Exceute nothing else on the command line.
.RE

.SH USAGE
.sp
.LP
The following subcommands and corresponding options are supported:
.sp
.ne 2
.mk
.na
\fBadd \fB-u\fR \fIuserName\fR \fB-p\fR \fIpassword\fR [\fB-g\fR
\fIgroup\fR] [\fB-s\fR] [\fB-i\fR \fIbrokerName\fR]\fR
.ad
.sp .6
.RS 4n
Add a new user and associated password to the repository, and optionally
specify the user's group.
.RE

.sp
.ne 2
.mk
.na
\fBdelete \fB-u\fR \fIuserName\fR [\fB-s\fR] [\fB-f\fR] [\fB-i\fR
\fIbrokerName\fR]\fR
.ad
.sp .6
.RS 4n
Delete a user from the repository.
.RE

.sp
.ne 2
.mk
.na
\fB list [\fB-u\fR \fIuser_name\fR] [\fB-i\fR \fIbrokerName\fR]\fR
.ad
.sp .6
.RS 4n
Display information about the specified user in the repository. If no user
is specified, all users are displayed.
.RE

.sp
.ne 2
.mk
.na
\fBupdate \fB-u\fR \fIuserName\fR \fB-p\fR \fIpassword\fR [\fB-a\fR
\fIstate\fR] [\fB-s\fR] [\fB-f\fR] [\fB-i\fR \fIbrokerName\fR]\fR
.ad
.br
.na
\fBupdate \fB-u\fR \fIuserName\fR \fB-a\fR \fIstate\fR [\fB-p\fR
\fIpassword\fR] [\fB-s\fR] [\fB-f\fR] [\fB-i\fR \fIbrokerName\fR]\fR
.ad
.sp .6
.RS 4n
Update the password or state (or both) of a user.
.RE

.SH ENVIRONMENT VARIABLES
.sp
.LP
The following environment variables affect the execution of this command:
.sp
.ne 2
.mk
.na
\fBIMQ_JAVAHOME\fR
.ad
.RS 16n
.rt
Specify the Java 2 compatible runtime. When this environment variable is not
set, it defaults to \fB/usr/j2se\fR.
.RE

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
\fB0\fR \fR
.ad
.RS 6n
.rt
Successful completion.
.RE

.sp
.ne 2
.mk
.na
\fB>\fB0\fR
.ad
.RS 6n
.rt
An error occurred.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
\fB/etc/imq/passwd\fR
.ad
.RS 19n
.rt
Flat-file user repository.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWiqu
.TE

.SH SEE ALSO
.sp
.LP
\fBimqadmin\fR(1M), \fBimqbrokerd\fR(1M), \fBimqcmd\fR(1M),
\fBimqdbmgr\fR(1M), \fBimqkeytool\fR(1M), \fBimqobjmgr\fR(1M),
\fBattributes\fR(5)
.sp
.LP
\fISun Java System Message Queue Administrator's Guide\fR
