usr/src/man/man1m/in.dhcpd.1m
'\" te
.\" Copyright (c) 2004 by Sun Microsystems, Inc. All Rights Reserved.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH in.dhcpd 1M "10 Aug 2004" "SunOS 5.11" "System Administration Commands"
.SH NAME
in.dhcpd \- Dynamic Host Configuration Protocol server
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/inet/in.dhcpd\fR  [\fB-denv\fR] [\fB-h\fR \fIrelay_hops\fR] [\fB-i\fR \fIinterface,\fR .\|.\|.]
 [\fB-l\fR \fIsyslog_local_facility\fR] [\fB-b\fR automatic | manual]
 [\fB-o\fR \fIDHCP_offer_time\fR] [\fB-t\fR \fIdhcptab_rescan_interval\fR]
.fi

.LP
.nf
\fB/usr/lib/inet/in.dhcpd\fR  [\fB-dv\fR] [\fB-h\fR \fIrelay_hops\fR] [\fB-i\fR \fIinterface,\fR].\|.\|.
 [\fB-l\fR \fIsyslog_local_facility\fR] \fB-r\fR \fIIP_address\fR | \fIhostname,\fR .\|.\|.
.fi

.SH DESCRIPTION
.sp
.LP
\fBin.dhcpd\fR is a daemon that responds to Dynamic Host Configuration Protocol
(\fBDHCP\fR) requests and optionally to \fBBOOTP\fR protocol requests. The daemon
forks a copy of itself that runs as a background process. It must be run as root.
The daemon has two run modes,
.B DHCP
.RB "server (with optional" " BOOTP"
compatibility mode) and
.B BOOTP
relay agent mode.
.sp
.LP
The first line in the
.B SYNOPSIS
section illustrates the options available
in the DHCP/BOOTP server mode. The second line in the SYNOPSIS section
illustrates the options available when the daemon is run in
.B BOOTP
relay
agent mode.
.sp
.LP
The
.B DHCP
and
.B BOOTP
protocols are used to provide configuration
.RB "parameters to Internet hosts. Client machines are allocated their" " IP"
addresses as well as other host configuration parameters through this
mechanism.
.sp
.LP
The \fBDHCP\fR/\fBBOOTP\fR daemon manages two types of \fBDHCP\fR data tables:
the
.B dhcptab
configuration table and the DHCP network tables.
.sp
.LP
See
.BR dhcptab (4)
regarding the dhcptab configuration table and
.BR dhcp_network (4)
regarding the
.B DHCP
network tables.
.sp
.LP
The
.B dhcptab
contains macro definitions defined using a
.BR termcap -like
syntax which permits network administrators to define groups of
.BR DHCP
configuration parameters to be returned to clients. However, a \fBDHCP/BOOTP\fR
server always returns hostname, network broadcast address, network subnet mask,
and
.B IP
maximum transfer unit (\fBMTU\fR) if requested by a client attached
to the same network as the server machine. If those options have not been
explicitly configured in the
.BR dhcptab ,
\fBin.dhcpd\fR returns reasonable
default values.
.sp
.LP
The
.B dhcptab
is read at startup, upon receipt of a
.B SIGHUP
signal, or
periodically as specified by the
.B -t
option. A
.B SIGHUP
(sent using the
command
.BR "svcadm refresh network/dhcp-server" )
causes the DHCP/BOOTP daemon to
reread the \fBdhcptab\fR within an interval from \fB0\fR-\fB60\fR seconds
(depending on where the DHCP daemon is in its polling cycle). For busy servers,
users should run
.B "svcadm restart network/dhcp-server"
to force the
\fBdhcptab\fR to be reread.
.sp
.LP
The DHCP network tables contain mappings of client identifiers to
.BR IP
addresses. These tables are named after the network they support and the
datastore used to maintain them.
.sp
.LP
The DHCP network tables are consulted during runtime. A client request received
from a network for which no DHCP network table exists is ignored.
.sp
.LP
This command may change in future releases of Solaris software. Scripts,
programs, or procedures that use this command might need modification when
upgrading to future Solaris software releases.The command line options provided
with the
.B in.dhcpd
daemon are used only for the current session, and include
only some of the server options you can set. The
.BR dhcpsvc.conf (4)
contains
all the server default settings, and can be modified by using the \fBdhcpmgr\fR
utility. See
.BR dhcpsvc.conf (4)
for more details.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -b  automatic | manual
.ad
.sp .6
.RS 4n
This option enables
.B BOOTP
.RB "compatibility mode, allowing the" " DHCP"
server to respond to
.B BOOTP
clients. The option argument specifies whether
the
.B DHCP
server should automatically allocate permanent lease
.BR IP
addresses to requesting
.B BOOTP
clients if the clients are not registered in
the DHCP network tables (\fBautomatic\fR) or respond only to
.B BOOTP
clients
who have been manually registered in the DHCP network tables
.RB ( " manual" ).
This option only affects
.B DHCP
server mode.
.RE

.sp
.ne 2
.mk
.na
.B -d
.ad
.sp .6
.RS 4n
Debugging mode. The daemon remains as a foreground process, and displays verbose
messages as it processes
.B DHCP
and/or
.B BOOTP
datagrams. Messages are
displayed on the current TTY. This option can be used in both DHCP/BOOTP server
mode and
.B BOOTP
relay agent mode.
.RE

.sp
.ne 2
.mk
.na
.BI -h " relay_hops"
.ad
.sp .6
.RS 4n
Specifies the maximum number of relay agent hops that can occur before the
daemon drops the DHCP/BOOTP datagram. The default number of relay agent hops is
4. This option affects both DHCP/BOOTP server mode and
.B BOOTP
relay agent
mode.
.RE

.sp
.ne 2
.mk
.na
\fB-i\fI interface, .\|.\|.\fR
.ad
.sp .6
.RS 4n
Selects the network interfaces that the daemon should monitor for DHCP/BOOTP
datagrams. The daemon ignores DHCP/BOOTP datagrams on network interfaces not
specified in this list. This option is only useful on machines that have multiple
network interfaces. If this option is not specified, then the daemon listens for
DHCP/BOOTP datagrams on all network interfaces. The option argument consists of a
comma-separated list of interface names. It affects both DHCP/BOOTP server and
\fBBOOTP\fR relay agent run modes.
.RE

.sp
.ne 2
.mk
.na
\fB-l\fR \fIsyslog_local_facility\fR
.ad
.sp .6
.RS 4n
The presence of this option turns on transaction logging for the
.BR DHCP
server or
.B BOOTP
relay agent. The value specifies the
.B syslog
local
facility (an integer from
.B 0
to
.B 7
inclusive) the DHCP daemon should
use for tagging the transactions. Using a facility separate from the
\fBLOG_DAEMON\fR facility allows the network administrator to capture these
transactions separately from other DHCP daemon events for such purposes as
generating transaction reports. See \fBsyslog\fR(3C), for details about local
facilities. Transactions are logged using a record with 9 space-separated fields
as follows:
.RS +4
.TP
1.
Protocol:
.sp
.in +2
.nf
  Relay mode:     "BOOTP"
  Server mode:    "BOOTP" or "DHCP" based upon client
                       type.
.fi
.in -2
.sp

.RE
.RS +4
.TP
2.
Type:
.sp
.in +2
.nf
Relay mode:     "RELAY-CLNT", "RELAY-SRVR"
Server mode:    "ASSIGN", "EXTEND", "RELEASE",
                    "DECLINE", "INFORM", "NAK" "ICMP-ECHO."
.fi
.in -2
.sp

.RE
.RS +4
.TP
3.
Transaction time: absolute time in seconds (unix time)
.RE
.RS +4
.TP
4.
Lease time:
.sp
.in +2
.nf
Relay mode:     Always 0.
Server mode:    0 for ICMP-ECHO events, absolute time in
                    seconds (unix time)  otherwise
.fi
.in -2
.sp

.RE
.RS +4
.TP
5.
Source IP address: Dotted Internet form
.LP
.nf
Relay mode:     Relay interface IP on RELAY-CLNT,  INADDR_ANY on RELAY-SRVR. Server mode:    Client IP.
.fi

.RE
.RS +4
.TP
6.
Destination IP address: Dotted Internet form
.LP
.nf
Relay mode:     Client IP on RELAY-CLNT, Server IP on RELAY-SRVR. Server mode:    Server IP.
.fi

.RE
.RS +4
.TP
7.
Client Identifier: Hex representation (0-9, A-F)
.LP
.nf
Relay mode:     MAC address                          Server mode:    BOOTP - MAC address; DHCP - client id
.fi

.RE
.RS +4
.TP
8.
Vendor Class identifier (white space converted to                        periods
(.)).
.LP
.nf
Relay mode:     Always "N/A" Server mode:    Vendor class ID tokenized by  converting white space characters  to periods (.)
.fi

.RE
.RS +4
.TP
9.
MAC address: Hex representation (0-9, A-F)
.LP
.nf
Relay mode:     MAC address Server mode:    MAC address
.fi

.RE
The format of this record is subject to change between releases.
.sp
Transactions are logged to the console if daemon is in debug mode
.RB ( -d ).
.sp
Logging transactions impact daemon performance.
.sp
It is suggested that you periodically rotate the DHCP transaction log file to
keep it from growing until it fills the filesystem. This can be done in a fashion
similar to that used for the general system message log
.BR /var/adm/messages
and is best accomplished using the facilities provided by
.BR logadm (1M).
.RE

.sp
.ne 2
.mk
.na
.B -n
.ad
.sp .6
.RS 4n
Disable automatic duplicate
.B IP
address detection. When this option is
specified, the
.B DHCP
server does not attempt to verify that an \fBIP address
it is about to\fR offer a client is not in use. By default, the
.B DHCP
server
pings an
.B IP
address before offering it to a DHCP/BOOTP client, to verify
that the address is not in use by another machine.
.RE

.sp
.ne 2
.mk
.na
\fB-o\fI DHCP_offer_time\fR
.ad
.sp .6
.RS 4n
Specifies the number of seconds the
.B DHCP
server should cache the offers it
has extended to discovering
.B DHCP
clients. The default setting is \fB10\fR
seconds. On slow network media, this value can be increased to compensate for
slow network performance. This option affects only
.B DHCP
server mode.
.RE

.sp
.ne 2
.mk
.na
\fB-r\fI IP_address | hostname, .\|.\|.\fR
.ad
.sp .6
.RS 4n
This option enables
.B BOOTP
relay agent mode. The option argument specifies
a comma-separated list of
.B IP
addresses or hostnames of
.B DHCP
or
\fBBOOTP\fR servers to which the relay agent is to forward \fBBOOTP\fR requests.
When the daemon is started in this mode, any
.B DHCP
tables are ignored, and
the daemon simply acts as a
.B BOOTP
relay agent.
.sp
A
.B BOOTP
relay agent listens to
.B UDP
port 68, and forwards \fBBOOTP\fR
request packets received on this port to the destinations specified on the
command line. It supports the
.B BROADCAST
flag described in
.B RFC
1542. A
\fBBOOTP\fR relay agent can run on any machine that has knowledge of local
routers, and thus does not have to be an Internet gateway machine.
.sp
Note that the proper entries must be made to the
.B netmasks
database so that
the
.B DHCP
server being served by the
.B BOOTP
relay agents can identify
the subnet mask of the foreign BOOTP/DHCP client's network. See \fBnetmasks\fR(4)
for the format and use of this database.
.RE

.sp
.ne 2
.mk
.na
.BI -t " dhcptab_rescan_interval"
.ad
.sp .6
.RS 4n
Specifies the interval in minutes that the
.B DHCP
server should use to
schedule the automatic rereading of the
.B dhcptab
information. Typically, you
would use this option if the changes to the
.B dhcptab
are relatively
frequent. Once the contents of the
.B dhcptab
have stabilized, you can turn
off this option to avoid needless reinitialization of the server.
.RE

.sp
.ne 2
.mk
.na
.B -v
.ad
.sp .6
.RS 4n
Verbose mode. The daemon displays more messages than in the default mode. Note
that verbose mode can reduce daemon efficiency due to the time taken to display
messages. Messages are displayed to the current
.B TTY
if the debugging option
is used; otherwise, messages are logged to the
.B syslogd
facility. This
option can be used in both DHCP/BOOTP server mode and
.B BOOTP
relay agent
mode.
.RE

.SH EXAMPLES
.LP
\fBExample 1\fR Starting a \fBDHCP\fR Server in \fBBOOTP\fR Compatibility Mode
.sp
.LP
The following command starts a
.B DHCP
server in
.B BOOTP
compatibility
.RB "mode, permitting the server to automatically allocate permanent" " IP"
addresses to
.B BOOTP
clients which are not registered in the server's table;
.RB "limits the server's attention to incoming datagrams on network devices" " le2"
and
.BR tr0 ;
drops
.B BOOTP
packets whose hop count exceeds 2; configures
the
.B DHCP
server to cache extended
.B DHCP
offers for 15 seconds; and
schedules
.B dhcptab
rescans to occur every 10 minutes:

.sp
.in +2
.nf
\fB# in.dhcpd \fB-i\fB le2,tr0 \fB-h\fB 2 \fB-o\fB 15 \fB-t\fB 10 \fB-b\fB automatic\fR
.fi
.in -2
.sp

.LP
\fBExample 2\fR Starting the Daemon in \fBBOOTP\fR Relay Agent Mode
.sp
.LP
The following command starts the daemon in
.B BOOTP
relay agent mode,
registering the hosts
.B bladerunner
and
.B 10.0.0.5
as relay destinations,
with debugging and verbose modes enabled, and drops
.B BOOTP
packets whose hop
count exceeds 5:

.sp
.in +2
.nf
\fB# in.dhcpd \fB-d\fB \fB-v\fB \fB-h\fB 5 \fB-r\fB bladerunner,10.0.0.5\fR
.fi
.in -2
.sp

.SH FILES
.sp
.ne 2
.mk
.na
\fB/etc/inet/dhcpsvc.conf\fR
.ad
.sp .6
.RS 4n

.RE

.sp
.ne 2
.mk
.na
.B /etc/init/hosts
.ad
.sp .6
.RS 4n

.RE

.sp
.ne 2
.mk
.na
\fB/usr/lib/inet/dhcp/nsu/rfc2136.so.1\fR
.ad
.sp .6
.RS 4n

.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWdhcsu
_
Interface StabilityEvolving
.TE

.SH SEE ALSO
.sp
.LP
.BR svcs (1),
.BR cron (1M),
.BR dhcpmgr (1M),
.BR dhtadm (1M),
.BR inetadm (1M),
.BR inetd (1M),
.BR logadm (1M),
.BR pntadm (1M),
.BR svcadm (1M),
.BR syslogd (1M),
.BR syslog (3C),
\fBdhcpsvc.conf\fR(4),
.BR dhcp_network (4),
.BR dhcptab (4),
.BR ethers (4),
.BR hosts (4),
.BR netmasks (4),
\fBnsswitch.conf\fR(4),
.BR attributes (5),
.BR dhcp (5),
\fBsmf\fR(5)
.sp
.LP
\fR
.sp
.LP
Alexander, S., and R. Droms,
.IR "DHCP Options and BOOTP Vendor Extensions" ,
RFC
2132, Silicon Graphics, Inc., Bucknell University, March 1997.
.sp
.LP
Droms, R.,
.IR "Interoperation Between DHCP and BOOTP" ,
RFC 1534, Bucknell
University, October 1993.
.sp
.LP
Droms, R.,
.IR "Dynamic Host Configuration Protocol" ,
RFC 2131, Bucknell
University, March 1997.
.sp
.LP
Wimer, W.,
.IR "Clarifications and Extensions for the Bootstrap Protocol" ,
RFC
1542, Carnegie Mellon University, October 1993.
.SH NOTES
.sp
.LP
The
.B in.dhcpd
service is managed by the service management facility,
\fBsmf\fR(5), under the service identifier:
.sp
.in +2
.nf
svc:/network/dhcp-server
.fi
.in -2
.sp

.sp
.LP
Administrative actions on this service, such as enabling, disabling, or
requesting restart, can be performed using \fBsvcadm\fR(1M). Responsibility for
initiating and restarting this service is delegated to
.BR inetd "(1M). Use"
.BR inetadm (1M)
to make configuration changes and to view configuration
information for this service. The service's status can be queried using the
.BR svcs (1)
command.
