usr/src/man/man1m/in.fingerd.1m
'\" te
.\" Copyright 1989 AT&T
.\" Copyright (c) 2004, Sun Microsystems, Inc.  All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH in.fingerd 1M "31 Jul 2004" "SunOS 5.11" "System Administration Commands"
.SH NAME
in.fingerd, fingerd \- remote user information server
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/in.fingerd\fR
.fi

.SH DESCRIPTION
.sp
.LP
\fBfingerd\fR implements the server side of the Name/Finger protocol,
specified in
.IR "RFC 742" .
The Name/Finger protocol provides a remote
interface to programs which display information on system status and
individual users. The protocol imposes little structure on the format of the
exchange between client and server. The client provides a single command
line to the finger server which returns a printable reply.
.sp
.LP
\fBfingerd\fR waits for connections on \fBTCP\fR port 79. Once connected,
it reads a single command line terminated by RETURN-LINEFEED and passes the
arguments to
.BR finger (1),
prepended with
.BR -s .
\fBfingerd\fR closes
its connections as soon as the output is finished.
.SH FILES
.sp
.ne 2
.mk
.na
.B /var/adm/utmpx
.ad
.RS 20n
.rt
User and accounting information.
.RE

.sp
.ne 2
.mk
.na
.B /etc/passwd
.ad
.RS 20n
.rt
System password file.
.RE

.sp
.ne 2
.mk
.na
.B /var/adm/lastlog
.ad
.RS 20n
.rt
Last login times.
.RE

.sp
.ne 2
.mk
.na
\fB$HOME/.plan\fR 
.ad
.RS 20n
.rt
User's plans.
.RE

.sp
.ne 2
.mk
.na
\fB$HOME/.project\fR 
.ad
.RS 20n
.rt
User's projects.
.RE

.SH USAGE
.sp
.LP
\fBfingerd\fR and \fBin.fingerd\fR are IPv6-enabled. See \fBip6\fR(7P).
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWrcmds
.TE

.SH SEE ALSO
.sp
.LP
.BR finger (1),
.BR svcs (1),
.BR inetadm (1M),
.BR inetd (1M),
.BR svcadm (1M),
.BR attributes (5),
\fBsmf\fR(5), \fBip6\fR(7P)
.sp
.LP
Harrenstien, Ken,
.IR "RFC 742, NAME/FINGER" ,
Network Information Center,
SRI International, Menlo Park, Calif., December 1977.
.SH NOTES
.sp
.LP
Connecting directly to the server from a
.B TIP
or an equally
narrow-minded TELNET-protocol user program can result in meaningless
attempts at option negotiation being sent to the server, which foul up the
command line interpretation. \fBfingerd\fR should be taught to filter out
\fBIAC\fR's and perhaps even respond negatively (\fBIAC\fR does not)  to all
option commands received.
.sp
.LP
The \fBin.fingerd\fR service is managed by the service management facility,
\fBsmf\fR(5), under the service identifier:
.sp
.in +2
.nf
svc:/network/finger:default
.fi
.in -2
.sp

.sp
.LP
Administrative actions on this service, such as enabling, disabling, or
requesting restart, can be performed using
.BR svcadm (1M).
Responsibility
for initiating and restarting this service is delegated to
.BR inetd (1M).
Use \fBinetadm\fR(1M) to make configuration changes and to view
configuration information for this service. The service's status can be
queried using the
.BR svcs (1)
command.
