usr/src/man/man1m/in.iked.1m
'\" te
.\" Copyright (C) 2009, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH in.iked 1M "27 Jan 2009" "SunOS 5.11" "System Administration Commands"
.SH NAME
in.iked \- daemon for the Internet Key Exchange (IKE)
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/inet/in.iked\fR [\fB-d\fR] [\fB-f\fR \fIfilename\fR] [\fB-p\fR \fIlevel\fR]
.fi

.LP
.nf
\fB/usr/lib/inet/in.iked\fR \fB-c\fR [\fB-f\fR \fIfilename\fR]
.fi

.SH DESCRIPTION
.sp
.LP
.B in.iked
performs automated key management for IPsec using the Internet
Key Exchange (\fBIKE\fR) protocol.
.sp
.LP
.B in.iked
implements the following:
.RS +4
.TP
.ie t \(bu
.el o
.B IKE
authentication with either pre-shared keys,
.B DSS
signatures,
.B RSA
signatures, or
.B RSA
encryption.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Diffie-Hellman key derivation using either
.BR 768 ,
.BR 1024 ,
or
\fB1536\fR-bit public key moduli.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Authentication protection with cipher choices of
.BR AES ,
.BR DES ,
Blowfish, or
.BR 3DES ,
and hash choices of either
.B HMAC-MD5
or
.BR HMAC-SHA-1 .
Encryption in
.B in.iked
is limited to the
.BR IKE
authentication and key exchange. See \fBipsecesp\fR(7P) for information
regarding IPsec protection choices.
.RE
.sp
.LP
.B in.iked
is managed by the following
.BR smf (5)
service:
.sp
.in +2
.nf
svc:/network/ipsec/ike
.fi
.in -2
.sp

.sp
.LP
This service is delivered disabled because the configuration file needs to be
created before the service can be enabled. See
.BR ike.config (4)
for the
format of this file.
.sp
.LP
See "Service Management Facility" for information on managing the \fBsmf\fR(5)
service.
.sp
.LP
.B in.iked
listens for incoming
.B IKE
requests from the network and for
requests for outbound traffic using the
.B PF_KEY
socket. See
.BR pf_key (7P).
.sp
.LP
.B in.iked
has two support programs that are used for IKE administration
and diagnosis:
.BR ikeadm (1M)
and
.BR ikecert (1M).
.sp
.LP
The \fBikeadm\fR(1M) command can read the \fB/etc/inet/ike/config\fR file as a
.BR rule ,
then pass the configuration information to the running
.B in.iked
daemon using a doors interface.
.sp
.in +2
.nf
example# \fBikeadm read rule /etc/inet/ike/config\fR
.fi
.in -2
.sp

.sp
.LP
Refreshing the
.BR "ike smf" (5)
service provided to manage the
.B in.iked
daemon sends a
.B SIGHUP
signal to the
.B in.iked
daemon,
which will (re)read
.B /etc/inet/ike/config
and reload the certificate
database.
.sp
.LP
The preceding two commands have the same effect, that is, to update the
running IKE daemon with the latest configuration. See "Service Management
Facility" for more details on managing the \fBin.iked\fR daemon.
.SS "Service Management Facility"
.sp
.LP
The IKE daemon (\fBin.iked\fR) is managed by the service management facility,
.BR smf (5).
The following group of services manage the components of IPsec:
.sp
.in +2
.nf
svc:/network/ipsec/ipsecalgs   (See ipsecalgs(1M))
svc:/network/ipsec/policy      (See ipsecconf(1M))
svc:/network/ipsec/manual-key  (See ipseckey(1M))
svc:/network/ipsec/ike         (see ike.config(4))
.fi
.in -2
.sp

.sp
.LP
The manual-key and
.B ike
services are delivered
.B disabled
because the
system administrator must create configuration files for each service, as
described in the respective man pages listed above.
.sp
.LP
The correct administrative procedure is to create the configuration file for
each service, then enable each service using
.BR svcadm (1M).
.sp
.LP
The
.B ike
service has a dependency on the
.B ipsecalgs
and
.BR policy
services. These services should be enabled before the
.B ike
service.
Failure to do so results in the
.B ike
service entering maintenance mode.
.sp
.LP
If the configuration needs to be changed, edit the configuration file then
refresh the service, as follows:
.sp
.in +2
.nf
example# \fBsvcadm refresh ike\fR
.fi
.in -2
.sp

.sp
.LP
The following properties are defined for the
.B ike
service:
.sp
.ne 2
.mk
.na
.B config/admin_privilege
.ad
.sp .6
.RS 4n
Defines the level that
.BR ikeadm "(1M) invocations can change or observe the"
running
.BR in.iked .
The acceptable values for this property are the same as
those for the
.B -p
option. See the description of
.B -p
in
.BR OPTIONS .
.RE

.sp
.ne 2
.mk
.na
.B config/config_file
.ad
.sp .6
.RS 4n
Defines the configuration file to use. The default value is
.BR /etc/inet/ike/config .
See
.BR ike.config (4)
for the format of this
file. This property has the same effect as the
.B -f
flag. See the
description of
.B -f
in
.BR OPTIONS .
.RE

.sp
.ne 2
.mk
.na
.B config/debug_level
.ad
.sp .6
.RS 4n
Defines the amount of debug output that is written to the \fBdebug_logfile\fR
file, described below. The default value for this is
.B op
or
.BR operator .
This property controls the recording of information on events
such as re-reading the configuration file. Acceptable value for
.B debug_level
are listed in the
.BR ikeadm "(1M) man page. The value"
.B all
is equivalent to the
.B -d
flag. See the description of \fB-d\fR
in
.BR OPTIONS .
.RE

.sp
.ne 2
.mk
.na
.B config/debug_logfile
.ad
.sp .6
.RS 4n
Defines where debug output should be written. The messages written here are
from debug code within
.BR in.iked .
Startup error messages are recorded by
the
.BR smf (5)
framework and recorded in a service-specific log file. Use any
of the following commands to examine the
.B logfile
property:
.sp
.in +2
.nf
example# \fBsvcs -l ike\fR
example# \fBsvcprop ike\fR
example# \fBsvccfg -s ike listprop\fR
.fi
.in -2
.sp

The values for these log file properties might be different, in which case
both files should be inspected for errors.
.RE

.sp
.ne 2
.mk
.na
.B config/ignore_errors
.ad
.sp .6
.RS 4n
A boolean value that controls
.BR in.iked "'s behavior should the"
configuration file have syntax errors. The default value is
.BR false ,
which
causes
.B in.iked
to enter maintenance mode if the configuration is
invalid.
.sp
Setting this value to
.B true
causes the IKE service to stay online, but
correct operation requires the administrator to configure the running daemon
with \fBikeadm\fR(1M). This option is provided for compatibility with previous
releases.
.RE

.sp
.LP
These properties can be modified using \fBsvccfg\fR(1M) by users who have been
assigned the following authorization:
.sp
.in +2
.nf
solaris.smf.value.ipsec
.fi
.in -2
.sp

.sp
.LP
PKCS#11 token objects can be unlocked or locked by using
.B ikeadm
token
login and
.B ikeadm
token logout, respectively. Availability of private
keying material stored on these PKCS#11 token objects can be observed with:
.BR "ikeadm dump certcache" .
The following authorizations allow users to log
into and out of PKCS#11 token objects:
.sp
.in +2
.nf
solaris.network.ipsec.ike.token.login
solaris.network.ipsec.ike.token.logout
.fi
.in -2
.sp

.sp
.LP
See
.BR auths (1),
.BR ikeadm (1M),
.BR user_attr (4),
.BR rbac (5).
.sp
.LP
The service needs to be refreshed using \fBsvcadm\fR(1M) before a new property
value is effective. General, non-modifiable properties can be viewed with the
.BR svcprop (1)
command.
.sp
.in +2
.nf
# \fBsvccfg -s ipsec/ike setprop config/config_file = \e
/new/config_file\fR
# \fBsvcadm refresh ike\fR
.fi
.in -2
.sp

.sp
.LP
Administrative actions on this service, such as enabling, disabling,
refreshing, and requesting restart can be performed using
.BR svcadm (1M).
A
user who has been assigned the authorization shown below can perform these
actions:
.sp
.in +2
.nf
solaris.smf.manage.ipsec
.fi
.in -2
.sp

.sp
.LP
The service's status can be queried using the
.BR svcs (1)
command.
.sp
.LP
The
.B in.iked
daemon is designed to be run under
.BR smf (5)
management.
While the
.B in.iked
command can be run from the command line, this is
discouraged. If the
.B in.iked
command is to be run from the command line,
the
.BR "ike smf" (5)
service should be disabled first. See
.BR svcadm (1M).
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -c
.ad
.RS 15n
.rt
Check the syntax of a configuration file.
.RE

.sp
.ne 2
.mk
.na
.B -d
.ad
.RS 15n
.rt
Use debug mode. The process stays attached to the controlling terminal and
produces large amounts of debugging output. This option is deprecated. See
"Service Management Facility" for more details.
.RE

.sp
.ne 2
.mk
.na
.B -f
.I filename
.ad
.RS 15n
.rt
Use
.I filename
instead of
.BR /etc/inet/ike/config .
See
.BR ike.config (4)
for the format of this file. This option is deprecated. See
"Service Management Facility" for more details.
.RE

.sp
.ne 2
.mk
.na
.B -p
.I level
.ad
.RS 15n
.rt
Specify privilege level
.RI ( level ).
This option sets how much
.BR ikeadm (1M)
invocations can change or observe about the running
.BR in.iked .
.sp
Valid
.I levels
are:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 5n
.rt
Base level
.RE

.sp
.ne 2
.mk
.na
.B 1
.ad
.RS 5n
.rt
Access to preshared key info
.RE

.sp
.ne 2
.mk
.na
.B 2
.ad
.RS 5n
.rt
Access to keying material
.RE

If
.B -p
is not specified,
.I level
defaults to
.BR 0 .
.sp
This option is deprecated. See "Service Management Facility" for more
details.
.RE

.SH SECURITY
.sp
.LP
This program has sensitive private keying information in its image. Care
should be taken with any core dumps or system dumps of a running
.BR in.iked
daemon, as these files contain sensitive keying information. Use the
.BR coreadm (1M)
command to limit any corefiles produced by
.BR in.iked .
.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/inet/ike/config
.ad
.sp .6
.RS 4n
Default configuration file.
.RE

.sp
.ne 2
.mk
.na
.B /etc/inet/secret/ike.privatekeys/*
.ad
.sp .6
.RS 4n
Private keys. A private key
.B must
have a matching public-key certificate
with the same filename in
.BR /etc/inet/ike/publickeys/ .
.RE

.sp
.ne 2
.mk
.na
.B /etc/inet/ike/publickeys/*
.ad
.sp .6
.RS 4n
Public-key certificates. The names are only important with regard to matching
private key names.
.RE

.sp
.ne 2
.mk
.na
.B /etc/inet/ike/crls/*
.ad
.sp .6
.RS 4n
Public key certificate revocation lists.
.RE

.sp
.ne 2
.mk
.na
.B /etc/inet/secret/ike.preshared
.ad
.sp .6
.RS 4n
.B IKE
pre-shared secrets for Phase I authentication.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.sp
.LP
.BR svcs (1),
.BR coreadm (1M),
.BR ikeadm (1M),
.BR ikecert (1M),
.BR svccfg (1M),
.BR svcadm (1M),
.BR ike.config (4),
.BR attributes (5),
.BR smf (5),
.BR ipsecesp (7P),
.BR pf_key (7P)
.sp
.LP
Harkins, Dan and Carrel, Dave.
.IR "RFC 2409, Internet Key Exchange (IKE)" .
Network Working Group. November 1998.
.sp
.LP
Maughan, Douglas, Schertler, M., Schneider, M., Turner, J. \fIRFC 2408,
Internet Security Association and Key Management Protocol (ISAKMP)\fR. Network
Working Group. November 1998.
.sp
.LP
Piper, Derrell, \fIRFC 2407, The Internet IP Security Domain of Interpretation
for ISAKMP\fR. Network Working Group. November 1998.
