usr/src/man/man1m/in.mpathd.1m
'\" te
.\" Copyright (C) 2009, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH in.mpathd 1M "13 May 2009" "SunOS 5.11" "System Administration Commands"
.SH NAME
in.mpathd \- IP multipathing daemon
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/inet/in.mpathd\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B in.mpathd
daemon performs failure and repair detection for IP
interfaces that have been placed into an IPMP group (or optionally, for all
IP interfaces on the system). It also controls which IP interfaces in an IPMP
group are "active" (being used by the system to send or receive IP data
traffic) in a manner that is consistent with the administrator's configured
policy.
.sp
.LP
The
.B in.mpathd
daemon can detect IP interface failure and repair
through two methods: by monitoring the
.B IFF_RUNNING
flag for each IP
interface (link-based failure detection), and by sending and receiving ICMP
probes on each IP interface (probe-based failure detection). Link-based
failure detection is instantaneous and is always enabled (provided the
network driver supports the feature); probe-based failure detection must be
enabled through the configuration of one or more test addresses (described
below), but tests the entire IP interface send and receive path. The
.BR ipmpstat (1M)
utility can be used to check which failure detection
methods are enabled.
.sp
.LP
If only link-based failure detection is enabled, then the health of the
interface is determined solely from the state of the
.B IFF_RUNNING
flag.
Otherwise, the interface is considered failed if either of the two methods
indicate a failure, and repaired once both methods indicate the failure has
been corrected. Not all interfaces in a group need to be configured with the
same failure detection methods.
.sp
.LP
As mentioned above, to perform probe-based failure detection \fBin.mpathd\fR
requires a test address on each IP interface for the purpose of sending and
receiving probes. Each address must be marked
.B NOFAILOVER
(see
.BR ifconfig (1M))
and
.B in.mpathd
will be limited to probing targets on
the same subnet. Each address may be configured statically or acquired by
means of DHCP. To find targets,
.B in.mpathd
first consults the routing
table for routes on the same subnet, and uses the specified next-hop. If no
routes match, it sends all-hosts ICMP probes and selects a subset of the
systems that respond. Thus, for probe-based failure detection to operate,
there must be at least one neighbor on each subnet that responds to ICMP echo
request probes. The
.BR ipmpstat (1M)
utility can be used to display both
the current probe target information and the status of sent probes.
.sp
.LP
Both IPv4 and IPv6 are supported. If an IP interface is plumbed for IPv4 and
an IPv4 test address is configured then
.B in.mpathd
will start sending
ICMPv4 probes over that IP interface. Similarly, if an IP interface is
plumbed for IPv6 and an IPv6 test address is configured, then \fBin.mpathd\fR
will start sending ICMPv6 probes over that IP interface. However, note that
.B in.mpathd
will ignore IPv6 test addresses that are not link-local. If
both IPv4 and IPv6 are plumbed, it is sufficient to configure only one of the
two, that is, either an IPv4 test address or an IPv6 test address. If both
IPv4 and IPv6 test addresses are configured,
.B in.mpathd
probes using
both ICMPv4 and ICMPv6.
.sp
.LP
As mentioned above,
.B in.mpathd
also controls which IP interfaces in an
IPMP group are "active" (used by the system to send and receive IP data
traffic). Specifically,
.B in.mpathd
tracks the administrative
configuration of each IPMP group and attempts to keep the number of active IP
interfaces in each group consistent with that configuration. Therefore, if an
active IP interface fails,
.B in.mpathd
will activate an
.BR INACTIVE
interface in the group, provided one exists (it will prefer \fBINACTIVE\fR
interfaces that are also marked
.BR STANDBY ).
Likewise, if an IP interface
repairs and the resulting repair leaves the IPMP group with more active
interfaces than the administrative configuration specifies, \fBin.mpathd\fR
will deactivate one of the interfaces (preferably one marked
.BR STANDBY ),
except when the
.B FAILBACK
variable is used, as described below. Similar
adjustments will be made by
.B in.mpathd
when offlining IP interfaces (for
instance, in response to \fBif_mpadm\fR(1M)).
.sp
.LP
The
.B in.mpathd
daemon accesses three variable values in
.BR /etc/default/mpathd :
.BR FAILURE_DETECTION_TIME ,
.B FAILBACK
and
.BR TRACK_INTERFACES_ONLY_WITH_GROUPS .
.sp
.LP
The
.B FAILURE_DETECTION_TIME
variable specifies the probe-based failure
detection time. The shorter the failure detection time, the more probe
traffic. The default value of
.B FAILURE_DETECTION_TIME
is 10 seconds.
This means that IP interface failure will be detected by
.BR in.mpathd
within 10 seconds. The IP interface repair detection time is always twice the
value of
.BR FAILURE_DETECTION_TIME .
Note that failures and repairs
detected by link-based failure detection are acted on immediately, though
.B in.mpathd
may ignore link state changes if it suspects that the link
state is flapping due to defective hardware; see
.BR DIAGNOSTICS .
.sp
.LP
By default,
.B in.mpathd
limits failure and repair detection to IP
interfaces that are configured as part of a named IPMP group. Setting
.B TRACK_INTERFACES_ONLY_WITH_GROUPS
to
.B no
enables failure and
repair detection on all IP interfaces, even if they are not part of a named
IPMP group. IP interfaces that are tracked but not part of a named IPMP group
are considered to be part of the "anonymous" IPMP group. In addition to
having no name, this IPMP group is special in that its IP interfaces are not
equivalent and thus cannot take over for one another in the event of an IP
interface failure. That is, the anonymous IPMP group can only be used for
failure and repair detection, and provides no high-availability or
load-spreading.
.sp
.LP
As described above, when
.B in.mpathd
detects that an IP interface has
repaired, it activates it so that it will again be used to send and receive
IP data traffic. However, if
.B FAILBACK
is set to
.BR no ,
then the IP
interface will only be activated if no other active IP interfaces in the
group remain. However, the interface may subsequently be activated if another
IP interface in the group fails.
.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/default/mpathd
.ad
.RS 23n
.rt
Contains default values used by the
.B in.mpathd
daemon.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsr
.TE

.SH SEE ALSO
.sp
.LP
.BR if_mpadm (1M),
.BR ifconfig (1M),
.BR ipmpstat (1M),
.BR attributes (5),
.BR icmp (7P),
.BR icmp6 (7P),
.sp
.LP
.I System Administration Guide: IP Services
.SH DIAGNOSTICS
.sp
.LP
IP interface
.I interface_name
has a hardware address which is not unique
in group
.IR group_name ;
offlining
.RS +4
.B Description:
.sp
.LP
For probe-based failure detection, load-spreading, and other code IPMP
features to work properly, each IP interface in an IPMP group must have a
unique hardware address. If this requirement is not met,
.B in.mpathd
will
automatically offline all but one of the IP interfaces with duplicate
hardware addresses.
.RE

.sp
.LP
IP interface
.I interface_name
now has a unique hardware address in group
.IR group_name ;
onlining
.RS +4
.B Description:
.sp
.LP
The previously-detected duplicate hardware address is now unique, and
therefore
.B in.mpathd
has brought
.I interface_name
back online.
.RE

.sp
.LP
Test address
.I address
is not unique in group; disabling probe-based
failure detection on \fIinterface_name\fR
.RS +4
.B Description:
.sp
.LP
For
.B in.mpathd
to perform probe-based failure detection, each test
address in the group must be unique.
.RE

.sp
.LP
No test address configured on interface
.I interface_name
disabling
probe-based failure detection on it
.RS +4
.B Description:
.sp
.LP
For
.B in.mpathd
to perform probe-based failure detection on an IP
interface, it must be configured with a test address: IPv4, IPv6, or both.
.RE

.sp
.LP
IP \fIinterface_name\fR in group \fIgroup_name\fR is not plumbed for
IPv[4|6], affecting IPv[4|6] connectivity
.RS +4
.B Description:
.sp
.LP
All IP interfaces in a multipathing group must be homogeneously plumbed. For
example, if one IP interface is plumbed for IPv4, then all IP interfaces in
the group must be plumbed for IPv4, or IPv4 packets will not be able to be
reliably sent and received. The STREAMS modules pushed on all IP interfaces
must also be identical.
.RE

.sp
.LP
The link has come up on
.I interface_name
more than 2 times in the last
minute; disabling repair until it stabilizes.
.RS +4
.B Description:
.sp
.LP
To limit the impact of interfaces with intermittent hardware (such as a bad
cable),
.B in.mpathd
will not consider an IP interface with a frequently
changing link state as repaired until the link state stabilizes.
.RE

.sp
.LP
Invalid failure detection time of
.IR time ,
assuming default 10000 ms
.RS +4
.B Description:
.sp
.LP
An invalid value was encountered for
.B FAILURE_DETECTION_TIME
in the
.B /etc/default/mpathd
file.
.RE

.sp
.LP
Too small failure detection time of
.IR time ,
assuming minimum of 100 ms
.RS +4
.B Description:
.sp
.LP
The minimum value that can be specified for
.B FAILURE_DETECTION_TIME
is
currently 100 milliseconds.
.RE

.sp
.LP
Invalid value for FAILBACK
.IR value
.RS +4
.B Description:
.sp
.LP
Valid values for the boolean variable
.B FAILBACK
are
.B yes
or
.BR no .
.RE

.sp
.LP
Invalid value for TRACK_INTERFACES_ONLY_WITH_GROUPS
.IR value
.RS +4
.B Description:
.sp
.LP
Valid values for the boolean variable
.B TRACK_INTERFACES_ONLY_WITH_GROUPS
are
.B yes
or
.BR no .
.RE

.sp
.LP
Cannot meet requested failure detection time of
.IR time " ms on (inet[6]"
.IR interface_name )
new failure detection time for group
.IR group_name
is
.I time
ms
.RS +4
.B Description:
.sp
.LP
The round trip time for
.B ICMP
probes is higher than necessary to
maintain the current failure detection time. The network is probably
congested or the probe targets are loaded.
.B in.mpathd
automatically
increases the failure detection time to whatever it can achieve under these
conditions.
.RE

.sp
.LP
Improved failure detection time
.IR time " ms on (inet[6]"
.IR interface_name )
for group
.IR group_name
.RS +4
.B Description:
.sp
.LP
The round trip time for
.B ICMP
probes has now decreased and
.B in.mpathd
has lowered the failure detection time correspondingly.
.RE

.sp
.LP
IP interface failure detected on \fIinterface_name\fR
.RS +4
.B Description:
.sp
.LP
.B in.mpathd
has detected a failure on
.IR interface_name ,
and has set
the
.B IFF_FAILED
flag on
.IR interface_name ,
ensuring that it will not
be used for IP data traffic.
.RE

.sp
.LP
IP interface repair detected on \fIinterface_name\fR
.RS +4
.B Description:
.sp
.LP
.B in.mpathd
has detected a repair on
.IR interface_name ,
and has
cleared the
.B IFF_FAILED
flag. Depending on the administrative
configuration, the
.I interface_name
may again be used for IP data
traffic.
.RE

.sp
.LP
All IP interfaces in group
.I group
are now unusable
.RS +4
.B Description:
.sp
.LP
.B in.mpathd
has determined that none of the IP interfaces in
.IR group
can be used for IP data traffic, breaking network connectivity for the
group.
.RE

.sp
.LP
At least 1 IP interface (\fIinterface_name\fR) in group
.I group
is now
usable
.RS +4
.B Description:
.sp
.LP
.B in.mpathd
has determined that at least one of the IP interfaces in
.I group
can again be used for IP data traffic, restoring network
connectivity for the group.
.RE

.sp
.LP
The link has gone down on \fIinterface_name\fR
.RS +4
.B Description:
.sp
.LP
.B in.mpathd
has detected that the
.B IFF_RUNNING
flag for
.I interface_name
has been cleared, indicating that the link has gone
down.
.RE

.sp
.LP
The link has come up on \fIinterface_name\fR
.RS +4
.B Description:
.sp
.LP
.B in.mpathd
has detected that the
.B IFF_RUNNING
flag for
.I interface_name
has been set, indicating that the link has come up.
.RE

