usr/src/man/man1m/in.rdisc.1m
'\" te
.\" Copyright (c) 2004 Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright 1989 AT&T
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH in.rdisc 1M "9 Nov 2006" "SunOS 5.11" "System Administration Commands"
.SH NAME
in.rdisc, rdisc \- network router discovery daemon
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/in.rdisc\fR  [\fB-a\fR] [\fB-f\fR] [\fB-s\fR] [\fIsend-address\fR] [\fIreceive-address\fR]
.fi

.LP
.nf
\fB/usr/sbin/in.rdisc\fR  \fB-r\fR [\fB-p\fR \fIpreference\fR] [\fB-T\fR \fIinterval\fR]
 [\fIsend-address\fR] [\fIreceive-address\fR]
.fi

.SH DESCRIPTION
.sp
.LP
\fBin.rdisc\fR remains part of the software distribution of the Solaris
Operating Environment. It is, however, not used by default.
.BR in.routed (1M)
includes the functionality provided by
.BR in.rdisc .
See
.BR routeadm (1M)
for details of how to specify the IPV4 routing daemon.
.sp
.LP
\fBin.rdisc\fR implements the \fBICMP\fR router discovery protocol. The first
form of the command is used on hosts and the second form is used on routers.
.sp
.LP
\fBin.rdisc\fR can be invoked in either the first form (host mode) or second
form (router mode).
.sp
.LP
On a host,
.B in.rdisc
populates the network routing tables with default
routes. On a router, advertises the router to all the hosts.
.sp
.LP
\fBin.rdisc\fR is managed by the service management facility (SMF), by means
of the service identifier:
.sp
.in +2
.nf
svc:/network/routing/rdisc:default
.fi
.in -2
.sp

.SS "Host (First Form)"
.sp
.LP
On a host,
.B in.rdisc
listens on the
.B ALL_HOSTS
(224.0.0.1)
multicast address for
.B ROUTER_ADVERTISE
messages from routers. The
received messages are handled by first ignoring those listed router addresses
with which the host does not share a network. Among the remaining addresses,
the ones with the highest preference are selected as default routers and a
default route is entered in the kernel routing table for each one of them.
.sp
.LP
Optionally,
.B in.rdisc
can avoid waiting for routers to announce
themselves by sending out a few
.B ROUTER_SOLICITATION
messages to the
\fBALL_ROUTERS\fR (224.0.0.2) multicast address when it is started.
.sp
.LP
A timer is associated with each router address. The address will no longer be
considered for inclusion in the routing tables if the timer expires before a
new
.I advertise
message is received from the router. The address will also
be excluded from consideration if the host receives an
.I advertise
message
with the preference being maximally negative or with a lifetime of zero.
.SS "Router (Second Form)"
.sp
.LP
When
.B in.rdisc
.RB "is started on a router, it uses the" " SIOCGIFCONF"
.BR ioctl (2)
to find the interfaces configured into the system and it starts
listening on the
.B ALL_ROUTERS
multicast address on all the interfaces
that support multicast. It sends out
.I advertise
messages to the
\fBALL_HOSTS\fR multicast address advertising all its \fBIP\fR addresses. A
few initial
.I advertise
messages are sent out during the first 30 seconds
and after that it will transmit
.I advertise
messages approximately every
600 seconds.
.sp
.LP
When
.B in.rdisc
receives a
.I solicitation
message, it sends an
\fIadvertise\fR message to the host that sent the \fIsolicitation\fR
message.
.sp
.LP
When
.B in.rdisc
is terminated by a signal, it sends out an
\fIadvertise\fR message with the preference being maximally negative.
.SH OPTIONS
.sp
.LP
Supported options and equivalent SMF service properties are listed below. SMF
service properties are set using a command of the form:
.sp
.in +2
.nf
# \fBrouteadm -m rdisc:default \fIkey\fR=\fIvalue\fR
.fi
.in -2
.sp

.sp
.ne 2
.mk
.na
.B -a
.ad
.RS 17n
.rt
Accept all routers independent of the preference they have in their
\fIadvertise\fR messages. Normally, \fBin.rdisc\fR only accepts (and enters in
the kernel routing tables) the router or routers with the highest preference.
Use of this option is equivalent to setting the
.B accept_all
property to
true.
.RE

.sp
.ne 2
.mk
.na
\fB-f\fR
.ad
.RS 17n
.rt
Run
.B in.rdisc
forever even if no routers are found. Normally,
\fBin.rdisc\fR gives up if it has not received any \fIadvertise\fR message
after soliciting three times, in which case it exits with a non-zero exit
code. If \fB-f\fR is not specified in the first form then
.B -s
must be
specified. For SMF execution, this option is required.
.RE

.sp
.ne 2
.mk
.na
.B -r
.ad
.RS 17n
.rt
Act as a router, rather than a host. Use of this option is equivalent to
setting the
.B act_as_router
property to true.
.RE

.sp
.ne 2
.mk
.na
.B -s
.ad
.RS 17n
.rt
Send three
.I solicitation
messages initially to quickly discover the
routers when the system is booted. When
.B -s
is specified, \fBin.rdisc\fR
exits with a non-zero exit code if it can not find any routers. This can be
overridden with the \fB-f\fR option. This option is not compatible with SMF
execution and is not supported for the
.B rdisc
service.
.RE

.sp
.ne 2
.mk
.na
\fB-p\fR \fIpreference\fR
.ad
.RS 17n
.rt
Set the preference transmitted in the
.I solicitation
messages. The
default is zero. Use of this option is equivalent to setting the
\fBpreference\fR property.
.RE

.sp
.ne 2
.mk
.na
\fB-T\fR \fIinterval\fR
.ad
.RS 17n
.rt
Set the interval between transmitting the
.I advertise
messages. The
default time is 600 seconds. Use of this option is equivalent to setting the
\fBtransmit_interval\fR property.
.RE

.sp
.LP
The
.B send-address
and
.B receive-address
daemon options  can be set
by means of the
.B send_address
and
.B receive_address
properties.
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWroute
.TE

.SH SEE ALSO
.sp
.LP
.BR in.routed (1M),
.BR routeadm (1M),
.BR svcadm (1M),
.BR ioctl (2),
.BR gateways (4),
.BR attributes (5),
\fBsmf\fR(5), \fBicmp\fR(7P),
.BR inet (7P)
.sp
.LP
Deering, S.E., editor,
.IR "ICMP Router Discovery Messages" ,
\fBRFC\fR 1256,
Network Information Center, SRI International, Menlo Park, California,
September 1991.
