usr/src/man/man1m/in.rwhod.1m
'\" te
.\" Copyright 1989 AT&T
.\" Copyright (C) 2001, Sun Microsystems, Inc. All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH in.rwhod 1M "8 Dec 2001" "SunOS 5.11" "System Administration Commands"
.SH NAME
in.rwhod, rwhod \- system status server
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/in.rwhod\fR [\fB-m\fR [\fIttl\fR]]
.fi

.SH DESCRIPTION
.sp
.LP
\fBin.rwhod\fR is the server which maintains the database used by the
.BR rwho (1)
and
.BR ruptime (1)
programs.  Its operation is predicated on
the ability to broadcast or multicast messages on a network.
.sp
.LP
\fBin.rwhod\fR operates as both a producer and consumer of status information.
As a producer of information it periodically queries the state of the system
and constructs status messages which are broadcast or multicast on a network.
As a consumer of information, it listens for other
.B in.rwhod
servers'
status messages, validating them, then recording them in a collection of files
located in the directory
.BR /var/spool/rwho .
.sp
.LP
The
.B rwho
server transmits and receives messages at the port indicated in
the
.B rwho
service specification, see
.BR services (4).
The messages sent
and received are defined in
.B /usr/include/protocols/rwhod.h
and are of the
form:
.sp
.in +2
.nf
struct  outmp {
        char     out_line[8];   /* tty name */
        char     out_name[8];   /* user id */
        long     out_time;      /* time on */
};
struct  whod {
        char     wd_vers;
        char     wd_type;
        char     wd_fill[2];
        int      wd_sendtime;
        int      wd_recvtime;
        char     wd_hostname[32];
        int      wd_loadav[3];
        int      wd_boottime;
        struct   whoent {
                 struct   outmp we_utmp;
                 int      we_idle;
     } wd_we[1024 / sizeof (struct whoent)];
 };
.fi
.in -2
.sp

.sp
.LP
All fields are converted to network byte order prior to transmission.  The
load averages are as calculated by the
.BR w (1)
program, and represent load
averages over the 1, 5, and 15 minute intervals prior to a server's
transmission. The host name included is that returned by the
.BR uname (2)
system call. The array at the end of the message contains information about the
users who are logged in to the sending machine.  This information includes the
contents of the
.BR utmpx (4)
entry for each non-idle terminal line and a
value indicating the time since a character was last received on the terminal
line.
.sp
.LP
Messages received by the
.B rwho
server are discarded unless they
originated at a
.B rwho
server's port.  In addition, if the host's name, as
specified in the message, contains any unprintable
.B ASCII
characters, the
message is discarded. Valid messages received by
.B in.rwhod
are placed in
files named
.B whod.hostname
in the directory
.BR /var/spool/rwho .
These files contain only the most recent message, in the format described
above.
.sp
.LP
Status messages are generated approximately once every 3 minutes.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB-m\fR [\fI ttl\fR ]\fR
.ad
.RS 14n
.rt
Use the rwho
.B IP
multicast address (224.0.1.3) when transmitting.
Receive announcements both on this multicast address and on the
.BR IP
broadcast address. If
.I ttl
is not specified
.B in.rwhod
multicasts on
all interfaces but with the
.B IP
TimeToLive set to 1 (that is, packets are
not forwarded by multicast routers.) If
.I ttl
is specified
.BR in.rwhod
only transmits packets on one interface and setting the
.B IP
TimeToLive to
the specified
.IR ttl .
.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B /var/spool/rwho/whod.*
.ad
.RS 26n
.rt
information about other machines
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWrcmds
.TE

.SH SEE ALSO
.sp
.LP
.BR ruptime (1),
.BR rwho (1),
.BR w (1),
.BR uname (2),
.BR services (4),
.BR utmpx (4),
.BR attributes (5)
.SH WARNINGS
.sp
.LP
This service can cause network performance problems when used by several hosts
on the network. It is not run at most sites by default. If used, include the
\fB-m\fR multicast option.
.SH NOTES
.sp
.LP
This service takes up progressively more network bandwidth as the number of
hosts on the local net increases.  For large networks, the cost becomes
prohibitive.
.sp
.LP
\fBin.rwhod\fR should relay status information between networks. People often
interpret the server dying as a machine going down.
