usr/src/man/man1m/in.rshd.1m
'\" te
.\" Copyright (C) 2005, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" Copyright 1989 AT&T
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH in.rshd 1M "10 Nov 2005" "SunOS 5.11" "System Administration Commands"
.SH NAME
in.rshd, rshd \- remote shell server
.SH SYNOPSIS
.LP
.nf
\fBin.rshd\fR [\fB-k5eciU\fR] [\fB-s\fR \fItos\fR] [\fB-S\fR \fIkeytab\fR] [\fB-M\fR \fIrealm\fR]
     [\fB-L\fR \fIenv_var\fR] \fIhost.port\fR
.fi

.SH DESCRIPTION
.sp
.LP
.B in.rshd
is the server for the
.BR rsh (1)
program. The server
provides remote execution facilities with authentication based on Kerberos
V5 or privileged port numbers.
.sp
.LP
.B in.rshd
is invoked by
.BR inetd "(1M) each time a shell service is"
requested.
.sp
.LP
When Kerberos V5 authentication is required (this can be set with
Kerberos-specific options listed below), the following protocol is
initiated:
.RS +4
.TP
1.
Check Kerberos V5 authentication.
.RE
.RS +4
.TP
2.
Check authorization according to rules in
.BR krb5_auth_rules (5).
.RE
.RS +4
.TP
3.
A null byte is returned on the initial socket and the command line is
passed to the normal login shell of the user. (The
.B PATH
variable is
set to
.BR /usr/bin .)
The shell inherits the network connections
established by
.BR in.rshd .
.RE
.sp
.LP
In order for Kerberos authentication to work, a \fBhost/\fI<FQDN>\fR
Kerberos principal must exist for each Fully Qualified Domain Name
associated with the
.B in.rshd
server. Each of these
\fBhost/\fI<FQDN>\fR principals must have a \fBkeytab\fR entry in the
.B /etc/krb5/krb5.keytab
file on the
.B in.rshd
server. An example
principal might be:
.sp
.LP
.B host/bigmachine.eng.example.com
.sp
.LP
See \fBkadmin\fR(1M) or \fBgkadmin\fR(1M) for instructions on adding a
principal to a
.B krb5.keytab
file. See\fR for a discussion of
Kerberos authentication.
.sp
.LP
If Kerberos V5 authentication is not enabled, then
.B in.rshd
executes
the following protocol:
.RS +4
.TP
1.
The server checks the client's source port. If the port is not in the range
512-1023, the server aborts the connection. The client's host address (in
hex) and port number (in decimal) are the arguments passed to
.BR in.rshd .
.RE
.RS +4
.TP
2.
The server reads characters from the socket up to a null (\fB\0\fR) byte.
The resultant string is interpreted as an
.B ASCII
number, base 10.
.RE
.RS +4
.TP
3.
If the number received in step 2 is non-zero, it is interpreted as the port
number of a secondary stream to be used for the
.BR stderr .
A second
connection is then created to the specified port on the client's machine.
The source port of this second connection is also in the range 512-1023.
.RE
.RS +4
.TP
4.
A null-terminated user name of at most 16 characters is retrieved on the
initial socket. This user name is interpreted as the user identity on the
\fIclient\fR's machine.
.RE
.RS +4
.TP
5.
A null terminated user name of at most 16 characters is retrieved on the
initial socket. This user name is interpreted as a user identity to use on
the
.IR server "'s machine."
.RE
.RS +4
.TP
6.
A null terminated command to be passed to a shell is retrieved on the
initial socket. The length of the command is limited by the upper bound on
the size of the system's argument list.
.RE
.RS +4
.TP
7.
.B in.rshd
then validates the user according to the following steps. The
remote user name is looked up in the password file and a
.B chdir
is
performed to the user's home directory. If the lookup fails, the connection
is terminated. If the
.B chdir
fails, it does a
.B chdir
to
.BR /
(root). If the user is not the superuser, (user
.B ID
0), and if the
pam_rhosts_auth
.B PAM
module is configured for authentication, the file
.B /etc/hosts.equiv
is consulted for a list of hosts considered
"equivalent". If the client's host name is present in this file, the
authentication is considered successful. See the SECURITY section below for
a discussion of
.B PAM
authentication.
.sp
If the lookup fails, or the user is the superuser, then the file
\fB\&.rhosts\fR in the home directory of the remote user is checked for the
machine name and identity of the user on the client's machine. If this
lookup fails, the connection is terminated
.RE
.RS +4
.TP
8.
A null byte is returned on the initial connection and the command line is
passed to the normal login shell of the user. The
.B PATH
variable is set
to
.BR /usr/bin .
The shell inherits the network connections established by
.BR in.rshd .
.RE
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -5
.ad
.RS 14n
.rt
Same as
.BR -k ,
for backwards compatibility
.RE

.sp
.ne 2
.mk
.na
.B -c
.ad
.RS 14n
.rt
Requires Kerberos V5 clients to present a cryptographic checksum of initial
connection information like the name of the user that the client is trying
to access in the initial authenticator. This checksum provides additionl
security by preventing an attacker from changing the initial connection
information. This option is mutually exclusive with the
.B -i
option.
.RE

.sp
.ne 2
.mk
.na
.B -e
.ad
.RS 14n
.rt
Requires the client to encrypt the connection.
.RE

.sp
.ne 2
.mk
.na
.B -i
.ad
.RS 14n
.rt
Ignores authenticator checksums if provided. This option ignores
authenticator checksums presented by current Kerberos clients to protect
initial connection information. Option
.B -i
is the opposite of option
.BR -c .
.RE

.sp
.ne 2
.mk
.na
.B -k
.ad
.RS 14n
.rt
Allows Kerberos V5 authentication with the \fB\&.k5login\fR access control
file to be trusted. If this authentication system is used by the client and
the authorization check is passed, then the user is allowed to log in.
.RE

.sp
.ne 2
.mk
.na
.B -L
.I env_var
.ad
.RS 14n
.rt
List of environment variables that need to be saved and passed along.
.RE

.sp
.ne 2
.mk
.na
.B -M
.I realm
.ad
.RS 14n
.rt
Uses the indicated Kerberos V5 realm. By default, the daemon will determine
its realm from the settings in the
.BR krb5.conf (4)
file.
.RE

.sp
.ne 2
.mk
.na
.B -s
.I tos
.ad
.RS 14n
.rt
Sets the
.B "IP TOS"
option.
.RE

.sp
.ne 2
.mk
.na
.B -S
.I keytab
.ad
.RS 14n
.rt
Sets the
.B KRB5
keytab file to use. The\fB/etc/krb5/krb5.keytab\fR file
is used by default.
.RE

.sp
.ne 2
.mk
.na
.B -U
.ad
.RS 14n
.rt
Refuses connections that cannot be mapped to a name through the
.BR getnameinfo (3SOCKET)
function.
.RE

.SH USAGE
.sp
.LP
.B rshd
and
.B in.rshd
are IPv6-enabled. See
.BR ip6 (7P).
.B IPv6
is not currently supported with Kerberos V5 authentication.
.sp
.LP
The Kerberized
.B rshd
service runs on port 544 (kshell). The
corresponding FMRI entry is: :
.sp
.in +2
.nf
svc:/network/shell:kshell (rshd with kerberos (ipv4 only))
.fi
.in -2
.sp

.SH SECURITY
.sp
.LP
.B in.rshd
uses \fBpam\fR(3PAM) for authentication, account management,
and session management. The
.B PAM
configuration policy, listed through
.BR /etc/pam.conf ,
specifies the modules to be used for
.BR in.rshd .
Here is a partial
.B pam.conf
file with entries for the
.B rsh
command
using rhosts authentication,
.B UNIX
account management, and session
management module.
.sp

.sp
.TS
tab();
lw(.79i) lw(.79i) lw(.79i) lw(3.14i)
lw(.79i) lw(.79i) lw(.79i) lw(3.14i)
.
rshauthrequiredpam_rhosts_auth.so.1

rshaccountrequiredpam_unix_roles.so.1
rshsessionrequiredpam_unix_projects.so.1
rshsessionrequiredpam_unix_account.so.1

rshsessionrequiredpam_unix_session.so.1
.TE

.sp
.LP
If there are no entries for the
.B rsh
service, then the entries for the
"other" service are used. To maintain the authentication requirement for
.BR in.rshd ,
the rsh entry must always be configured with the
.B pam_rhosts_auth.so.1
module.
.sp
.LP
.B in.rshd
can authenticate using Kerberos V5 authentication or
.BR pam (3PAM).
For Kerberized
.B rsh
.RB "service, the appropriate" " PAM"
service name is
.BR krsh .
.SH FILES
.sp
.LP
.B /etc/hosts.equiv
.sp
.ne 2
.mk
.na
.B $HOME/.k5login
.ad
.RS 23n
.rt
File containing Kerberos principals that are allowed access.
.RE

.sp
.ne 2
.mk
.na
.B /etc/krb5/krb5.conf
.ad
.RS 23n
.rt
Kerberos configuration file.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWrcmds
.TE

.SH SEE ALSO
.sp
.LP
.BR rsh (1),
.BR svcs (1),
.BR gkadmin (1M),
.BR inetadm (1M),
.BR inetd (1M),
.BR kadmin (1M),
.BR svcadm (1M),
.BR pam (3PAM),
.BR getnameinfo (3SOCKET),
.BR hosts (4),
.BR krb5.conf (4),
.BR pam.conf (4),
.BR " attributes" (5),
.BR environ (5),
.BR krb5_auth_rules (5),
.BR pam_authtok_check (5),
.BR pam_authtok_get (5),
.BR pam_authtok_store (5),
.BR pam_dhkeys (5),
.BR pam_passwd_auth (5),
.BR pam_rhosts_auth (5),
.BR pam_unix_account (5),
.BR pam_unix_auth (5),
.BR pam_unix_session (5),
.BR smf (5),
.BR ip6 (7P)
.sp
.LP
\fR
.SH DIAGNOSTICS
.sp
.LP
The following diagnostic messages are returned on the connection associated
with
.BR stderr ,
after which any network connections are closed. An error
is indicated by a leading byte with a value of 1 in step 8 above (\fB0\fR is
returned above upon successful completion of all the steps prior to the
command execution).
.sp
.ne 2
.mk
.na
.B locuser too long
.ad
.sp .6
.RS 4n
The name of the user on the client's machine is longer than 16
characters.
.RE

.sp
.ne 2
.mk
.na
.B remuser too long
.ad
.sp .6
.RS 4n
The name of the user on the remote machine is longer than 16 characters.
.RE

.sp
.ne 2
.mk
.na
.B command too long
.ad
.sp .6
.RS 4n
The command line passed exceeds the size of the argument list (as
configured into the system).
.RE

.sp
.ne 2
.mk
.na
.B Hostname for your address unknown.
.ad
.sp .6
.RS 4n
No entry in the host name database existed for the client's machine.
.RE

.sp
.ne 2
.mk
.na
.B Login incorrect.
.ad
.sp .6
.RS 4n
No password file entry for the user name existed.
.RE

.sp
.ne 2
.mk
.na
.B Permission denied.
.ad
.sp .6
.RS 4n
The authentication procedure described above failed.
.RE

.sp
.ne 2
.mk
.na
.B Can't make pipe.
.ad
.sp .6
.RS 4n
The pipe needed for the
.B stderr
was not created.
.RE

.sp
.ne 2
.mk
.na
.B Try again.
.ad
.sp .6
.RS 4n
A
.I fork
by the server failed.
.RE

.SH NOTES
.sp
.LP
The authentication procedure used here assumes the integrity of each client
machine and the connecting medium. This is insecure, but it is useful in an
"open" environment.
.sp
.LP
A facility to allow all data exchanges to be encrypted should be present.
.sp
.LP
The
.BR pam_unix (5)
module is no longer supported. Similar functionality
is provided by
.BR pam_authtok_check (5),
.BR pam_authtok_get (5),
.BR pam_authtok_store (5),
.BR pam_dhkeys (5),
.BR pam_passwd_auth (5),
.BR pam_unix_account (5),
.BR pam_unix_auth (5),
and
.BR pam_unix_session (5).
.sp
.LP
The
.B in.rshd
service is managed by the service management facility,
.BR smf (5),
under the service identifier:
.sp
.in +2
.nf
svc:/network/shell:default
.fi
.in -2
.sp

.sp
.LP
Administrative actions on this service, such as enabling, disabling, or
requesting restart, can be performed using
.BR svcadm (1M).
Responsibility
for initiating and restarting this service is delegated to
.BR inetd (1M).
Use \fBinetadm\fR(1M) to make configuration changes and to view
configuration information for this service. The service's status can be
queried using the
.BR svcs (1)
command.
