usr/src/man/man1m/in.ripngd.1m
'\" te
.\" Copyright (C) 2006, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH in.ripngd 1M "26 Jan 2007" "SunOS 5.11" "System Administration Commands"
.SH NAME
in.ripngd \- network routing daemon for IPv6
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/in.ripngd\fR  [\fB-s\fR] [\fB-q\fR] [\fB-t\fR] [\fB-p\fR \fIn\fR] [\fB-P\fR] [\fB-v\fR ]
 [\fIlogfile\fR]
.fi

.SH DESCRIPTION
.sp
.LP
.B in.ripngd
is the IPv6 equivalent of
.BR in.routed "(1M). It is invoked"
at boot time to manage the network routing tables. The routing daemon uses the
Routing Information Protocol for IPv6.
.sp
.LP
.B in.ripngd
is managed by the service management facility (SMF), by means
of the service identifier:
.sp
.in +2
.nf
svc:/network/routing/ripng:default
.fi
.in -2
.sp

.sp
.LP
In normal operation,
.B in.ripngd
listens on the
.BR udp "(7P) socket port"
521 for routing information packets. If the host is an internetwork router, it
periodically supplies copies of its routing tables to any directly connected
hosts and networks.
.sp
.LP
When
.B in.ripngd
is started, it uses the
.BR "SIOCGLIFCONF ioctl" (2)
to find those directly connected IPv6 interfaces configured into the system and
marked "up"; the software loopback interface is ignored. If multiple interfaces
are present, it is assumed the host will forward packets between networks.
.B in.ripngd
then multicasts a request packet on each IPv6 interface and
enters a loop, listening for request and response packets from other hosts.
.sp
.LP
When a request packet is received,
.B in.ripngd
formulates a reply based on
the information maintained in its internal tables. The response packet contains
a list of known routes. With each route is a number specifying the number of
bits in the prefix. The prefix is the number of bits in the high order part of
an address that indicate the subnet or network that the route describes. Each
route reported also has a "\fIhop count\fR" metric. A count of 16 or greater is
considered "infinity." The metric associated with each route returned provides
a metric relative to the sender.
.sp
.LP
The request packets received by
.B in.ripngd
are used to update the routing
tables if one of the following conditions is satisfied:
.RS +4
.TP
.ie t \(bu
.el o
No routing table entry exists for the destination network or host, and the
metric indicates the destination is "reachable", that is, the \fIhop count\fR
is not infinite.
.RE
.RS +4
.TP
.ie t \(bu
.el o
The source host of the packet is the same as the router in the existing
routing table entry. That is, updated information is being received from the
very internetwork router through which packets for the destination are being
routed.
.RE
.RS +4
.TP
.ie t \(bu
.el o
The existing entry in the routing table has not been updated for a period of
time, defined to be 90 seconds, and the route is at least as cost-effective as
the current route.
.RE
.RS +4
.TP
.ie t \(bu
.el o
The new route describes a shorter route to the destination than the one
currently stored in the routing tables; this is determined by comparing the
metric of the new route against the one stored in the table.
.RE
.sp
.LP
When an update is applied,
.B in.ripngd
records the change in its internal
tables and generates a response packet to all directly connected hosts and
.RB "networks. To allow possible unstable situations to settle," " in.ripngd"
waits a short period of time (no more than 30 seconds) before modifying the
kernel's routing tables.
.sp
.LP
In addition to processing incoming packets,
.B in.ripngd
also periodically
checks the routing table entries. If an entry has not been updated for 3
minutes, the entry's metric is set to infinity and marked for deletion.
Deletions are delayed an additional 60 seconds to insure the invalidation is
propagated throughout the internet.
.sp
.LP
Hosts acting as internetwork routers gratuitously supply their routing tables
every 30 seconds to all directly connected hosts and networks.
.SH OPTIONS
.sp
.LP
.B in.ripngd
supports the options listed below. Listed with the
options are the equivalent SMF property values. These are set for the
.B ripng:default
service with a command of the form:
.sp
.in +2
.nf
# \fBrouteadm -m ripng:default \fIkey\fR=\fIvalue\fR
.fi
.in -2
.sp

.sp
.ne 2
.mk
.na
.B -p
.I n
.ad
.RS 8n
.rt
Send and receive the routing packets from other routers using the
.B UDP
port number
.IR n .
Use of this option is equivalent to setting the
.B udp_port
property.
.RE

.sp
.ne 2
.mk
.na
.B -P
.ad
.RS 8n
.rt
Do not use poison reverse. Use of this option is equivalent to setting the
.B poison_reverse
property to false.
.RE

.sp
.ne 2
.mk
.na
.B -q
.ad
.RS 8n
.rt
Do not supply routing information. Use of this option is equivalent to setting
the
.B quiet_mode
property to true.
.RE

.sp
.ne 2
.mk
.na
.B -s
.ad
.RS 8n
.rt
Force
.B in.ripngd
to supply routing information whether it is acting as an
internetwork router or not. Use of this option is equivalent to setting the
.B supply_routes
property to true.
.RE

.sp
.ne 2
.mk
.na
.B -t
.ad
.RS 8n
.rt
Print all packets sent or received to standard output.
.B in.ripngd
will
not divorce itself from the controlling terminal. Accordingly, interrupts from
the keyboard will kill the process. Not supported by the
.B ripng
service.
.RE

.sp
.ne 2
.mk
.na
.B -v
.ad
.RS 8n
.rt
Print all changes made to the routing tables to standard output with a
timestamp. Use of this option is equivalent to setting the
.B verbose
property to true.
.sp
Any other argument supplied to this option is interpreted as the name of the
file in which the actions of
.BR in.ripngd ,
as specified by this option or by
.BR -t ,
should be logged instead of being sent to standard output.
.sp
The logfile can be specified for the
.B ripng
service by means of the
.B log_file
property.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWroute
.TE

.SH SEE ALSO
.sp
.LP
.BR in.routed (1M),
.BR routeadm (1M),
.BR svcadm (1M),
.BR ioctl (2),
.BR attributes (5),
.BR smf (5),
.BR udp (7P)
.sp
.LP
G. Malkin, R. Minnear,
.IR "RFC 2080, RIPng for IPv6" ,
January 1997.
.SH NOTES
.sp
.LP
The kernel's routing tables may not correspond to those of
.B in.ripngd
for
short periods of time while processes that utilize existing routes exit; the
only remedy for this is to place the routing process in the kernel.
.sp
.LP
.B in.ripngd
currently does not support all of the functionality of
.BR in.routed (1M).
Future releases may support more if appropriate.
.sp
.LP
.B in.ripngd
initially obtains a routing table by examining the interfaces
configured on a machine. It then sends a request on all directly connected
networks for more routing information.
.B in.ripngd
does not recognize or
use any routing information already established on the machine prior to
startup. With the exception of interface changes,
.B in.ripngd
does not see
any routing table changes that have been done by other programs on the machine,
for example, routes added, deleted or flushed by means of the
.BR route (1M)
command. Therefore, these types of changes should not be done while
.B in.ripngd
is running. Rather, shut down
.BR in.ripngd ,
make the changes
required, and then restart
.BR in.ripngd .
