usr/src/man/man1m/in.stdiscover.1m
'\" te
.\" Copyright (c) 2007 Sun Microsystems, Inc. All Rights Reserved.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH in.stdiscover 1M "11 Dec 2007" "SunOS 5.11" "System Administration Commands"
.SH NAME
in.stdiscover \- Service Tag Discovery Daemon
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/inet/in.stdiscover\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B in.stdiscover
daemon allows a mechanism for discovering the
location of the Service Tag Listener. By default, the \fBin.stdiscover\fR
daemon listens for discovery probes (using a minimal built-in protocol) on
\fBUDP\fR port 6481.
.sp
.LP
The daemon is under control of the service management facility,
\fBsmf\fR(5), under its \fBinetd\fR framework.  It only runs upon demand and
exits when no longer in use.
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWservicetagu
_
Interface StabilityPrivate
.TE

.SH SEE ALSO
.sp
.LP
.BR in.stlisten (1M),
.BR stclient (1M)
