usr/src/man/man1m/in.telnetd.1m
'\" te
.\" Copyright 1989 AT&T
.\" Copyright (C) 2005, Sun Microsystems, Inc. All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH in.telnetd 1M "10 Nov 2005" "SunOS 5.11" "System Administration Commands"
.SH NAME
in.telnetd, telnetd \- DARPA TELNET protocol server
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/in.telnetd\fR [\fB-a\fR \fIauthmode\fR] [\fB-EXUh\fR] [\fB-s\fR \fItos\fR]
     [\fB-S\fR \fIkeytab\fR] [\fB-M\fR \fIrealm\fR]
.fi

.SH DESCRIPTION
.sp
.LP
.B in.telnetd
is a server that supports the
.B DARPA
standard
.B TELNET
virtual terminal protocol.
.B in.telnetd
is normally invoked in
the internet server (see \fBinetd\fR(1M)), for requests to connect to the
.B TELNET
port as indicated by the
.B /etc/services
file (see
.BR services (4)).
.sp
.LP
.B in.telnetd
operates by allocating a pseudo-terminal device for a client,
then creating a login process which has the slave side of the pseudo-terminal
as its standard input, output, and error.
.B in.telnetd
manipulates the
master side of the pseudo-terminal, implementing the
.B TELNET
protocol and
passing characters between the remote client and the login process.
.sp
.LP
When a
.B TELNET
session starts up,
.B in.telnetd
sends
.BR TELNET
options to the client side indicating a willingness to do
.IR remote
.B echo
of characters, and to \fIsuppress go\fR
.IR ahead .
The
pseudo-terminal allocated to the client is configured to operate in "cooked"
mode, and with
.BR XTABS ,
.B ICRNL
and
.B ONLCR
enabled. See
.BR termio (7I).
.sp
.LP
.B in.telnetd
is willing to do:
.IR echo ,
.IR binary ,
.I suppress
.IR "go ahead" ,
and
.IR "timing mark" .
.B in.telnetd
is willing
to have the remote client do:
.IR binary ,
.IR "terminal type" ,
.IR "terminal size" ,
.IR "logout option" ,
and
.IR suppress
.IR "go ahead" .
.sp
.LP
.B in.telnetd
also allows environment variables to be passed, provided that
the client negotiates this during the initial option negotiation. The
.B DISPLAY
environment variable may be sent this way, either by the
.B TELNET
general environment passing methods, or by means of the
.B XDISPLOC TELNET
option.
.B DISPLAY
can be passed in the
environment option during the same negotiation where
.B XDISPLOC
is used.
Note that if you use both methods, use the same value for both. Otherwise, the
results may be unpredictable.
.sp
.LP
These options are specified in Internet standards
.IR "RFC 1096" ,
\fIRFC
1408\fR,
.IR "RFC 1510" ,
.IR "RFC 1571" ,
.IR "RFC 2941" ,
.IR "RFC 2942" ,
\fIRFC
2946\fR, and
.IR "RFC 1572" .
The following Informational draft is also
supported:
.IR "RFC 2952" .
.sp
.LP
The banner printed by
.B in.telnetd
is configurable. The default is (more
or less) equivalent to `\fBuname -sr\fR` and will be used if no banner is
set in
.BR /etc/default/telnetd .
To set the banner, add a line of the form
.sp
.in +2
.nf
BANNER=".\|.\|."
.fi
.in -2

.sp
.LP
to
.BR /etc/default/telnetd .
Nonempty banner strings are fed to shells for
evaluation. The default banner may be obtained by
.sp
.in +2
.nf
BANNER="\e\er\e\en\e\er\e\en`uname -s` `uname -r`\e\er\e\en\e\er\e\en"
.fi
.in -2

.sp
.LP
and no banner will be printed if
.B /etc/default/telnetd
contains
.sp
.in +2
.nf
BANNER=""
.fi
.in -2

.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -a
.I authmode
.ad
.RS 15n
.rt
This option may be used for specifying what mode should be used for
authentication. There are several valid values for
.IR authmode :
.sp
.ne 2
.mk
.na
.B valid
.ad
.RS 9n
.rt
Only allows connections when the remote user can provide valid authentication
information to identify the remote user, and is allowed access to the specified
account without providing a password.
.RE

.sp
.ne 2
.mk
.na
.B user
.ad
.RS 9n
.rt
Only allows connections when the remote user can provide valid authentication
information to identify the remote user. The
.BR login (1)
command will
provide any additional user verification needed if the remote user is not
allowed automatic access to the specified account.
.RE

.sp
.ne 2
.mk
.na
.B none
.ad
.RS 9n
.rt
This is the default state. Authentication information is not required. If no
or insufficient authentication information is provided, then the
.BR login (1)
program provides the necessary user verification.
.RE

.sp
.ne 2
.mk
.na
.B off
.ad
.RS 9n
.rt
This disables the authentication code. All user verification happens through
the
.BR login (1)
program.
.RE

.RE

.sp
.ne 2
.mk
.na
.B -E
.ad
.RS 15n
.rt
Disables encryption support negotiation.
.RE

.sp
.ne 2
.mk
.na
.B -h
.ad
.RS 15n
.rt
Disables displaying host specific information before login has been
completed.
.RE

.sp
.ne 2
.mk
.na
.B -M
.I realm
.ad
.RS 15n
.rt
Uses the indicated Kerberos V5 realm. By default, the daemon will determine
its realm from the settings in the
.BR krb5.conf (4)
file.
.RE

.sp
.ne 2
.mk
.na
.B -s
.I tos
.ad
.RS 15n
.rt
Sets the
.B "IP TOS"
option.
.RE

.sp
.ne 2
.mk
.na
.B -S
.I keytab
.ad
.RS 15n
.rt
Sets the
.B KRB5
keytab file to use. The\fB/etc/krb5/krb5.keytab\fR file is
used by default.
.RE

.sp
.ne 2
.mk
.na
.B -U
.ad
.RS 15n
.rt
Refuses connections that cannot be mapped to a name through the
.BR getnameinfo (3SOCKET)
function.
.RE

.sp
.ne 2
.mk
.na
.B -X
.ad
.RS 15n
.rt
Disables Kerberos V5 authentication support negotiation.
.RE

.SH USAGE
.sp
.LP
.B telnetd
and
.B in.telnetd
are IPv6-enabled. See
.BR ip6 (7P).
.SH SECURITY
.sp
.LP
.B in.telnetd
can authenticate using Kerberos V5 authentication,
.BR pam (3PAM),
or both. By default, the telnet server will accept valid
Kerberos V5 authentication credentials from a
.B telnet
client that supports
Kerberos.
.B in.telnetd
can also support an encrypted session from such a
client if the client requests it.
.sp
.LP
The
.B telnet
protocol only uses single DES for session
protection\(emclients request service tickets with single DES session keys. The
KDC must know that host service principals that offer the
.B telnet
service
support single DES, which, in practice, means that such principals must have
single DES keys in the KDC database.
.sp
.LP
In order for Kerberos authentication to work, a \fBhost/\fI<FQDN>\fR
Kerberos principal must exist for each Fully Qualified Domain Name associated
with the \fBtelnetd\fR server. Each of these \fBhost/\fI<FQDN>\fR principals
must have a
.B keytab
entry in the
.B /etc/krb5/krb5.keytab
file on the
.B telnetd
server. An example principal might be:
.sp
.LP
.B host/bigmachine.eng.example.com
.sp
.LP
See \fBkadmin\fR(1M) or \fBgkadmin\fR(1M) for instructions on adding a
principal to a
.B krb5.keytab
file. See\fR  for a discussion of Kerberos
authentication.
.sp
.LP
.B in.telnetd
uses \fBpam\fR(3PAM) for authentication, account management,
session management, and password management. The
.B PAM
configuration
policy, listed through
.BR /etc/pam.conf ,
specifies the modules to be used
for
.BR in.telnetd .
Here is a partial
.B pam.conf
file with entries for
the
.B telnet
command using the UNIX authentication, account management,
session management, and password management modules.
.sp
.in +2
.nf
telnet  auth requisite          pam_authtok_get.so.1
telent  auth required           pam_dhkeys.so.1
telent  auth required           pam_unix_auth.so.1

telnet  account requisite       pam_roles.so.1
telnet  account required        pam_projects.so.1
telnet  account required        pam_unix_account.so.1

telnet  session required        pam_unix_session.so.1

telnet  password required       pam_dhkeys.so.1
telent  password requisite      pam_authtok_get.so.1
telnet  password requisite      pam_authtok_check.so.1
telnet  password required       pam_authtok_store.so.1
.fi
.in -2

.sp
.LP
If there are no entries for the
.B telnet
service, then the entries for the
"other" service will be used. If multiple authentication modules are listed,
then the user may be prompted for multiple passwords.
.sp
.LP
For a Kerberized telnet service, the correct
.B PAM
service name is
.BR ktelnet .
.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/default/telnetd
.ad
.RS 24n
.rt

.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWtnetd
.TE

.SH SEE ALSO
.sp
.LP
.BR login (1),
.BR svcs (1),
.BR telnet (1),
.BR gkadmin (1M),
.BR inetadm (1M),
.BR inetd (1M),
.BR kadmin (1M),
.BR svcadm (1M),
.BR pam (3PAM),
.BR getnameinfo (3SOCKET),
.BR issue (4),
.BR krb5.conf (4),
.BR pam.conf (4),
.BR services (4),
.BR attributes (5),
.BR pam_authtok_check (5),
.BR pam_authtok_get (5),
.BR pam_authtok_store (5),
.BR pam_dhkeys (5),
.BR pam_passwd_auth (5),
.BR pam_unix_account (5),
.BR pam_unix_auth (5),
.BR pam_unix_session (5),
.BR smf (5),
.BR ip6 (7P),
.BR termio (7I)
.sp
.LP
\fR
.sp
.LP
Alexander, S.
.IR "RFC 1572, TELNET Environment Option" .
Network Information
Center, SRI International, Menlo Park, Calif., January 1994.
.sp
.LP
Borman, Dave.
.IR "RFC 1408, TELNET Environment Option" .
Network Information
Center, SRI International, Menlo Park, Calif., January 1993.
.sp
.LP
Borman, Dave. \fIRFC 1571, TELNET Environment Option Interoperability
Issues\fR. Network Information Center, SRI International, Menlo Park, Calif.,
January 1994.
.sp
.LP
Crispin, Mark.
.IR "RFC 727, TELNET Logout Option" .
Network Information
Center, SRI International, Menlo Park, Calif., April 1977.
.sp
.LP
Marcy, G.
.IR "RFC 1096, TELNET X Display Location Option" .
Network
Information Center, SRI International, Menlo Park, Calif., March 1989.
.sp
.LP
Postel, Jon, and Joyce Reynolds.
.IR "RFC 854, TELNET Protocol Specification" .
Network Information Center, SRI International, Menlo Park, Calif., May 1983.
.sp
.LP
Waitzman, D.
.IR "RFC 1073, TELNET Window Size Option" .
Network Information
Center, SRI International, Menlo Park, Calif., October 1988.
.sp
.LP
Kohl, J., Neuman, C., \fIThe Kerberos Network Authentication Service (V5), RFC
1510\fR. September 1993.
.sp
.LP
Ts'o, T. and J. Altman,
.IR "Telnet Authentication Option, RFC 2941" .
September 2000.
.sp
.LP
Ts'o, T.,
.IR "Telnet Authentication: Kerberos Version 5, RFC 2942" .
September
2000.
.sp
.LP
Ts'o, T.,
.IR "Telnet Data Encryption Option, RFC 2946" .
September 2000.
.sp
.LP
Ts'o, T.,
.IR "Telnet Encryption: DES 64 bit Cipher Feedback, RFC 2952" .
September 2000.
.SH NOTES
.sp
.LP
Some
.B TELNET
commands are only partially implemented.
.sp
.LP
Binary mode has no common interpretation except between similar operating
systems.
.sp
.LP
The terminal type name received from the remote client is converted to lower
case.
.sp
.LP
The
.I packet
interface to the pseudo-terminal should be used for more
intelligent flushing of input and output queues.
.sp
.LP
.B in.telnetd
never sends
.B TELNET
.I go ahead
commands.
.sp
.LP
The
.BR pam_unix (5)
module is no longer supported.. Similar functionality is
provided by
.BR pam_authtok_check (5),
.BR pam_authtok_get (5),
.BR pam_authtok_store (5),
.BR pam_dhkeys (5),
.BR pam_passwd_auth (5),
.BR pam_unix_account (5),
.BR pam_unix_auth (5),
and
.BR pam_unix_session (5).
.sp
.LP
The
.B in.telnetd
service is managed by the service management facility,
.BR smf (5),
under the service identifier:
.sp
.in +2
.nf
svc:/network/telnet
.fi
.in -2
.sp

.sp
.LP
Administrative actions on this service, such as enabling, disabling, or
requesting restart, can be performed using \fBsvcadm\fR(1M). Responsibility for
initiating and restarting this service is delegated to
.BR inetd "(1M). Use"
.BR inetadm (1M)
to make configuration changes and to view configuration
information for this service. The service's status can be queried using the
.BR svcs (1)
command.
