usr/src/man/man1m/in.uucpd.1m
'\" te
.\" Copyright (c) 2004, Sun Microsystems, Inc.  All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH in.uucpd 1M "12 Aug 2004" "SunOS 5.11" "System Administration Commands"
.SH NAME
in.uucpd, uucpd \- UUCP server
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/in.uucpd\fR [\fB-n\fR]
.fi

.SH DESCRIPTION
.sp
.LP
.B in.uucpd
is the server for supporting
.B UUCP
connections over
networks.
.sp
.LP
.B in.uucpd
is invoked by
.BR inetd "(1M) when a"
.B UUCP
connection
is established, that is, a connection to the port indicated in the "uucp"
service specification, and executes the following protocol. See
.BR services (4):
.RS +4
.TP
1.
The server prompts with
.BR login: .
The
.BR uucico "(1M) process at the"
other end must supply a username.
.RE
.RS +4
.TP
2.
Unless the username refers to an account without a password, the server
then prompts with
.BR Password: .
The
.B uucico
process at the other end
must supply the password for that account.
.RE
.sp
.LP
If the username is not valid, or is valid but refers to an account that
does not have
.B /usr/lib/uucp/uucico
as its login shell, or if the
password is not the correct password for that account, the connection is
dropped. Otherwise,
.B uucico
is run, with the user
.BR ID ,
group
.BR ID ,
group set, and home directory for that account, with the
environment variables
.B USER
and
.B " LOGNAME"
set to the specified
username, and with a
.B -u
flag specifying the username. Unless the
.B -n
flag is specified, entries are made in
.BR /var/adm/utmpx ,
.BR /var/adm/wtmpx ,
and
.B /var/adm/lastlog
for the username.
.B in.uucpd
must be invoked by a user with appropriate privilege (usually
root) in order to be able to verify that the password is correct.
.SH SECURITY
.sp
.LP
.B in.uucpd
uses \fBpam\fR(3PAM) for authentication, account management,
and session management.  The
.B PAM
configuration policy, listed through
.BR /etc/pam.conf ,
specifies the modules to be used for
.BR in.uucpd .
Here is a partial
.B pam.conf
file with entries for
.B uucp
using the
UNIX authentication, account management, and session management module.
.sp
.in +2
.nf
uucp    auth requisite          pam_authtok_get.so.1
uucp    auth required           pam_dhkeys.so.1
uucp    auth required           pam_unix_auth.so.1

uucp    account requisite       pam_roles.so.1
uucp    account required        pam_projects.so.1
uucp    account required        pam_unix_account.so.1

uucp      session required      pam_unix_session.so.1
.fi
.in -2

.sp
.LP
If there are no entries for the
.B uucp
service, then the entries for
the "other" service will be used. If multiple authentication modules are
listed, then the peer may be prompted for multiple passwords.
.SH FILES
.sp
.ne 2
.mk
.na
.B /var/adm/utmpx
.ad
.RS 20n
.rt
accounting
.RE

.sp
.ne 2
.mk
.na
.B /var/adm/wtmpx
.ad
.RS 20n
.rt
accounting
.RE

.sp
.ne 2
.mk
.na
.B /var/adm/lastlog
.ad
.RS 20n
.rt
time of last login
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWbnuu
.TE

.SH SEE ALSO
.sp
.LP
.BR svcs (1),
.BR inetadm (1M),
.BR inetd (1M),
.BR svcadm (1M),
.BR uucico (1M),
.BR pam (3PAM),
.BR pam.conf (4),
.BR services (4),
.BR attributes (5),
.BR pam_authtok_check (5),
.BR pam_authtok_get (5),
.BR pam_authtok_store (5),
.BR pam_dhkeys (5),
.BR pam_passwd_auth (5),
.BR pam_unix_account (5),
.BR pam_unix_auth (5),
.BR pam_unix_session (5),
.BR smf (5)
.SH DIAGNOSTICS
.sp
.LP
All diagnostic messages are returned on the connection, after which the
connection is closed.
.sp
.ne 2
.mk
.na
.B user read
.ad
.RS 20n
.rt
An error occurred while reading the username.
.RE

.sp
.ne 2
.mk
.na
.B passwd read
.ad
.RS 20n
.rt
An error occurred while reading the password.
.RE

.sp
.ne 2
.mk
.na
.B Login incorrect.
.ad
.RS 20n
.rt
The username is invalid or refers to an account with a login shell other
than
.BR /usr/lib/uucp/uucico ,
or the password is not the correct password
for the account.
.RE

.SH NOTES
.sp
.LP
The
.B in.uucpd
service is managed by the service management facility,
.BR smf (5),
under the service identifier:
.sp
.in +2
.nf
svc:/network/uucp
.fi
.in -2
.sp

.sp
.LP
Administrative actions on this service, such as enabling, disabling, or
requesting restart, can be performed using
.BR svcadm (1M).
Responsibility
for initiating and restarting this service is delegated to
.BR inetd (1M).
Use \fBinetadm\fR(1M) to make configuration changes and to view
configuration information for this service. The service's status can be
queried using the
.BR svcs (1)
command.
.sp
.LP
The
.BR pam_unix (5)
module is no longer supported. Similar functionality
is provided by
.BR pam_authtok_check (5),
.BR pam_authtok_get (5),
.BR pam_authtok_store (5),
.BR pam_dhkeys (5),
.BR pam_passwd_auth (5),
.BR pam_unix_account (5),
.BR pam_unix_auth (5),
and
.BR pam_unix_session (5).
