usr/src/man/man1m/inetadm.1m
'\" te
.\" Copyright (c) 2004, Sun Microsystems, Inc. All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH inetadm 1M "5 Jul 2007" "SunOS 5.11" "System Administration Commands"
.SH NAME
inetadm \- observe or configure inetd-controlled services
.SH SYNOPSIS
.LP
.nf
\fBinetadm\fR
.fi

.LP
.nf
\fBinetadm\fR \fB-?\fR
.fi

.LP
.nf
\fBinetadm\fR \fB-p\fR
.fi

.LP
.nf
\fBinetadm\fR \fB-l\fR {\fIFMRI\fR | \fIpattern\fR}
.fi

.LP
.nf
\fBinetadm\fR \fB-e\fR {\fIFMRI\fR | \fIpattern\fR}
.fi

.LP
.nf
\fBinetadm\fR \fB-d\fR {\fIFMRI\fR | \fIpattern\fR}
.fi

.LP
.nf
\fBinetadm\fR \fB-m\fR {\fIFMRI\fR | \fIpattern\fR}.\|.\|. {\fIname\fR=\fIvalue\fR}.\|.\|.
.fi

.LP
.nf
\fBinetadm\fR \fB-M\fR {\fIname\fR=\fIvalue\fR}.\|.\|.
.fi

.SH DESCRIPTION
.sp
.LP
The
.B inetadm
utility provides the following capabilities for
\fBinetd\fR-managed SMF services:
.RS +4
.TP
.ie t \(bu
.el o
Provides a list of all such services installed.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Lists the services' properties and values.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Allows enabling and disabling of services.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Allows modification of the services'property values, as well as the default
values provided by
.BR inetd .
.RE
.sp
.LP
See
.BR smf (5)
for a description of an SMF service.
.sp
.LP
With no arguments,
.B inetadm
lists all services under
.BR inetd (1M)
control, including such attributes as their current run state and whether or
not they are enabled.
.SH OPTIONS
.sp
.LP
For options taking one or more FMRI operands (see
.BR smf (5)
for a
description of an FMRI), if the operand specifies a service (instead of a
service instance), and that service has only a single instance,
.B inetadm
operates on that instance.
.sp
.LP
If a service name is supplied and it contains more than one instances or a
pattern is supplied and and it matches more than one instance, a warning
message is displayed and that operand is ignored.
.sp
.LP
For those options taking \fIname\fR=\fIvalue\fR parameters, a description
of each of the possible names and the allowed values is found in the
.BR inetd (1M)
man page.
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -?
.ad
.sp .6
.RS 4n
Display a usage message.
.RE

.sp
.ne 2
.mk
.na
.B -p
.ad
.sp .6
.RS 4n
Lists all default
.B inet
service property values provided by
\fBinetd\fR in the form of \fIname\fR=\fIvalue\fR pairs. If the value is of
boolean type, it is listed as TRUE or FALSE.
.RE

.sp
.ne 2
.mk
.na
\fB-l\fR {\fIFMRI\fR | \fIpattern\fR}.\|.\|.\fR
.ad
.sp .6
.RS 4n
List all properties for the specified service instances as
\fIname\fR=\fIvalue\fR pairs. In addition, if the property value is
inherited from the default value provided by
.BR inetd ,
the
\fIname\fR=\fIvalue\fR pair is identified by the token (default). Property
inheritance occurs when properties do not have a specified service instance
default.
.RE

.sp
.ne 2
.mk
.na
\fB-e\fR {\fIFMRI\fR | \fIpattern\fR}.\|.\|.\fR
.ad
.sp .6
.RS 4n
Enable the specified service instances.
.RE

.sp
.ne 2
.mk
.na
\fB-d\fR {\fIFMRI\fR | \fIpattern\fR}.\|.\|.\fR
.ad
.sp .6
.RS 4n
Disable the specified service instances.
.RE

.sp
.ne 2
.mk
.na
\fB-m\fR {\fIFMRI\fR | \fIpattern\fR}.\|.\|.{\fIname\fR=\fIvalue\fR}.\|.\|.\fR
.ad
.sp .6
.RS 4n
Change the values of the specified properties of the identified service
instances. Properties are specified as whitespace-separated
\fIname\fR=\fIvalue\fR pairs. To remove an instance-specific value and
accept the default value for a property, simply specify the property without
a value, for example,
.B name=
\&.
.RE

.sp
.ne 2
.mk
.na
\fB-M\fR {\fIname\fR=\fIvalue\fR}.\|.\|.\fR
.ad
.sp .6
.RS 4n
Change the values of the specified
.B inetd
default properties.
Properties are specified as whitespace-separated \fIname\fR=\fIvalue\fR
pairs.
.RE

.SH EXAMPLES
.LP
.B Example 1
Displaying Properties for a Service
.sp
.LP
The following command displays the properties for the
.BR spray
service.

.sp
.in +2
.nf
# inetadm -l network/rpc/spray:default
SCOPE    NAME=VALUE
         name="sprayd"
         endpoint_type="tli"
         proto="datagram_v"
         isrpc=TRUE
         rpc_low_version=1
         rpc_high_version=1
         wait=TRUE
         exec="/usr/lib/netsvc/spray/rpc.sprayd"
         user="root"
default  bind_addr=""
default  bind_fail_max=-1
default  bind_fail_interval=-1
default  max_con_rate=-1
default  max_copies=-1
default  con_rate_offline=-1
default  failrate_cnt=40
default  failrate_interval=60
default  inherit_env=TRUE
default  tcp_trace=FALSE
default  tcp_wrappers=FALSE
default  connection_backlog=10
.fi
.in -2

.LP
.B Example 2
Displaying Default Properties
.sp
.LP
The following command displays default properties.

.sp
.in +2
.nf
# inetadm -p
NAME=VALUE
bind_addr=""
bind_fail_max=-1
bind_fail_interval=-1
max_con_rate=-1
max_copies=-1
con_rate_offline=-1
failrate_cnt=40
failrate_interval=60
inherit_env=TRUE
tcp_trace=FALSE
tcp_wrappers=FALSE
default  connection_backlog=10
.fi
.in -2

.LP
.B Example 3
Changing Property Values for a Service
.sp
.LP
The following command changes
.B rpc_high_version
to
.B 3
and
.B tcp_trace
to
.B TRUE
for the
.B spray
service.

.sp
.in +2
.nf
# inetadm -m network/rpc/spray:default \e
         rpc_high_version=3 tcp_trace=TRUE
# inetadm -l network/rpc/spray:default
SCOPE    NAME=VALUE
         name="sprayd"
         endpoint_type="tli"
         proto="datagram_v"
         isrpc=TRUE
         rpc_low_version=1
         rpc_high_version=3
         wait=TRUE
         exec="/usr/lib/netsvc/spray/rpc.sprayd"
         user="root"
default  bind_addr=""
default  bind_fail_max=-1
default  bind_fail_interval=-1
default  max_con_rate=-1
default  max_copies=-1
default  con_rate_offline=-1
default  failrate_cnt=40
default  failrate_interval=60
default  inherit_env=TRUE
         tcp_trace=TRUE
default  tcp_wrappers=FALSE
default  connection_backlog=10
.fi
.in -2

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 5n
.rt
Operation completed successfully.
.RE

.sp
.ne 2
.mk
.na
.B 1
.ad
.RS 5n
.rt
A fatal error occurred. An accompanying error message will provide further
information.
.RE

.sp
.ne 2
.mk
.na
.B 2
.ad
.RS 5n
.rt
Invalid arguments were supplied, such as an ambiguous service FMRI or
pattern.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
_
Interface StabilityEvolving
.TE

.SH SEE ALSO
.sp
.LP
.BR inetd (1M),
.BR svccfg (1M),
.BR attributes (5),
.BR smf (5)
