usr/src/man/man1m/inetconv.1m
'\" te
.\" Copyright (c) 2004, Sun Microsystems, Inc.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH inetconv 1M "21 Oct 2004" "SunOS 5.11" "System Administration Commands"
.SH NAME
inetconv \- convert \fBinetd.conf\fR entries into smf service manifests,
import them into smf repository
.SH SYNOPSIS
.LP
.nf
\fBinetconv\fR \fB-?\fR
.fi

.LP
.nf
\fBinetconv\fR [\fB-f\fR] [\fB-n\fR] [\fB-i\fR \fIsrcfile\fR] [\fB-o\fR \fIdestdir\fR]
.fi

.LP
.nf
\fBinetconv\fR \fB-e\fR [\fB-n\fR] [\fB-i\fR \fIsrcfile\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The
.B inetconv
utility converts a file containing records of
.BR inetd.conf (4)
into
.BR smf (5)
service manifests, and then import
those manifests into the \fBsmf\fR repository. Once the \fBinetd.conf\fR
file has been converted, the only way to change aspects of an inet service
is to use the
.BR inetadm "(1M) utility."
.sp
.LP
There is a one-to-one correspondence between a service line in the input
file and the manifest generated. By default, the manifests are named using
the following template:
.sp
.in +2
.nf
\fI<svcname>\fR-\fI<proto>\fB\&.xml\fR
.fi
.in -2

.sp
.LP
The
.I <svcname>
token is replaced by the service's name and the
.I <proto>
token by the service's protocol. Any slash (\fB/\fR)
characters that exist in the source line for the service name or protocol
are replaced with underscores
.RB ( _ ).
.sp
.LP
The service line is recorded as a property of the converted service.
.sp
.LP
During the conversion process, if a service line is found to be malformed
or to be for an internal
.B inetd
service, no manifest is generated and
that service line is skipped.
.sp
.LP
The input file is left untouched by the conversion process.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -?
.ad
.RS 14n
.rt
Display a usage message.
.RE

.sp
.ne 2
.mk
.na
.B -e
.ad
.RS 14n
.rt
Enable
.B smf
services which are listed in the input file.
.RE

.sp
.ne 2
.mk
.na
.B -f
.ad
.RS 14n
.rt
If a service manifest of the same name as the one to be generated is found
in the destination directory,
.B inetconv
will overwrite that manifest if
this option is specified. Otherwise, an error message is generated and the
conversion of that service is not performed.
.RE

.sp
.ne 2
.mk
.na
.B -i
.I srcfile
.ad
.RS 14n
.rt
Permits the specification of an alternate input file
.IR srcfile .
If this
option is not specified, then the
.BR inetd.conf (4)
file is used as
input.
.RE

.sp
.ne 2
.mk
.na
.B -n
.ad
.RS 14n
.rt
Turns off the auto-import of the manifests generated during the conversion
process. Later, if you want to import a generated manifest into the
.BR smf (5)
repository, you can do so through the use of the
.BR svccfg (1M)
utility.
.sp
If the
.B -e
option is specified, the
.B -n
option only displays the
.B smf
services that would be enabled.
.RE

.sp
.ne 2
.mk
.na
.B -o
.ad
.RS 14n
.rt
Permits the specification of an alternate destination directory
.I destdir
for the generated manifests. If this option is not specified,
then the manifests are placed in
.BR /var/svc/manifest/network/rpc ,
if the
service is a RPC service, or
.B /var/svc/manifest/network
otherwise.
.RE

.SH EXAMPLES
.LP
.B Example 1
Generating \fBsmf\fR Manifests from \fBinetd.conf\fR
.sp
.LP
The following command generates
.BR smf (5)
manifests from
.BR inetd.conf (4)
and places them in
.BR /var/tmp ,
overwriting any
preexisting manifests of the same name, and then imports them into the
.B smf
repository.

.sp
.in +2
.nf
# inetconv -f -o /var/tmp
100232/10 -> /var/tmp/100232_10-rpc_udp.xml
Importing 100232_10-rpc_udp.xml .\|.\|.Done
telnet -> /var/tmp/telnet-tcp6.xml
Importing telnet-tcp6.xml .\|.\|.Done
.fi
.in -2

.LP
.B Example 2
Generating Manifests from an Alternate Input File
.sp
.LP
The following command specifies a different input file and does not load
the resulting manifests into the
.B smf
repository.

.sp
.in +2
.nf
# inetconv -n -i /export/test/inet.svcs -o /var/tmp
100232/10 -> /var/tmp/100232_10-rpc_udp.xml
telnet -> /var/tmp/telnet-tcp6.xml
.fi
.in -2

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 5n
.rt
Operation completed successfully (no errors).
.RE

.sp
.ne 2
.mk
.na
.B 1
.ad
.RS 5n
.rt
Invalid options specified.
.RE

.sp
.ne 2
.mk
.na
.B 2
.ad
.RS 5n
.rt
One or more service lines are malformed, and thus no manifest(s) were
generated for them.
.RE

.sp
.ne 2
.mk
.na
.B 3
.ad
.RS 5n
.rt
An error occurred importing one or more of the generated manifests.
.RE

.sp
.ne 2
.mk
.na
.B 4
.ad
.RS 5n
.rt
A system error occurred.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
\fB/var/svc/manifest/network/{rpc}/\fI<svcname>\fR-\fI<proto>\fR\&.xml\fR
.ad
.sp .6
.RS 4n
default output manifest file name
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
_
Interface StabilityEvolving
.TE

.SH SEE ALSO
.sp
.LP
.BR inetadm (1M),
.BR inetd (1M),
.BR svccfg (1M),
.BR inetd.conf (4),
.BR attributes (5),
.BR smf (5)
