usr/src/man/man1m/inityp2l.1m
'\" te
.\" Copyright (C) 2003, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH inityp2l 1M "10 Apr 2003" "SunOS 5.11" "System Administration Commands"
.SH NAME
inityp2l \- create NIS (YP) to LDAP configuration files
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/netsvc/yp/inityp2l\fR [\fB-m\fR \fImapping_file_name\fR]
     [\fB-c\fR \fIconfig_file_name\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The
.B inityp2l
utility assists with creation of the
.B NISLDAPmapping
and
.B ypserv
files. See
.BR NISLDAPmapping (4)
and\fBypserv\fR(4).
.B inityp2l
examines the NIS maps on a system. and
through a dialogue with the user, determines which NIS to (and from) LDAP
mappings are required. A
.B NISLDAPmapping
file is then created based on
this information. The utility asks users about their LDAP server
configuration and a
.B ypserv
file is created based on this
information.
.sp
.LP
The
.B inityp2l
utility handles mappings for standard NIS maps and the
.B auto.*
series of maps. If requested, it creates default mappings for
custom maps, with each map entry represented as a single DIT string.
.B inityp2l
does not handle full custom mapping, but if requested,
.B inityp2l
will insert comments into the
.B NISLDAPmapping
file that
indicate where these should be added.
.sp
.LP
To write to the
.B NISLDAPmapping
or
.B ypserv
files is potentially
dangerous.
.B inityp2l
warns the user and asks for confirmation before:
.RS +4
.TP
1.
it overwrites either file
.RE
.RS +4
.TP
2.
it writes to the default
.B NISLDAPmapping
file location, if this file
did not previously exist. This is important because the existence of a file
in this location causes NIS components to work NIS to LDAP (N2L)  mode when
next restarted, rather than to traditional NIS mode.
.RE
.sp
.LP
.B inityp2l
assists with rapid creation of a simple N2L configuration
files. It is not a general purpose tool for the		management of these files.
An advanced user who would like to maintain the files or use custom mappings
should examine the output of
.B inityp2l
and customize it by using a
standard text editor.
.SH OPTIONS
.sp
.LP
.B inityp2l
supports the following options:
.sp
.ne 2
.mk
.na
.B -c
.ad
.RS 6n
.rt
Specify the name of the generated
.B ypserv
file. The default location
is described in .
.RE

.sp
.ne 2
.mk
.na
.B -m
.ad
.RS 6n
.rt
Specify the name of the generated
.B NISLDAPmapping
file. The default is
described in .
.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B /var/yp
.ad
.RS 26n
.rt
The directory to be searched for candidate domains (\fB/var/yp/*\fR) and
NIS maps (\fB/var/yp/*/*\fR)
.RE

.sp
.ne 2
.mk
.na
.B /var/yp/NISLDAPmapping
.ad
.RS 26n
.rt
The default location for the generated
.B NISLDAPmapping
file
.RE

.sp
.ne 2
.mk
.na
.B /etc/default/ypserv
.ad
.RS 26n
.rt
The default location for the generated
.B ypserv
file
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWypu
_
Interface StabilityObsolete
.TE

.SH SEE ALSO
.sp
.LP
.BR NISLDAPmapping (4),
.BR ypserv (4),
.BR attributes (5)
