usr/src/man/man1m/installgrub.1m
'\" te
.\" Copyright (c) 2008, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH installgrub 1M "2 Jul 2009" "SunOS 5.11" "System Administration Commands"
.SH NAME
installgrub \- install GRUB in a disk partition or a floppy
.SH SYNOPSIS
.LP
.nf
\fB/sbin/installgrub\fR [\fB-fm\fR] \fIstage1\fR \fIstage2\fR \fIraw-device\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B installgrub
command is an x86-only program. GRUB stands for GRand
Unified Bootloader.
.sp
.LP
.B installgrub
installs GRUB stage 1 and stage 2 files on the boot area
of a disk partition. If you specify the
.B -m
.RB option, " installgrub"
installs the stage 1 file on the master boot sector of the disk.
.SH OPTIONS
.sp
.LP
The
.B installgrub
command accepts the following options:
.sp
.ne 2
.mk
.na
.B -f
.ad
.RS 6n
.rt
Suppresses interaction when overwriting the master boot sector.
.RE

.sp
.ne 2
.mk
.na
.B -m
.ad
.RS 6n
.rt
Installs GRUB
.I stage1
on the master boot sector interactively. You
must use this option if Solaris is installed on an extended partition.
.RE

.SH OPERANDS
.sp
.LP
The
.B installgrub
command accepts the following operands:
.sp
.ne 2
.mk
.na
.I stage1
.ad
.RS 14n
.rt
The name of the GRUB stage 1 file.
.RE

.sp
.ne 2
.mk
.na
.I stage2
.ad
.RS 14n
.rt
The name of the GRUB stage 2 file.
.RE

.sp
.ne 2
.mk
.na
.I raw-device
.ad
.RS 14n
.rt
The name of the device onto which GRUB code is to be installed. It must be
a character device that is readable and writable. For disk devices, specify
the slice where the GRUB menu file is located. (For Solaris it is the root
slice.) For a floppy disk, it is
.BR /dev/rdiskette .
.RE

.SH EXAMPLES
.LP
.B Example 1
Installing GRUB on a Hard Disk Slice
.sp
.LP
The following command installs GRUB on a system where the root slice is
.BR c0d0s0 :

.sp
.in +2
.nf
example# /sbin/installgrub /boot/grub/stage1 \e
         /boot/grub/stage2 /dev/rdsk/c0d0s0
.fi
.in -2

.LP
.B Example 2
Installing GRUB on a Floppy
.sp
.LP
The following command installs GRUB on a formatted floppy:

.sp
.in +2
.nf
example# mount -F pcfs /dev/diskette /mnt
# mkdir -p /mnt/boot/grub
# cp /boot/grub/* /mnt/boot/grub
# umount /mnt
# cd /boot/grub
# /sbin/installgrub stage1 stage2 /dev/rdiskette
.fi
.in -2

.SH FILES
.sp
.ne 2
.mk
.na
.B /boot/grub
.ad
.RS 14n
.rt
Directory where GRUB files reside.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
_
Interface StabilityUncommitted
.TE

.SH SEE ALSO
.sp
.LP
.BR boot (1M),
.BR fdisk (1M),
.BR fmthard (1M),
.BR kernel (1M),
.BR attributes (5)
.SH WARNINGS
.sp
.LP
Installing GRUB on the master boot sector (\fB-m\fR option) overrides any
boot manager currently installed on the machine. The system will always boot
the GRUB in the Solaris partition regardless of which
.B fdisk
partition
is active.
