usr/src/man/man1m/install.1m
'\" te
.\" Copyright 1989 AT&T Copyright (c) 2004, Sun Microsystems, Inc. All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH install 1M "3 Nov 2005" "SunOS 5.11" "System Administration Commands"
.SH NAME
install \- install commands
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/install\fR \fB-c\fR \fIdira\fR [\fB-m\fR \fImode\fR] [\fB-u\fR \fIuser\fR] [\fB-g\fR \fIgroup\fR]
     [\fB-o\fR] [\fB-s\fR] \fIfile\fR
.fi

.LP
.nf
\fB/usr/sbin/install\fR \fB-f\fR \fIdirb\fR [\fB-m\fR \fImode\fR] [\fB-u\fR \fIuser\fR] [\fB-g\fR \fIgroup\fR]
     [\fB-o\fR] [\fB-s\fR] \fIfile\fR
.fi

.LP
.nf
\fB/usr/sbin/install\fR \fB-n\fR \fIdirc\fR [\fB-m\fR \fImode\fR] [\fB-u\fR \fIuser\fR] [\fB-g\fR \fIgroup\fR]
     [\fB-o\fR] [\fB-s\fR] \fIfile\fR
.fi

.LP
.nf
\fB/usr/sbin/install\fR \fB-d\fR | \fB-i\fR [\fB-m\fR \fImode\fR] [\fB-u\fR \fIuser\fR] [\fB-g\fR \fIgroup\fR]
     [\fB-o\fR] [\fB-s\fR] \fIdirx\fR...
.fi

.LP
.nf
\fB/usr/sbin/install\fR [\fB-m\fR \fImode\fR] [\fB-u\fR \fIuser\fR] [\fB-g\fR \fIgroup\fR] [\fB-o\fR] [\fB-s\fR] \fIfile\fR
     [\fIdirx\fR]...
.fi

.SH DESCRIPTION
.sp
.LP
.B install
is most commonly used in ``makefiles'' (see
.BR make (1S))
to install a
.B file
in specific locations, or to create directories
within a file system. Each
.B file
is installed by copying it into the
appropriate directory.
.sp
.LP
.B install
uses no special privileges to copy files from one place to
another. The implications of this are:
.RS +4
.TP
.ie t \(bu
.el o
You must have permission to read the files to be installed.
.RE
.RS +4
.TP
.ie t \(bu
.el o
You must have permission to copy into the destination directory.
.RE
.RS +4
.TP
.ie t \(bu
.el o
You must have permission to change the modes on the final copy of the file
if you want to use the
.B -m
option.
.RE
.RS +4
.TP
.ie t \(bu
.el o
You must be super-user if you want to specify the ownership of the
installed file with the
.B -u
or
.B -g
options. If you are not the
super-user, the installed file is owned by you, regardless of who owns the
original.
.RE
.sp
.LP
Note that if the
.B ROOT
environment variable is set, each of the
default directory paths are prefixed by its value (for example,
.B $ROOT/bin
and so on).
.sp
.LP
.B install
prints messages telling the user exactly what files it is
replacing or creating and where they are going.
.sp
.LP
If no options or directories (\fIdirx\fR .\|.\|.) are given, \fBinstall\fR
searches a set of default directories (
.BR /bin ,
.BR /usr/bin ,
.BR /etc ,
.BR /lib ,
and
.BR /usr/lib ,
in that order) for a file with
the same name as
.BR file .
When the first occurrence is found,
.B install
issues a message saying that it is overwriting that file with
.BR file ,
and proceeds to do so. If the file is not found, the program
states this and exits.
.sp
.LP
If one or more directories (\fIdirx\fR .\|.\|.) are specified after
.BR file ,
those directories are searched before the default directories.
.sp
.LP
This version of
.B install
(\fB/usr/sbin/install\fR) is not compatible
with the
.B install
binaries in many versions of Unix other than Solaris.
For a  higher degree of compatibility with other Unix versions, use
.BR /usr/ucb/install ,
which is described in the
.BR install "(1B) man"
page.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -c
.I dira
.ad
.RS 12n
.rt
Install
.B file
in the directory specified by
.IR dira ,
if \fBfile\fR
does not yet exist. If it is found,
.B install
issues a message saying
that the file already exists, and exits without overwriting it.
.RE

.sp
.ne 2
.mk
.na
.B -f
.I dirb
.ad
.RS 12n
.rt
Force
.B file
to be installed in given directory, even if the file
already exists. If the file being installed does not already exist, the mode
and owner of the new file is set to
.B 755
and
.BR "bin ,"
respectively. If the file already exists, the mode and owner is that of the
already existing file.
.RE

.sp
.ne 2
.mk
.na
.B -n
.I dirc
.ad
.RS 12n
.rt
If
.B file
is not found in any of the searched directories, it is put in
the directory specified in
.IR dirc .
The mode and owner of the new file is
set to
.B 755
and
.BR bin ,
respectively.
.RE

.sp
.ne 2
.mk
.na
.B -d
.ad
.RS 12n
.rt
Create a directory. Missing parent directories are created as required as
in
.BR "mkdir -p" .
If the directory already exists, the owner, group
and mode is set to the values given on the command line.
.RE

.sp
.ne 2
.mk
.na
.B -i
.ad
.RS 12n
.rt
Ignore default directory list, searching only through the given directories
(\fIdirx\fR .\|.\|.).
.RE

.sp
.ne 2
.mk
.na
.B -m
.I mode
.ad
.RS 12n
.rt
The mode of the new file is set to
.IR mode .
Set to
.B 0755
by
default.
.RE

.sp
.ne 2
.mk
.na
.B -u
.I user
.ad
.RS 12n
.rt
The owner of the new file is set to
.IR user .
Only available to the
super-user. Set to
.B bin
by default.
.RE

.sp
.ne 2
.mk
.na
.B -g
.I group
.ad
.RS 12n
.rt
The group id of the new file is set to
.IR group .
Only available to the
super-user. Set to
.B bin
by default.
.RE

.sp
.ne 2
.mk
.na
.B -o
.ad
.RS 12n
.rt
If
.B file
is found, save the ``found'' file by copying it to
.B OLDfile
in the directory in which it was found. This option is
useful when installing a frequently used file such as
.B /bin/sh
or
.BR /lib/saf/ttymon ,
where the existing file cannot be removed.
.RE

.sp
.ne 2
.mk
.na
.B -s
.ad
.RS 12n
.rt
Suppress printing of messages other than error messages.
.RE

.SH USAGE
.sp
.LP
See
.BR largefile (5)
for the description of the behavior of
.BR install
when encountering files greater than or equal to 2 Gbyte ( 2^31 bytes).
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.sp
.LP
.BR chgrp (1),
.BR chmod (1),
.BR chown (1),
.BR cp (1),
.BR install (1B),
.BR make (1S),
.BR mkdir (1),
.BR attributes (5),
.BR largefile (5)
