usr/src/man/man1m/installgrub.1m
'\" te
.\" Copyright (c) 2008, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2019, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH installgrub 1M "16 Sep 2019" "SunOS 5.11" "System Administration Commands"
.SH NAME
installgrub \- install GRUB in a disk partition or a floppy
.SH SYNOPSIS
.LP
.nf
\fB/sbin/installgrub\fR [\fB-dfFmn\fR] [\fB-u \fIupd-str\fR] \fIstage1\fR \fIstage2\fR \fIraw-device\fR
\fB/sbin/installgrub\fR \fB-M\fR [\fB-n\fR] \fIdevice1 device2\fR
\fB/sbin/installgrub\fR \fB-i\fR [\fB-deV\fR] \fIraw-device\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B installgrub
command is an x86-only program. GRUB stands for GRand
Unified Bootloader.
.sp
.LP
.B installgrub
installs GRUB stage 1 and stage 2 files on the boot area
of a disk partition. If you specify the
.B -m
.RB option, " installgrub"
installs the stage 1 file on the master boot sector of the disk.
.SH OPTIONS
.sp
.LP
The
.B installgrub
command accepts the following options:
.sp
.ne 3
.TP 6n
.B -d
Print debug information.

.sp
.ne 3
.TP
.B -e
Print easy to parse exteded information.

.sp
.ne 3
.TP
.B -f
Suppresses interaction when overwriting the master boot sector.

.sp
.ne 3
.TP
.B -F
Force to update the boot.

.sp
.ne 3
.TP
.B -i
Retrieves the extended information (einfo) from a device, associated to the
installed
.IR stage2 .
Expects one parameter, the device path, in the form:
.B /dev/rdsk/c\c
.IR ? [\c
.BI t ?\c
.RB ] d\c
.IB ? s0\c
\&.
.sp
This option disables the options
.BR \-m ,
.BR \-f ,
.B \-u
and
.BR \-F .

.sp
.ne 3
.TP
.B -m
Installs GRUB
.I stage1
on the master boot sector interactively. You
must use this option if Solaris is installed on an extended partition.

.sp
.ne 3
.TP
.B -M
Attempt to mirror (propagate) the current
.I stage2
over the attaching disk. 

.sp
.ne 3
.TP
.B -n
Do not write to the
.I raw-device
and open 
.I raw-device
read-only for safety reasons.

.sp
.ne 3
.TP
.BI -u " update-string
Handle versioning in
.IR stage2 .

.sp
.ne 3
.TP
.B -V
Print extended information.

.SH OPERANDS
.sp
.LP
The
.B installgrub
command accepts the following operands:
.sp
.ne 2
.TP 14n
.I stage1
The name of the GRUB stage 1 file.

.sp
.ne 2
.TP
.I stage2
The name of the GRUB stage 2 file.

.sp
.ne 2
.TP
.I raw-device
The name of the device onto which GRUB code is to be installed. It must be
a character device that is readable and writable. For disk devices, specify
the slice where the GRUB menu file is located. (For Solaris it is the root
slice.) For a floppy disk, it is
.BR /dev/rdiskette .

.SH EXAMPLES
.LP
.B Example 1
Installing GRUB on a Hard Disk Slice
.sp
.LP
The following command installs GRUB on a system where the root slice is
.BR c0d0s0 :

.sp
.in +2
.nf
example# /sbin/installgrub /boot/grub/stage1 \e
         /boot/grub/stage2 /dev/rdsk/c0d0s0
.fi
.in -2

.LP
.B Example 2
Installing GRUB on a Floppy
.sp
.LP
The following command installs GRUB on a formatted floppy:

.sp
.in +2
.nf
example# mount -F pcfs /dev/diskette /mnt
# mkdir -p /mnt/boot/grub
# cp /boot/grub/* /mnt/boot/grub
# umount /mnt
# cd /boot/grub
# /sbin/installgrub stage1 stage2 /dev/rdiskette
.fi
.in -2

.SH FILES
.sp
.ne 2
.TP 14n
.B /boot/grub
Directory where GRUB files reside.

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
_
Interface StabilityUncommitted
.TE

.SH SEE ALSO
.sp
.LP
.BR boot (1M),
.BR fdisk (1M),
.BR fmthard (1M),
.BR kernel (1M),
.BR attributes (5)
.SH WARNINGS
.sp
.LP
Installing GRUB on the master boot sector (\fB-m\fR option) overrides any
boot manager currently installed on the machine. The system will always boot
the GRUB in the Solaris partition regardless of which
.B fdisk
partition
is active.
