usr/src/man/man1m/ipaddrsel.1m
'\" te
.\" Copyright (C) 2006, Sun Microsystems, Inc. All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ipaddrsel 1M "6 Feb 2006" "SunOS 5.11" "System Administration Commands"
.SH NAME
ipaddrsel \- configure IPv6 default address selection
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/ipaddrsel\fR
.fi

.LP
.nf
\fB/usr/sbin/ipaddrsel\fR \fB-f\fR \fIfile\fR
.fi

.LP
.nf
\fB/usr/sbin/ipaddrsel\fR \fB-d\fR
.fi

.SH DESCRIPTION
.sp
.LP
Use the
.B ipaddrsel
utility to configure the IPv6 default address
selection policy table. The policy table is a longest-matching-prefix lookup
table that is used for IPv6 source address selection and for destination
address ordering when resolving names to
.B AF_INET6
addresses. For a
description of how the policy table is used for source address selection,
see \fBinet6\fR(7P). For a description of how the policy table is used for
destination address ordering, see \fBgetaddrinfo\fR(3SOCKET).
.sp
.LP
The unmodified policy table is valid for all typical IPv6 deployments.
Modify the table only if a circumstance exists for which the default
behavior of the IPv6 source address selection or destination address
ordering mechanism is unsatisfactory. See the  section for examples of such
circumstances. You should carefully consider your addressing strategy before
you change the table from the provided default.
.sp
.LP
When the
.B ipaddrsel
command is issued without any arguments, the
address selection policy currently in use is printed. The format of the
output is compatible with the format of the configuration file that the
\fB-f\fR option accepts.
.LP
Note -
.sp
.RS 2
If the
.B usesrc
subcommand to \fBifconfig\fR(1M) is applied to a
particular physical interface, the selection policy specified by
\fBusesrc\fR overrides the source address selection policies specified by
.BR ipaddrsel .
This is true for packets that are locally generated and for
applications that do not choose a non-zero source address using
.BR bind (3SOCKET).
.RE
.SS "The Configuration File"
.sp
.LP
The configuration file that the \fB-f\fR option accepts can contain either
comment lines or policy entries. Comment lines have a '\fB#\fR' character as
the first non-blank character. and they are ignored by the \fBipaddrsel\fR
utility. Policy entry lines have the following format:
.sp
.in +2
.nf
\fIprefix\fR/\fIprefix_length\fR \fIprecedence\fR \fIlabel\fR [# \fIcomment\fR]
.fi
.in -2

.sp
.LP
The \fIprefix\fR must be an IPv6 prefix in a format consistent with
.BR inet (3SOCKET).
The \fIprefix_length\fR is an integer ranging from 0 to
128. The IPv6 source address selection and destination address ordering
algorithms determine the precedence or label of an address by doing a
longest-prefix-match lookup using the prefixes in this table, much like
next-hop determination for a destination is done by doing a
longest-prefix-match lookup using an IP routing table.
.sp
.LP
The precedence is a non-negative integer that represents how the
destination address ordering mechanism will sort addresses returned from
name lookups. In general, addresses with a higher precedence will be in
front of addresses with a lower precedence. Other factors, such as
destinations with undesirable source addresses can, however, override these
precedence values.
.sp
.LP
The label is a string of at most fifteen characters, not including the
\fINULL\fR terminator. The label allows particular source address prefixes
to be used with destination prefixes of the same label. Specifically, for a
particular destination address, the IPv6 source address selection algorithm
prefers source addresses whose label is equal that of the destination.
.sp
.LP
The label may be followed by an optional comment.
.sp
.LP
The file must contain a default policy entry, which is an entry with
\fB::0/0\fR as its \fIprefix\fR and
.IR prefix_length .
This is to ensure
that all possible addresses match a policy.
.SH OPTIONS
.sp
.LP
The
.B ippadrsel
utility supports the following options:
.sp
.ne 2
.mk
.na
\fB-f\fR \fIfile\fR
.ad
.RS 11n
.rt
Replace the address selection policy table with the policy specified in the
.IR file .
.RE

.sp
.ne 2
.mk
.na
.B -d
.ad
.RS 11n
.rt
Revert the kernel's address selection policy table back to the default
table. Invoking
.B ipaddrsel
in this way only changes the currently
running kernel's policy table, and does not alter the configuration file
\fB/etc/inet/ipaddrsel.conf\fR. To revert the configuration file back to its
default settings, use
.BR "ipaddrsel -d" ,
then dump the contents of
the table to the configuration file by redirecting the output of
\fBipaddrsel\fR to \fB/etc/inet/ipaddrsel.conf\fR.
.sp
.in +2
.nf
example# \fBipaddrsel -d\fR
example# \fBipaddrsel > /etc/inet/ipaddrsel.conf\fR
.fi
.in -2
.sp

.RE

.SH EXAMPLES
.LP
\fBExample 1\fR The Default Policy in \fB/etc/inet/ipaddrsel.conf\fR
.sp
.LP
The following example is the default policy that is located in
.BR /etc/inet/ipaddrsel.conf :

.sp
.in +2
.nf
# Prefix                            Precedence Label
::1/128                             50 Loopback
::/96                               20 IPv4_Compatible
::ffff:0.0.0.0/96                   10 IPv4
2002::/16                           30 6to4
::/0                                40 Default
.fi
.in -2
.sp

.LP
\fBExample 2\fR Assigning a Lower Precedence to Link-local and Site-local
Addresses
.sp
.LP
By default, the destination address ordering rules sort addresses of
smaller scope before those of larger scope. For example, if a name resolves
to a global and a site-local address, the site local address would be
ordered before the global address. An administrator can override this
ordering rule by assigning a lower precedence to addresses of smaller scope,
as the following table demonstrates.

.sp
.in +2
.nf
# Prefix                             Precedence Label
::1/128                              50 Loopback
::/0                                 40 Default
2002::/16                            30 6to4
fec0::/10                            27 Site-Local
fe80::/10                            23 Link-Local
::/96                                20 IPv4_Compatible
::ffff:0.0.0.0/96                    10 IPv4
.fi
.in -2
.sp

.LP
\fBExample 3\fR Assigning Higher Precedence to IPv4 Destinations
.sp
.LP
By default, IPv6 addresses are ordered in front of IPv4 addresses in name
lookups. \fB::ffff:0.0.0.0/96\fR has the lowest precedence in the default
table. In the following example, IPv4 addresses are assigned higher
precedence and are ordered in front of IPv6 destinations:

.sp
.in +2
.nf
# Prefix                             Precedence Label
::1/128                              50 Loopback
::/0                                 40 Default
2002::/16                            30 6to4
::/96                                20 IPv4_Compatible
::ffff:0.0.0.0/96                    60 IPv4
.fi
.in -2
.sp

.LP
\fBExample 4\fR Ensuring that a Particular Source Address is Used
.sp
.LP
This example ensures that a particular source address is used only when
communicating with destinations in a particular network.

.sp
.LP
The following policy table assigns a label of 5 to a particular source
address on the local system,
.BR 2001:1111:1111::1 .
The table assigns the
same label to a network,
.BR 2001:2222:2222::/48 .
The result of this
policy is that the
.B 2001:1111:1111::1
source address will only be used
when communicating with destinations contained in the
\fB2001:2222:2222::/48\fR network. For this example, this network is the
.BR ClientNet ,
which could represent a particular client's network.

.sp
.in +2
.nf
# Prefix                              Precedence Label
::1/128                               50 Loopback
2001:1111:1111::1/128                 40 ClientNet
2001:2222:2222::/48                   40 ClientNet
::/0                                  40 Default
2002::/16                             30 6to4
::/96                                 20 IPv4_Compatible
::ffff:0.0.0.0/96                     10 IPv4
.fi
.in -2
.sp

.sp
.LP
This example assumes that the local system has one physical interface, and
that all global prefixes are assigned to that physical interface.

.SH EXIT STATUS
.sp
.LP
\fBipaddrsel\fR returns the following exit values:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 6n
.rt
\fBipaddrsel\fR successfully completed.
.RE

.sp
.ne 2
.mk
.na
\fB>\fB0\fR
.ad
.RS 6n
.rt
An error occurred. If a failure is encountered, the kernel's current policy
table is unchanged.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
\fB/etc/inet/ipaddrsel.conf\fR
.ad
.RS 28n
.rt
The file that contains the IPv6 default address selection policy to be
installed at boot time. This file is loaded before any Internet services are
started.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
_
Interface StabilityEvolving
.TE

.SH SEE ALSO
.sp
.LP
.BR nscd (1M),
.BR inet (3SOCKET),
.BR getaddrinfo (3SOCKET),
.BR ipaddrsel.conf (4),
.BR attributes (5),
.BR inet6 (7P)
.SH NOTES
.sp
.LP
The ipnodes cache kept by
.BR nscd "(1M) contains addresses that are"
ordered using the destination address ordering algorithm, which is one of
the reasons why
.B ipaddrsel
is called before
.B nscd
in the boot
sequence. If
.B ipaddrsel
is used to change the address selection policy
after
.B nscd
has started, you should invalidate the
.B nscd
ipnodes
cache invalidated by invoking the following command:
.sp
.in +2
.nf
example# \fB/usr/sbin/nscd -i ipnodes\fR
.fi
.in -2
.sp

