usr/src/man/man1m/ipmpstat.1m
'\" te
.\" Copyright (c) 2009, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ipmpstat 1M "10 Feb 2009" "SunOS 5.11" "System Administration Commands"
.SH NAME
ipmpstat \- display IPMP subsystem status
.SH SYNOPSIS
.LP
.nf
\fBipmpstat\fR [\fB-n\fR] [\fB-o\fR \fIfield\fR[,.\|.\|.] [\fB-P\fR]] \fB-a\fR|\fB-g\fR|\fB-i\fR|\fB-p\fR|\fB-t\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B ipmpstat
command concisely displays information about the IPMP
subsystem. It supports five different output modes, each of which provides a
different view of the IPMP subsystem (address, group, interface, probe, and
target), described below. At most one output mode may be specified per
invocation, and the displayed information is guaranteed to be self-consistent.
It also provides a parseable output format which may be used by scripts to
examine the state of the IPMP subsystem. Only basic privileges are needed to
invoke
.BR ipmpstat ,
with the exception of probe mode which requires all
privileges.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -a
.ad
.sp .6
.RS 4n
Display IPMP data address information ("address" output mode).
.RE

.sp
.ne 2
.mk
.na
.B -g
.ad
.sp .6
.RS 4n
Display IPMP group information ("group" output mode).
.RE

.sp
.ne 2
.mk
.na
.B -i
.ad
.sp .6
.RS 4n
Display IP interface information ("interface" output mode).
.RE

.sp
.ne 2
.mk
.na
.B -n
.ad
.sp .6
.RS 4n
Display IP addresses numerically, rather than attempting to resolve them to
hostnames. This option may be used in any output mode.
.RE

.sp
.ne 2
.mk
.na
\fB-o\fR \fIfield\fR[,.\|.\|.]\fR
.ad
.sp .6
.RS 4n
Display only the specified output fields, in order. The list of field names
is case-insensitive and comma-separated. The field names that are supported
depend on the selected output mode, described below. The special field name
.B all
may be used to display all fields for a given output mode.
.RE

.sp
.ne 2
.mk
.na
.B -p
.ad
.sp .6
.RS 4n
Display IPMP probe information ("probe" output mode).
.RE

.sp
.ne 2
.mk
.na
.B -t
.ad
.sp .6
.RS 4n
Display IPMP target information ("target" output mode).
.RE

.sp
.ne 2
.mk
.na
.B -P
.ad
.sp .6
.RS 4n
Display using a machine-parseable format, described below. If this option is
specified, an explicit list of fields must be specified using the \fB-o\fR
option.
.RE

.SH OUTPUT MODES
.sp
.LP
The
.B ipmpstat
utility supports the output modes listed below. Note that
these modes map to some of the options described above.
.sp
.ne 2
.mk
.na
.B Address Mode
.ad
.sp .6
.RS 4n
Address mode displays the state of all IPMP data addresses on the system. The
following output fields are supported:
.sp
.ne 2
.mk
.na
.B ADDRESS
.ad
.sp .6
.RS 4n
The hostname (or IP address) associated with the information. Note that
because duplicate down addresses may exist, the address must be taken together
with the
.B GROUP
to form a unique identity. For a given IPMP group, if
duplicate addresses exist, at most one will be displayed, and an up address
will always take precedence.
.RE

.sp
.ne 2
.mk
.na
.B STATE
.ad
.sp .6
.RS 4n
The state of the address. Either
.B up
if the address is
.B IFF_UP
(see
.BR ifconfig (1M)),
or
.B down
if the address is not
.BR IFF_UP .
.RE

.sp
.ne 2
.mk
.na
.B GROUP
.ad
.sp .6
.RS 4n
The IPMP IP interface hosting the address.
.RE

.sp
.ne 2
.mk
.na
.B INBOUND
.ad
.sp .6
.RS 4n
The underlying IP interface that will receive packets for this address. This
may change in response to external events such as IP interface failure. If
this field is empty, then the system will not accept IP packets sent to this
address (for example, because the address is down or because there are no
active IP interfaces left in the IPMP group).
.RE

.sp
.ne 2
.mk
.na
.B OUTBOUND
.ad
.sp .6
.RS 4n
The underlying IP interfaces that will send packets using this source
address. This may change in response to external events such as IP interface
failure. If this field is empty, then the system will not send packets with
this address as a source (for example, because the address is down or because
there are no active IP interfaces left in the IPMP group).
.RE

If
.B -o
is not specified, all output fields are displayed.
.RE

.sp
.ne 2
.mk
.na
.B Group Mode
.ad
.sp .6
.RS 4n
Group mode displays the state of all IPMP groups on the system. The following
output fields are supported:
.sp
.ne 2
.mk
.na
.B GROUP
.ad
.sp .6
.RS 4n
The IPMP IP interface name associated with the information. For the anonymous
group (see \fBin.mpathd\fR(1M)), this field will be empty.
.RE

.sp
.ne 2
.mk
.na
.B GROUPNAME
.ad
.sp .6
.RS 4n
The IPMP group name. For the anonymous group, this field will be empty.
.RE

.sp
.ne 2
.mk
.na
.B STATE
.ad
.sp .6
.RS 4n
The state of the group:
.sp
.ne 2
.mk
.na
.B ok
.ad
.RS 12n
.rt
All interfaces in the group are usable.
.RE

.sp
.ne 2
.mk
.na
.B degraded
.ad
.RS 12n
.rt
Some (but not all) interfaces in the group are usable.
.RE

.sp
.ne 2
.mk
.na
.B failed
.ad
.RS 12n
.rt
No interfaces in the group are usable.
.RE

.RE

.sp
.ne 2
.mk
.na
.B FDT
.ad
.sp .6
.RS 4n
The probe-based failure detection time. If probe-based failure detection is
disabled, this field will be empty.
.RE

.sp
.ne 2
.mk
.na
.B INTERFACES
.ad
.sp .6
.RS 4n
The list of underlying IP interfaces in the group. The list is divided into
three parts:
.RS +4
.TP
1.
Active interfaces are listed first and not enclosed in any brackets or
parenthesis. Active interfaces are those being used by the system to send or
receive data traffic.
.RE
.RS +4
.TP
2.
.B INACTIVE
interfaces are listed next and enclosed in parenthesis.
.B INACTIVE
interfaces are those that are functioning, but not being used
according to administrative policy.
.RE
.RS +4
.TP
3.
Unusable interfaces are listed last and enclosed in brackets. Unusable
interfaces are those that cannot be used at all in their present configuration
(for example,
.B FAILED
or
.BR OFFLINE ).
.RE
.RE

If
.B -o
is not specified, all output fields are displayed.
.RE

.sp
.ne 2
.mk
.na
.B Interface Mode
.ad
.sp .6
.RS 4n
Interface mode displays the state of all IP interfaces that are tracked by
.B in.mpathd
on the system. The following output fields are supported:
.sp
.ne 2
.mk
.na
.B INTERFACE
.ad
.sp .6
.RS 4n
The IP interface name associated with the information.
.RE

.sp
.ne 2
.mk
.na
.B ACTIVE
.ad
.sp .6
.RS 4n
Either
.B yes
or
.BR no ,
depending on whether the IP interface is being
used by the system for IP data traffic.
.RE

.sp
.ne 2
.mk
.na
.B GROUP
.ad
.sp .6
.RS 4n
The IPMP IP interface associated with the IP interface. For IP interfaces in
the anonymous group (see \fBin.mpathd\fR(1M)), this field will be empty.
.RE

.sp
.ne 2
.mk
.na
.B FLAGS
.ad
.sp .6
.RS 4n
Assorted information about the IP interface:
.sp
.ne 2
.mk
.na
.B i
.ad
.RS 5n
.rt
Unusable due to being
.BR INACTIVE .
.RE

.sp
.ne 2
.mk
.na
.B s
.ad
.RS 5n
.rt
Marked
.BR STANDBY .
.RE

.sp
.ne 2
.mk
.na
.B m
.ad
.RS 5n
.rt
Nominated to send/receive IPv4 multicast for its IPMP group.
.RE

.sp
.ne 2
.mk
.na
.B b
.ad
.RS 5n
.rt
Nominated to send/receive IPv4 broadcast for its IPMP group.
.RE

.sp
.ne 2
.mk
.na
.B M
.ad
.RS 5n
.rt
Nominated to send/receive IPv6 multicast for its IPMP group.
.RE

.sp
.ne 2
.mk
.na
.B d
.ad
.RS 5n
.rt
Unusable due to being
.BR down .
.RE

.sp
.ne 2
.mk
.na
.B h
.ad
.RS 5n
.rt
Unusable due to being brought
.B OFFLINE
by
.B in.mpathd
because of a
duplicate hardware address.
.RE

.RE

.sp
.ne 2
.mk
.na
.B LINK
.ad
.sp .6
.RS 4n
The state of link-based failure detection:
.sp
.ne 2
.mk
.na
.B up
.ad
.sp .6
.RS 4n
The link is up.
.RE

.sp
.ne 2
.mk
.na
.B down
.ad
.sp .6
.RS 4n
The link is down.
.RE

.sp
.ne 2
.mk
.na
.B unknown
.ad
.sp .6
.RS 4n
The network driver does not report link state changes.
.RE

.RE

.sp
.ne 2
.mk
.na
.B PROBE
.ad
.sp .6
.RS 4n
The state of probe-based failure detection:
.sp
.ne 2
.mk
.na
.B ok
.ad
.sp .6
.RS 4n
Probes detect no problems.
.RE

.sp
.ne 2
.mk
.na
.B failed
.ad
.sp .6
.RS 4n
Probes detect failure.
.RE

.sp
.ne 2
.mk
.na
.B unknown
.ad
.sp .6
.RS 4n
Probes cannot be sent since no suitable probe targets are known.
.RE

.sp
.ne 2
.mk
.na
.B disabled
.ad
.sp .6
.RS 4n
Probes have been disabled because a unique IP test address has not been
configured.
.RE

.RE

.sp
.ne 2
.mk
.na
.B STATE
.ad
.sp .6
.RS 4n
The overall state of the interface:
.sp
.ne 2
.mk
.na
.B ok
.ad
.sp .6
.RS 4n
The interface is online and functioning properly based on the configured
failure detection methods.
.RE

.sp
.ne 2
.mk
.na
.B failed
.ad
.sp .6
.RS 4n
The interface is online but has a link state of
.B down
or a probe state
of
.BR failed .
.RE

.sp
.ne 2
.mk
.na
.B offline
.ad
.sp .6
.RS 4n
The interface is offline.
.RE

.sp
.ne 2
.mk
.na
.B unknown
.ad
.sp .6
.RS 4n
The interface is online but may or may not be functioning because the
configured failure detection methods are in
.B unknown
states.
.RE

.RE

If
.B -o
is not specified, all output fields are displayed.
.RE

.sp
.ne 2
.mk
.na
.B Probe Mode
.ad
.sp .6
.RS 4n
Probe mode displays information about the probes being sent by
.BR in.mpathd .
Unlike other output modes, this mode runs until explicitly
terminated using
.BR Ctrl-C .
The following output fields are supported:
.sp
.ne 2
.mk
.na
.B TIME
.ad
.sp .6
.RS 4n
The time the probe was sent, relative to when
.B ipmpstat
was started. If
the probe was sent prior to starting
.BR ipmpstat ,
the time will be
negative.
.RE

.sp
.ne 2
.mk
.na
.B PROBE
.ad
.sp .6
.RS 4n
An identifier representing the probe. The identifier will start at zero and
will monotonically increment for each probe sent by
.B in.mpathd
over a
given interface. To enable more detailed analysis by packet monitoring tools,
this identifier matches the
.B icmp_seq
field of the ICMP probe packet.
.RE

.sp
.ne 2
.mk
.na
.B INTERFACE
.ad
.sp .6
.RS 4n
The IP interface the probe was sent on.
.RE

.sp
.ne 2
.mk
.na
.B TARGET
.ad
.sp .6
.RS 4n
The hostname (or IP address) of the target the probe was sent to.
.RE

.sp
.ne 2
.mk
.na
.B NETRTT
.ad
.sp .6
.RS 4n
The network round-trip-time for the probe. This is the time between when the
IP module sends the probe and when the IP module receives the acknowledgment.
If
.B in.mpathd
has concluded that the probe has been lost, this field will
be empty.
.RE

.sp
.ne 2
.mk
.na
.B RTT
.ad
.sp .6
.RS 4n
The total round-trip-time for the probe. This is the time between when
.B in.mpathd
starts executing the code to send the probe, and when it
completes processing the
.BR ack .
If
.B in.mpathd
has concluded that the
probe has been lost, this field will be empty. Spikes in the total round-trip
time that are not present in the network round-trip time indicate that the
local system itself is overloaded.
.RE

.sp
.ne 2
.mk
.na
.B RTTAVG
.ad
.sp .6
.RS 4n
The average round-trip-time to
.B TARGET
over
.BR INTERFACE .
This aids
identification of slow targets. If there is insufficient data to calculate the
average, this field will be empty.
.RE

.sp
.ne 2
.mk
.na
.B RTTDEV
.ad
.sp .6
.RS 4n
The standard deviation for the round-trip-time to
.B TARGET
over
.BR INTERFACE .
This aids identification of jittery targets. If there is
insufficient data to calculate the standard deviation, this field will be
empty.
.RE

If
.B -o
is not specified, all fields except for
.B RTTAVG
and
.B RTTDEV
are displayed.
.RE

.sp
.ne 2
.mk
.na
.B Target Mode
.ad
.sp .6
.RS 4n
Target mode displays IPMP probe target information. The following output
fields are supported:
.sp
.ne 2
.mk
.na
.B INTERFACE
.ad
.sp .6
.RS 4n
The IP interface name associated with the information.
.RE

.sp
.ne 2
.mk
.na
.B MODE
.ad
.sp .6
.RS 4n
The probe target discovery mode:
.sp
.ne 2
.mk
.na
.B routes
.ad
.RS 13n
.rt
Probe targets found by means of the routing table.
.RE

.sp
.ne 2
.mk
.na
.B multicast
.ad
.RS 13n
.rt
Probe targets found by means of multicast ICMP probes.
.RE

.sp
.ne 2
.mk
.na
.B disabled
.ad
.RS 13n
.rt
Probe-based failure detection is disabled.
.RE

.RE

.sp
.ne 2
.mk
.na
.B TESTADDR
.ad
.sp .6
.RS 4n
The hostname (or IP address) that will be used for sending and receiving
probes. If a unique test address has not been configured, this field will be
empty. Note that if an IP interface is configured with both IPv4 and IPv6 test
addresses, probe target information will be displayed separately for each test
address.
.RE

.sp
.ne 2
.mk
.na
.B TARGETS
.ad
.sp .6
.RS 4n
A space-separated list of probe target hostnames (or IP addresses), in firing
order. If no probe targets could be found, this field will be empty.
.RE

If
.B -o
is not specified, all output fields are displayed.
.RE

.SH OUTPUT FORMAT
.sp
.LP
By default,
.B ipmpstat
uses a human-friendly tabular format for its
output modes, where each row contains one or more fields of information about
a given object, which is in turn uniquely identified by one or more of those
fields. In this format, a header identifying the fields is displayed above the
table (and after each screenful of information), fields are separated by
whitespace, empty fields are represented by
.B --
(double hyphens), and
other visual aids are used. If the value for a field cannot be determined, its
value will be displayed as "\fB?\fR" and a diagnostic message will be output
to standard error.
.sp
.LP
Machine-parseable format also uses a tabular format, but is designed to be
efficient to programmatically parse. Specifically, machine-parseable format
differs from human-friendly format in the following ways:
.RS +4
.TP
.ie t \(bu
.el o
No headers are displayed.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Fields with empty values yield no output, rather than showing
.BR -- .
.RE
.RS +4
.TP
.ie t \(bu
.el o
Fields are separated by a single colon
.RB ( : ),
rather than variable
amounts of whitespace.
.RE
.RS +4
.TP
.ie t \(bu
.el o
If multiple fields are requested, and a literal
.B :
or a backslash
(\fB\e\fR) occur in a field's value, they are escaped by prefixing them with
.BR \e \&.
.RE
.SH EXAMPLES
.LP
.B Example 1
Obtaining Failure Detection Time of a Specific Interface
.sp
.LP
The following code uses the machine-parseable output format to create a
.B ksh
function that outputs the failure detection time of a given IPMP IP
interface:

.sp
.in +2
.nf
     getfdt() {
         ipmpstat -gP -o group,fdt | while IFS=: read group fdt; do
             [[ "$group" = "$1" ]] && { echo "$fdt"; return; }
         done
     }
.fi
.in -2
.sp

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp
.LP
.BR /usr/sbin/ipmpstat :
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
_
Interface StabilityCommitted
_
Machine-Parseable FormatCommitted
_
Human-Friendly FormatNot-an-Interface
.TE

.sp
.LP
.B /sbin/ipmpstat
is not a Committed interface.
.SH SEE ALSO
.sp
.LP
.BR if_mpadm (1M),
.BR ifconfig (1M),
.BR in.mpathd (1M),
.BR attributes (5)
