usr/src/man/man1m/ipnat.1m
'\" te
.\" To view license terms, attribution, and copyright for IP Filter,
.\" the default path is /usr/lib/ipf/IPFILTER.LICENCE.
.\" If the Solaris operating environment has been installed anywhere
.\" other than the default, modify the given path to access the file
.\" at the installed location.
.\" Portions Copyright (c) 2008, Sun Microsystems Inc. All Rights Reserved.
.TH ipnat 1M "3 Apr 2008" "SunOS 5.11" "System Administration Commands"
.SH NAME
ipnat \- user interface to the NAT subsystem
.SH SYNOPSIS
.LP
.nf
\fBipnat\fR [\fB-CdFhlnRrsv\fR] \fB-f\fR \fIfilename\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B ipnat
utility opens a specified file (treating
.B -
as stdin)
and parses it for a set of rules that are to be added or removed from the IP
NAT.
.sp
.LP
If there are no parsing problems, each rule processed by
.B ipnat
is
added to the kernel's internal lists. Rules are appended to the internal
lists, matching the order in which they appear when given to
.BR ipnat .
.sp
.LP
\fBipnat\fR's use is restricted through access to
.BR /dev/ipauth ,
.BR /dev/ipl ,
and
.BR /dev/ipstate .
The default permissions of these
files require
.B ipnat
to be run as root for all operations.
.sp
.LP
\fBipnat\fR's use is restricted through access to
.BR /dev/ipnat .
The
default permissions of
.B /dev/ipnat
require
.B ipnat
to be run as
root for all operations.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -C
.ad
.RS 15n
.rt
Delete all entries in the current NAT rule listing (NAT rules).
.RE

.sp
.ne 2
.mk
.na
.B -d
.ad
.RS 15n
.rt
Turn debug mode on. Causes a hex dump of filter rules to be generated as it
processes each one.
.RE

.sp
.ne 2
.mk
.na
.B -F
.ad
.RS 15n
.rt
Delete all active entries in the current NAT translation table (currently
active NAT mappings).
.RE

.sp
.ne 2
.mk
.na
\fB-f\fR \fIfilename\fR
.ad
.RS 15n
.rt
Parse specified file for rules to be added or removed from the IP NAT.
\fIfilename\fR can be stdin.
.RE

.sp
.ne 2
.mk
.na
.B -h
.ad
.RS 15n
.rt
Print number of hits for each MAP/Redirect filter.
.RE

.sp
.ne 2
.mk
.na
.B -l
.ad
.RS 15n
.rt
Show the list of current NAT table entry mappings.
.RE

.sp
.ne 2
.mk
.na
.B -n
.ad
.RS 15n
.rt
Prevents \fBipf\fR from doing anything, such as making ioctl calls, which
might alter the currently running kernel.
.RE

.sp
.ne 2
.mk
.na
.B -R
.ad
.RS 15n
.rt
Disable both IP address-to-hostname resolution and port number-to-service
name resolution.
.RE

.sp
.ne 2
.mk
.na
.B -r
.ad
.RS 15n
.rt
Remove matching NAT rules rather than add them to the internal lists.
.RE

.sp
.ne 2
.mk
.na
.B -s
.ad
.RS 15n
.rt
Retrieve and display NAT statistics.
.RE

.sp
.ne 2
.mk
.na
.B -v
.ad
.RS 15n
.rt
Turn verbose mode on. Displays information relating to rule processing and
active rules/table entries.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B /dev/ipnat
.ad
.sp .6
.RS 4n
Link to IP Filter pseudo device.
.RE

.sp
.ne 2
.mk
.na
.B /dev/kmem
.ad
.sp .6
.RS 4n
Special file that provides access to virtual address space.
.RE

.sp
.ne 2
.mk
.na
\fB/etc/ipf/ipnat.conf\fR
.ad
.sp .6
.RS 4n
Location of
.B ipnat
startup configuration file.
.RE

.sp
.ne 2
.mk
.na
\fB/usr/share/ipfilter/examples/\fR
.ad
.sp .6
.RS 4n
Contains numerous IP Filter examples.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWipfu
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBipf\fR(1M), \fBipfstat\fR(1M),
.BR ipnat (4),
.BR attributes (5)
