usr/src/man/man1m/ippool.1m
'\" te
.\" To view license terms, attribution, and copyright for IP Filter,
.\" the default path is /usr/lib/ipf/IPFILTER.LICENCE.
.\" If the Solaris operating environment has been installed anywhere
.\" other than the default, modify the given path to access the file
.\" at the installed location.
.\" Portions Copyright (c) 2008, Sun Microsystems Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.TH ippool 1M "3 Apr 2008" "SunOS 5.11" "System Administration Commands"
.SH NAME
ippool \- user interface to the IP Filter pools
.SH SYNOPSIS
.LP
.nf
\fBippool\fR \fB-a\fR [\fB-dnv\fR] [\fB-m\fR \fIpoolname\fR] [\fB-o\fR \fIrole\fR] \fB-i\fR \fIipaddr\fR
     [/\fInetmask\fR]
.fi

.LP
.nf
\fBippool\fR \fB-A\fR [\fB-dnv\fR] [\fB-m\fR \fIpoolname\fR] [\fB-o\fR \fIrole\fR] [\fB-S\fR \fIseed\fR]
     [\fB-t\fR \fItype\fR]
.fi

.LP
.nf
\fBippool\fR \fB-f\fR \fIfile\fR [\fB-dnuv\fR]
.fi

.LP
.nf
\fBippool\fR \fB-F\fR [\fB-dv\fR] [\fB-o\fR \fIrole\fR] [\fB-t\fR \fItype\fR]
.fi

.LP
.nf
\fBippool\fR \fB-h\fR [\fB-dv\fR] [\fB-m\fR \fIpoolname\fR] [\fB-t\fR \fItype\fR]
.fi

.LP
.nf
\fBippool\fR \fB-l\fR [\fB-dv\fR] [\fB-m\fR \fIpoolname\fR] [\fB-t\fR \fItype\fR]
.fi

.LP
.nf
\fBippool\fR \fB-r\fR [\fB-dnv\fR] [\fB-m\fR \fIpoolname\fR] [\fB-o\fR \fIrole\fR] \fB-i\fR \fIipaddr\fR
     [/\fInetmask\fR]
.fi

.LP
.nf
\fBippool\fR \fB-R\fR [\fB-dnv\fR] [\fB-m\fR \fIpoolname\fR] [\fB-o\fR \fIrole\fR] [\fB-t\fR \fItype\fR]
.fi

.LP
.nf
\fBippool\fR \fB-s\fR [\fB-dtv\fR] [\fB-M\fR \fIcore\fR] [\fB-N\fR \fInamelist\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The
.B ippool
utility is used to manage information stored in the IP
pools subsystem of IP Filter software. Configuration file information can be
parsed and loaded into the kernel and currently configured pools can be
removed, changed, or inspected.
.sp
.LP
.BR ippool 's
use is restricted through access to
.BR /dev/ippool .
The
default permissions of
.B /dev/ippool
require
.B ippool
to be run as
root for all operations.
.sp
.LP
The command line options used are divided into two sections: the global
options and the instance-specific options.
.sp
.LP
.BR ippool 's
use is restricted through access to
.BR /dev/ipauth ,
.BR /dev/ipl ,
and
.BR /dev/ipstate .
The default permissions of these
files require
.B ippool
to be run as root for all operations.
.SH OPTIONS
.sp
.LP
.B ippool
supports the option categories described below.
.SS "Global Options"
.sp
.LP
The following global options are supported:
.sp
.ne 2
.mk
.na
.B -d
.ad
.RS 6n
.rt
Toggle debugging of processing the configuration file.
.RE

.sp
.ne 2
.mk
.na
.B -n
.ad
.RS 6n
.rt
Prevents
.B ippool
from doing anything, such as making ioctl calls, that
would alter the currently running kernel.
.RE

.sp
.ne 2
.mk
.na
.B -v
.ad
.RS 6n
.rt
Turn verbose mode on.
.RE

.SS "Instance-Specific Options"
.sp
.LP
The following instance-specific options are supported:
.sp
.ne 2
.mk
.na
.B -a
.ad
.RS 11n
.rt
Add a new data node to an existing pool in the kernel.
.RE

.sp
.ne 2
.mk
.na
.B -A
.ad
.RS 11n
.rt
Add a new (empty) pool to the kernel.
.RE

.sp
.ne 2
.mk
.na
.B -f
.I file
.ad
.RS 11n
.rt
Read in IP pool configuration information from
.I file
and load it into
the kernel.
.RE

.sp
.ne 2
.mk
.na
.B -F
.ad
.RS 11n
.rt
Flush loaded pools from the kernel.
.RE

.sp
.ne 2
.mk
.na
.B -h
.ad
.RS 11n
.rt
Display a list of pools of the type: hash loaded in the kernel.
.RE

.sp
.ne 2
.mk
.na
.B -l
.ad
.RS 11n
.rt
Display a list of pools of the type: tree loaded in the kernel.
.RE

.sp
.ne 2
.mk
.na
.B -r
.ad
.RS 11n
.rt
Remove an existing data node from a pool in the kernel.
.RE

.sp
.ne 2
.mk
.na
.B -R
.ad
.RS 11n
.rt
Remove an existing pool from within the kernel.
.RE

.sp
.ne 2
.mk
.na
.B -s
.ad
.RS 11n
.rt
Display IP pool statistical information.
.RE

.SS "Other Options"
.sp
.LP
The following, additional options are supported:
.sp
.ne 2
.mk
.na
\fB-i\fR \fIipaddr\fR[/\fInetmask\fR]\fR
.ad
.RS 23n
.rt
Sets the IP address for the operation being undertaken with an all-one's
mask or, optionally, a specific netmask, given in either dotted-quad
notation or as a single integer.
.RE

.sp
.ne 2
.mk
.na
.B -m
.I poolname
.ad
.RS 23n
.rt
Sets the pool name for the current operation.
.RE

.sp
.ne 2
.mk
.na
.B -M
.I core
.ad
.RS 23n
.rt
Specify an alternative path to
.B /dev/kmem
from which to retrieve
statistical information.
.RE

.sp
.ne 2
.mk
.na
.B -N
.I namelist
.ad
.RS 23n
.rt
Specify an alternative path to lookup symbol name information when
retrieving statistical information.
.RE

.sp
.ne 2
.mk
.na
.B -o
.I role
.ad
.RS 23n
.rt
Sets the role with which this pool is to be used. Currently only
.BR ipf ,
.BR auth ,
and
.B count
are accepted as arguments to this option.
.RE

.sp
.ne 2
.mk
.na
.B -S
.I seed
.ad
.RS 23n
.rt
Sets the hashing seed to the number specified. For use with hash-type pools
only.
.RE

.sp
.ne 2
.mk
.na
.B -t
.I type
.ad
.RS 23n
.rt
Sets the type of pool being defined. Must be one of
.BR pool ,
.BR hash ,
or
.BR group-map .
.RE

.sp
.ne 2
.mk
.na
.B -u
.ad
.RS 23n
.rt
When parsing a configuration file, rather than load new pool data into the
kernel, unload it.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B /dev/ippool
.ad
.RS 24n
.rt
Link to IP Filter pseudo device.
.RE

.sp
.ne 2
.mk
.na
.B /dev/kmem
.ad
.RS 24n
.rt
Special file that provides access to virtual address space.
.RE

.sp
.ne 2
.mk
.na
.B /etc/ipf/ippool.conf
.ad
.RS 24n
.rt
Location of
.B ippool
startup configuration file.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWipfu
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
.BR ipf (1M),
.BR ipfstat (1M),
.BR ippool (4),
.BR attributes (5)
