usr/src/man/man1m/iscsiadm.1m
'\" te
.\" Copyright (c) 2008, Sun Microsystems, Inc. All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH iscsiadm 1M "16 Jul 2009" "SunOS 5.11" "System Administration Commands"
.SH NAME
iscsiadm \- enable management of iSCSI initiators
.SH SYNOPSIS
.LP
.nf
\fBiscsiadm\fR \fIsubcommand\fR \fIdirect-object\fR [\fIoptions\fR] [\fIoperand\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The \fBiscsiadm\fR command enables management of the iSCSI (Internet SCSI)
initiator on a host. \fBiscsiadm\fR is implemented as a set of subcommands,
many with their own options, which are described in the section for that
subcommand. Options not associated with a particular subcommand are
described under OPTIONS.
.sp
.LP
\fBiscsiadm\fR works only when the following service is online:
.sp
.in +2
.nf
svc:/network/iscsi/initiator:default
.fi
.in -2
.sp

.sp
.LP
The \fBiscsiadm\fR command supports the following subcommands, which are
described in detail in subsections that follow:
.sp
.ne 2
.mk
.na
\fBadd\fR
.ad
.RS 10n
.rt
Adds element(s) to an object.
.RE

.sp
.ne 2
.mk
.na
\fBlist\fR
.ad
.RS 10n
.rt
Lists element(s) of an object.
.RE

.sp
.ne 2
.mk
.na
\fBmodify\fR
.ad
.RS 10n
.rt
Modifies attributes of an object.
.RE

.sp
.ne 2
.mk
.na
\fBremove\fR
.ad
.RS 10n
.rt
Removes an element from an object.
.RE

.sp
.LP
The \fBiscsiadm\fR subcommands operate on a \fIdirect-object\fR. These are
described in the section for each subcommand.
.sp
.LP
The \fBiscsiadm\fR command supports the Internet Storage Name Service
(iSNS) for the discovery of iSCSI targets. The command supports the
Challenge Handshake Authentication Protocol (CHAP) for authentication.
.SS "\fBadd\fR Subcommand"
.sp
.LP
The syntax for the \fBadd\fR subcommand is:
.sp
.in +2
.nf
# iscsiadm add \fIdirect_object\fR [\fIoperands\fR...]
.fi
.in -2

.sp
.LP
The \fBadd\fR subcommand adds the following \fIdirect_object\fRs:
.sp
.ne 2
.mk
.na
\fBdiscovery-address\fR \fIdiscovery-address\fR [...]\fR
.ad
.sp .6
.RS 4n
Adds a target to a list of discovery addresses. A discovery address (as in
the syntax shown below) is an IP \fIaddress\fR:\fIport\fR combination used
in a SendTargets discovery session. Using this discovery approach, a target
device can inform an initiator of the target address and target name of each
target exposed by that device. Connection to a target is not attempted
unless the SendTargets method of discovery has been enabled on the host. You
enable this method with the \fBmodify\fR subcommand.
.sp
The \fIdiscovery-address\fR parameter is formatted as:
.sp
.in +2
.nf
<\fIIP address\fR>[:\fIport\fR]
.fi
.in -2

If \fIport\fR is not specified, the default of 3260 will be used.
.RE

.sp
.ne 2
.mk
.na
\fBisns-server\fR \fIisns-server\fR [...]\fR
.ad
.sp .6
.RS 4n
Add an iSNS server to the list of iSNS server addresses. An iSNS server
address (specified in the syntax shown below) is an IP address-port
combination used in an iSNS discovery session. By using iSNS discovery, an
iSNS server can provide an initiator with information about a portal and the
name of each target that belongs to the same discovery domain as that of the
initiator. Connection to the iSNS server is not attempted unless the iSNS
method of discovery has been enabled on the host. You enable this method
with the \fBmodify\fR subcommand, described below.
.sp
The \fIisns-server\fR parameter is formatted as:
.sp
.in +2
.nf
\fIIP_address\fR[:\fIport\fR]
.fi
.in -2

If a port is not specified, the default of 3205 is used.
.RE

.sp
.ne 2
.mk
.na
\fBstatic-config\fR \fIstatic_target\fR [...]\fR
.ad
.sp .6
.RS 4n
Adds a target to the list of statically configured targets. A connection to
the target will not be attempted unless the static configuration method of
discovery has been enabled.
.sp
The \fIstatic_target\fR parameter is formatted as:
.sp
.in +2
.nf
\fI<target-name>\fR,\fI<target address>\fR[:\fIport-number\fR][,\fItpgt\fR]
.fi
.in -2

\fI<target-name>\fR can be up to 223 characters.
.RE

.SS "\fBlist\fR Subcommand"
.sp
.LP
The syntax for the \fBlist\fR subcommand is:
.sp
.in +2
.nf
# iscsiadm list \fIdirect-object\fR [\fIoptions\fR]
.fi
.in -2

.sp
.LP
The \fBlist\fR subcommand displays data for the following
\fIdirect-object\fRs:
.sp
.ne 2
.mk
.na
\fBdiscovery\fR
.ad
.sp .6
.RS 4n
Lists the discovery methods and their current activation state, enabled or
disabled. Discovery methods are:
.RS +4
.TP
.ie t \(bu
.el o
iSNS (Internet Storage Name Service)
.RE
.RS +4
.TP
.ie t \(bu
.el o
Static
.RE
.RS +4
.TP
.ie t \(bu
.el o
SendTargets
.RE
.RE

.sp
.ne 2
.mk
.na
\fBinitiator-node\fR
.ad
.sp .6
.RS 4n
Lists information for the initiator node on the host. The iSCSI initiator
node represents a logical HBA and is a logical host connection point for
iSCSI targets. The parameter values listed in the response are default
parameter settings for the initiator. Each connected target for an initiator
can have parameter values that differ from the parameter values on the
initiator node.
.RE

.sp
.ne 2
.mk
.na
\fBstatic-config\fR [\fIstatic_target\fR[, ...]]\fR
.ad
.sp .6
.RS 4n
Lists the target name and address for specified targets or, if no static
targets are specified, all statically discovered targets.
.RE

.sp
.ne 2
.mk
.na
\fBtarget\fR [\fB-S\fR] [\fB-v\fR] [\fItarget\fR[, ...]]\fR
.ad
.sp .6
.RS 4n
Lists a target's current parameters, connection state, and which method was
used for the target's discovery. Reports information for specified targets
or, if no targets are specified, all targets that have been discovered or
have had parameters modified by the \fBmodify target\fR subcommand.
.sp
When used with the \fB-S\fR option for a specified target, this subcommand
returns:
.RS +4
.TP
.ie t \(bu
.el o
target name
.RE
.RS +4
.TP
.ie t \(bu
.el o
logical unit number
.RE
.RS +4
.TP
.ie t \(bu
.el o
vendor ID
.RE
.RS +4
.TP
.ie t \(bu
.el o
product ID
.RE
.RS +4
.TP
.ie t \(bu
.el o
OS device name (for example, \fB/dev/rdsk/c0t2d0s0\fR)
.RE
The \fB-v\fR options gives more details, such as the current login
parameters, the detailed connection information, and the discovery method
used to discover the target.
.sp
A return of \fBNA\fR as the discovery method parameter indicates that the
target was created with a \fBiscsiadm modify target-param\fR command and
does not exist as a discovered object. To remove such targets, use
\fBiscsiadm remove target-param\fR.
.RE

.sp
.ne 2
.mk
.na
\fBtarget-param\fR [\fB-v\fR] \fItarget\fR [...]\fR
.ad
.sp .6
.RS 4n
Lists a target's default and user-defined parameters.
.RE

.sp
.ne 2
.mk
.na
\fBdiscovery-address\fR [\fB-v\fR] [\fIdiscovery-address\fR[, ...]]\fR
.ad
.sp .6
.RS 4n
Lists the \fBdiscovery-address\fR objects that have been added using the
\fBiscsiadm add discovery-address\fR subcommand.
.sp
When used with the \fB-v\fR option, lists all known targets at a specified
\fIdiscovery-address\fR. The \fB-v\fR option returns one or more target
names along with zero or more target addresses and associated target portal
group tags (TPGT), if applicable.
.RE

.sp
.ne 2
.mk
.na
\fBisns-server\fR [\fB-v\fR] [\fIisns-server\fR[, ...]]\fR
.ad
.sp .6
.RS 4n
Lists the \fBisns-server\fR objects that have been added using the
\fBiscsiadm\fR \fBadd\fR \fBisns-server\fR subcommand.
.sp
When used with the \fB-v\fR option, this subcommand lists all known targets
at a specified \fBisns-server\fR address. The \fB-v\fR option returns one of
more target names along with zero or more target addresses and associated
target portal group tags, if applicable.
.RE

.SS "\fBmodify\fR Subcommand"
.sp
.LP
The syntax for the \fBmodify\fR subcommand is:
.sp
.in +2
.nf
# iscsiadm modify \fIdirect_object\fR [\fIoptions\fR]
.fi
.in -2

.sp
.LP
The \fBmodify\fR subcommand supports the following \fIdirect_object\fRs:
.sp
.ne 2
.mk
.na
\fBdiscovery\fR [\fIoptions\fR]\fR
.ad
.sp .6
.RS 4n
Enabling a discovery method initiates a discovery using that method.
Disabling a discovery method that is currently enabled does not affect
connections to any targets that have already been discovered by that
method.
.sp
Options for \fBmodify discovery\fR are as follows:
.sp
.ne 2
.mk
.na
\fB-i\fR, \fB-iSNS\fR \fBenable\fR | \fBdisable\fR
.ad
.sp .6
.RS 4n
Enable or disable iSNS discovery.
.RE

.sp
.ne 2
.mk
.na
\fB-s\fR, \fB-\fB-static\fR \fBenable\fR | \fBdisable\fR
.ad
.sp .6
.RS 4n
Enable or disable static discovery.
.RE

.sp
.ne 2
.mk
.na
\fB-t\fR, \fB-\fB-sendtargets\fR \fBenable\fR | \fBdisable\fR
.ad
.sp .6
.RS 4n
Enable or disable SendTargets discovery.
.RE

.RE

.sp
.ne 2
.mk
.na
\fBinitiator-node\fR [\fIoptions\fR]\fR
.ad
.sp .6
.RS 4n
Modifies an initiator's properties. If a target is currently connected,
this operation can succeed. However, the modified set of parameters will not
be in effect for that target until an existing connection session no longer
exists and a new connection has been established. The options \fB-C\fR and
\fB-\fB-CHAP-secret\fR require a CHAP secret entry in response to a
prompt.
.sp
For iSCSI booting when the Solaris I/O multipathing feature (formerly known
as Sun StorEdge Traffic Manager [STMS] or MPxIO) is disabled, you can modify
only the following initiator-node options:
.RS +4
.TP
.ie t \(bu
.el o
\fB-r\fR, \fB--radius-server\fR
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fB-R\fR, \fB--radius-access\fR
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fB-P\fR, \fB--radius-shared-secret\fR
.RE
For iSCSI booting when the Solaris I/O multipathing feature is enabled, you
can modify only the following initiator-node options:
.RS +4
.TP
.ie t \(bu
.el o
\fB-h\fR, \fB--headerdigest\fR
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fB-d\fR, \fB--datadigest\fR
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fB-c\fR, \fB--configured-sessions\fR
.RE
Options for \fBmodify initiator-node\fR are as follows:
.sp
.ne 2
.mk
.na
\fB-A\fR, \fB-\fB-node-alias\fR \fI<initiator node alias>\fR
.ad
.sp .6
.RS 4n
Modifies the initiator node alias. Maximum length of 223 characters.
.RE

.sp
.ne 2
.mk
.na
\fB-a\fR, \fB-\fB-authentication\fR \fBchap\fR | \fBnone\fR
.ad
.sp .6
.RS 4n
Sets the authentication mode.
.RE

.sp
.ne 2
.mk
.na
\fB-C\fR, \fB-\fB-CHAP-secret\fR
.ad
.sp .6
.RS 4n
Sets the CHAP secret value. There is no default value. Maximum length is 16
characters; minimum required length is 12 characters.
.RE

.sp
.ne 2
.mk
.na
\fB-c\fR, \fB--configured-sessions\fR \fI<num_sessions>\fR | \fI<IP
address>\fR[,\fI<IP address>\fR\&...]\fR
.ad
.sp .6
.RS 4n
Sets the number of configured iSCSI sessions that will be created for each
iSCSI target. The feature should be used in combination with the Solaris I/O
multipathing feature described in \fBscsi_vhci\fR(7D).
.RE

.sp
.ne 2
.mk
.na
\fB-d\fR, \fB--datadigest\fR \fBnone\fR | \fBCRC32\fR
.ad
.sp .6
.RS 4n
Sets whether CRC32 is enabled to check SCSI data transfers.
.RE

.sp
.ne 2
.mk
.na
\fB-H\fR, \fB-\fB-CHAP-name\fR \fICHAP name\fR
.ad
.sp .6
.RS 4n
Specifies a CHAP username. If you do not use this option, upon
initialization, the CHAP name is set to the initiator node name. When the
authentication method is set to CHAP (see
\fB-a\fR/\fB-\fB-authentication\fR option, above), the CHAP username is
displayed with the command \fBiscsiadm list initiator-node\fR.
.RE

.sp
.ne 2
.mk
.na
\fB-h\fR, \fB--headerdigest\fR \fBnone\fR | \fBCRC32\fR
.ad
.sp .6
.RS 4n
Sets whether CRC32 is enabled to check SCSI packet headers.
.RE

.sp
.ne 2
.mk
.na
\fB-N\fR, \fB-\fB-node-name\fR \fI<initiator node name>\fR
.ad
.sp .6
.RS 4n
Modifies the initiator node name. Maximum of 223 characters.
.LP
Note -
.sp
.RS 2
During Solaris installation, the initiator node name is set to a globally
unique value. Changing this value can adversely affect operation within the
iSCSI network.
.RE
.RE

.sp
.ne 2
.mk
.na
\fB-P\fR, \fB--radius-shared-secret\fR (exclusive)\fR
.ad
.sp .6
.RS 4n
Sets the RADIUS shared secret.
.RE

.sp
.ne 2
.mk
.na
\fB-R\fR, \fB--radius-access\fR \fBenable\fR | \fBdisable\fR
.ad
.sp .6
.RS 4n
Sets whether a RADIUS server will be used.
.RE

.sp
.ne 2
.mk
.na
\fB-r\fR, \fB--radius-server\fR \fI<IP address>\fR[:\fI<port>\fR]\fR
.ad
.sp .6
.RS 4n
Sets the IP address and port of the radius server to be used.
.RE

.sp
.ne 2
.mk
.na
\fB-T\fR, \fB-\fB-tunable-param\fR
<<\fItunable-prop\fR>=<\fIvalue\fR>, ...>\fR
.ad
.sp .6
.RS 4n
Specify one or more tunable parameters for all targets that initiator node
connected.
.LP
Note -
.sp
.RS 2
These values should only be modified by an administrator with a good
working knowledge of the parameter's impact within the iSCSI network.
.RE
Supported tunable-prop options are:
.sp
.ne 2
.mk
.na
\fBrecv-login-rsp-timeout\fR
.ad
.sp .6
.RS 4n
Session Login Response Time
.sp
The \fBrecv-login-rsp-timeout\fR option specifies how long iSCSI initiator
will wait for the response of iSCSI session login request from the iSCSI
target. Valid value is from 0 to 60*60, default to 60 seconds.
.RE

.sp
.ne 2
.mk
.na
\fBconn-login-max\fR
.ad
.sp .6
.RS 4n
Maximized Connection Retry Time
.sp
The \fBconn-login-max\fR option lets the iSCSI initiator reestablish the
connection to the target in case of IO timeout or connection failure during
the given time window.  Valid value is from 0 to 60*60, default to 180
seconds.
.RE

.sp
.ne 2
.mk
.na
\fBpolling-login-delay\fR
.ad
.sp .6
.RS 4n
Login Retry Time Interval
.sp
The \fBpolling-login-delay\fR option specifies the time interval between
each login retry when iSCSI initiator to target IO timeout or connection
failure. Valid value is from 0 to 60*60, default to 60 seconds.
.RE

.RE

.RE

.sp
.ne 2
.mk
.na
\fBtarget-param\fR [\fIoptions\fR] \fItarget\fR
.ad
.sp .6
.RS 4n
Modifies a target's parameters. If a target is currently connected, the
modify operation will succeed, although the modified settings might not take
effect for a few seconds. To confirm that these settings are active, use
\fBiscsiadm list target\fR \fB-v\fR. If a specified target is not associated
with any discovery method, a target object is created with the specified
parameters. After using this command to modify a target's parameters, the
new parameters will persist until they are modified or removed with a
\fBiscsiadm remove target-param\fR command on that target. The options
\fB-C\fR and \fB-\fB-CHAP-secret\fR require a CHAP secret entry in
response to a prompt.
.sp
Options for \fBmodify target-param\fR are as follows:
.sp
.ne 2
.mk
.na
\fB-B\fR, \fB-\fB-bi-directional-authentication enable |
disable\fR
.ad
.sp .6
.RS 4n
Sets the bidirectional option. If set to \fBenable\fR, the initiator
performs bidirectional authentication for the specified target.
.RE

.sp
.ne 2
.mk
.na
\fB-C\fR, \fB-\fB-CHAP-secret\fR
.ad
.sp .6
.RS 4n
Sets the target's CHAP secret value. There is no default value. Maximum
acceptable length is 16 characters.
.RE

.sp
.ne 2
.mk
.na
\fB-c\fR, \fB-\fB-configured-sessions\fR \fI<num_sessions>\fR |
\fI<IP address>\fR[,\fI<IP address>\fR\&...]\fR
.ad
.sp .6
.RS 4n
Sets the number of configured iSCSI sessions that will be created for each
iSCSI target. The feature should be used in combination with the Solaris I/O
multipathing feature described in \fBscsi_vhci\fR(7D).
.RE

.sp
.ne 2
.mk
.na
\fB-d\fR, \fB-\fB-datadigest\fR \fBnone\fR | \fBCRC32\fR
.ad
.sp .6
.RS 4n
Sets whether CRC32 is enabled or disabled for the data.
.RE

.sp
.ne 2
.mk
.na
\fB-H\fR, \fB-\fB-CHAP-name\fR \fICHAP name\fR
.ad
.sp .6
.RS 4n
Sets a CHAP username. If you do not use this option, upon initialization,
the CHAP name is set to the target name. When the authentication method is
set to CHAP (see \fB-a\fR/\fB-\fB-authentication\fR option, under the
\fBinitiator-node\fR direct object, above), the CHAP username is displayed
with the command \fBiscsiadm list initiator-node\fR.
.RE

.sp
.ne 2
.mk
.na
\fB-h\fR, \fB-\fB-headerdigest\fR \fBnone\fR | \fBCRC32\fR
.ad
.sp .6
.RS 4n
Sets whether CRC32 is enabled or disabled for the header.
.RE

.sp
.ne 2
.mk
.na
\fB-p\fR, \fB-\fB-login-param\fR
.ad
.sp .6
.RS 4n
Specify one or more login parameter settings.
.LP
Note -
.sp
.RS 2
These values should only be modified by an administrator with a good
working knowledge of the parameter's impact within the iSCSI network.
.RE
The login parameters are derived from iSCSI proposed standard RFC 3720.
Valid values are:
.sp
.ne 2
.mk
.na
\fBdataseqinorder\fR
.ad
.RS 22n
.rt
\fByes\fR or \fBno\fR
.RE

.sp
.ne 2
.mk
.na
\fBdefaulttime2retain\fR
.ad
.RS 22n
.rt
0-3600
.RE

.sp
.ne 2
.mk
.na
\fBdefaulttime2wait\fR
.ad
.RS 22n
.rt
0-3600
.RE

.sp
.ne 2
.mk
.na
\fBfirstburstlength\fR
.ad
.RS 22n
.rt
512 to 2^24-1
.RE

.sp
.ne 2
.mk
.na
\fBimmediatedata\fR
.ad
.RS 22n
.rt
\fByes\fR or \fBno\fR
.RE

.sp
.ne 2
.mk
.na
\fBinitialr2t\fR
.ad
.RS 22n
.rt
\fByes\fR or \fBno\fR
.RE

.sp
.ne 2
.mk
.na
\fBmaxburstlength\fR
.ad
.RS 22n
.rt
512 to 2^24-1
.RE

.sp
.ne 2
.mk
.na
\fBdatapduinorder\fR
.ad
.RS 22n
.rt
\fByes\fR or \fBno\fR
.RE

.sp
.ne 2
.mk
.na
\fBmaxoutstandingr2t\fR
.ad
.RS 22n
.rt
1 to 65535
.RE

.sp
.ne 2
.mk
.na
\fBmaxrecvdataseglen\fR
.ad
.RS 22n
.rt
512 to 2^24-1
.RE

.RE

.sp
.ne 2
.mk
.na
\fB-T\fR, \fB-\fB-tunable-param\fR
<<\fItunable-prop\fR>=<\fIvalue\fR>, ...>\fR
.ad
.sp .6
.RS 4n
Specify one or more tunable parameters for all targets that initiator node
connected.
.LP
Note -
.sp
.RS 2
Tunable values should only be modified by an administrator with a good
working knowledge of the parameter's impact within the iSCSI network.
.RE
Supported \fItunable-prop\fR options are:
.sp
.ne 2
.mk
.na
\fBrecv-login-rsp-timeout\fR
.ad
.sp .6
.RS 4n
Session Login Response Time
.sp
The \fBrecv-login-rsp-timeout\fR option specifies how long iSCSI initiator
will wait for the response of iSCSI session login request from the iSCSI
target. Valid value is from 0 to 60*60, default to 60 seconds.
.RE

.sp
.ne 2
.mk
.na
\fBconn-login-max\fR
.ad
.sp .6
.RS 4n
Maximized Connection Retry Time
.sp
The \fBconn-login-max\fR option lets the iSCSI initiator reestablish the
connection to the target in case of IO timeout or connection failure during
the given time window.  Valid value is from 0 to 60*60, default to 180
seconds.
.RE

.sp
.ne 2
.mk
.na
\fBpolling-login-delay\fR
.ad
.sp .6
.RS 4n
Login Retry Time Interval
.sp
The \fBpolling-login-delay\fR option specifies the time interval between
each login retry when iSCSI initiator to target IO timeout or connection
failure. Valid value is from 0 to 60*60, default to 60 seconds.
.RE

.RE

.RE

.SS "\fBremove\fR Subcommand"
.sp
.LP
The syntax for the \fBremove\fR subcommand is:
.sp
.in +2
.nf
# iscsiadm remove \fIdirect_object\fR
.fi
.in -2

.sp
.LP
The \fBremove\fR subcommand supports the following \fIdirect_object\fRs:
.sp
.ne 2
.mk
.na
\fBdiscovery-address\fR \fIdiscovery-address\fR, ...\fR
.ad
.sp .6
.RS 4n
Removes a target device from the list of discovery addresses. A discovery
address (as in the syntax shown below) is an IP address-port combination
used in a SendTargets discovery session. Using this discovery approach, a
target device can inform an initiator of the target address and target name
of each target exposed by that device. If any target exposed by the
discovery address is currently mounted or there is active I/O on the device,
an error of "logical unit in use" is returned and the operation fails. If
the associated devices are not in use, they are removed.
.sp
\fIdiscovery-address\fR must be formatted as:
.sp
.in +2
.nf
\fI<IP address>\fR[:\fI<port>\fR]
.fi
.in -2

There are no options associated with this direct object.
.RE

.sp
.ne 2
.mk
.na
\fBisns-server\fR \fIisns-server\fR, ...\fR
.ad
.sp .6
.RS 4n
Removes an iSNS server from the list of iSNS server addresses. An iSNS
server address (specified in the syntax shown below) is an IP address-port
combination used in an iSNS discovery session. By using iSNS discovery, an
iSNS server can provide an initiator with information about a portal and the
name of each target that belongs to the same discovery domain as that of the
initiator. If any target discovered by means of iSNS is currently mounted or
there is active I/O on the device, an error of "logical unit in use" is
returned and the operation fails. If the associated devices are not in use,
they are removed.
.sp
\fIisns-server\fR must be formatted as:
.sp
.in +2
.nf
\fIIP_address\fR[:\fIport\fR]
.fi
.in -2

There are no options associated with this direct object.
.RE

.sp
.ne 2
.mk
.na
\fBstatic-config\fR \fIstatic_target\fR, ...\fR
.ad
.sp .6
.RS 4n
Removes a target from the list of statically discovered targets. If the
target being removed is currently mounted or there is active I/O on the
device, an error of "logical unit in use" is returned and the operation
fails. If a device is not in use, it will be removed.
.sp
\fIstatic_target\fR must be formatted as:
.sp
.in +2
.nf
\fI<target-name>\fR,\fI<target-address>\fR[:\fIport-number\fR][,\fItpgt\fR]
.fi
.in -2

There are no options associated with this direct object.
.RE

.sp
.ne 2
.mk
.na
\fBtarget-param\fR \fItarget-name\fR
.ad
.sp .6
.RS 4n
Removes target specified by \fItarget-name\fR. The target name is formatted
as:
.sp
.in +2
.nf
\fI<target-name>\fR
.fi
.in -2

There are no options associated with this direct object. For iSCSI booting
when the Solaris I/O multipathing feature (formerly known as Sun StorEdge
Traffic Manager [STMS] or MPxIO) is enabled, you cannot remove the target.
.RE

.SS "Proper Use of Discovery Methods"
.sp
.LP
Do not configure a target to be discovered by both static and dynamic
discovery methods. The consequence of using redundant discovery methods
might be slow performance when communicating with the iSCSI target device.
.SH OPTIONS
.sp
.LP
The following generic options are supported:
.sp
.ne 2
.mk
.na
\fB-V\fR, \fB-\fB-version\fR
.ad
.RS 17n
.rt
Displays version information. Stops interpretation of subsequent
arguments.
.RE

.sp
.ne 2
.mk
.na
\fB-?\fR, \fB-\fB-help\fR
.ad
.RS 17n
.rt
Displays help information. Can be used following an \fBiscsiadm\fR command
with no arguments, following a subcommand, or following a subcommand-direct
object combination. Responds with help information appropriate for your
entry. For example, if you enter:
.sp
.in +2
.nf
# \fBiscsiadm modify initiator-node --help\fR
.fi
.in -2
.sp

\&...\fBiscsiadm\fR responds with a display of the options available for
that combination of subcommand and direct object.
.RE

.SH EXAMPLES
.LP
\fBExample 1 \fRAdding a Discovery Address
.sp
.LP
The following command uses the \fBadd\fR subcommand to add a discovery
address.

.sp
.in +2
.nf
# \fBiscsiadm add discovery-address 10.0.0.1:3260 10.0.0.2:3260\fR
.fi
.in -2
.sp

.LP
\fBExample 2 \fRAdding a Static Target
.sp
.LP
The following command uses the \fBadd\fR subcommand to add a static
target.

.sp
.in +2
.nf
# \fBiscsiadm add static-config \e
iqn.1999-08.com.array:sn.01234567,10.0.0.1:3260\fR
.fi
.in -2
.sp

.LP
\fBExample 3 \fRListing Current Discovery Settings
.sp
.LP
The following command uses the \fBlist\fR subcommand to list current
discovery settings.

.sp
.in +2
.nf
# \fBiscsiadm list discovery\fR
        Discovery:
                Static: enabled
                Send Targets: disabled
                iSNS: enabled
.fi
.in -2
.sp

.LP
\fBExample 4 \fRObtaining Verbose Discovery Output
.sp
.LP
The following commands uses the \fB-v\fR option (one with, one without)
with the \fBlist\fR subcommand to obtain verbose output.

.sp
.in +2
.nf
# \fBiscsiadm list discovery-address\fR
        Discovery Address: 10.0.0.1:3260
        Discovery Address: 10.0.0.2:3260

# \fBiscsiadm list discovery-address -v 10.0.0.1:3260\fR
        Discovery Address: 10.0.0.1:3260
                Target name: eui.210000203787d1f7
                        Target address:    10.0.0.1:3260
                Target name: eui.210000203787a693
                        Target address:    10.0.0.1:3260
.fi
.in -2
.sp

.LP
\fBExample 5 \fRDisplaying Information on the Initiator
.sp
.LP
The following command uses the \fBlist\fR subcommand to display information
on the initiator.

.sp
.in +2
.nf
# \fBiscsiadm list initiator-node\fR
Initiator node name: iqn.1986-03.com.company.central.interopv20-1
Initiator node alias: interopv20-1
        Login Parameters (Default/Configured):
                Header Digest: NONE/NONE
                Data Digest: NONE/NONE
        Authentication Type: CHAP
                CHAP Name: iqn.1986-03.com.company.central.interopv20-1
        RADIUS Server: NONE
        RADIUS access: disabled
        Tunable Parameters (Default/Configured):
                Session Login Response Time: 60/-
                Maximum Connection Retry Time: 180/-
                Login Retry Time Interval: 60/-
        Configured Sessions: 1
.fi
.in -2
.sp

.LP
\fBExample 6 \fRDisplaying Static Configuration Information
.sp
.LP
The following command uses the \fBlist\fR subcommand to display information
about static configurations.

.sp
.in +2
.nf
# \fBiscsiadm list static-config\fR
        Static target: eui.210000203787a693,10.0.0.1:3260
.fi
.in -2
.sp

.LP
\fBExample 7 \fRDisplaying Target Information
.sp
.LP
The following commands show the use of the \fBlist\fR subcommand with
various options to display information about targets.

.sp
.in +2
.nf
# \fBiscsiadm list target\fR
Target: iqn.2004-05.com.abcStorage:Tgt-1
        Alias: -
        TPGT: 12288
        ISID: 4000002a0000
        Connections: 1# \fBiscsiadm list target -v iqn.2004-05.com.abcStorage:Tgt-1\fR
Target: iqn.2004-05.com.abcStorage:Tgt-1
        Alias: -
        TPGT: 12288
        ISID: 4000002a0000
        Connections: 1
                CID: 0
                  IP address (Local): 10.4.52.158:32803
                  IP address (Peer): 10.4.49.70:3260
                  Discovery Method: SendTargets
                  Login Parameters (Negotiated):
                        Data Sequence In Order: yes
                        Data PDU In Order: yes
                        Default Time To Retain: 20
                        Default Time To Wait: 2
                        Error Recovery Level: 0
                        First Burst Length: 65536
                        Immediate Data: yes
                        Initial Ready To Transfer (R2T): yes
                        Max Burst Length: 262144
                        Max Outstanding R2T: 1
                        Max Receive Data Segment Length: 65536
                        Max Connections: 1
                        Header Digest: NONE
                        Data Digest: NONE
# \fBiscsiadm list target -S iqn.2004-05.com.abcStorage:Tgt-1\fR
Target: iqn.2004-05.com.abcStorage:Tgt-1
        Alias: -
        TPGT: 12288
        ISID: 4000002a0000
        Connections: 1
        LUN: 6
             Vendor:  ABCStorage
             Product: iSCSI Target
             OS Device Name: /dev/rdsk/c3t1d0s2
        LUN: 5
             Vendor:  ABCStorage
             Product: iSCSI Target
             OS Device Name: /dev/rdsk/c3t0d0s2
.fi
.in -2
.sp

.LP
\fBExample 8 \fRDisplaying Target Parameter Information
.sp
.LP
The following command uses the \fBlist\fR subcommand to display target
information for a specific target.

.sp
.in +2
.nf
# \fBiscsiadm list target-param -v iqn.2004-05.com.abcStorage:Tgt-1\fR
Target: iqn.2004-05.com.abcStorage:Tgt-1
        Alias: -
        Bi-directional Authentication: disabled
        Authentication Type: NONE
        Login Parameters (Default/Configured):
                Data Sequence In Order: yes/-
                Data PDU In Order: yes/-
                Default Time To Retain: 20/-
                Default Time To Wait: 2/-
                Error Recovery Level: 0/-
                First Burst Length: 65536/-
                Immediate Data: yes/-
                Initial Ready To Transfer (R2T): yes/-
                Max Burst Length: 262144/-
                Max Outstanding R2T: 1/-
                Max Receive Data Segment Length: 65536/-
                Max Connections: 1/-
                Header Digest: NONE/-
                Data Digest: NONE/-
        Tunable Parameters (Default/Configured):
                Session Login Response Time: 60/-
                Maximum Connection Retry Time: 180/-
                Login Retry Time Interval: 60/-
        Configured Sessions: 1
.fi
.in -2
.sp

.LP
\fBExample 9 \fREnabling Static Discovery Method
.sp
.LP
The following command uses the \fBmodify\fR subcommand to enable the static
discovery method.

.sp
.in +2
.nf
# \fBiscsiadm modify discovery --static enable\fR
.fi
.in -2
.sp

.LP
\fBExample 10 \fRSetting the IP Address for the Radius Server
.sp
.LP
The following command uses the \fBmodify\fR subcommand to set the IP
address for the radius server, which will be used for CHAP authentication.

.sp
.in +2
.nf
# \fBiscsiadm modify initiator --radius-server 10.0.0.1\fR
.fi
.in -2
.sp

.LP
\fBExample 11 \fRSetting the Node Name for Initiator
.sp
.LP
The following command uses the \fBmodify\fR subcommand to set the node name
for the initiator node.

.sp
.in +2
.nf
# \fBiscsiadm modify initiator-node -N iqn.2004-10.com.SUN.host-1\fR
.fi
.in -2
.sp

.LP
\fBExample 12 \fRChanging Target Parameters
.sp
.LP
The following command uses the \fBmodify\fR subcommand to change the target
parameters for a specified target.

.sp
.in +2
.nf
# \fBiscsiadm modify target-param -d none -h none eui.210000203787a693\fR
.fi
.in -2
.sp

.LP
\fBExample 13 \fRRemoving a Discovery Address
.sp
.LP
The following command uses the \fBremove\fR subcommand to remove a
discovery address.

.sp
.in +2
.nf
# \fBiscsiadm remove discovery-address 10.0.0.1:3260\fR
.fi
.in -2
.sp

.LP
\fBExample 14 \fRRemoving Target Parameters
.sp
.LP
The following command uses the \fBremove\fR subcommand to remove a set of
target parameters.

.sp
.in +2
.nf
# \fBiscsiadm remove target-param eui.210000203787a693\fR
.fi
.in -2
.sp

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWiscsiu
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBattributes\fR(5), \fBiscsi\fR(7D), \fBscsi_vhci\fR(7D)
.sp
.LP
\fISystem Administration Guide: Devices and File Systems\fR
