usr/src/man/man1m/iscsitgtd.1m
'\" te
.\" Copyright (c) 2008, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH iscsitgtd 1M "16 Mar 2009" "SunOS 5.11" "System Administration Commands"
.SH NAME
iscsitgtd \- iSCSI Target daemon
.SH SYNOPSIS
.LP
.nf
\fBiscsitgtd\fR [\fB-d\fR \fIdoor_file\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The
.B iscsitgtd
daemon process implements the iSCSI configuration,
control, and data paths, providing iSCSI Target Mode support in the Solaris
operating system.
.sp
.LP
The configuration and control path is by means of the Solaris Doors
subsystem (see \fBdoor_create\fR(3C)), and provides the interface between
the iSCSI Target administration utility,
.BR iscsitadm (1M),
persistence
configuration data stored in the Service Configuration Facility (SCF) of the
service management facility (SMF). See
.BR smf (5).
.sp
.LP
The data path managed by the daemon exists between TPC/IP port 3260, and
the files, block devices, or raw SCSI devices configured as iSCSI target
LUNs.
.SH OPTIONS
.sp
.LP
The following options is supported:
.sp
.ne 2
.mk
.na
.B -d
.I door_file
.ad
.sp .6
.RS 4n
Override the location of the Solaris Door used for configuration from
.B /var/run/iscsi_tgt_door
to a door of one's choosing.
.RE

.SS "Solaris Configuration Facility (SCF)"
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B PGR-basedir
.ad
.sp .6
.RS 4n
SCSI-3 PGR base directory for ZVOL failover. Set to
.BR / .
.RE

.sp
.ne 2
.mk
.na
.B daemonize
.ad
.sp .6
.RS 4n
Run as Solaris daemon process. Either
.B true
or
.BR false .
.RE

.sp
.ne 2
.mk
.na
.B dbg-lvl
.ad
.sp .6
.RS 4n
Runtime debug level to console.
.RE

.sp
.ne 2
.mk
.na
.B qlog-lvl
.ad
.sp .6
.RS 4n
Runtime logging to
.BR /tmp/target_log .
.RE

.sp
.LP
The following are the logging values, in hexadecimal.
.sp
.in +2
.nf
0x00001 - Connection errors
0x00002 - Connection login errors
0x00004 - Connection Non-I/O errors
0x00008 - Connection I/O errors
0x00010 - Session errors
0x00020 - Session login errors
0x00040 - Session Non-I/O errors
0x00080 - Session I/O errors
0x00100 - Emulation errors
0x00200 - Emulation Non-I/O errors
0x00400 - Emulation I/O errors
0x01000 - General errors
0x02000 - General details
0x04000 - iSNS details
0x10000 - SCSI-3 PGR errors
0x20000 - SCSI-3 PGR Non-I/O errors
0x40000 - SCSI-3 PGR I/O errors
.fi
.in -2
.sp

.SH EXAMPLES
.LP
.B Example 1
Listing All
.B iscsitgt
Values
.sp
.LP
The following commands lists all
.B iscsitgt
values.

.sp
.in +2
.nf
# \fBsvccfg -s iscsitgt listprop iscsitgt\fR
.fi
.in -2
.sp

.LP
.B Example 2
Setting SCF Options
.sp
.LP
The following command sets the
.B PGR-basedir
option.

.sp
.in +2
.nf
# \fBsvccfg -s iscsitgt setprop iscsitgt/PGR-basedir = astring: "/"\fR
.fi
.in -2
.sp

.sp
.LP
The following command sets the
.B dbg-lvl
option.

.sp
.in +2
.nf
# \fBsvccfg -s iscsitgt setprop iscsitgt/dbg-lvl = integer: 0x80ffffff\fR
.fi
.in -2
.sp

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWiscsitgtu
_
Interface StabilityVolatile
.TE

.SH SEE ALSO
.sp
.LP
.BR iscsitadm (1M),
.BR door_create (3C),
.BR attributes (5),
.BR smf (5)
.SH NOTES
.sp
.LP
The iSCSI Target daemon,
.BR iscsitgtd ,
is managed by the service
management facility,
.BR smf (5),
under the fault management resource
identifier:
.sp
.in +2
.nf
svc:/system/iscsitgt:default
.fi
.in -2
.sp

