usr/src/man/man1m/iscsitadm.1m
'\" te
.\" Copyright (c) 2008, Sun Microsystems, Inc. All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH iscsitadm 1M "5 Feb 2009" "SunOS 5.11" "System Administration Commands"
.SH NAME
iscsitadm \- administer iSCSI targets
.SH SYNOPSIS
.LP
.nf
\fBiscsitadm\fR create [\fB-?\fR | \fB--help\fR] \fIobject\fR [\fB-?\fR | \fB--help\fR]
 [\fIoptions\fR] \fIoperand\fR
.fi

.LP
.nf
\fBiscsitadm\fR modify [\fB-?\fR | \fB--help\fR] \fIobject\fR [\fB-?\fR | \fB--help\fR]
 [\fIoptions\fR] \fIoperand\fR
.fi

.LP
.nf
\fBiscsitadm\fR delete [\fB-?\fR | \fB--help\fR] \fIobject\fR [\fB-?\fR | \fB--help\fR]
 [\fIoptions\fR] \fIoperand\fR
.fi

.LP
.nf
\fBiscsitadm\fR list [\fB-?\fR | \fB--help\fR] \fIobject\fR [\fB-?\fR | \fB--help\fR] [\fIoptions\fR]
 \fIoperand\fR
.fi

.LP
.nf
\fBiscsitadm\fR show [\fB-?\fR | \fB--help\fR] admin
.fi

.LP
.nf
\fBiscsitadm\fR show [\fB-?\fR | \fB--help\fR] \fIobject\fR [\fB-?\fR | \fB--help\fR] [\fIoptions\fR]
 [\fIoperand\fR]
.fi

.LP
.nf
\fBiscsitadm\fR \fB-?\fR \fB--help\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B iscsitadm
command enables you to manage Internet SCSI (iSCSI)
target nodes. It is a companion to
.BR iscsiadm (1M),
which enables you to
manage iSCSI initiator nodes.
.sp
.LP
The
.B iscsitadm
command has the following subcommands:
.sp
.ne 2
.mk
.na
.B create
.ad
.RS 10n
.rt
Creates a target using a local target as a reference.
.RE

.sp
.ne 2
.mk
.na
\fBmodify\fR
.ad
.RS 10n
.rt
Modifies a target or a list of targets.
.RE

.sp
.ne 2
.mk
.na
.B delete
.ad
.RS 10n
.rt
Deletes a target or a list of targets.
.RE

.sp
.ne 2
.mk
.na
.B list
.ad
.RS 10n
.rt
Lists names and information about targets.
.RE

.sp
.ne 2
.mk
.na
.B show
.ad
.RS 10n
.rt
Displays target-related statistics.
.RE

.sp
.LP
The preceding subcommands work on the following objects:
.sp
.ne 2
.mk
.na
.B target
.ad
.RS 13n
.rt
An iSCSI target node, or list of target nodes.
.RE

.sp
.ne 2
.mk
.na
.B initiator
.ad
.RS 13n
.rt
An iSCSI initiator node, or list of initiator nodes.
.RE

.sp
.ne 2
.mk
.na
.B admin
.ad
.RS 13n
.rt
Stores administrative information, such as server locations and passwords.
.RE

.sp
.ne 2
.mk
.na
.B tpgt
.ad
.RS 13n
.rt
Stands for
.BR TargetPortGroupTag .
A number that represents a list of
connections that an initiator can use for a given target.
.RE

.sp
.ne 2
.mk
.na
.B stats
.ad
.RS 13n
.rt
Displays statistics; can accept interval and count values. Used only with
the
.B show
subcommand.
.RE

.sp
.LP
These objects are discussed in greater detail under the options descriptions
for each subcommand.
.sp
.LP
As indicated in the SYNOPSIS,
.B iscsitadm
has two levels of help. If you
invoke
.B -?
or
.B --help
following a subcommand, the command displays
available operands, options, and objects. If you invoke an help option
following an object,
.B iscsitadm
displays options and operands.
.SH OPTIONS
.sp
.LP
The
.B iscsitadm
options and objects are discussed below in the context
of each subcommand. Note that the help options (\fB-?\fR or
.BR --help )
are
invoked as shown in the SYNOPSIS. See EXAMPLES.
.SS "\fBcreate\fR Options"
.sp
.LP
The following are the options and objects for the
.B create
subcommand:
.sp
.ne 2
.mk
.na
\fBtarget --size\fR|\fB-z\fR \fIlun_size\fR [\fB--lun\fR
\fInumber\fR]\fR
.ad
.br
.na
\fB[\fB--type disk|tape|raw\fR] [\fB--backing-store\fR|\fB-b\fR
\fIpathname\fR] \fIlocal_name\fR
.ad
.sp .6
.RS 4n
Create a target using
.I local_name
as a reference.
.I local_name
is
only used within the context
.BR iscsitgtd .
\fB--size\fR is a multiplier
and is specified as a number followed by a single letter. The letter is one
of:
.sp
.ne 2
.mk
.na
.B k
.ad
.RS 5n
.rt
kilobyte
.RE

.sp
.ne 2
.mk
.na
.B m
.ad
.RS 5n
.rt
megabyte
.RE

.sp
.ne 2
.mk
.na
.B g
.ad
.RS 5n
.rt
gigabyte
.RE

.sp
.ne 2
.mk
.na
.B t
.ad
.RS 5n
.rt
terabyte
.RE

\fB--lun\fR specifies the logical unit number. \fB--type\fR specifies which
type of emulation will occur for the LUN.
.B disk
and
.B tape
are the
familiar devices.
.B raw
indicates that the emulator will use the uSCSI
interface and pass the command blocks directly to and from the device. The
use of
.B raw
also implies the option
.B --backing-store
will be
entered. The argument to this option is the full pathname to the device node
normally found in
.BR /dev .
If you use
.BR --backing-store ,
the size of
the store is determined by a SCSI
.B READ_CAPACITY
command or, if the
backing store is a regular file, by
.BR stat (2).
.sp
If
.I local_name
already exists, a new target name is not generated for
this LUN. The LUN is created within the
.I local_name
storage hierarchy.
You can use the
.B --backing-store
option to specify a different location
for the data. If you use
.BR --backing-store ,
it is up to you to allocate
actual storage instead of having the target create the data file.
.RE

.sp
.ne 2
.mk
.na
\fBinitiator --iqn\fR|\fB-n\fR \fIiSCSI_node_name\fR
.I local_initiator
.ad
.sp .6
.RS 4n
To use access control lists you must know the name of the initiator. Since
the iSCSI initiator name can be quite long (223 bytes) and made up of a long
list of numbers, it is best to enter this information once and then refer to
the initiator using a simplified name of
.IR local_initiator .
.RE

.sp
.ne 2
.mk
.na
\fBtpgt\fR \fItpgt_number\fR
.ad
.sp .6
.RS 4n
If a host has multiple NICs, you might want to limit the number of
connections that an initiator can use for a given target. To establish this
limit, you must first create a TargetPortGroupTag (TPGT), which can be any
number from 1 to 65535. Once this tag is created, the IP addresses of the
NICs can be added to the TPGT, using the \fBmodify\fR subcommand. Then, the
TPGT can itself be added to the target.
.RE

.SS "\fBmodify\fR Options"
.sp
.LP
The following are the options and objects for the \fBmodify\fR subcommand:
.sp
.ne 2
.mk
.na
\fBtarget --tpgt\fR|\fB-p\fR \fIlocal_tpgt\fR
.I local_target
.ad
.sp .6
.RS 4n
Specifies one or more target portal groups to use when initiators reference
\fIlocal_target\fR during discovery.
.RE

.sp
.ne 2
.mk
.na
\fBtarget --acl\fR|\fB-l\fR \fIlocal_initiator\fR
.I local_target
.ad
.sp .6
.RS 4n
Adds to the list a local initiator that can access
.IR local_target .
By
adding an initiator to a target all initiators from that point on must be in
the ACL.
.RE

.sp
.ne 2
.mk
.na
\fBtarget --alias\fR|\fB-a\fR \fITargetAlias\fR
.I local_target
.ad
.sp .6
.RS 4n
Sets the alias if it was not done during the creation of the target or
change an existing target's alias.
.RE

.sp
.ne 2
.mk
.na
\fBtarget --maxrecv\fR|\fB-m\fR \fIvalue local_target\fR
.ad
.sp .6
.RS 4n
Sets the
.BR MaxRecvDataSegmentLength ,
which can be any value between 512
to (2^24 - 1). You can use this option to limit the amount of memory used by
the target.
.RE

.sp
.ne 2
.mk
.na
\fBinitiator --chap-secret\fR|\fB-C\fR \fIlocal_initiator\fR
.ad
.sp .6
.RS 4n
Prompts the user to enter the value, using \fBgetpassphrase\fR(3C).
Associates the secret used for CHAP authentication during login with
.IR local_initiator .
.RE

.sp
.ne 2
.mk
.na
\fBinitiator --chap-name\fR|\fB-H\fR \fIvalue\fR
.I local_initiator
.ad
.sp .6
.RS 4n
Specifies the CHAP username used during authentication.
.RE

.sp
.ne 2
.mk
.na
\fBtpgt --ip-address\fR|\fB-i\fR \fIaddress\fR
.I tpgt_number
.ad
.sp .6
.RS 4n
Adds the NIC's
.I address
to
.IR tpgt_number .
.RE

.sp
.ne 2
.mk
.na
\fBadmin --base-directory\fR|\fB-d\fR \fIdirectory\fR
.ad
.sp .6
.RS 4n
Sets the location of where to store the data files that represent the
individual LUNs. This should be done before any other function is performed.
Otherwise, an error will be generated when attempting to set a persistent
value.
.RE

.sp
.ne 2
.mk
.na
\fBadmin --chap-secret\fR|\fB-C\fR
.ad
.sp .6
.RS 4n
Upon entering this option, you will be prompted to enter the value using
.BR getpassphrase (3C).
For bidirectional authentication, this is the value
used to generate a response to the initiator's challenge.
.RE

.sp
.ne 2
.mk
.na
\fBadmin --chap-name\fR|\fB-H\fR \fIvalue\fR
.ad
.sp .6
.RS 4n
Specifies the user name portion of the CHAP protocol.
.RE

.sp
.ne 2
.mk
.na
\fBadmin --radius-access\fR|\fB-R enable\fR |
.B disable
.ad
.sp .6
.RS 4n
Enables or disables the use of the RADIUS server. Even with a RADIUS server
address defined, the use of that server must be enabled. If the server
becomes inaccessible and you need to fall back on configuration file access,
you can use this option to disable the server.
.RE

.sp
.ne 2
.mk
.na
\fBadmin --radius-server\fR|\fB-r\fR \fIhostname\fR:\fIport\fR
.ad
.sp .6
.RS 4n
Location of RADIUS server.
.I hostname
can be either a resolvable name or
an IP address.
.RE

.sp
.ne 2
.mk
.na
\fBadmin --radius-secret\fR|\fB-P\fR
.ad
.sp .6
.RS 4n
Used to initiate contact with the RADIUS server. Interaction with server
uses
.BR getpassphrase (3C).
.RE

.sp
.ne 2
.mk
.na
\fBadmin --isns-access\fR|\fB-S enable\fR |
.B disable
.ad
.sp .6
.RS 4n
Enables or disables access to an iSNS server. iSNS servers broadcast their
locations.
.RE

.sp
.ne 2
.mk
.na
\fBadmin --isns-server\fR|\fB-s\fR \fIhostname\fR
.ad
.sp .6
.RS 4n
Location of the iSNS server. "\fIhostname\fR" can be either a resolvable
host name or an
.B IP
address.
.RE

.sp
.ne 2
.mk
.na
\fBadmin --fast-write-ack\fR|\fB-f enable\fR |
.B disable
.ad
.sp .6
.RS 4n
Enables or disables fast-write acknowledgment. You should enable this option
only if a system is connected to the power grid through a UPS. Otherwise,
data corruption could occur if power is lost and some writes that were
acknowledged have not been completely flushed to the backing store.
.RE

.SS "\fBdelete\fR Options"
.sp
.LP
The following are the options and objects for the
.B delete
subcommand:
.sp
.ne 2
.mk
.na
\fBtarget --lun\fR|\fB-u\fR \fIlun_number\fR
.I local_target
.ad
.sp .6
.RS 4n
Removes information about the LUN identified by
.IR lun_number .
This
includes the data that is stored in the LUNs.
.RE

.sp
.ne 2
.mk
.na
\fBtarget --acl\fR|\fB-l\fR \fIlocal_initiator\fR
.I local_target
.ad
.sp .6
.RS 4n
Remove access to
.I local_target
by
.IR local_initiator .
If the
initiator is currently logged into the target, this option sends an
asynchronous event message to the initiator.
.RE

.sp
.ne 2
.mk
.na
\fBtarget --tpgt\fR|\fB-p\fR \fIlocal_tpgt\fR
.I local_target
.ad
.sp .6
.RS 4n
Removes the
.I local_tpgt
from
.IR local_target .
Does not affect
existing connections.
.RE

.sp
.ne 2
.mk
.na
\fBinitiator --all\fR|\fB-A\fR \fIlocal_initiator\fR
.ad
.sp .6
.RS 4n
Removes information about
.IR local_initiator .
Does not affect current
connections. This option search all targets, seeking those that reference
.IR local_initiator .
On these, it performs the action defined by the
command:
.sp
.in +2
.nf
# \fBiscsitadm delete target --acl\fR \fIlocal_initiator\fR \fItarget\fR
.fi
.in -2
.sp

.RE

.sp
.ne 2
.mk
.na
\fBtpgt --all\fR|\fB-A\fR \fItpgt_number\fR
.ad
.sp .6
.RS 4n
Removes from the system all knowledge of the target portal group identified
by
.IR tpgt_number .
This includes removal of the references by targets to
this group.
.RE

.sp
.ne 2
.mk
.na
\fBtpgt --ip-address\fR|\fB-i\fR \fIaddress\fR
.I tpgt_number
.ad
.sp .6
.RS 4n
Removes a NIC's address from the target portal group identified by
.IR tpgt_number .
Does not affect current connections.
.RE

.SS "\fBlist\fR Options"
.sp
.LP
The following are the options and objects for the
.B list
subcommand:
.sp
.ne 2
.mk
.na
\fBtarget\fR [\fB--verbose\fR] [\fIlocal_target\fR]\fR
.ad
.br
.na
\fBtarget\fR [\fB-v\fR|\fB-s\fR \fInum\fR] [\fIlocal_target\fR]\fR
.ad
.sp .6
.RS 4n
By default, displays a list of target local names followed by the iSCSI
TargetName, as it was created. By specifying
.IR local_target ,
the same
information is displayed for that target and can be used to validate the name
of
.IR local_target .
With the
.B --verbose
option, information about the
target's LUNs and current connections is displayed.
.sp
You can use the \fBiostat\fR(1M) command to obtain information on the number
of SCSI commands issued and sectors read and written.
.RE

.sp
.ne 2
.mk
.na
\fBinitiator\fR [\fB--verbose\fR|\fB-v\fR] \fIlocal_initiator\fR
.ad
.sp .6
.RS 4n
Displays detailed information about
.IR local_initiator .
Among this data
is CHAP information, what target portal groups this initiator belongs to, and
any available connections.
.RE

.sp
.ne 2
.mk
.na
\fBtpgt\fR [\fB--verbose\fR|\fB-v\fR] \fItpgt_number\fR
.ad
.sp .6
.RS 4n
Displays detailed information about target group identified by
.IR tpgt_number .
Among this data is the list of NICs that are a part of
this target group.
.RE

.SS "\fBshow\fR Options"
.sp
.LP
The following are the options and objects for the
.B show
subcommand:
.sp
.ne 2
.mk
.na
.B admin
.ad
.sp .6
.RS 4n
Displays a list of administrative information, including the base directory
used by the target, CHAP, RADIUS, iSNS, and if fast writes are enabled.
.RE

.sp
.ne 2
.mk
.na
\fBstats\fR [\fB--interval\fR|\fB-I\fR \fIseconds\fR
[\fB--count\fR|\fB-N\fR \fIvalue\fR]] [\fIlocal_target\fR]\fR
.ad
.sp .6
.RS 4n
Displays statistics for all available targets, unless you specify
.IR local_target ,
in which case, displays statistics only for
.IR local_target .
If you use
.BR --interval ,
displays statistics for an
interval specified by
.IR seconds .
If you do not specify
.BR --count ,
the
display continues until you enter a Control-C.
.RE

.SH EXAMPLES
.LP
\fBExample 1\fR Invoking Help
.sp
.LP
All of the commands shown below are valid ways of invoking help.

.sp
.in +2
.nf
# \fBiscsitadm -?\fR
# \fBiscsitadm modify -?\fR
# \fBiscsitadm modify target -?\fR
# \fBiscsitadm --help\fR
# \fBiscsitadm create --help\fR
# \fBiscsitadm create tpgt --help\fR
.fi
.in -2
.sp

.LP
\fBExample 2\fR Establishing Backing Store
.sp
.LP
The following command establishes the default location for the backing
store. In addition to the backing store, certain configuration files will be
stored in the same location.

.sp
.in +2
.nf
# \fBiscsitadm modify admin --base-directory /zfs/data/targets\fR
.fi
.in -2
.sp

.sp
.LP
The short form of the
.B --base-directory
option is
.BR -d .

.LP
\fBExample 3\fR Simplest-Case Target Creation
.sp
.LP
The following command creates a target that will emulate an LBA device that
has 10 GB of storage available. With the base directory set up and as well as
a single target, it is possible to use the system as an iSCSI target. Note
that because the LUN is not specified on the command line, it reverts to the
default, 0.

.sp
.in +2
.nf
# \fBiscsitadm create target --size 10g playarea\fR
.fi
.in -2
.sp

.sp
.LP
The short form of the
.B --size
option is
.BR -z .

.LP
\fBExample 4\fR Creating with Both Size and Backing Store
.sp
.LP
The following
.B "iscsitadm create"
command specifies LUN size and a
backing store location. The result of this command is that the daemon will
create a LUN file at the named location, of the specified size (20 GB).

.sp
.in +2
.nf
# \fBiscsitadm create target -z 20g -b /zfs/mirror/data/payroll payroll\fR
.fi
.in -2
.sp

.sp
.LP
A target such as the one created by the preceding command might be useful,
for example, when most of the LUN can be created in a default area, using
whatever redundancy is provided by the underlying file system. Alternatively,
you might want to create a special LUN on a higher speed storage medium or
one with better failover characteristics.

.sp
.LP
The long form of the
.B -z
option is
.BR --size .
The long form of the
\fB-b\fR option is \fB--backing-store\fR

.LP
\fBExample 5\fR Specifying a Local Name for a SCSI Initiator
.sp
.LP
Consider that you want to restrict access to the
.B payroll
target,
created in the previous example, to a limited set of initiators. Because the
initiator names can be quite long (and therefore prone to be entered
incorrectly), you create a local name for each initiator, as in the command
below.

.sp
.in +2
.nf
# \fBiscsitadm create initiator --iqn \e
iqn.1986-03.com.example\fI[node name continues.\|.\|.]\fR \fBmultistrada\fR
.fi
.in -2
.sp

.sp
.LP
The short form of the
.B --iqn
option is
.BR -q .

.LP
\fBExample 6\fR Granting an Initiator Access to a Target
.sp
.LP
Upon completion of the command below, only the initiator \fBmultistrada\fR
is allowed to log into the daemon and access the
.B payroll
target. This
presents a potential gap in security, which is addressed in the following
example.

.sp
.in +2
.nf
# \fBiscsitadm modify target --acl multistrada payroll\fR
.fi
.in -2
.sp

.sp
.LP
The short form of the
.B --acl
option is
.BR -l .

.LP
\fBExample 7\fR Adding CHAP Secret and Name for an Initiator
.sp
.LP
The initiator is allowed to identify itself. Because of this, it is prudent
to add a CHAP secret an name for an initiator. This is accomplished with the
following command.

.sp
.in +2
.nf
# \fBiscsitadm modify initiator -C multistrada\fR
.fi
.in -2
.sp

.sp
.LP
The preceding command prompts you for a secret to use. This must be the same
secret that was setup on the initiator with the local name of
.BR multistrada .
If it is not, the target daemon will issue a challenge to
\fBmultistrada\fR when it attempts to login. A non-matching response will
cause the target to drop the connection. If you have many targets that
require authentication, it is probably best to setup a RADIUS server to
administer the secrets.

.sp
.LP
The long form of the
.B -C
option is
.BR --chap-secret .

.LP
\fBExample 8\fR Displaying Target Information
.sp
.LP
The following commands displays information about iSCSI targets.

.sp
.in +2
.nf
# \fBiscsitadm list target\fR
Target: vol0
         iSCSI Name: iqn.1986-03.com.sun:01:00093d12170c.434c5250.vol0
Target: disk0
         iSCSI Name: iqn.1986-03.com.sun:01:00093d12170c.434c6f05.disk0
.fi
.in -2
.sp

.sp
.LP
The following command differs from the preceding in that it uses the verbose
(\fB-v\fR) option and it specifies a single target.

.sp
.in +2
.nf
# \fBiscsitadm list target -v vol0\fR
Target: vol0
         iSCSI Name: iqn.1986-03.com.sun:01:00093d12170c.434c5250.vol0
         ACL list:
         TPGT list:
         LUN information:
                 LUN: 0
                         GUID: 010000093d12170c00002a00434c5251
                         VID: SUN
                         PID: SOLARIS
                         Type: raw
                         Size: 0x1400000 blocks
.fi
.in -2
.sp

.LP
\fBExample 9\fR Displaying Administrative Information
.sp
.LP
The following command uses the
.B show
subcommand to display
administrative information.

.sp
.in +2
.nf
# \fBiscsitadm show admin\fR
iscsitadm:
         Base Directory: /zfs/stress/play/targets
         CHAP Name: Not set
         RADIUS Access: Not set
         RADIUS Server: Not set
         iSNS Access: Not set
         Fast Write ACK: Not set
.fi
.in -2
.sp

.LP
\fBExample 10\fR Displaying Statistics
.sp
.LP
The following command uses the
.B show
subcommand to display
statistics.

.sp
.in +2
.nf
# \fBiscsitadm show stats\fR
                         operations    bandwidth
device                 read  write   read  write
--------------------  -----  -----  -----  -----
vol0                      0      0     0K     0K
disk0                     0      0     0K     0K
.fi
.in -2
.sp

.SH EXIT STATUS
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 6n
.rt
Command successful.
.RE

.sp
.ne 2
.mk
.na
.B >0
.ad
.RS 6n
.rt
An error occurred.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWiscsitgtu
_
Interface StabilityVolatile
.TE

.SH SEE ALSO
.sp
.LP
.BR iostat (1M),
.BR iscsiadm (1M),
.BR getpassphrase (3C),
.BR attributes (5),
.BR rbac (5),
.BR smf (5)
.SH NOTES
.sp
.LP
This command set is considered to be experimental. Future releases, both
minor and micro, might introduce incompatible changes to the command set. A
future release will stabilize the command set. Any future changes in
stability level will be reflected in the ATTRIBUTES section of this man
page.
.sp
.LP
The iSCSI Target daemon,
.BR iscsitgtd ,
is managed by the service
management facility (\fBsmf\fR(5)), under the fault management resource
identifier (FMRI):
.sp
.in +2
.nf
svc:/system/iscsitgt:default
.fi
.in -2
.sp

.sp
.LP
Use
.B iscsitadm
to perform administrative actions, such as are performed
by the
.BR create ,
\fBmodify\fR, and \fBdelete\fR subcommands, on iSCSI
Target properties. Such actions require that you become superuser or assume
the Primary Administrator role. See
.BR rbac (5).
