usr/src/man/man1m/isnsadm.1m
'\" te
.\" Copyright (c) 2008, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH isnsadm 1M "25 Sep 2008" "SunOS 5.11" "System Administration Commands"
.SH NAME
isnsadm \- administer the internet Storage Name Server (iSNS) server
.SH SYNOPSIS
.LP
.nf
\fBisnsadm\fR \fIoptions\fR
.fi

.LP
.nf
\fBisnsadm\fR \fIsubcommand\fR [\fIsubcommand_options\fR] [\fIoperand\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The
.B isnsadm
command is the command-line interface to the Internet
Storage Name Service (iSNS) server.
.B isnsadm
comprises a set of
subcommands, described in their own section, each of which accomplishes one
of the iSNS server management functions.
.sp
.LP
For any operations that will change the iSNS configurations the
.B solaris.isnsmgr.write
authorization is required. Refer to
.BR isns (1M).
For read operations, the command does not require special
authorizations.
.sp
.LP
.B isnsadm
has a set of general options and a set of subcommand-specific
options. The first category is described under OPTIONS; the second category
is described in the context of each subcommand description.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.BR -? ,
.B --help
.ad
.sp .6
.RS 4n
Displays context help. Stops interpretation of any subsequent arguments.
.RE

.sp
.ne 2
.mk
.na
.BR -V ,
.B --version
.ad
.sp .6
.RS 4n
Displays version information.  Stops interpretation of any subsequent
arguments.
.RE

.SH OPERANDS
.sp
.LP
The following operands are used by one or more
.B isnsadm
subcommands.
.sp
.ne 2
.mk
.na
.I iscsi-node-name
.ad
.sp .6
.RS 4n
iSCSI target or iSCSI initiator symbolic name. A string with a maximum
length of 223 characters.
.RE

.sp
.ne 2
.mk
.na
.I discovery-domain-name
.ad
.sp .6
.RS 4n
Discovery domain symbolic name. A string with a maximum length of 256
characters.
.RE

.sp
.ne 2
.mk
.na
.I discovery-domain-set-name
.ad
.sp .6
.RS 4n
Discovery domain set symbolic name. A string with a maximum length of 256
characters.
.RE

.SH SUBCOMMANDS
.sp
.LP
The
.B isnsadm
command supports the subcommands described below.
.SS "\fBadd-dd\fR"
.sp
.LP
The
.B add-dd
subcommand adds a discovery domain to a discovery domain
set.
.sp
.LP
The
.B add-dd
subcommand has the following syntax:
.sp
.in +2
.nf
# \fBisnsadm add-dd \fIoption\fR \fIdiscovery-domain-name\fR, .\|.\|.\fR
.fi
.in -2
.sp

.sp
.LP
.B add-dd
has the following option:
.sp
.ne 2
.mk
.na
.B -s
.I discovery-domain-set-name
.ad
.sp .6
.RS 4n
Specifies a discovery domain set.
.RE

.SS "\fBadd-node\fR"
.sp
.LP
The
.B add-node
subcommand adds a node to a specified
discovery-domain.
.sp
.LP
The
.B add-node
subcommand has the following syntax:
.sp
.in +2
.nf
# \fBisnsadm add-node \fIoption\fR \fIiscsi-node-name\fR,.\|.\|.\fR
.fi
.in -2
.sp

.sp
.LP
.B add-node
has the following options:
.sp
.ne 2
.mk
.na
\fB-d\fR,\fB--dd\fR \fIdiscovery-domain-name\fR
.ad
.sp .6
.RS 4n
Specifies a discovery domain.
.RE

.SS "\fBcreate-dd\fR"
.sp
.LP
The
.B create-dd
subcommand creates a discovery domain with the name you
specify.
.sp
.LP
The
.B create-dd
subcommand has the following syntax:
.sp
.in +2
.nf
# \fBisnsadm create-dd \fIdiscovery-domain-name\fR, .\|.\|.\fR
.fi
.in -2
.sp

.sp
.LP
.B create-dd
has no options.
.SS "\fBcreate-dd-set\fR"
.sp
.LP
The
.B create-dd-set
subcommand creates a discovery domain set with the
name you specify.
.sp
.LP
The
.B create-dd-set
subcommand has the following syntax:
.sp
.in +2
.nf
# \fBisnsadm create-dd-set \fIdiscovery-domain-set-name\fR, .\|.\|.\fR
.fi
.in -2
.sp

.sp
.LP
.B create-dd-set
has no options.
.SS "\fBdelete-dd\fR"
.sp
.LP
The
.B delete-dd
subcommand deletes a discovery domain of the name you
specify.
.sp
.LP
The
.B delete-dd
subcommand has the following syntax:
.sp
.in +2
.nf
# \fBisnsadm delete-dd \fIdiscovery-domain-name\fR, .\|.\|.\fR
.fi
.in -2
.sp

.sp
.LP
.B delete-dd
has no options.
.SS "\fBdelete-dd-set\fR"
.sp
.LP
The
.B delete-dd-set
subcommand deletes a discovery domain set of the
name you specify.
.sp
.LP
The
.B delete-dd-set
subcommand has the following syntax:
.sp
.in +2
.nf
# \fBisnsadm delete-dd-set \fIdiscovery-domain-set-name\fR, .\|.\|.\fR
.fi
.in -2
.sp

.sp
.LP
.B delete-dd-set
has no options.
.SS "\fBdisable-dd-set\fR"
.sp
.LP
The
.B disable-dd-set
subcommand disables a discovery domain set.
.sp
.LP
The
.B disable-dd-set
subcommand has the following syntax:
.sp
.in +2
.nf
# \fBisnsadm disable-dd-set \fIdiscovery-domain-set-name\fR, .\|.\|.\fR
.fi
.in -2
.sp

.sp
.LP
.B disable-dd-set
has no options.
.SS "\fBenable-dd-set\fR"
.sp
.LP
The
.B enable-dd-set
subcommand enables a discovery domain set.
.sp
.LP
The
.B enable-dd-set
subcommand has the following syntax:
.sp
.in +2
.nf
# \fBisnsadm enable-dd-set \fIdiscovery-domain-set-name\fR, .\|.\|.\fR
.fi
.in -2
.sp

.sp
.LP
.B enable-dd-set
has no options.
.SS "\fBlist-dd\fR"
.sp
.LP
The
.B list-dd
subcommand displays information about discovery domains.
If no operand is specified, it lists all discovery domains that currently
exist on the iSNS server.
.sp
.LP
The
.B list-dd
subcommand has the following syntax:
.sp
.in +2
.nf
# \fBisnsadm list-dd [\fIoption\fR] [\fIdiscovery-domain-name\fR, .\|.\|.]\fR
.fi
.in -2
.sp

.sp
.LP
.B list-dd
supports the following option:
.sp
.ne 2
.mk
.na
.BR -v ,
.B --verbose
.ad
.sp .6
.RS 4n
Displays the member contents of the discovery domain(s).
.RE

.SS "\fBlist-dd-set\fR"
.sp
.LP
The
.B list-dd-set
subcommand lists the discovery domain sets, both
enabled and disabled, that exist on the iSNS server. Note that there is no
.B dd-set
registration. If no operand is specified, it lists all of the
discovery domain sets.
.sp
.LP
The
.B list-dd-set
subcommand has the following syntax:
.sp
.in +2
.nf
# \fBisnsadm list-dd-set [\fIoption\fR] [\fIdiscovery-domain-set-name\fR, .\|.\|.]\fR
.fi
.in -2
.sp

.sp
.LP
.B list-dd-set
supports the following option:
.sp
.ne 2
.mk
.na
.BR -v ,
.B --verbose
.ad
.sp .6
.RS 4n
Shows all discovery domains within the discovery domain set.
.RE

.SS "\fBlist-node\fR"
.sp
.LP
The
.B list-node
subcommand displays information about nodes that are
currently registered with the iSNS server or that are not registered and
belong to non-default discovery-domain(s). For the latter case, the node has
its type field shown as
.BR unknown .
If no operand is specified,
.B list-node
lists all nodes known by the iSNS server.
.sp
.LP
The
.B list-node
subcommand has the following syntax:
.sp
.in +2
.nf
# \fBisnsadm list-node [\fIoptions\fR] [\fIiscsi-node-name\fR, .\|.\|.]\fR
.fi
.in -2
.sp

.sp
.LP
.B list-node
supports the following options:
.sp
.ne 2
.mk
.na
.BR -t ,
.B --target
.ad
.sp .6
.RS 4n
Filters the list to display only iSCSI target nodes.
.RE

.sp
.ne 2
.mk
.na
.BR -i ,
.B --initiator
.ad
.sp .6
.RS 4n
Filters the list to display only iSCSI initiator nodes.
.RE

.sp
.ne 2
.mk
.na
.BR -v ,
.B --verbose
.ad
.sp .6
.RS 4n
Displays details about a node. Without this option, only the name, alias,
and type information are displayed.
.RE

.SS "\fBmodify-dd\fR"
.sp
.LP
The
.B modify-dd
subcommand modifies an attribute of a specified
discovery domain.
.sp
.LP
The
.B modify-dd
subcommand has the following syntax:
.sp
.in +2
.nf
# \fBisnsadm modify-dd \fIoption\fR \fIdiscovery-domain-name\fR
.fi
.in -2
.sp

.sp
.LP
.B modify-dd
has the following option:
.sp
.ne 2
.mk
.na
.B -n
.I discovery-domain-name
.ad
.sp .6
.RS 4n
Specifies the new name of a discovery domain to be applied to an existing
discovery-domain.
.RE

.SS "\fBmodify-dd-set\fR"
.sp
.LP
The
.B modify-dd-set
subcommand modifies a discovery domain set.
.sp
.LP
The
.B modify-dd-set
subcommand has the following syntax:
.sp
.in +2
.nf
# \fBisnsadm modify-dd-set \fIoption\fR \fIdiscovery-domain-set-name\fR
.fi
.in -2
.sp

.sp
.LP
.B modify-dd-set
has the following option:
.sp
.ne 2
.mk
.na
.B -n
.I discovery-domain-set-name
.ad
.sp .6
.RS 4n
Specifies the new name of a discovery domain set to be applied to an
existing discovery-domain-set.
.RE

.SS "\fBremove-dd\fR"
.sp
.LP
The
.B remove-dd
subcommand removes the association with a specified
discovery domain set.
.sp
.LP
The
.B remove-dd
subcommand has the following syntax:
.sp
.in +2
.nf
# \fBisnsadm remove-dd \fIoption\fR \fIdiscovery-domain-name\fR, .\|.\|.\fR
.fi
.in -2
.sp

.sp
.LP
.B remove-dd
has the following option:
.sp
.ne 2
.mk
.na
.B -s
.I discovery-domain-set-name
.ad
.sp .6
.RS 4n
Specifies the discovery domain set from which the discovery domain will 	be
removed.
.RE

.SS "\fBremove-node\fR"
.sp
.LP
The
.B remove-node
subcommand removes a node.
.sp
.LP
The
.B remove-node
subcommand has the following syntax:
.sp
.in +2
.nf
# \fBisnsadm remove-node \fIoption\fR \fIiscsi-node-name\fR, .\|.\|.\fR
.fi
.in -2
.sp

.sp
.LP
.B remove-node
has the following option:
.sp
.ne 2
.mk
.na
.B -d
.I discovery-domain-name
.ad
.sp .6
.RS 4n
Specifies the discovery domain from which a node will be removed.
.RE

.SS "\fBshow-config\fR"
.sp
.LP
The
.B show-config
subcommand displays the iSNS server administrative
settings. Note that the setting can be modified by means of the service
management facility (see
.BR smf (5)).
Refer to
.BR isns (1M).
.sp
.LP
The
.B show-config
subcommand has the following syntax:
.sp
.in +2
.nf
# \fBisnsadm show-config\fR
.fi
.in -2
.sp

.sp
.LP
.B show-config
has no options.
.SH EXAMPLES
.LP
.B Example 1
Displaying Clients
.sp
.LP
The following use of the
.B list-node
subcommand displays clients.

.sp
.in +2
.nf
# \fBisnsadm list-node -v\fR
iSCSI Name: iqn.1986-03.com.sun:01:000e0c9f10da.45173FEA.engr
        Alias: STK5320_NAS
        Type: Target
        Network Entity: SE5310
        Portal: 172.20.57.95:3260
                Portal Group: 1
        Portal: 172.20.56.95:3260
                Portal Group: 1
        DD Name: Default
iSCSI Name: iqn.1986-03.com.sun:01:000e0c9f10da.454F00A2.acct
        Alias:
        Type: Target
        Network Entity: SE5310
        Portal: 172.20.57.95:3260
                Portal Group: 1
        Portal: 172.20.56.95:3260
                Portal Group: 1
        DD Name: Default
iSCSI Name: iqn.1986-03.com.sun:01:e00000000000.46fd8e2b
        Alias: host-x2100
        Type: Initiator
        Network Entity: iqn.1986-03.com.sun:01:e00000000000.46fd8e2b
        Portal: 172.20.236.123:58530
                Portal Group: 1
        DD Name: Default
.fi
.in -2
.sp

.LP
.B Example 2
Displaying a Discovery Domain
.sp
.LP
The following use of the
.B list-dd
subcommand displays discovery
domains.

.sp
.in +2
.nf
# \fBisnsadm list-dd -v\fR
DD name: Default
        DD set(s): Default
	iSCSI Name: iqn.1986-03.com.sun:01:000e0c9f10da.45173FEA.engr
	iSCSI Name: iqn.1986-03.com.sun:01:000e0c9f10da.454F00A2.acct
        iSCSI name: iqn.1986-03.com.sun:01:e00000000000.46fd8e2b
DD name: acct-dd
DD name: engineering-dd
.fi
.in -2
.sp

.LP
.B Example 3
Adding a Node
.sp
.LP
The following use of the
.B add-node
subcommand adds a node to a
discovery domain, creating a discovery domain membership.

.sp
.in +2
.nf
# \fBisnsadm add-node -d engineering-dd \e
iqn.1986-03.com.sun:01:000e0c9f10da.454F00A2.engr\fR
.fi
.in -2
.sp

.LP
.B Example 4
Removing a Node
.sp
.LP
The following use of the
.B remove-node
subcommand removes a node from a
discovery domain, thereby removing a discovery domain membership.

.sp
.in +2
.nf
# \fBisnsadm remove-node -d acct-dd \e
iqn.1986-03.com.sun:01:000e0c9f10da.454F00A2.acct\fR
.fi
.in -2
.sp

.LP
.B Example 5
Creating a Discovery Domain Set
.sp
.LP
The following use of the
.B create-dd-set
subcommand creates a discovery
domain set.

.sp
.in +2
.nf
# \fBisnsadm create-dd-set operation-dd-set\fR
.fi
.in -2
.sp

.LP
.B Example 6
Displaying a Discovery Domain Set
.sp
.LP
The following use of the
.B list-dd-set
subcommand displays discovery
domain sets.

.sp
.in +2
.nf
# \fBisnsadm list-dd-set -v\fR
DD Set name: Default
        State: Disabled
        DD Name: Default
DD Set name: operation-dd-set
        State: Disabled
.fi
.in -2
.sp

.LP
.B Example 7
Adding a Discovery Domain
.sp
.LP
The following use of the
.B add-dd
subcommand adds a discovery domain to
a discovery domain set.

.sp
.in +2
.nf
# \fBisnsadm add-dd -s operation-dd-set engineering-dd\fR
.fi
.in -2
.sp

.LP
.B Example 8
Displaying a Discovery Domain Set
.sp
.LP
The following use of the
.B list-dd-set
displays the attributes of a
discovery domain set.

.sp
.in +2
.nf
# \fBisnsadm list-dd-set\fR
DD Set name: Default
        State: Disabled
        DD Name: Default
DD Set name: operation-dd-set
        State: Disabled
        DD Name: engineering-dd
.fi
.in -2
.sp

.LP
.B Example 9
Enabling a Discovery Domain Set
.sp
.LP
The following use of the
.B enable-dd-set
subcommand enables a discovery
domain set.

.sp
.in +2
.nf
# \fBisnsadm enable-dd-set Default\fR
.fi
.in -2
.sp

.LP
.B Example 10
Disabling a Discovery Domain Set
.sp
.LP
The following use of the
.B disable-dd-set
subcommand disables a
discovery domain set.

.sp
.in +2
.nf
# \fBisnsadm disable-dd-set Default\fR
.fi
.in -2
.sp

.LP
.B Example 11
Displaying Administrative Settings
.sp
.LP
The following use of the
.B show-config
subcommand displays current
administrative settings.

.sp
.in +2
.nf
# \fBisnsadm show-config\fR
        Data Store Location: /etc/isns/isnsdata.xml
        Entity Status Inquiry Non-Response Threshold: 3
        Management SCN Enabled: yes
        Authorized Control Node Names: -
.fi
.in -2
.sp

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWisnsadm
_
Interface StabilityVolatile
.TE

.SH SEE ALSO
.sp
.LP
.BR iscsiadm (1M),
.BR iscsitadm (1M),
.BR isns (1M),
.BR attributes (5),
.BR smf (5)
.SH NOTES
.sp
.LP
When a subcommand is invoked with multiple operands and there are failures
on one or more, but not all, operands,
.B isnsadm
displays a generic
message indicating partial failure, with list of failed operands. An error
on a specific operand can be found by issuing the same subcommand on the
failing operand.
