usr/src/man/man1m/itu.1m
'\" te
.\" Copyright (c) 2008, Sun Microsystems, Inc. All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH itu 1M "23 Sep 2009" "SunOS 5.11" "System Administration Commands"
.SH NAME
itu \- convert packages to Driver Update format and patch Solaris install
media for Install Time Update
.SH SYNOPSIS
.LP
.nf
\fBitu makedu\fR \fB-r\fR \fIsolaris_release\fR [\fB-v\fR] [\fB-f\fR] [\fB-d\fR \fIoutput_dir\fR] [\fB-o\fR \fIiso_file\fR]
     [\fB-l\fR \fIiso_label\fR] \fIpackage\fR [\fIpackage\fR.\|.\|.]
.fi

.LP
.nf
\fBitu updatemedia\fR \fB-R\fR \fImedia_root\fR [\fB-v\fR] [\fB-f\fR] [\fB-o\fR \fIiso_file\fR]
     [\fB-l\fR \fIiso_label\fR] \fIpkg_or_patch\fR [\fIpkg_or_patch\fR.\|.\|.]
.fi

.LP
.nf
\fBitu makeiso\fR \fB-o\fR \fIiso_file\fR [\fB-v\fR] [\fB-l\fR \fIiso_label\fR] \fImedia_root\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B itu
utility converts driver packages to Driver Update (DU) format
and patches a Solaris install media with driver packages and patches for
Install Time Update (ITU).
.B itu
has three subcommands:
.BR makedu ,
.B updatemedia
and
.BR makeiso .
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -d
.I output_dir
.ad
.sp .6
.RS 4n
Directory where the Driver Update directory is to be created.
.RE

.sp
.ne 2
.mk
.na
.B -f
.ad
.sp .6
.RS 4n
If \fIoutput_dir\fR/DU or \fIiso_file\fR already exists, remove it without
asking first.
.RE

.sp
.ne 2
.mk
.na
.B -l
.I iso_label
.ad
.sp .6
.RS 4n
Label/volume name of the ISO image (if
.B -o
option is specified).
.RE

.sp
.ne 2
.mk
.na
.B -o
.I iso_file
.ad
.sp .6
.RS 4n
Path of the ISO image file to be created. For subcommands \fBupdatemedia\fR
and
.BR makeiso ,
it will be a bootable ISO image. This option must be
specified for subcommand
.BR makeiso .
.RE

.sp
.ne 2
.mk
.na
.B -R
.I media_root
.ad
.sp .6
.RS 4n
Top-level directory of on-disk image of Solaris installation media. This
option must be specified for subcommand
.BR updatemedia .
.RE

.sp
.ne 2
.mk
.na
.B -r
.I solaris_release
.ad
.sp .6
.RS 4n
Solaris release number for which the Driver Update is intended. It takes
the form of the output of
.BR "uname -r" ,
for example,
.BR 5.10 .
This option must be specified for subcommand
.BR makedu .
.RE

.sp
.ne 2
.mk
.na
.B -v
.ad
.sp .6
.RS 4n
Verbose. Multiple
.B -v
options increase verbosity.
.RE

.SH SUB-COMMANDS
.sp
.LP
The
.B itu
subcommands are described as follows.
.SS "\fBmakedu\fR"
.sp
.LP
The
.B makedu
subcommand takes one or more driver packages as input and
converts them to DU format. At the beginning of an interactive Solaris
installation session, these driver updates can be applied to the running
kernel, which will then also automatically apply them to the newly installed
Solaris at the end of the installation process.
.sp
.LP
The
.B -r
option is required to specify the Solaris release number for
which the driver updates apply. The
.I solaris_release
option argument
takes the form
.B "uname -r"
output, for example,
.B 5.10
or
.BR 5.11 .
.sp
.LP
If the
.B -d
option is specified, the resulting DU directory tree is
placed in the directory
.IR output_dir .
.sp
.LP
If the
.B -o
option is specified, a (non-bootable) ISO image of the DU
directory tree is written in the file
.IR iso_file .
This ISO image can be
burned onto a CD/DVD using
.BR cdrw (1)
or
.B cdrecord(1)
(not a SunOS
man page). See the "Examples" section below for an example of creating a DU
on a floppy.
.sp
.LP
At least one of
.B -d
and
.B -o
option must be specified. If both are
specified, then both an ISO image and a directory tree are generated.
.SS "\fBupdatemedia\fR"
.sp
.LP
The
.B updatemedia
subcommand takes a list of driver packages and
patches as input and applies them to the miniroot of a Solaris install
media. It also places them in a subdirectory called
.B ITUs
under the
Solaris install media's top-level directory:
.sp
.in +2
.nf
\fImedia_root\fR/ITUs
.fi
.in -2
.sp

.sp
.LP
When booting a system from the updated media, the patches and packages will
be part of the booted Solaris image. They will also be applied to the target
system being installed at the end of the installation process.
.sp
.LP
The
.B -R
option must be entered on the command line to specify the
Solaris install media. Note that the install media must be on a location
that is writable by
.BR itu .
.sp
.LP
If the
.B -o
option is specified, a bootable ISO image of the patched
install media is also created in the file
.IR iso_file .
The ISO image can
then be burned onto a CD or DVD.
.SS "\fBmakeiso\fR"
.sp
.LP
The
.B makeiso
subcommand runs
.B mkisofs(8)
to create a bootable
Solaris ISO image of the Solaris install media
.I media_root
and writes
it to the file
.IR iso_file .
The ISO image file can then be burned onto a
CD or DVD with utilities such as
.BR cdrw (1)
or
.BR cdrecord(1) .
(Note
that
.B mkisofs(8)
and
.B cdrecord(1)
are not SunOS man pages.)
.LP
Caution -
.sp
.RS 2
The Solaris install media
.I media-root
must contain the file
.BR boot/grub/stage2_eltorito ,
which will be written to the media boot
sectors. This file will be modified with some boot information, thus it has
to be writable. If necessary, first save a copy, prior to running this
subcommand.
.RE
.SH OPERANDS
.sp
.LP
The following operands are supported:
.sp
.ne 2
.mk
.na
\fIpackage\fR [\fIpackage\fR.\|.\|.]\fR
.ad
.sp .6
.RS 4n
One or more driver packages.
.RE

.sp
.ne 2
.mk
.na
\fIpkg_or_patch\fR [\fIpkg_or_patch\fR.\|.\|.]\fR
.ad
.sp .6
.RS 4n
One or more patches or packages.
.RE

.sp
.ne 2
.mk
.na
.I media_root
.ad
.sp .6
.RS 4n
The top-level directory of a Solaris install media.
.RE

.SH EXAMPLES
.LP
.B Example 1
Creating a DU CD/DVD
.sp
.LP
The following commands create a Driver Update CD/DVD containing the
packages
.B SAMPLEpkg1
and
.BR SAMPLEpkg2 .

.sp
.in +2
.nf
# \fBitu makedu -r 5.10 -o my.iso SAMPLEpkg1 SAMPLEpkg2\fR
# \fBcdrw -i my.iso\fR
.fi
.in -2
.sp

.LP
.B Example 2
Creating a DU Floppy
.sp
.LP
The following commands create a Driver Update floppy containing the driver
package
.BR MYdriver .

.sp
.in +2
.nf
# \fBrmformat -F quick /dev/rdiskette\fR
# \fBmkfs -F pcfs /dev/rdiskette\fR
# \fBmount -F pcfs /dev/diskette /mnt\fR
# \fB/usr/bin/itu makedu -r 5.10 -d /mnt /export/MYdriver\fR
# \fBumount /mnt\fR
# \fBdd if=/dev/rdiskette of=floppy.dd\fR
.fi
.in -2
.sp

.sp
.LP
The
.B itu
command above creates the DU directly onto the floppy mounted
on
.BR /mnt .
The
.B dd
invocation stores an image of the floppy in the
file
.BR floppy.dd .
This is useful for distributing a DU floppy in file
form. From the file, the floppy can then be recreated as follows:

.sp
.in +2
.nf
# \fBdd if=floppy.dd of=/dev/rdiskette\fR
.fi
.in -2
.sp

.LP
.B Example 3
Patching the Solaris Install Media
.sp
.LP
The following command patches the Solaris install media in
.B /export/s10u1
with patch
.B /opt/patches/123456-07
and driver
package
.BR /opt/pkgs/MYdriver .
The command also creates a bootable ISO
image with ISO label "\fBMyS10U1\fR" in the file \fB/tmp/dvd.iso\fR.

.sp
.in +2
.nf
# \fB/usr/bin/itu updatemedia -R /export/s10u1 -o /tmp/dvd.iso -l MyS10U1 \e
       /opt/patches/123456-07 /opt/pkgs/MYdriver\fR
.fi
.in -2
.sp

.LP
.B Example 4
Creating a Bootable ISO Image
.sp
.LP
The following commands create the bootable ISO image
.B mydvd.iso
of the
Solaris install image
.B /export/solaris-10u1
with ISO label
"\fBSpecial-S10\fR".

.sp
.in +2
.nf
# \fB/usr/bin/itu makeiso -o mydvd.iso -l "Special-S10" \e
     /export/solaris-10u1\fR
# \fBcdrw -i mydvd.iso\fR
.fi
.in -2
.sp

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
.BR cdrw (1),
.BR patchadd (1M),
.BR pkgadd (1M),
.BR attributes (5)
.sp
.LP
.BR mkisofs(8) ,
(\fB/usr/share/man/man8/mkisofs.8\fR), in the
.B SUNWfsman
package (not a SunOS man page)
