usr/src/man/man1m/k5srvutil.1m
'\" te
.\" Copyright (c) 2006, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH k5srvutil 1M "29 Aug 2006" "SunOS 5.11" "System Administration Commands"
.SH NAME
k5srvutil \- host key table (keytab) manipulation utility
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/k5srvutil\fR \fIoperation\fR [\fB-ik\fR] [\fB-f\fR \fIfilename\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The
.B k5srvutil
command allows a system manager to list or change keys
currently in his keytab or to add new keys to the keytab.
.sp
.LP
The operand
.I operation
must be one of the following:
.sp
.ne 2
.mk
.na
.B list
.ad
.RS 10n
.rt
Lists the keys in a keytab, showing version number and principal name.
.RE

.sp
.ne 2
.mk
.na
.B change
.ad
.RS 10n
.rt
Changes all the keys in the keytab to new randomly-generated keys, updating
the keys in the Kerberos server's database to match those by using the
.B kadmin
protocol. If a key's version number does not match the version
number stored in the Kerberos server's database, the operation fails. The
old keys are retained so that existing tickets continue to work. If the
.B -i
flag is specified,
.B k5srvutil
prompts for
.B yes
or
.B no
before changing each key. If the
.B -k
option is used, the old
and new keys are displayed.
.RE

.sp
.ne 2
.mk
.na
.B delold
.ad
.RS 10n
.rt
Deletes keys that are not the most recent version from the keytab. This
operation should be used at some point after a change operation to remove
old keys. If the
.B -i
flag is specified,
.B k5srvutil
asks the user
whether the old keys associated with each principal should be removed.
.RE

.sp
.ne 2
.mk
.na
.B delete
.ad
.RS 10n
.rt
Deletes particular keys in the keytab, interactively prompting for each
key.
.RE

.sp
.LP
In all cases, the default keytab file is
.B /etc/krb5.keytab
file unless
this is overridden by the
.B -f
option.
.sp
.LP
.B k5srvutil
uses the
.BR kadmin "(1M) program to edit the keytab in"
place. However, old keys are retained, so they are available in case of
failure.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -f
.I filename
.ad
.RS 15n
.rt
Specify a keytab file other than the default file,
.BR /etc/krb5.keytab .
.RE

.sp
.ne 2
.mk
.na
.B -i
.ad
.RS 15n
.rt
Prompts user before changing keys when using the
.B change
or
.B delold
operands.
.RE

.sp
.ne 2
.mk
.na
.B -k
.ad
.RS 15n
.rt
Displays old and new keys when using the
.B change
operand.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWkdcu
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
.BR ktutil (1),
.BR kadmin (1M),
.BR attributes (5)
