usr/src/man/man1m/kadb.1m
'\" te
.\" Copyright (c) 2001 Sun Microsystems, Inc. All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH kadb 1M "2 Jul 2004" "SunOS 5.11" "System Administration Commands"
.SH NAME
kadb \- a kernel debugger
.SH SYNOPSIS
.SS "SPARC"
.LP
.nf
\fBok\fR boot \fIdevice_specifier\fR kadb [\fB-d\fR] [\fIboot-flags\fR]
.fi

.SS "x86"
.LP
.nf
\fBselect\fR (b)oot or (i)nterpreter: b kadb [\fB-d\fR] [\fIboot-flags\fR]
.fi

.SH DESCRIPTION
.sp
.LP
.BR kadb ,
an interactive kernel debugger, has been replaced by
.BR kmdb (1).
For backwards compatibility, the methods used to load
\fBkadb\fR will be interpreted as requests to load
.BR kmdb (1).
Unlike
with the compatibility link from
.BR adb (1)
to
.BR mdb (1),
.BR kmdb (1)
will always load in its native user interface mode, regardless of the name
used to load it.
.sp
.LP
.BR kmdb (1)
is based on
.BR mdb (1),
and thus shares
.BR mdb "'s user"
interface style and feature set. The
.BR mdb (1)
man page describes the
features and operation of
.BR mdb .
The
.BR kmdb (1)
man page describes
the differences between
.B mdb
and
.BR kmdb .
This man page describes
the major changes and incompatibilities between
.B kadb
and
.BR kmdb .
.sp
.LP
Consult the
.I "Solaris Modular Debugger Guide"
for a detailed description
of both
.B mdb
and
.BR kmdb .
.SS "Major changes"
.sp
.LP
This section briefly lists the major differences between
.B kadb
and
.BR kmdb .
It is not intended to be exhaustive.
.sp
.ne 2
.mk
.na
.B Debugger Loading and Unloading
.ad
.sp .6
.RS 4n
.BR kmdb (1)
may be loaded at boot, as with
.BR kadb .
It may also be
loaded after boot, thus allowing for kernel debugging and execution control
without requiring a system reboot. If
.BR kmdb (1)
is loaded after boot, it
may be unloaded.
.RE

.sp
.ne 2
.mk
.na
.B mdb Feature Set
.ad
.sp .6
.RS 4n
The features introduced by
.BR mdb (1),
including access to kernel type
data, debugger commands (dcmds), debugger modules (dmods), and enhanced
execution control facilities, are available under
.BR kmdb (1).
Support for
changing the representative CPU (:x) is available for both SPARC and x86.
Furthermore, full execution-control facilities are available after the
representative CPU has been changed.
.RE

.SS "Significant Incompatibilities"
.sp
.LP
This section lists the significant features that have changed incompatibly
between
.B kadb
and
.BR kmdb (1).
It is not intended to be exhaustive.
All
.BR kmdb (1)
commands referenced here are fully described in the
.BR kmdb (1)
man page. A description as well as examples can be found in
the
.IR "Solaris Modular Debugger Guide" .
.sp
.ne 2
.mk
.na
\fBDeferred Breakpoints\fR
.ad
.sp .6
.RS 4n
The kadb-style "module#symbol:b" syntax is not supported under
\fBkmdb\fR(1). Instead, use "::bp module`symbol".
.RE

.sp
.ne 2
.mk
.na
.B Watchpoints
.ad
.sp .6
.RS 4n
The ::wp dcmd is the preferred way to set watchpoint with
.BR kmdb .
Various options are available to control the type of watchpoint set,
including
.B -p
for physical watchpoints (SPARC only), and
.B -i
for
I/O port watchpoints (x86 only). $l is not supported, therefore, the
watchpoint size must be specified for each watchpoint created.
.RE

.sp
.ne 2
.mk
.na
.B "Access to I/O Ports (x86 only)
.ad
.sp .6
.RS 4n
The commands used to access I/O ports under
.B kadb
have been replaced
with the ::in and ::out dcmds. These two dcmds allow both read and write of
all I/O port sizes supported by
.BR kadb .
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcar
.TE

.SH SEE ALSO
.sp
.LP
.BR adb (1),
.BR mdb (1),
.BR kmdb (1),
.BR attributes (5)
.sp
.LP
.I Solaris Modular Debugger Guide
