usr/src/man/man1m/kadmind.1m
'\" te
.\" Copyright 1987, 1989 by the Student Information Processing Board of the
.\" Massachusetts Institute of Technology. For copying and distribution
.\" information, please see the file kerberosv5/mit-sipb-copyright.h.
.\" Portions Copyright (c) 2007, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH kadmind 1M "29 Feb 2008" "SunOS 5.11" "System Administration Commands"
.SH NAME
kadmind \- Kerberos administration daemon
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/krb5/kadmind\fR [\fB-d\fR] [\fB-m\fR] [\fB-p\fR \fIport-number\fR] [\fB-r\fR \fIrealm\fR]
     \fB-x\fR \fIdb_args\fR]...
.fi

.SH DESCRIPTION
.sp
.LP
.B kadmind
runs on the master key distribution center
.RB ( KDC ),
which
stores the principal and policy databases.
.B kadmind
accepts remote
requests to administer the information in these databases. Remote requests
are sent, for example, by
.BR kpasswd (1),
.BR gkadmin (1M),
and
.BR kadmin (1M)
commands, all of which are clients of
.BR kadmind .
When
you install a
.BR KDC ,
.B kadmind
is set up in the
.B init
scripts
to start automatically when the
.B KDC
is rebooted.
.sp
.LP
.B kadmind
requires a number of configuration files to be set up for it
to work:
.sp
.ne 2
.mk
.na
.B /etc/krb5/kdc.conf
.ad
.sp .6
.RS 4n
The
.B KDC
configuration file contains configuration information for the
.B KDC
and the Kerberos administration system.
.B kadmind
understands
a number of configuration variables (called relations) in this file, some of
which are mandatory and some of which are optional. In particular,
.B kadmind
uses the
.BR acl_file ,
.BR dict_file ,
.BR admin_keytab ,
and
.B kadmind_port
relations in the [\fIrealms\fR] section. Refer to the
.BR kdc.conf (4)
man page for information regarding the format of the
.B KDC
configuration file.
.RE

.sp
.ne 2
.mk
.na
.B /etc/krb5/kadm5.keytab
.ad
.sp .6
.RS 4n
.B kadmind
requires a
.B keytab
(key table) containing correct
entries for the \fBkadmin\fR/\fIfqdn\fR, \fBkadmin\fR/\fBchangepw\fR and
\fBkadmin\fR/\fBchangepw\fR principals for every realm that \fBkadmind\fR
answers requests. The
.B keytab
can be created with the
.BR kadmin.local (1M)
or
.BR kdb5_util (1M)
command. The location of the
keytab is determined by the
.B admin_keytab
relation in the
.BR kdc.conf (4)
file.
.RE

.sp
.ne 2
.mk
.na
.B /etc/krb5/kadm5.acl
.ad
.sp .6
.RS 4n
.B kadmind
uses an
.B ACL
(access control list) to determine which
principals are allowed to perform Kerberos administration actions. The path
of the
.B ACL
file is determined by the
.B acl_file
relation in the
.B kdc.conf
file. See
.BR kdc.conf (4).
For information regarding the
format of the
.B ACL
file, refer to
.BR kadm5.acl (4).
.sp
The
.B kadmind
daemon will need to be restarted to reread the
.B kadm5.acl
file after it has been modified. You can do this, as root,
with the following command:
.sp
.in +2
.nf
# svcadm restart svc:/network/security/kadmin:default
.fi
.in -2
.sp

.RE

.sp
.LP
After
.B kadmind
begins running, it puts itself in the background and
disassociates itself from its controlling terminal.
.sp
.LP
.B kadmind
can be configured for incremental database propagation.
Incremental propagation allows slave KDC servers to receive principal and
policy updates incrementally instead of receiving full dumps of the
database. These settings can be changed in the
.BR kdc.conf (4)
file:
.sp
.ne 2
.mk
.na
.B sunw_dbprop_enable = [true | false]
.ad
.sp .6
.RS 4n
Enable or disable incremental database propagation. Default is
.BR false .
.RE

.sp
.ne 2
.mk
.na
.B sunw_dbprop_master_ulogsize = N
.ad
.sp .6
.RS 4n
Specifies the maximum amount of log entries available for incremental
propagation to the slave KDC servers. The maximum value that this can be is
2500 entries. Default value is 1000 entries.
.RE

.sp
.LP
The \fBkiprop/\fI<hostname>\fB@\fI<REALM>\fR principal must exist
in the master's
.B kadm5.keytab
file to enable the slave to authenticate
incremental propagation from the master. In the principal syntax above,
.I <hostname>
is the master KDC's host name and
.I <REALM>
is the
realm in which the master KDC resides.
.sp
.LP
Kerberos client machines can automatically migrate Unix users to the
default Kerberos realm specified in the local
.BR krb5.conf (4),
if the
user does not have a valid kerberos account already. You achieve this by
using the
.BR pam_krb5_migrate (5)
service module for the service in
question. The Kerberos service principal used by the client machine
attempting the migration needs to be validated using the
.B u
privilege
in
.BR kadm5.acl (4).
When using the
.B u
.RB privilege, " kadmind"
validates user passwords using PAM, specifically using a
.B PAM_SERVICE
name of
.B k5migrate
by calling
.BR pam_authenticate "(3PAM) and"
.BR pam_acct_mgmt (3PAM).
.sp
.LP
A suitable PAM stack configuration example for
.B k5migrate
would look
like:
.sp
.in +2
.nf
k5migrate        auth    required        pam_unix_auth.so.1
k5migrate        account required        pam_unix_account.so.1
.fi
.in -2
.sp

.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -d
.ad
.sp .6
.RS 4n
Specifies that
.B kadmind
does not put itself in the background and does
not disassociate itself from the terminal. In normal operation, you should
use the default behavior, which is to allow the daemon to put itself in the
background.
.RE

.sp
.ne 2
.mk
.na
.B -m
.ad
.sp .6
.RS 4n
Specifies that the master database password should be retrieved from the
keyboard rather than from the stash file. When using
.BR -m ,
the
.B kadmind
daemon receives the password prior to putting itself in the
background. If used in combination with the
.B -d
option, you must
explicitly place the daemon in the background.
.RE

.sp
.ne 2
.mk
.na
.B -p
.I port-number
.ad
.sp .6
.RS 4n
Specifies the port on which the
.B kadmind
daemon listens for
connections. The default is controlled by the
.B kadmind_port
relation in
the
.BR kdc.conf (4)
file.
.RE

.sp
.ne 2
.mk
.na
.B -r
.I realm
.ad
.sp .6
.RS 4n
Specifies the default realm that
.B kadmind
serves. If
.I realm
is
not specified, the default
.I realm
of the host is used.
.B kadmind
answers requests for any realm that exists in the local
.B KDC
database
and for which the appropriate principals are in its
.BR keytab .
.RE

.sp
.ne 2
.mk
.na
.B -x
.I db_args
.ad
.sp .6
.RS 4n
Pass database-specific arguments to
.BR kadmind .
Supported arguments are
for LDAP and the
.B Berkeley-db2
plug-in. These arguments are:
.sp
.ne 2
.mk
.na
\fBbinddn\fR=\fIbinddn\fR
.ad
.sp .6
.RS 4n
LDAP simple bind DN for authorization on the directory server. Overrides
the
.B ldap_kadmind_dn
parameter setting in
.BR krb5.conf (4).
.RE

.sp
.ne 2
.mk
.na
\fBbindpwd\fR=\fIbindpwd\fR
.ad
.sp .6
.RS 4n
Bind password.
.RE

.sp
.ne 2
.mk
.na
\fBdbname\fR=\fIname\fR
.ad
.sp .6
.RS 4n
For the
.B Berkeley-db2
plug-in, specifies a name for the Kerberos
database.
.RE

.sp
.ne 2
.mk
.na
\fBnconns\fR=\fInum\fR
.ad
.sp .6
.RS 4n
Maximum number of server connections.
.RE

.sp
.ne 2
.mk
.na
\fBport\fR=\fInum\fR
.ad
.sp .6
.RS 4n
Directory server connection port.
.RE

.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B /var/krb5/principal
.ad
.sp .6
.RS 4n
Kerberos principal database.
.RE

.sp
.ne 2
.mk
.na
.B /var/krb5/principal.ulog
.ad
.sp .6
.RS 4n
The update log file for incremental propagation.
.RE

.sp
.ne 2
.mk
.na
.B /var/krb5/principal.kadm5
.ad
.sp .6
.RS 4n
Kerberos administrative database containing policy information.
.RE

.sp
.ne 2
.mk
.na
.B /var/krb5/principal.kadm5.lock
.ad
.sp .6
.RS 4n
Kerberos administrative database lock file. This file works backwards from
most other lock files (that is,
.B kadmin
exits with an error if this
file does not exist).
.RE

.sp
.ne 2
.mk
.na
.B /var/krb5/kadm5.dict
.ad
.sp .6
.RS 4n
Dictionary of strings explicitly disallowed as passwords.
.RE

.sp
.ne 2
.mk
.na
.B /etc/krb5/kadm5.acl
.ad
.sp .6
.RS 4n
List of principals and their
.B kadmin
administrative privileges.
.RE

.sp
.ne 2
.mk
.na
.B /etc/krb5/kadm5.keytab
.ad
.sp .6
.RS 4n
Keytab for
.B kadmin
principals: \fBkadmin\fR/\fIfqdn\fR,
\fBchangepw\fR/\fIfqdn\fR, and \fBkadmin\fR/\fBchangepw\fR.
.RE

.sp
.ne 2
.mk
.na
.B /etc/krb5/kdc.conf
.ad
.sp .6
.RS 4n
.B KDC
configuration information.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWkdcu
_
Interface StabilityEvolving
.TE

.SH SEE ALSO
.sp
.LP
.BR kpasswd (1),
.BR svcs (1),
.BR gkadmin (1M),
.BR kadmin (1M),
.BR kadmin.local (1M),
.BR kdb5_util (1M),
.BR kdb5_ldap_util (1M),
.BR kproplog (1M),
.BR svcadm (1M),
.BR pam_acct_mgmt (3PAM),
.BR pam_authenticate (3PAM),
.BR kadm5.acl (4),
.BR kdc.conf (4),
.BR krb5.conf (4),
.BR attributes (5),
.BR kerberos (5),
.BR krb5envvar (5),
.BR pam_krb5_migrate (5),
.BR smf (5)
.SH NOTES
.sp
.LP
The Kerberos administration daemon
.RB ( kadmind )
is now compliant with
the change-password standard mentioned in RFC 3244, which means it can now
handle change-password requests from non-Solaris Kerberos clients.
.sp
.LP
The
.B kadmind
service is managed by the service management facility,
.BR smf (5),
under the service identifier:
.sp
.in +2
.nf
svc:/network/security/kadmin
.fi
.in -2
.sp

.sp
.LP
Administrative actions on this service, such as enabling, disabling, or
requesting restart, can be performed using
.BR svcadm (1M).
The service's
status can be queried using the
.BR svcs (1)
command.
