usr/src/man/man1m/kcfd.1m
'\" te
.\" Copyright (c) 2003, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH kcfd 1M "30 Sep 2003" "SunOS 5.11" "System Administration Commands"
.SH NAME
kcfd \- kernel-level cryptographic framework daemon
.SH SYNOPSIS
.LP
.nf
\fBkcfd\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B kcfd
daemon helps in managing CPU usage by cryptographic
operations performed in software by kernel threads. The system utilization
associated with these threads is charged to the
.B kcfd
process. It also
does module verification for kernel cryptographic modules.
.sp
.LP
Only a privileged user can run this daemon.
.sp
.LP
The
.B kcfd
daemon is automatically invoked in run level 1, after
.B /usr
is mounted. A previously invoked
.B kcfd
daemon that is still
running must be stopped before invoking another
.B kcfd
command.
.sp
.LP
Manually starting and restarting
.B kcfd
is not recommended. If it is
necessary to do so, use the
.BR cryptoadm (1M)
.B
start \c
and
.B stop
subcommands.
.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 8n
.rt
Daemon started successfully.
.RE

.sp
.ne 2
.mk
.na
.B > 1
.ad
.RS 8n
.rt
Daemon failed to start.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsl/SUNWcslx
_
Interface StabilityEvolving
.TE

.SH SEE ALSO
.sp
.LP
.BR cryptoadm (1M),
.BR attributes (5)
