usr/src/man/man1m/kclient.1m
'\" te
.\" Copyright (c) 2008, Sun Microsystems, Inc. All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH kclient 1M "27 May 2009" "SunOS 5.11" "System Administration Commands"
.SH NAME
kclient \- set up a machine as a Kerberos client
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/kclient\fR [\fB-n\fR] [\fB-R\fR \fIrealm\fR] [\fB-k\fR \fIkdc\fR] [\fB-a\fR \fIadminuser\fR]
     [\fB-c\fR \fIfilepath\fR] [\fB-d\fR \fIdnsarg\fR] [\fB-f\fR \fIfqdn_list\fR] [\fB-h\fR \fIlogical_host_name\fR]
     [\fB-k\fR \fIkdc_list\fR] [\fB-m\fR \fImaster_kdc\fR] [\fB-p\fR \fIprofile\fR] [\fB-s\fR \fIpam_service\fR]
     [\fB-T\fR \fIkdc_vendor\fR]
.fi

.SH DESCRIPTION
.sp
.LP
By specifying the various command options, you can use the \fBkclient\fR
utility to:
.RS +4
.TP
.ie t \(bu
.el o
Configure a machine as a Kerberos client for a specified realm and for KDC
by setting up \fBkrb5.conf\fR(4).
.RE
.RS +4
.TP
.ie t \(bu
.el o
Add the Kerberos host principal to the local host's
.B keytab
file
(\fB/etc/krb5/krb5.keytab\fR).
.RE
.RS +4
.TP
.ie t \(bu
.el o
Set up the machine to do kerberized NFS.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Bring over a master \fBkrb5.conf\fR copy from a specified pathname.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Setup a machine to do server and/or host/domain name-to-realm mapping
lookups by means of DNS.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Configure a Kerberos client to use an MS Active Directory server. This
generates a
.B keytab
file with the Kerberos client's service keys
populated.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Setup a Kerberos client that has no service keys. This is useful when the
client does not require service keys, because the client does not wish to
host a service that uses Kerberos for security.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Configure a Kerberos client that is part of a cluster. This option requires
the logical host name of the cluster so that the proper service keys are
created and populated in the client's
.B keytab
file.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Setup a Kerberos client to join an environment that consists of Kerberos
servers that are non-Solaris and non-MS Active Directory servers.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Configure
.BR pam.conf (4)
to use Kerberos authentication for specified
services.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Configure the client as a simple NTP broadcast/multicast client.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Specify custom domain/host name-to-realm name mappings.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Setup the Kerberos client to use multiple KDC servers.
.RE
.sp
.LP
The
.B kclient
utility needs to be run on the client machine with root
permission and can be run either interactively or non-interactively. In the
non-interactive mode, the user feeds in the required inputs by means of a
profile, command-line options, or a combination of profile and command-line
options. The user is prompted for "required" parameter values (\fBrealm\fR
and
.BR adminuser ),
if found missing in the non-interactive run. The
interactive mode is invoked when the utility is run without any command-line
arguments.
.sp
.LP
Both the interactive and non-interactive forms of
.B kclient
can add the
\fBhost/fqdn\fR entry to the local host's \fBkeytab\fR file. They also can
require the user to enter the password for the administrative user
requested, to obtain the Kerberos Ticket Granting Ticket (TGT) for
.BR adminuser .
The
.BR host/fqdn ,
\fBnfs/fqdn\fR, and \fBroot/fqdn\fR
principals can be added to the KDC database (if not already present) before
their possible addition to the local host's \fBkeytab\fR.
.sp
.LP
The
.B kclient
utility assumes that the local host has been setup for
DNS and requires the presence of a valid
.BR resolv.conf (4).
Also,
\fBkclient\fR can fail if the localhost time is not synchronized with that
of the KDC. For Kerberos to function the localhost time must be within five
minutes of that of the KDC. It is advised that both systems run some form of
time synchronization protocol, such as the Network Time Protocol (NTP). See
the
.B ntpd
man page, delivered  in  the 
.B SUNWntpu
package (not a
SunOS man page).
.SH OPTIONS
.sp
.LP
The non-interactive mode supports the following options:
.sp
.ne 2
.mk
.na
.B -n
.ad
.sp .6
.RS 4n
Set up the machine for kerberized NFS. This involves making changes to
\fBkrb5*\fR security flavors in
.BR nfssec.conf (4).
This option will also
add \fBnfs/fqdn\fR and \fBroot/fqdn\fR entries to the local host's
\fBkeytab\fR file if the \fB-K\fR option has not been specified.
.RE

.sp
.ne 2
.mk
.na
\fB-R\fR [ \fIrealm\fR ]\fR
.ad
.sp .6
.RS 4n
Specifies the Kerberos realm.
.RE

.sp
.ne 2
.mk
.na
\fB-k\fR \fIkdc_list\fR
.ad
.sp .6
.RS 4n
The
.B -k
option specifies the KDC host names for the Kerberos client.
\fIkdc_list\fR is a comma-separated list of KDCs. If the \fB-m\fR option is
not used, it is assumed that the first (or only) host in
.I kdc_list
is
the master KDC host name. Note that the list specified is used verbatim.
This is helpful when specifying non-fully qualified KDC host names that can
be canonicalized by DNS.
.RE

.sp
.ne 2
.mk
.na
\fB-a\fR [ \fIadminuser\fR ]\fR
.ad
.sp .6
.RS 4n
Specifies the Kerberos administrative user.
.RE

.sp
.ne 2
.mk
.na
\fB-T\fR \fIkdc_vendor\fR
.ad
.sp .6
.RS 4n
Configure the Kerberos client to associate with a third party server. Valid
\fIkdc_vendor\fR currently supported are:
.sp
.ne 2
.mk
.na
.B ms_ad
.ad
.sp .6
.RS 4n
Microsoft Active Directory
.RE

.sp
.ne 2
.mk
.na
.B mit
.ad
.sp .6
.RS 4n
MIT KDC server
.RE

.sp
.ne 2
.mk
.na
.B heimdal
.ad
.sp .6
.RS 4n
Heimdal KDC server
.RE

.sp
.ne 2
.mk
.na
.B shishi
.ad
.sp .6
.RS 4n
Shishi KDC server
.RE

Knowing the administrative password will be required to associate the
client with the server if the
.B ms_ad
option is specified.
.RE

.sp
.ne 2
.mk
.na
\fB-c\fR [ \fIfilepath\fR ]\fR
.ad
.sp .6
.RS 4n
Specifies the pathname to the
.BR krb5.conf (4)
master file, to be copied
over to the local host. The path specified normally points to a master copy
on a remote host and brought over to the local host by means of NFS.
.RE

.sp
.ne 2
.mk
.na
\fB-d\fR [ \fIdnsarg\fR ]\fR
.ad
.sp .6
.RS 4n
Specifies the DNS lookup option to be used and specified in the
\fBkrb5.conf\fR(4) file. Valid \fIdnsarg\fR entries are: \fBnone\fR,
.BR dns_lookup_kdc ,
\fBdns_lookup_realm\fR and
.BR dns_fallback .
Any
other entry is considered invalid. The latter three
.I dnsarg
values
assume the same meaning as those described in \fBkrb5.conf\fR.
\fBdns_lookup_kdc\fR implies DNS lookups for the KDC and the other servers.
\fBdns_lookup_realm\fR is for host/domain name-to-realm mapping by means of
DNS. \fBdns_fallback\fR is a superset and does DNS lookups for both the
servers and the host/domain name-to-realm mapping. A lookup option of
\fBnone\fR specifies that DNS is not be used for any kind of mapping
lookup.
.RE

.sp
.ne 2
.mk
.na
\fB-D\fR \fIdomain_list\fR
.ad
.sp .6
.RS 4n
Specifies the host and/or domain names to be mapped to the Kerberos
client's default realm name.
.I domain_list
is a comma-separated list,
for example "\fBexample.com,host1.example.com\fR". If the \fB-D\fR option is
not used, then only the client's domain is used for this mapping. For
example, if the client is
.BR host1.eng.example.com ,
then the domain that
is mapped to the
.B EXAMPLE.COM
realm is
.BR example.com .
.RE

.sp
.ne 2
.mk
.na
.B -K
.ad
.sp .6
.RS 4n
Configure the Kerberos client without service keys, which are usually
stored in
.BR /etc/krb5/krb5.keytab .
This is useful in the following
scenarios:
.RS +4
.TP
.ie t \(bu
.el o
The client IP address is dynamically assigned and therefore does not host
Kerberized services.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Client has a static IP address, but does not want to host any Kerberized
services.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Client has a static IP address, but the local administrator does not
currently have service keys available for the machine. It is expected that,
at a later time, these keys will be installed on the machine.
.RE
.RE

.sp
.ne 2
.mk
.na
\fB-f\fR [ \fIfqdn_list\fR ]\fR
.ad
.sp .6
.RS 4n
This option creates a service principal entry (host/nfs/root) associated
with each of the listed fqdn's, if required, and subsequently adds the
entries to the local host's \fBkeytab\fR.
.sp
\fIfqdn_list\fR is a comma-separated list of one or more fully qualified
DNS domain names.
.sp
This option is especially useful in Kerberos realms having systems offering
kerberized services, but situated in multiple different DNS domains.
.RE

.sp
.ne 2
.mk
.na
\fB-h\fR \fIlogical_host_name\fR
.ad
.sp .6
.RS 4n
Specifies that the Kerberos client is a node in a cluster. The
\fIlogical_host_name\fR is the logical host name given to the cluster. The
resulting \fB/etc/krb5/krb5.conf\fR and \fB/etc/krb5/krb5.keytab\fR files
must be manually copied over to the other members of the cluster.
.RE

.sp
.ne 2
.mk
.na
\fB-m\fR \fImaster_kdc\fR
.ad
.sp .6
.RS 4n
This option specifies the master KDC to be used by the Kerberos client.
\fImaster_kdc\fR is the host name of the master KDC for the client. If the
\fB-m\fR option is not used, then it is assumed that the first KDC host name
listed with the
.B -k
option is the master KDC.
.RE

.sp
.ne 2
.mk
.na
\fB-p\fR [ \fIprofile\fR ]\fR
.ad
.sp .6
.RS 4n
Specifies the profile to be used to enable the reading in of the values of
all the parameters required for setup of the machine as a Kerberos client.
.sp
The profile should have entries in the format:
.sp
.in +2
.nf
\fIPARAM\fR \fI<value>\fR
.fi
.in -2
.sp

Valid
.I PARAM
entries are:
.BR REALM ,
.BR KDC ,
.BR ADMIN ,
.BR FILEPATH ,
.BR NFS ,
.BR DNSLOOKUP ,
.BR FQDN ,
.BR NOKEY ,
.BR NOSOL ,
.BR LHN ,
.BR KDCVENDOR ,
.BR RMAP ,
.BR MAS ,
and
.BR PAM .
.sp
These profile entries correspond to the \fB-R\fR [\fIrealm\fR], \fB-k\fR
[\fIkdc\fR], \fB-a\fR [\fIadminuser\fR], \fB-c\fR [\fIfilepath\fR],
.BR -n ,
\fB-d\fR [\fIdnsarg\fR], \fB-f\fR [\fIfqdn_list\fR], \fB-K\fR,
\fB-h\fR [\fIlogical_host_name\fR], \fB-T\fR [\fIkdc_vendor\fR], \fB-D\fR
[\fIdomain_list\fR], \fB-m\fR [\fImaster_kdc\fR], and \fB-s\fR
[\fIpam_service\fR] command-line options, respectively. Any other
\fIPARAM\fR entry is considered invalid and is ignored.
.sp
The NFS profile entry can have a value of 0 (do nothing) or 1 (operation is
requested). Any other value is considered invalid and is ignored.
.sp
Keep in mind that the command line options override the
.I PARAM
values
listed in the profile.
.RE

.sp
.ne 2
.mk
.na
\fB-s\fR \fIpam_service\fR
.ad
.sp .6
.RS 4n
Specifies that the PAM service names, listed in
.IR pam_service ,
are
authenticated through Kerberos before any other type of authentication.
Using this option updates
.BR pam.conf (4)
to include
.BR pam_krb5 (5)
to
existing authentication stacks for the specified service(s) in
.IR pam_service .
An example of a possible
.I pam_service
value is:
.BR dtlogin,sshd-kbdint .
.RE

.SH EXAMPLES
.LP
\fBExample 1\fR Setting Up a Kerberos Client Using Command-Line Options
.sp
.LP
To setup a Kerberos client using the \fBclntconfig/admin\fR administrative
principal for realm \fB\&'ABC.COM', kdc `example1.com'\fR and that also does
kerberized NFS, enter:

.sp
.in +2
.nf
# /usr/sbin/kclient -n -R ABC.COM -k example1.com -a clntconfig
.fi
.in -2
.sp

.sp
.LP
Alternatively, to set up a Kerberos client using the \fBclntconfig/admin\fR
administrative principal for the realm \fB`EAST.ABC.COM', kdc
`example2.east.abc.com'\fR and that also needs service principal(s) created
and/or added to the local
.B keytab
for multiple DNS domains, enter:

.sp
.in +2
.nf
# /usr/sbin/kclient -n -R EAST.ABC.COM -k example2.east.abc.com \e
-f west.abc.com,central.abc.com -a clntconfig
.fi
.in -2

.sp
.LP
Note that the
.B krb5
administrative principal used by the administrator
needs to have only
.BR add ,
.BR inquire ,
\fBchange-pwd\fR and
\fBmodify\fR privileges (for the principals in the KDC database) in order
for the
.B kclient
utility to run. A sample
.BR kadm5.acl (4)
entry
is:

.sp
.in +2
.nf
clntconfig/admin@ABC.COM acmi
.fi
.in -2
.sp

.LP
\fBExample 2\fR Setting Up a Kerberos Client Using the Profile Option
.sp
.LP
To setup a Kerberos client using the \fBclntconfig/admin\fR administrative
principal for realm
.B "`ABC.COM', kdc `example1.com'"
and that also copies
over the master \fBkrb5.conf\fR from a specified location, enter:

.sp
.in +2
.nf
# /usr/sbin/kclient -p /net/example1.com/export/profile.krb5
.fi
.in -2
.sp

.sp
.LP
The contents of \fBprofile.krb5\fR:

.sp
.in +2
.nf
REALM ABC.COM
KDC example1
ADMIN clntconfig
FILEPATH /net/example1.com/export/krb5.conf
NFS 0
DNSLOOKUP none
.fi
.in -2
.sp

.LP
\fBExample 3\fR Setting Up a Kerberos Client That Has a Dynamic IP
Address
.sp
.LP
In this example a Kerberos client is a DHCP client that has a dynamic IP
address. This client does not wish to host any Kerberized services and
therefore does not require a
.B keytab
(\fB/etc/krb5/krb5.keytab\fR)
file.

.sp
.LP
For this type of client the administrator would issue the following command
to configure this machine to be a Kerberos client of the
.B ABC.COM
realm
with the KDC server
.BR kdc1.example.com :

.sp
.in +2
.nf
# \fB/usr/sbin/kclient -K -R EXAMPLE.COM -k kdc1.example.com\fR
.fi
.in -2
.sp

.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/krb5/kadm5.acl
.ad
.sp .6
.RS 4n
Kerberos access control list (ACL) file.
.RE

.sp
.ne 2
.mk
.na
\fB/etc/krb5/krb5.conf\fR
.ad
.sp .6
.RS 4n
Default location for the local host's configuration file.
.RE

.sp
.ne 2
.mk
.na
.B /etc/krb5/krb5.keytab
.ad
.sp .6
.RS 4n
Default location for the local host's
.B keytab
file.
.RE

.sp
.ne 2
.mk
.na
\fB/etc/nfssec.conf\fR
.ad
.sp .6
.RS 4n
File listing NFS security modes.
.RE

.sp
.ne 2
.mk
.na
\fB/etc/resolv.conf\fR
.ad
.sp .6
.RS 4n
DNS resolver configuration file.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWkdcu
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
.BR encrypt (1),
.BR ksh93 (1),
.BR ldapdelete (1),
\fBldapmodify\fR(1),
.BR ldapsearch (1),
.BR dd (1M),
.BR smbadm (1M),
.BR kadm5.acl (4),
\fBkrb5.conf\fR(4),
.BR nfssec.conf (4),
\fBpam.conf\fR(4),
\fBresolv.conf\fR(4),
.BR attributes (5),
.BR pam_krb5 (5)
.SH NOTES
.sp
.LP
\fBfqdn\fR stands for the Fully Qualified Domain Name of the local host.
The
.B kclient
utility saves copies of both the
.BR krb5.conf (4)
and
\fBnfssec.conf\fR(4) files to files with corresponding names and
\fB\&.sav\fR extensions. The optional copy of the
.BR krb5.conf (4)
master
file is neither encrypted nor integrity-protected and it takes place over
regular NFS.
