usr/src/man/man1m/kdcmgr.1m
'\" te
.\" Copyright (c) 2007, Sun Microsystems, Inc. All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH kdcmgr 1M "19 Sep 2007" "SunOS 5.11" "System Administration Commands"
.SH NAME
kdcmgr \- set up a Kerberos Key Distribution Center (KDC)
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/kdcmgr\fR [\fB-a\fR \fIadmprincipal\fR] [\fB-e\fR \fIenctype\fR]
     [\fB-h\fR] [\fB-p\fR \fIpwfile\fR] [\fB-r\fR \fIrealm\fR] \fIsubcommand\fR
.fi

.SH DESCRIPTION
.sp
.LP
Use the
.B kdcmgr
utility to do the following:
.RS +4
.TP
.ie t \(bu
.el o
Configure a master Key Distribution Center (KDC) server.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Configure a slave KDC. This assumes that a master KDC has already been
configured. The default propagation method configured is incremental
propagation. See
.BR kpropd (1M).
.RE
.RS +4
.TP
.ie t \(bu
.el o
Specify a list of slave KDCs to configure service principals and create
access control list for those slaves on the master KDC.
.RE
.sp
.LP
If you specify no options,
.B kdcmgr
prompts you for required
information, including a password to generate the master key and a password
for the administrative principal. When you specify sufficient options, you
are still prompted for these passwords, unless you specified the \fB-p\fR
.I pwfile
option.
.sp
.LP
The
.B kdcmgr
utility must be run as superuser or by someone who has the
Primary Administrator role. The command must be run on the server from which
it is invoked.
.sp
.LP
Note that
.B kdcmgr
requires the user to enter sensitive information,
such as the password used to generate the database's master key and the
password for the administrative principal. Great care must be taken to
ensure that the connection to the server is secured over the network, by
using a protocol such as
.BR ssh (1).
.sp
.LP
You must also exercise great care when selecting the administrative and
master key passwords. They should be derived from non-dictionary words and a
long string of characters consisting of all of the following character
classes:
.RS +4
.TP
.ie t \(bu
.el o
special characters (for example, !@#$%^&*)
.RE
.RS +4
.TP
.ie t \(bu
.el o
numerals (0-9)
.RE
.RS +4
.TP
.ie t \(bu
.el o
uppercase letters
.RE
.RS +4
.TP
.ie t \(bu
.el o
lowercase letters
.RE
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -a
.I admprincipal
.ad
.sp .6
.RS 4n
When creating a master KDC, specifies the administrative principal,
.IR admprincipal ,
that will be created.
.sp
When creating a slave KDC,
.I admprincipal
is used to authenticate as
the administrative principal.
.sp
If you omit
.BR -a ,
the suggested default administrative principal name
is the output of
.BR logname (1)
appended by
.BR /admin .
.RE

.sp
.ne 2
.mk
.na
.B -e
.I enctype
.ad
.sp .6
.RS 4n
Specifies the encryption type to be used when creating the key for the
master key, which is used to encrypt all principal keys in the database. The
set of valid encryption types used here are described in
.BR krb5.conf (4)
under the
.B permitted_enctypes
option. Note that the encryption type
specified here must be supported on all KDCs or else they will not be able
to decrypt any of the principal keys. Solaris 9 and earlier releases support
only the
.B des-cbc-crc
encryption type for the master key. Therefore, if
any of the master or slave KDCs are of these older releases, then \fB-e\fR
.B des-cbc-crc
would need to be specified on all KDCs configured with
.BR kdcmgr .
.sp
The default encryption type is
.BR aes128-cts-hmac-sha1-96 .
.RE

.sp
.ne 2
.mk
.na
.B -h
.ad
.sp .6
.RS 4n
Displays usage information for
.BR kdcmgr .
.RE

.sp
.ne 2
.mk
.na
.B -p
.I pwfile
.ad
.sp .6
.RS 4n
Provides the location of the password file that contains the password used
to create the administrative principal and/or master key.
.sp
.B Warning:
This option should be used with great care. Make sure that
this
.I pwfile
is accessible only by a privileged user and on a local
file system. Once the KDC has been configured, you should remove
.IR pwfile .
.RE

.sp
.ne 2
.mk
.na
.B -r
.I realm
.ad
.sp .6
.RS 4n
Set the default realm for this server.
.sp
If the
.B -r
option is not specified,
.B kdcmgr
attempts to obtain
the machine's local domain name by submitting the canonical form of the
machine's host name to DNS and using the return value to derive the domain
name. If successful, the domain name is converted to uppercase and proposed
as the default realm name.
.RE

.SH SUBCOMMANDS
.sp
.LP
The following subcommands are supported:
.sp
.ne 2
.mk
.na
.B create
[ \fImaster\fR ]\fR
.ad
.br
.na
.B create
[ \fB-m\fR \fImasterkdc\fR ] slave\fR
.ad
.sp .6
.RS 4n
Creates a KDC. If no option is specified, an attempt to create a master KDC
is made.
.sp
.ne 2
.mk
.na
.B create
[ \fImaster\fR ]\fR
.ad
.sp .6
.RS 4n
Create a master KDC. Upon successful configuration the
.BR krb5kdc (1M)
and
.BR kadmind "(1M) are enabled on the machine."
.RE

.sp
.ne 2
.mk
.na
.B create
[ \fB-m\fR \fImasterkdc\fR ] slave\fR
.ad
.sp .6
.RS 4n
Configures a slave KDC. After configuration, the
.BR krb5kdc (1M)
and
.BR kpropd (1M)
services are enabled on the machine.
.sp
.I masterkdc
specifies the master KDC to authenticate and with which to
perform administrative tasks. If the
.B -m
option is not specified, you
are prompted for a master KDC host name.
.RE

.RE

.sp
.ne 2
.mk
.na
.B destroy
.ad
.sp .6
.RS 4n
Remove all Kerberos configuration and database files associated with the
KDC server. A confirmation is required before these files are deleted.
.RE

.sp
.ne 2
.mk
.na
.B status
.ad
.sp .6
.RS 4n
Determines the role of the KDC, master or slave, and outputs this and the
state of such associated processes as:
.RS +4
.TP
.ie t \(bu
.el o
.BR krb5kdc (1M)
.RE
.RS +4
.TP
.ie t \(bu
.el o
.BR kadmind (1M)
.RE
.RS +4
.TP
.ie t \(bu
.el o
.BR kpropd (1M)
.RE
The subcommand also displays information on incremental propagation if the
configuration has this feature enabled, as well as any issues with dependent
files.
.RE

.SH EXAMPLES
.LP
.B Example 1
Setting up a Master KDC
.sp
.LP
The following command configures a master KDC with the administrative
principal
.B user1/admin
and with the realm name
.BR EXAMPLE.COM :

.sp
.in +2
.nf
$ \fBkdcmgr -a user1/admin -r EXAMPLE.COM create\fR
.fi
.in -2
.sp

.sp
.LP
Note that a password will be required to assign to the newly created
.B user1/admin
principal. The password for the master key will also need
to be provided.

.LP
.B Example 2
Setting up a Slave KDC
.sp
.LP
The following command configures a slave KDC, authenticates with the
administrative principal
.BR user1/admin ,
specifies
.B kdc1
as the
master, and uses the
.B EXAMPLE.COM
realm name:

.sp
.in +2
.nf
$ \fBkdcmgr -a user1/admin -r EXAMPLE.COM create -m kdc1 slave\fR
.fi
.in -2
.sp

.sp
.LP
Note that you must enter the correct password for
.B user1/admin
and
that the master KDC must already have been created before entering this
command. The correct password for the master key is also required.

.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/krb5/krb5.conf
.ad
.sp .6
.RS 4n
Main Kerberos configuration file.
.RE

.sp
.ne 2
.mk
.na
.B /etc/krb5/kdc.conf
.ad
.sp .6
.RS 4n
KDC configuration, used by both master and slave servers.
.RE

.sp
.ne 2
.mk
.na
.B /etc/krb5/krb5.keytab
.ad
.sp .6
.RS 4n
Default location of the local host's service keys.
.RE

.sp
.ne 2
.mk
.na
.B /etc/krb5/kadm5.acl
.ad
.sp .6
.RS 4n
Kerberos administrative access control list (ACL).
.RE

.sp
.ne 2
.mk
.na
.B /etc/krb5/kadm5.keytab
.ad
.sp .6
.RS 4n
Service keys specific to
.BR kadmind (1M).
.RE

.sp
.ne 2
.mk
.na
.B /var/krb5/principal
.ad
.sp .6
.RS 4n
Kerberos principal database.
.RE

.sp
.ne 2
.mk
.na
.B /var/krb5/principal.kadm5
.ad
.sp .6
.RS 4n
Kerberos policy database.
.RE

.sp
.ne 2
.mk
.na
.B /etc/krb5/kpropd.acl
.ad
.sp .6
.RS 4n
Used by slaves to indicate from which server to receive updates.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWkdcu
_
Interface StabilitySee below
.TE

.sp
.LP
The command line interface (CLI) is Uncommitted. The CLI output is Not an
Interface.
.SH SEE ALSO
.sp
.LP
.BR logname (1),
.BR ssh (1),
.BR kadmin (1M),
.BR kadmind (1M),
.BR kdb5_util (1M),
.BR kdb5_ldap_util (1M),
.BR kpropd (1M),
.BR krb5kdc (1M),
.BR ping (1M),
.BR svcadm (1M),
.BR kdc.conf (4),
.BR krb5.conf (4),
.BR attributes (5)
