usr/src/man/man1m/kernel.1m
'\" te
.\" Copyright (c) 2006 Sun Microsystems, Inc. All Rights Reserved
.\" Copyright 1989 AT&T
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH kernel 1M "27 Nov 2007" "SunOS 5.11" "System Administration Commands"
.SH NAME
kernel \- UNIX system executable file containing basic operating system
services
.SH SYNOPSIS
.LP
.nf
\fBkernel-name\fR [\fB-asrvx\fR] [\fB-m \fIsmf_options\fR] [\fB-i \fIaltinit\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The operating system image, or kernel, is the collection of software
comprising the image files (\fBunix\fR and
.BR genunix )
and the modules
loaded at any instant in time. The system will not function without a kernel
to control it.
.sp
.LP
The kernel is loaded by the \fBboot\fR(1M) command in a machine-specific
way. The kernel may be loaded from disk,
.BR CD-ROM ,
or DVD (\fBdiskfull
boot\fR) or over the network
.RB ( "diskless boot" ).
In either case, the
directories under
.B /platform
and
.B /kernel
must be readable and
must contain executable code which is able to perform the required kernel
service. If the
.B -a
flag is given, the user is able to supply different
pathnames for the default locations of the kernel and modules. See
.BR boot (1M)
for more information on loading a specific kernel.
.sp
.LP
The
.B moddir
variable contains a list of module directories separated
by whitespace. moddir can be set in the
.B /etc/system
file. The minimal
default is:
.sp
.in +2
.nf
/platform/platform-name/kernel /kernel /usr/kernel
.fi
.in -2

.sp
.LP
This default can be supplemented by a specific platform. It is common for
many SPARC systems to override the default path with:
.sp
.in +2
.nf
/platform/\fIplatform-name\fR/kernel:/platform/\fIhardware-class-name\fR\e
     /kernel:/kernel:/usr/kernel
.fi
.in -2
.sp

.sp
.LP
where \fIplatform-name\fR can be found using the \fB-i\fR option of
.BR uname (1),
and
.I hardware-class-name
can be found using the
.B -m
option of
.BR uname (1).
.sp
.LP
The kernel configuration can be controlled using the
.B /etc/system
file
(see
.BR system (4)).
.sp
.LP
.B genunix
is the platform-independent component of the base kernel.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -a
.ad
.sp .6
.RS 4n
Asks the user for configuration information, such as where to find the
system file, where to mount
.BR root ,
and even override the name of the
kernel itself. Default responses will be contained in square brackets ([ ]),
and the user may simply enter RETURN to use the default response (note that
RETURN is labeled ENTER on some keyboards). To help repair a damaged
.B /etc/system
file, enter
.B /dev/null
at the prompt that asks for
the pathname of the system configuration file. See
.BR system (4).
.RE

.sp
.ne 2
.mk
.na
.B -i
.I altinit
.ad
.sp .6
.RS 4n
Select an alternative executable to be the primordial process.
.I altinit
must be a valid path to an executable. The default primordial
process is
.BR init (1M).
.RE

.sp
.ne 2
.mk
.na
.B -m
.I smf_options
.ad
.sp .6
.RS 4n
The
.I smf_options
include two categories of options to control booting
behavior of the service management facility: recovery options and messages
options.
.sp
Message options determine the type and amount of messages that
.BR smf (5)
displays during boot. Service options determine the services which are used
to boot the system.
.sp
Recovery options
.sp
.ne 2
.mk
.na
.I debug
.ad
.sp .6
.RS 4n
Prints standard per-service output and all
.B svc.startd
messages to
log.
.RE

.sp
.ne 2
.mk
.na
.I milestone=[milestone]
.ad
.sp .6
.RS 4n
Boot with some SMF services temporarily disabled, as indicated by
\fImilestone\fR. \fImilestone\fR can be "none", "single-user", "multi-user",
"multi-user-server", or "all". See the \fBmilestone\fR subcommand of
.BR svcadm (1M).
.RE

Messages options
.sp
.ne 2
.mk
.na
.I quiet
.ad
.sp .6
.RS 4n
Prints standard per-service output and error messages requiring
administrative intervention.
.RE

.sp
.ne 2
.mk
.na
.I verbose
.ad
.sp .6
.RS 4n
Prints standard per-service output with more informational messages.
.RE

.RE

.sp
.ne 2
.mk
.na
.B -r
.ad
.sp .6
.RS 4n
Reconfiguration boot. The system will probe all attached hardware devices
and configure the logical namespace in
.BR /dev .
See
.BR add_drv "(1M) and"
.BR rem_drv (1M)
for additional information about maintaining device
drivers.
.RE

.sp
.ne 2
.mk
.na
.B -s
.ad
.sp .6
.RS 4n
Boots only to init level 's'. See
.BR init (1M).
.RE

.sp
.ne 2
.mk
.na
.B -v
.ad
.sp .6
.RS 4n
Boots with verbose messages enabled. If this flag is not given, the
messages are still printed, but the output is directed to the system
logfile. See
.BR syslogd (1M).
.RE

.sp
.ne 2
.mk
.na
.B -x
.ad
.sp .6
.RS 4n
Does not boot in clustered mode. This option only has an effect when a
version of Sun Cluster software that supports this option has been
installed.
.RE

.SH EXAMPLES
.sp
.LP
See \fBboot\fR(1M) for examples and instructions on how to boot.
.SH FILES
.sp
.ne 2
.mk
.na
.B /kernel
.ad
.sp .6
.RS 4n
Contains kernel components common to all platforms within a particular
instruction set that are needed for booting the system. of the core image
file.
.RE

.sp
.ne 2
.mk
.na
\fB/platform/\fIplatform-name\fR/kernel\fR
.ad
.sp .6
.RS 4n
The platform-specific kernel components.
.RE

.sp
.ne 2
.mk
.na
\fB/platform/\fIhardware-class-name\fB/kernel\fR
.ad
.sp .6
.RS 4n
The kernel components specific to this hardware class.
.RE

.sp
.ne 2
.mk
.na
.B /usr/kernel
.ad
.sp .6
.RS 4n
Contains kernel components common to all platforms within a particular
instruction set.
.RE

.sp
.LP
The directories in this section can potentially contain the following
subdirectories:
.sp
.ne 2
.mk
.na
.B drv
.ad
.sp .6
.RS 4n
Loadable device drivers
.RE

.sp
.ne 2
.mk
.na
.B exec
.ad
.sp .6
.RS 4n
The modules that execute programs stored in various file formats.
.RE

.sp
.ne 2
.mk
.na
.B fs
.ad
.sp .6
.RS 4n
File system modules
.RE

.sp
.ne 2
.mk
.na
.B misc
.ad
.sp .6
.RS 4n
Miscellaneous system-related modules
.RE

.sp
.ne 2
.mk
.na
.B sched
.ad
.sp .6
.RS 4n
Operating system schedulers
.RE

.sp
.ne 2
.mk
.na
.B strmod
.ad
.sp .6
.RS 4n
System V STREAMS loadable modules
.RE

.sp
.ne 2
.mk
.na
.B sys
.ad
.sp .6
.RS 4n
Loadable system calls
.RE

.SS "SPARC"
.sp
.ne 2
.mk
.na
.B cpu
.ad
.sp .6
.RS 4n
Processor specific modules
.RE

.sp
.ne 2
.mk
.na
.B tod
.ad
.sp .6
.RS 4n
Time-Of-Day hardware interface modules
.RE

.sp
.LP
As only 64-bit SPARC platforms are supported, all SPARC executable modules
are contained within
.B sparcv9
directories in the directories listed
above.
.SS "x86"
.sp
.ne 2
.mk
.na
.B mach
.ad
.sp .6
.RS 4n
x86 hardware support
.RE

.sp
.LP
Modules comprising the 32-bit x86 kernel are contained in the above
directories, with the 64-bit x86 kernel components contained within
.B amd64
subdirectories.
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcar, SUNWcarx
.TE

.SH SEE ALSO
.sp
.LP
.BR uname (1),
.BR isainfo (1),
.BR add_drv (1M),
.BR boot (1M),
.BR init (1M),
.BR kadb (1M),
.BR rem_drv (1M),
.BR savecore (1M),
.BR svc.startd (1M),
.BR svcadm (1M),
.BR syslogd (1M),
.BR system (4),
.BR attributes (5),
.BR smf (5),
.BR devfs (7FS)
.SS "SPARC Only"
.sp
.LP
.BR monitor (1M)
.SH DIAGNOSTICS
.sp
.LP
The kernel gives various warnings and error messages. If the kernel detects
an unrecoverable fault, it will panic or halt.
.SH NOTES
.sp
.LP
Reconfiguration boot will, by design, not remove
.B /dev
entries for
some classes of devices that have been physically removed from the system.

