usr/src/man/man1m/keyserv.1m
'\" te
.\" Copyright 1989 AT&T
.\" Copyright (C) 2005, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH keyserv 1M "4 Jan 2002" "SunOS 5.11" "System Administration Commands"
.SH NAME
keyserv \- server for storing private encryption keys
.SH SYNOPSIS
.LP
.nf
\fBkeyserv\fR [\fB-c\fR] [\fB-d\fR | \fB-e\fR] [\fB-D\fR] [\fB-n\fR] [\fB-s\fR \fIsizespec\fR]
.fi

.SH DESCRIPTION
.sp
.LP
.B keyserv
is a daemon that is used for storing the private encryption
keys of each user logged into the system. These encryption keys are used for
accessing secure network services such as secure
.B NFS
and NIS+.
.sp
.LP
Normally, root's key is read from the file
.B /etc/.rootkey
when the
daemon is started. This is useful during power-fail reboots when no one is
around to type a password.
.sp
.LP
.B keyserv
does not start up if the system does not have a secure
.B rpc
domain configured. Set up the domain name by using the
.B /usr/bin/domainname
command. Usually the
.B svc:/system/identity:domain
service reads the domain from
.BR /etc/defaultdomain .
Invoking the
.B domainname
command without
arguments tells you if you have a domain set up.
.sp
.LP
The
.B /etc/default/keyserv
file contains the following default
parameter settings. See .
.sp
.ne 2
.mk
.na
.B ENABLE_NOBODY_KEYS
.ad
.RS 22n
.rt
Specifies whether default keys for
.B nobody
are used.
.B ENABLE_NOBODY_KEYS=NO
is equivalent to the
.B -d
command-line
option. The default value for
.B ENABLE_NOBODY_KEYS
is
.BR YES .
.RE

.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -c
.ad
.RS 15n
.rt
Do not use disk caches. This option overrides any
.B -s
option.
.RE

.sp
.ne 2
.mk
.na
.B -D
.ad
.RS 15n
.rt
Run in debugging mode and log all requests to
.BR keyserv .
.RE

.sp
.ne 2
.mk
.na
.B -d
.ad
.RS 15n
.rt
Disable the use of default keys for
.BR nobody .
See .
.RE

.sp
.ne 2
.mk
.na
.B -e
.ad
.RS 15n
.rt
Enable the use of default keys for
.BR nobody .
This is the default
behavior. See .
.RE

.sp
.ne 2
.mk
.na
.B -n
.ad
.RS 15n
.rt
Root's secret key is not read from
.BR /etc/.rootkey .
Instead,
.B keyserv
prompts the user for the password to decrypt root's key stored
in the
.B publickey
database and then stores the decrypted key in
.B /etc/.rootkey
for future use. This option is useful if the
.B /etc/.rootkey
file ever gets out of date or corrupted.
.RE

.sp
.ne 2
.mk
.na
.B -s
.I sizespec
.ad
.RS 15n
.rt
Specify the size of the extended Diffie-Hellman common key disk caches. The
.I sizespec
can be one of the following forms:
.sp
.ne 2
.mk
.na
\fImechtype\fR=\fBsize\fR
.ad
.RS 17n
.rt
.B size
is an integer specifying the maximum number of entries in the
cache, or an integer immediately followed by the letter
.IR M ,
denoting
the maximum size in MB.
.RE

.sp
.ne 2
.mk
.na
.B size
.ad
.RS 17n
.rt
This form of
.I sizespec
applies to all caches.
.RE

See \fBnisauthconf\fR(1M) for mechanism types. Note that the \fBdes\fR
mechanism,
.BR AUTH_DES ,
does not use a disk cache.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/.rootkey
.ad
.RS 24n
.rt

.RE

.sp
.ne 2
.mk
.na
.B /etc/default/keyserv
.ad
.RS 24n
.rt
Contains default settings. You can use command-line options to override
these settings.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.sp
.LP
.BR keylogin (1),
.BR svcs (1),
.BR keylogout (1),
.BR nisauthconf (1M),
.BR svcadm (1M),
.BR publickey (4),
.BR attributes (5),
.BR smf (5)
.sp
.LP
http://www.sun.com/directory/nisplus/transition.html
.SH NOTES
.sp
.LP
NIS+ might not be supported in future releases of the Solaris operating
system. Tools to aid the migration from NIS+ to LDAP are available in the
current Solaris release. For more information, visit
http://www.sun.com/directory/nisplus/transition.html.
.sp
.LP
The
.B keyserv
service is managed by the service management facility,
.BR smf (5),
under the service identifier:
.sp
.in +2
.nf
svc:/network/rpc/keyserv:default
.fi
.in -2
.sp

.sp
.LP
Administrative actions on this service, such as enabling, disabling, or
requesting restart, can be performed using
.BR svcadm (1M).
The service's
status can be queried using the
.BR svcs (1)
command.
