usr/src/man/man1m/killall.1m
'\" te
.\" Copyright (c) 1996, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" Copyright 1989 AT&T
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH killall 1M "14 Sep 1992" "SunOS 5.11" "System Administration Commands"
.SH NAME
killall \- kill all active processes
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/killall\fR [\fIsignal\fR]
.fi

.SH DESCRIPTION
.sp
.LP
.B killall
is used by
.BR shutdown "(1M) to kill all active processes"
not directly related to the shutdown procedure.
.sp
.LP
.B killall
terminates all processes with open files so that the mounted
file systems will be unbusied and can be unmounted.
.sp
.LP
.B killall
sends
.I signal
(see
.BR kill (1))
to the active
processes. If no
.I signal
is specified, a default of
.B 15
is used.
.sp
.LP
The
.B killall
command can be run only by the super-user.
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.sp
.LP
.BR kill (1),
.BR ps (1),
.BR fuser (1M),
.BR shutdown (1M),
.BR signal (3C),
.BR attributes (5)
