usr/src/man/man1m/kprop.1m
'\" te
.\" Copyright 1987, 1989 by the Student Information Processing Board of the
.\" Massachusetts Institute of Technology. For copying and distribution
.\" information, please see the file kerberosv5/mit-sipb-copyright.h.
.\" Portions Copyright (c) 2006, Sun Microsystems, Inc. All Rights Reserved.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH kprop 1M "14 Nov 2005" "SunOS 5.11" "System Administration Commands"
.SH NAME
kprop \- Kerberos database propagation program
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/krb5/kprop\fR [\fB-d\fR] [\fB-f\fR \fIfile\fR] [\fB-p\fR \fIport-number\fR]
     [\fB-r\fR \fIrealm\fR] [\fB-s\fR \fIkeytab\fR] [\fIhost\fR]
.fi

.SH DESCRIPTION
.sp
.LP
\fBkprop\fR is a command-line utility used for propagating a Kerberos
database from a master
.B KDC
to a slave
.BR KDC .
This command must be
run on the master
.BR KDC .
See the \fISolaris System Administration Guide,
Vol. 6\fR on how to set up periodic propagation between the master \fBKDC\fR
and slave
.BR KDC s.
.sp
.LP
To propagate a Kerberos database, the following conditions must be met:
.RS +4
.TP
.ie t \(bu
.el o
The slave \fBKDC\fRs must have an \fB/etc/krb5/kpropd.acl\fR file that
contains the principals for the master
.B KDC
and all the slave
.BR KDC s.
.RE
.RS +4
.TP
.ie t \(bu
.el o
A keytab containing a host principal entry must exist on each slave
.BR KDC .
.RE
.RS +4
.TP
.ie t \(bu
.el o
The database to be propagated must be dumped to a file using
.BR kdb5_util (1M).
.RE
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -d
.ad
.RS 18n
.rt
Enable debug mode. Default is debug mode disabled.
.RE

.sp
.ne 2
.mk
.na
\fB-f\fR \fIfile\fR
.ad
.RS 18n
.rt
File to be sent to the slave
.BR KDC .
Default is the
\fB/var/krb5/slave_datatrans\fR file.
.RE

.sp
.ne 2
.mk
.na
\fB-p\fR \fIport-number\fR
.ad
.RS 18n
.rt
Propagate
.IR port-number .
Default is port
.BR 754 .
.RE

.sp
.ne 2
.mk
.na
\fB-r\fR \fIrealm\fR
.ad
.RS 18n
.rt
Realm where propagation will occur. Default
.I realm
is the local
realm.
.RE

.sp
.ne 2
.mk
.na
\fB-s\fR \fIkeytab\fR
.ad
.RS 18n
.rt
Location of the keytab. Default location is
.BR /etc/krb5/krb5.keytab .
.RE

.SH OPERANDS
.sp
.LP
The following operands are supported:
.sp
.ne 2
.mk
.na
.I host
.ad
.RS 8n
.rt
Name of the slave
.BR KDC .
.RE

.SH EXAMPLES
.LP
\fBExample 1\fR Propagating the Kerberos Database
.sp
.LP
The following example propagates the Kerberos database from the
\fB/tmp/slave_data\fR file to the slave
.BR "KDC london" .
The machine
\fBlondon\fR must have a host principal keytab entry and the
\fBkpropd.acl\fR file must contain an entry for the all the \fBKDC\fRs.

.sp
.in +2
.nf
# kprop -f /tmp/slave_data london
.fi
.in -2
.sp

.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/krb5/kpropd.acl
.ad
.RS 29n
.rt
List of principals of all the KDCs; resides on each slave KDC.
.RE

.sp
.ne 2
.mk
.na
.B /etc/krb5/krb5.keytab
.ad
.RS 29n
.rt
Keytab for Kerberos clients.
.RE

.sp
.ne 2
.mk
.na
.B /var/krb5/slave_datatrans
.ad
.RS 29n
.rt
Kerberos database propagated to the KDC slaves.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWkdcu
.TE

.SH SEE ALSO
.sp
.LP
.BR kpasswd (1),
.BR svcs (1),
.BR gkadmin (1M),
.BR inetadm (1M),
.BR inetd (1M),
.BR kadmind (1M),
.BR kadmin.local (1M),
.BR kdb5_util (1M),
.BR svcadm (1M),
.BR kadm5.acl (4),
.BR kdc.conf (4),
.BR attributes (5),
.BR kerberos (5),
.BR smf (5)
.sp
.LP
\fR
