usr/src/man/man1m/krb5kdc.1m
'\" te
.\" Copyright 1987, 1989 by the Student Information Processing Board of the
.\" Massachusetts Institute of Technology. For copying and distribution
.\" information, please see the file kerberosv5/mit-sipb-copyright.h.
.\" Portions Copyright (c) 2007, Sun Microsystems, Inc.  All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH krb5kdc 1M "24 Oct 2007" "SunOS 5.11" "System Administration Commands"
.SH NAME
krb5kdc \- KDC daemon
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/krb5/krb5kdc\fR [\fB-d\fR \fIdbpath\fR] [\fB-r\fR \fIrealm\fR]  [\fB-m\fR]
     [\fB-k\fR \fImasterenctype\fR] [\fB-M\fR \fImasterkeyname\fR]
     [\fB-p\fR \fIport\fR] [\fB-n\fR] [\fB-x\fR \fIdb_args\fR]...
.fi

.SH DESCRIPTION
.sp
.LP
\fBkrb5kdc\fR is the daemon that runs on the master and slave \fBKDC\fRs to
process the Kerberos tickets. For Kerberos to function properly, \fBkrb5kdc\fR
must be running on at least one
.B KDC
that the Kerberos clients can
access. Prior to running
.BR krb5kdc ,
you must initialize the Kerberos
database using \fBkdb5_util\fR(1M). See the\fR  for information regarding
how to set up
.BR KDC "s and initialize the Kerberos database."
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB-d\fR \fIdbpath\fR
.ad
.sp .6
.RS 4n
Specify the path to the database; default value is
.BR /var/krb5 .
.RE

.sp
.ne 2
.mk
.na
\fB-k\fR \fImasterenctype\fR
.ad
.sp .6
.RS 4n
Specify the encryption type for encrypting the database. The default value is
.BR des-cbc-crc .
.BR des3-cbc-sha1 ,
.BR arcfour-hmac-md5 ,
.BR arcfour-hmac-md5-exp ,
.BR aes128-cts-hmac-sha1-96 ,
and
\fBaes256-cts-hmac-sha1-96\fR are also valid.
.RE

.sp
.ne 2
.mk
.na
.B -m
.ad
.sp .6
.RS 4n
Specify that the master key for the database is to be entered manually.
.RE

.sp
.ne 2
.mk
.na
\fB-M\fR \fImasterkeyname\fR
.ad
.sp .6
.RS 4n
Specify the principal to retrieve the master Key for the database.
.RE

.sp
.ne 2
.mk
.na
.B -n
.ad
.sp .6
.RS 4n
Specify that
.B krb5kdc
should not detach from the terminal.
.RE

.sp
.ne 2
.mk
.na
\fB-p\fR \fIport\fR
.ad
.sp .6
.RS 4n
Specify the port that will be used by the
.B KDC
to listen for incoming
requests.
.RE

.sp
.ne 2
.mk
.na
\fB-r\fR \fIrealm\fR
.ad
.sp .6
.RS 4n
Specify the realm name; default is the local realm name.
.RE

.sp
.ne 2
.mk
.na
\fB-x\fR \fIdb_args\fR
.ad
.sp .6
.RS 4n
Pass database-specific arguments to
.BR kadmin .
Supported arguments are for
the LDAP plug-in. These arguments are:
.sp
.ne 2
.mk
.na
\fBbinddn\fR=\fIbinddn\fR
.ad
.sp .6
.RS 4n
Specifies the DN of the object used by the KDC server to bind to the LDAP
server. This object should have the rights to read the realm container,
principal container and the subtree that is referenced by the realm. Overrides
the
.B ldap_kdc_dn
parameter setting in
.BR krb5.conf (4).
.RE

.sp
.ne 2
.mk
.na
\fBbindpwd\fR=\fIbindpwd\fR
.ad
.sp .6
.RS 4n
Specifies the password for the above-mentioned
.IR binddn .
It is
recommended not to use this option. Instead, the password can be stashed using
the
.B stashsrvpw
command of
.BR kdb5_ldap_util (1M).
.RE

.sp
.ne 2
.mk
.na
\fBnconns\fR=\fInum\fR
.ad
.sp .6
.RS 4n
Specifies the number of connections to be maintained per LDAP server.
.RE

.sp
.ne 2
.mk
.na
\fBhost\fR=\fIldapuri\fR
.ad
.sp .6
.RS 4n
Specifies, by an LDAP URI, the LDAP server to which to connect.
.RE

.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B /var/krb5/principal.db
.ad
.sp .6
.RS 4n
Kerberos principal database.
.RE

.sp
.ne 2
.mk
.na
.B /var/krb5/principal.kadm5
.ad
.sp .6
.RS 4n
Kerberos administrative database. This file contains policy information.
.RE

.sp
.ne 2
.mk
.na
.B /var/krb5/principal.kadm5.lock
.ad
.sp .6
.RS 4n
Kerberos administrative database lock file. This file works backwards from
most other lock files (that is,
.B kadmin
will exit with an error if this
file does
.I not
exist).
.RE

.sp
.ne 2
.mk
.na
\fB/etc/krb5/kdc.conf\fR
.ad
.sp .6
.RS 4n
\fBKDC\fR configuration file. This file is read at startup.
.RE

.sp
.ne 2
.mk
.na
.B /etc/krb5/kpropd.acl
.ad
.sp .6
.RS 4n
File that defines the access control list for propagating the Kerberos
database using
.BR kprop .
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWkdcu
.TE

.SH SEE ALSO
.sp
.LP
.BR kill (1),
.BR kpasswd (1),
.BR gkadmin (1M),
.BR kadmind (1M),
.BR kadmin.local (1M),
.BR kdb5_util (1M),
.BR kdb5_ldap_util (1M),
.BR logadm (1M),
.BR krb5.conf (4),
.BR attributes (5),
.BR krb5envvar (5),
.BR kerberos (5),
.sp
.LP
\fR
.SH NOTES
.sp
.LP
The following signal has the specified effect when sent to the server process
using the
.BR kill (1)command:
.sp
.ne 2
.mk
.na
.B SIGHUP
.ad
.sp .6
.RS 4n
\fBkrb5kdc\fR closes and re-opens log files that it directly opens. This can
be useful for external log-rotation utilities such as \fBlogadm\fR(1M). If
this method is used for log file rotation, set the
.BR krb5.conf (4)
\fBkdc_rotate\fR period relation to
.BR never .
.RE

