usr/src/man/man1m/ksslcfg.1m
'\" te
.\" Copyright (c) 2005, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ksslcfg 1M "27 May 2008" "SunOS 5.11" "System Administration Commands"
.SH NAME
ksslcfg \- enable and configure SMF instance of Kernel SSL
.SH SYNOPSIS
.LP
.nf
\fBksslcfg\fR create \fB-f\fR pkcs11 \fB-T\fR \fItoken_label\fR \fB-C\fR \fIcertificate_label\fR
     [\fB-d\fR \fIsofttoken_directory\fR]
     [\fB-p\fR \fIpassword_file\fR [\fB-u\fR \fIusername\fR]]
     [\fB-h\fR \fIca_certchain_file\fR] [\fB-c\fR \fIciphersuites\fR]
     [\fB-t\fR \fIssl_session_cache_timeout\fR]
     [\fB-z\fR \fIssl_session_cache_size\fR] [\fB-v\fR] \fB-x\fR \fIproxy_port\fR [\fIhost\fR] \fIssl_port\fR
.fi

.LP
.nf
\fBksslcfg\fR create \fB-f\fR pkcs12 \fB-i\fR \fIcert_and_key_pk12file\fR
     [\fB-p\fR \fIpassword_file\fR [\fB-u\fR \fIusername\fR]]
     [\fB-c\fR \fIciphersuites\fR] [\fB-t\fR \fIssl_session_cache_timeout\fR]
     [\fB-z\fR \fIssl_session_cache_size\fR] [\fB-v\fR] \fB-x\fR \fIproxy_port\fR [\fIhost\fR] \fIssl_port\fR
.fi

.LP
.nf
\fBksslcfg\fR create \fB-f\fR pem \fB-i\fR \fIcert_and_key_pemfile\fR
     [\fB-p\fR \fIpassword_file\fR [\fB-u\fR \fIusername\fR]]
     [\fB-c\fR \fIciphersuites\fR] [\fB-t\fR \fIssl_session_cache_timeout\fR]
     [\fB-z\fR \fIssl_session_cache_size\fR] [\fB-v\fR] \fB-x\fR \fIproxy_port\fR [\fIhost\fR] \fIssl_port\fR
.fi

.LP
.nf
\fBksslcfg\fR delete [\fB-v\fR] [\fIhost\fR] \fIssl_port\fR
.fi

.LP
.nf
\fBksslcfg\fR \fB-V\fR
.fi

.LP
.nf
\fBksslcfg\fR \fB-?\fR
.fi

.SH DESCRIPTION
.sp
.LP
.B ksslcfg
manages
.BR smf (5)
instances for the Kernel SSL proxy
module. An SSL-enabled web server can use the services of its Kernel SSL
proxy to improve the performance of the HTTPS packets processing. It does so
by creating an instance of the Kernel SSL service, specifying the SSL proxy
port and parameters, and by listening on the proxy port.
.sp
.LP
The
.B create
subcommand creates an instance and enables the service for
the given address and SSL port.
.sp
.LP
The
.B delete
subcommand disables the service for the given address and
port, if it is enabled, and deletes the instance from the SMF repository.
.sp
.LP
.B ksslcfg
can be run as root or by other users assigned to the Network
Security profile. See
.BR rbac (5)
and
.BR user_attr (4).
You must run
.B ksslcfg
to configure your Kernel SSL proxy before you start your
application.
.sp
.LP
.B ksslcfg
allows you to specify an
.I ssl_port
operand, described
under OPERANDS, and, with the
.B -x
option, a
.I proxy_port
value.
When specified for use with the Kernel SSL proxy, these values cannot also
be configured for the Solaris Network Cache and Acceleration (NCA) feature.
See
.BR nca (1)
for a description of the NCA feature.
.sp
.LP
The Fault Managed Resource Identifier (FMRI) for the kernel SSL proxy
instances is
.BR svc://network/ssl/proxy .
.B ksslcfg
creates an
instance of that service unique to the combination of host and SSL port.
Instance FMRIs for particular proxy entries can be found with
.BR svcs (1)
and used for dependencies of other services.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -c
.I ciphersuites
.ad
.sp .6
.RS 4n
Set of ciphers a client is allowed to negotiate in a sorted order. The
supported SSL version3 and TLS ciphers are listed below. Note that the names
are case-insensitive.
.sp
.in +2
.nf
rsa_rc4_128_sha
rsa_rc4_128_md5
rsa_aes_256_cbc_sha
rsa_aes_128_cbc_sha
rsa_3des_ede_cbc_sha
rsa_des_cbc_sha
.fi
.in -2

.RE

.sp
.ne 2
.mk
.na
.B -f
.I key_format
.ad
.sp .6
.RS 4n
Uses the certificate/key format specified in
.IR key_format .
The
supported options are
.BR pkcs11 ,
.BR pkcs12 ,
and
.BR pem .
.RE

.sp
.ne 2
.mk
.na
.B -i
.I key_and_certificate_file
.ad
.sp .6
.RS 4n
When
.B pkcs12
or
.B pem
is specified with the
.B -f
option, reads
a key and a certificate of the web server from
.IR key_and_certificate_file .
This file can also contain any intermediate
CA certificates that form the certificate chain to the root CA for the
server certificate. These certificates must follow the server certificate in
the file and the order must be bottom up: lowest level CA certificate
followed by the next higher level CA certificate, and so on.
.RE

.sp
.ne 2
.mk
.na
.B -C
.I certificate_label
.ad
.sp .6
.RS 4n
PKCS#11 can store multiple certificates in single token. This option
enables you to specify a single certificate, identified by
.IR certificate_label .
This label must match the
.B CKA_LABEL
on the
certificate object in the token specified by
.BR -T .
This option is to be
used only with
.BR "-f pkcs11" .
.RE

.sp
.ne 2
.mk
.na
.B -d
.I softtoken_directory
.ad
.sp .6
.RS 4n
This option is applicable only with the
.B pkcs11
key format, when the
token label is the Sun Software PKCS#11 softtoken. Use this option to
override the default location of the PKCS#11 softtoken directory
.RB ( $HOME/.sunw "). See " pkcs11_softtoken (5).
.RE

.sp
.ne 2
.mk
.na
.B -h
.I ca_certchain_file
.ad
.sp .6
.RS 4n
When
.B pkcs11
is specified with the
.B -f
option, reads a set of
intermediate CA certificates that form the certificate chain to the root CA
for the server certificate (specified with the
.B -C
option), from
.IR ca_certchain_file .
The file must be in PEM format.
.RE

.sp
.ne 2
.mk
.na
.B -p
.I password_file
.ad
.sp .6
.RS 4n
Obtains the password used to encrypt the private key from
.IR password_file .
When using the
.B pkcs11
option (see
.BR -f ,
above), the password is used to authenticate the user to the PKCS #11
token.
.RE

.sp
.ne 2
.mk
.na
.B -t
.I ssl_session_cache_timeout
.ad
.sp .6
.RS 4n
The timeout value, in seconds, for an SSL session. It corresponds to
.B SSL3SessionTimeout
of the Sun ONE web server configuration or
.B SSLSessionCacheTimeout
of
.BR mod_ssl .
.RE

.sp
.ne 2
.mk
.na
.B -T
.I token_label
.ad
.sp .6
.RS 4n
When
.B pkcs11
is specified with
.BR -f ,
uses the PKCS#11 token
specified in
.IR token_label .
Use
.B "cryptoadm list"
.B -v
to display
all PKCS#11 tokens available.
.RE

.sp
.ne 2
.mk
.na
.B -u
.I username
.ad
.sp .6
.RS 4n
The username of the user who owns the password file. If omitted, the system
will try to read the password file as root.
.RE

.sp
.ne 2
.mk
.na
.B -v
.ad
.sp .6
.RS 4n
Verbose mode.
.RE

.sp
.ne 2
.mk
.na
.B -V
.ad
.sp .6
.RS 4n
Displays the version.
.RE

.sp
.ne 2
.mk
.na
.B -x
.I proxy_port
.ad
.sp .6
.RS 4n
The SSL proxy port. The port number is designated exclusively for
clear-text HTTP communication between the web server and the kernel SSL
proxy module. No external HTTP packets are delivered to this port.
.RE

.sp
.ne 2
.mk
.na
.B -z
.I ssl_session_cache_size
.ad
.sp .6
.RS 4n
The maximum number of SSL sessions that can be cached. It corresponds to
.B SSLCacheEntries
of the Sun ONE web server configuration. When this
option is not specified, the default is 5000 entries.
.RE

.sp
.ne 2
.mk
.na
.B -?
.ad
.sp .6
.RS 4n
Displays the usage of the command.
.RE

.SH OPERANDS
.sp
.ne 2
.mk
.na
\fB[\fIhost\fR] [\fIssl_port\fR]\fR
.ad
.RS 21n
.rt
The address and the port of the web server for which the kernel SSL entry
is created. If
.I host
is omitted, the entry will be used for all
requests that arrived at the
.IR ssl_port ,
regardless of the destination
address. Both a host name and an IP address are acceptable forms for
.IR host .
.I ssl_port
is required. Typically, this has a value of
443.
.RE

.SH EXAMPLES
.LP
.B Example 1
Create and Enable a Kernel SSL Instance
.sp
.LP
The following command creates and enables a Kernel SSL instance using a
certificate and a key in PKCS#11 format.

.sp
.in +2
.nf
# \fBksslcfg create -f pkcs11 -T "Sun Software PKCS#11 softtoken"  \e
-C "Server-Cert" -p /some/directory/password -u webservd \e
-x 8080 www.mysite.com 443\fR

% \fBsvcs svc:/network/ssl/proxy\fR
STATE          STIME    FMRI
online         Sep_27   svc:/network/ssl/proxy:kssl-www-mysite-com-443
.fi
.in -2
.sp

.LP
.B Example 2
Create and Enable a Default Instance for All Addresses
.sp
.LP
The following command creates and enables a default instance for all
addresses from a certicate and key in a
.B pkcs#12
file.

.sp
.in +2
.nf
# \fBksslcfg create -x 8888 -f pkcs12 -i /some/directory/keypair.p12 \e
    -p /some/directory/password -u webservd 443\fR
.fi
.in -2
.sp

.LP
.B Example 3
Create and Enable an Instance with Specific Cipher Suites
.sp
.LP
The following command creates and enables an instance with specific cipher
suites.

.sp
.in +2
.nf
# \fBksslcfg create -x 8080 -f pem \e
-i /some/directory/keypair.pem -p /some/directory/password \e
-c "rsa_rc4_128_md5,rsa_rc4_128_sha" \e
209.249.116.195 443\fR
.fi
.in -2
.sp

.LP
.B Example 4
Disable and Delete an Instance
.sp
.LP
The following command disables and deletes an instance.

.sp
.in +2
.nf
# \fBksslcfg delete www.mysite.com 443\fR
.fi
.in -2
.sp

.SH EXIT STATUS
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 6n
.rt
Successful completion.
.RE

.sp
.ne 2
.mk
.na
.B >0
.ad
.RS 6n
.rt
An error occurred.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWksslu
_
Interface StabilitySee below.
.TE

.sp
.LP
Command line options are Evolving; command output is Unstable. The FMRI
service name
.RB ( svc://network/ssl/proxy )
is Unstable, as is the FMRI
instance's name format. The utility name is Stable.
.SH SEE ALSO
.sp
.LP
.BR nca (1),
.BR svcprop (1),
.BR svcs (1),
.BR cryptoadm (1M),
.BR svcadm (1M),
.BR svccfg (1M),
.BR user_attr (4),
.BR attributes (5),
.BR pkcs11_softtoken (5),
.BR rbac (5),
.BR smf (5)
.SH NOTES
.sp
.LP
.B ksslcfg create
without an host argument creates an
.B INADDR_ANY smf
instance.
.B "ksslcfg delete"
without an
host argument deletes only the
.B INADDR_ANY
instance.
.B ksslcfg
.B delete
needs a host argument to delete any non-\fBINADDR_ANY\fR
instance.
.sp
.LP
On a system with
.BR zones (5)
installed, the
.B ksslcfg
command can be
used only in the global zone at this time.
