usr/src/man/man1m/ktkt_warnd.1m
'\" te
.\" Copyright 1987, 1989 by the Student Information Processing Board of the
.\" Massachusetts Institute of Technology. For copying and distribution
.\" information, please see the file kerberosv5/mit-sipb-copyright.h.
.\" Portions Copyright (c) 2004, Sun Microsystems, Inc.  All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ktkt_warnd 1M "21 Mar 2005" "SunOS 5.11" "System Administration Commands"
.SH NAME
ktkt_warnd \- Kerberos warning daemon
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/krb5/ktkt_warnd\fR
.fi

.SH DESCRIPTION
.sp
.LP
\fBktkt_warnd\fR is a daemon on Kerberos clients that can warn users when
their Kerberos tickets are about to expire or renew the tickets before they
expire. It is invoked by
.B inetd
when a ticket-granting ticket (TGT) is
obtained for the first time, such as after using the
.B kinit
command.
\fBktkt_warnd\fR can be configured through the \fB/etc/krb5/warn.conf\fR
file on the client. In
.BR warn.conf ,
you can specify that you be supplied
notice, through
.B syslog
or terminal or mail, of ticket expiration or to
renew the TGT.
.SH FILES
.sp
.ne 2
.mk
.na
\fB/etc/krb5/warn.conf\fR
.ad
.RS 23n
.rt
Kerberos warning configuration file
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityEvolving
.TE

.SH SEE ALSO
.sp
.LP
.BR svcs (1),
.BR inetadm (1M),
.BR inetd (1M),
.BR svcadm (1M),
\fBwarn.conf\fR(4), \fBattributes\fR(5),
.BR kerberos (5),
\fBsmf\fR(5)
.SH NOTES
.sp
.LP
The
.B ktkt_warnd
service is managed by the service management facility,
\fBsmf\fR(5), under the service identifier:
.sp
.in +2
.nf
svc:/network/security/ktkt_warn:default
.fi
.in -2
.sp

.sp
.LP
Administrative actions on this service, such as enabling, disabling, or
requesting restart, can be performed using
.BR svcadm (1M).
Responsibility
for initiating and restarting this service is delegated to
.BR inetd (1M).
Use \fBinetadm\fR(1M) to make configuration changes and to view
configuration information for this service. The service's status can be
queried using the
.BR svcs (1)
command.
