usr/src/man/man1m/labelit.1m
'\" te
.\" Copyright (c) 2000, Sun Microsystems, Inc.  All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" Copyright 1989 AT&T
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH labelit 1M "31 Oct 2000" "SunOS 5.11" "System Administration Commands"
.SH NAME
labelit \- list or provide labels for file systems
.SH SYNOPSIS
.LP
.nf
\fBlabelit\fR [\fB-F\fR \fIFSType\fR] [\fB-V\fR] [\fB-o\fR \fIFSType-specific-options\fR] \fIspecial\fR
     [\fIoperands\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The
.B labelit
utility is used to write or display labels on unmounted
disk file systems.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -F
.I FSType
.ad
.RS 13n
.rt
Specify the
.I FSType
on which to operate. The
.I FSType
should
either be specified here or be determinable from
.B /etc/vfstab
by
matching the
.I special
with an entry in the table. If no matching entry
is found, the default file system type specified in \fB/etc/default/fs\fR
will be used.
.RE

.sp
.ne 2
.mk
.na
.B -V
.ad
.RS 13n
.rt
Echo complete command line. This option may be used to verify and validate
the command line. Additional information obtained using a \fB/etc/vfstab\fR
lookup is included in the output. The command is not executed.
.RE

.sp
.ne 2
.mk
.na
.B -o
.ad
.RS 13n
.rt
Specify \fIFSType\fR-specific options. See the manual page for the
.B labelit
module specific to the file system type.
.RE

.SH OPERANDS
.sp
.LP
The following operands are supported. If no operands are specified,
.B labelit
will display the value of the labels.
.sp
.ne 2
.mk
.na
.I special
.ad
.RS 12n
.rt
The disk partition (for example,
.BR /dev/rdsk/c0t3d0s6 ).
The device may
not be on a remote machine.
.RE

.sp
.ne 2
.mk
.na
.I operands
.ad
.RS 12n
.rt
\fIFSType\fR-specific operands. Consult the manual page of the
\fIFSType\fR-specific \fBlabelit\fR command for detailed descriptions.
.RE

.SH USAGE
.sp
.LP
See
.BR largefile (5)
for the description of the behavior of
.BR labelit
when encountering files greater than or equal to 2 Gbyte ( 2^31 bytes).
.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 12n
.rt
Write or display of labels was successful.
.RE

.sp
.ne 2
.mk
.na
.B non-zero
.ad
.RS 12n
.rt
An error occurred.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/vfstab
.ad
.RS 19n
.rt
List of default parameters for each file system.
.RE

.sp
.ne 2
.mk
.na
.B /etc/default/fs
.ad
.RS 19n
.rt
Default local file system type. Default values can be set for the following
flags in
.BR /etc/default/fs .
For example:
.sp
.ne 2
.mk
.na
.B LOCAL=ufs
.ad
.br
.na
.B LOCAL
.ad
.RS 13n
.rt
The default partition for a command if no
.I FSType
is specified.
.RE

.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.sp
.LP
.BR labelit_hsfs (1M),
.BR labelit_udfs (1M),
.BR labelit_ufs (1M),
.BR volcopy (1M),
.BR vfstab (4),
.BR attributes (5),
.BR largefile (5)
.SH NOTES
.sp
.LP
This utility may not be supported for all
.IR FSTypes .
