usr/src/man/man1m/labelit_udfs.1m
'\" te
.\" Copyright (c) 2000 Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH labelit_udfs 1M "31 Oct 2000" "SunOS 5.11" "System Administration Commands"
.SH NAME
labelit_udfs \- provide and print labels for udf file systems
.SH SYNOPSIS
.LP
.nf
\fBlabelit\fR \fB-F \fR udfs [\fIgeneric_options\fR] [\fB-o\fR \fIspecific_options\fR] \fIspecial\fR
     [\fIfsname\fR \fIvolume\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The
.B labelit
command writes labels on an unmounted disk that contains
a universal disk file (\fBudf\fR) system. These labels can be used to
identify volumes.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.I generic_options
.ad
.RS 23n
.rt
Specify
.I generic_options
supported by the generic
.BR labelit
command. See \fBlabelit\fR(1M) for descriptions of supported options.
.RE

.sp
.ne 2
.mk
.na
.B -o
.I specific_options
.ad
.RS 23n
.rt
Specify udfs-file-system-specific options in a  comma-separated list with
no intervening spaces. The following
.I specific_options
are available:
.sp
.ne 2
.mk
.na
\fBlvinfo1=\fIstring\fR
.ad
.RS 18n
.rt
Specify information to be inserted in the
.B LVInfo1
field of the
Implementation Use Volume Descriptor. Information in
.B LVInfo1
is
generally used to identify the person creating the file system. The maximum
length of the string specified is 35 bytes.
.RE

.sp
.ne 2
.mk
.na
\fBlvinfo2=\fIstring\fR
.ad
.RS 18n
.rt
Specify information to be inserted into the
.B LVInfo2
field of the
Implementation Use Volume Descriptor. Information in
.B LVInfo2
is
generally used to identify the organization responsible for creating the
file system. The maximum length of the string specified is 35 bytes.
.RE

.sp
.ne 2
.mk
.na
\fBlvinfo3=\fIstring\fR
.ad
.RS 18n
.rt
Specify information to be inserted into the
.B LVInfo3
field of the
Implementation Use Volume Descriptor. Information in
.B LVInfo3
is
generally used to identify the contact information for the medium. The
maximum length of the string specified is 35 bytes.
.RE

.RE

.SH OPERANDS
.sp
.LP
The following operands are supported:
.sp
.ne 2
.mk
.na
.I special
.ad
.RS 11n
.rt
Specify
.I special
as the physical disk slice, for example,
.BR /dev/rdsk/c0t0d0s6 .
The device can not be on a remote machine.
.RE

.sp
.ne 2
.mk
.na
.I fsname
.ad
.RS 11n
.rt
Specify
.I fsname
as the mount point, (for example,
.BR root ,
.BR u1 ,
and so forth), of the file system.
.RE

.sp
.ne 2
.mk
.na
.I volume
.ad
.RS 11n
.rt
Specify
.I volume
as the physical volume name.
.RE

.sp
.LP
If none of the options (\fIfsname\fR,
.IR volume ,
.IR specific_options )
is specified,
.B labelit
prints the current values of
.IR fsname ,
.IR volume ,
.BR LVInfo1 ,
.B LVInfo2
and \fBLVInfo3\fR.
.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 12n
.rt
Successful completion.
.RE

.sp
.ne 2
.mk
.na
.B non-zero
.ad
.RS 12n
.rt
An error occurred.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWudf
.TE

.SH SEE ALSO
.sp
.LP
.BR labelit (1M),
.BR attributes (5)
