usr/src/man/man1m/labelit_udfs.1m
'\" te
.\" Copyright (c) 2000 Sun Microsystems, Inc. All Rights Reserved.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH labelit_udfs 1M "31 Oct 2000" "SunOS 5.11" "System Administration Commands"
.SH NAME
labelit_udfs \- provide and print labels for udf file systems
.SH SYNOPSIS
.LP
.nf
\fBlabelit\fR \fB-F \fR udfs [\fIgeneric_options\fR] [\fB-o\fR \fIspecific_options\fR] \fIspecial\fR
     [\fIfsname\fR \fIvolume\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The \fBlabelit\fR command writes labels on an unmounted disk that contains
a universal disk file (\fBudf\fR) system. These labels can be used to
identify volumes.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fIgeneric_options\fR
.ad
.RS 23n
.rt
Specify \fIgeneric_options\fR supported by the generic \fBlabelit\fR
command. See \fBlabelit\fR(1M) for descriptions of supported options.
.RE

.sp
.ne 2
.mk
.na
\fB-o\fR \fIspecific_options\fR
.ad
.RS 23n
.rt
Specify udfs-file-system-specific options in a  comma-separated list with
no intervening spaces. The following \fIspecific_options\fR are available:
.sp
.ne 2
.mk
.na
\fBlvinfo1=\fIstring\fR
.ad
.RS 18n
.rt
Specify information to be inserted in the \fBLVInfo1\fR field of the
Implementation Use Volume Descriptor. Information in \fBLVInfo1\fR is
generally used to identify the person creating the file system. The maximum
length of the string specified is 35 bytes.
.RE

.sp
.ne 2
.mk
.na
\fBlvinfo2=\fIstring\fR
.ad
.RS 18n
.rt
Specify information to be inserted into the \fBLVInfo2\fR field of the
Implementation Use Volume Descriptor. Information in \fBLVInfo2\fR is
generally used to identify the organization responsible for creating the
file system. The maximum length of the string specified is 35 bytes.
.RE

.sp
.ne 2
.mk
.na
\fBlvinfo3=\fIstring\fR
.ad
.RS 18n
.rt
Specify information to be inserted into the \fBLVInfo3\fR field of the
Implementation Use Volume Descriptor. Information in \fBLVInfo3\fR is
generally used to identify the contact information for the medium. The
maximum length of the string specified is 35 bytes.
.RE

.RE

.SH OPERANDS
.sp
.LP
The following operands are supported:
.sp
.ne 2
.mk
.na
\fIspecial\fR
.ad
.RS 11n
.rt
Specify \fIspecial\fR as the physical disk slice, for   example,
\fB/dev/rdsk/c0t0d0s6\fR. The device can not be on a remote machine.
.RE

.sp
.ne 2
.mk
.na
\fIfsname\fR
.ad
.RS 11n
.rt
Specify \fIfsname\fR as the mount point, (for example, \fBroot\fR,
\fBu1\fR, and so forth), of the file system.
.RE

.sp
.ne 2
.mk
.na
\fIvolume\fR
.ad
.RS 11n
.rt
Specify \fIvolume\fR as the physical volume name.
.RE

.sp
.LP
If none of the options (\fIfsname\fR, \fIvolume\fR, \fIspecific_options\fR)
is specified, \fBlabelit\fR prints the current values of \fIfsname\fR,
\fIvolume\fR, \fBLVInfo1\fR, \fBLVInfo2\fR and \fBLVInfo3\fR.
.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
\fB0\fR
.ad
.RS 12n
.rt
Successful completion.
.RE

.sp
.ne 2
.mk
.na
\fBnon-zero\fR
.ad
.RS 12n
.rt
An error occurred.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWudf
.TE

.SH SEE ALSO
.sp
.LP
\fBlabelit\fR(1M), \fBattributes\fR(5)
