usr/src/man/man1m/labelit_hsfs.1m
'\" te
.\" Copyright (c) 1992, Sun Microsystems, Inc.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH labelit_hsfs 1M "20 Mar 1992" "SunOS 5.11" "System Administration Commands"
.SH NAME
labelit_hsfs \- provide and print labels for hsfs file systems
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/labelit\fR \fB-F\fR hsfs [\fIgeneric_options\fR]
     [\fB-o\fR \fIspecific_options\fR] \fIspecial\fR
.fi

.SH DESCRIPTION
.sp
.LP
.B labelit
can be used to provide labels for unmounted CD-ROM images
(CD-ROMs may not be labeled, as they are read-only media).
.sp
.LP
.I generic_options
are options supported by the generic
.BR labelit
command.
.sp
.LP
If no
.I specific_options
are specified,
.B labelit
prints the
current value of all label fields.
.sp
.LP
The
.I special
name should be the physical disk section (for example,
.BR /dev/dsk/c0d0s6 ).
.SH OPTIONS
.sp
.ne 2
.mk
.na
.B -o
.ad
.RS 6n
.rt
.RI "Use one or more of the following  " name = value " pairs separated by"
commas (with no intervening spaces) to specify values for specific label
fields. According to the ISO 9660 specification, only certain sets of
characters may be used to fill in these labels.  Thus, ``d-characters''
below refers to the characters `A' through `Z', the digits `0' through `9',
and the `_' (underscore) character.  ``a-characters'' below refers to `A'
through `Z', `0' through `9', space, and the following characters:
!"%&'()*+,-./:;<=>?_. 
.sp
.ne 2
.mk
.na
.B absfile=
.ad
.RS 13n
.rt
Abstract file identifier, d-characters, 37 characters maximum.
.RE

.sp
.ne 2
.mk
.na
.B applid=
.ad
.RS 13n
.rt
Application identifier, d-characters, 128 characters maximum.
.RE

.sp
.ne 2
.mk
.na
.B bibfile=
.ad
.RS 13n
.rt
Bibliographic file identifier, d-characters, 37 characters maximum.
.RE

.sp
.ne 2
.mk
.na
.B copyfile=
.ad
.RS 13n
.rt
Copyright file identifier, d-characters, 128 maximum.
.RE

.sp
.ne 2
.mk
.na
.B prepid=
.ad
.RS 13n
.rt
Data preparer identifier, d-characters, 128 maximum.
.RE

.sp
.ne 2
.mk
.na
.B pubid=
.ad
.RS 13n
.rt
Publisher identifier, d-characters, 128 maximum.
.RE

.sp
.ne 2
.mk
.na
.B sysid=
.ad
.RS 13n
.rt
System identifier, a-characters, 32 maximum.
.RE

.sp
.ne 2
.mk
.na
.B volid=
.ad
.RS 13n
.rt
Volume identifier, d-characters, 32 maximum.
.RE

.sp
.ne 2
.mk
.na
.B volsetid=
.ad
.RS 13n
.rt
Volume set identifier, d-characters, 128 maximum.
.RE

.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.sp
.LP
.BR labelit (1M),
.BR volcopy (1M),
.BR attributes (5)
