usr/src/man/man1m/ldap_cachemgr.1m
'\" te
.\" Copyright (C) 2005, Sun Microsystems, Inc. All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ldap_cachemgr 1M "7 Oct 2008" "SunOS 5.11" "System Administration Commands"
.SH NAME
ldap_cachemgr \- LDAP daemon to manage client configuration for LDAP based
Network Information Service lookups
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/ldap/ldap_cachemgr\fR [\fB-l\fR \fIlog-file\fR] [\fB-g\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The
.B ldap_cachemgr
daemon is a process that provides an up-to-date
configuration cache for LDAP naming services. It is started during
multi-user boot.
.sp
.LP
The
.B ldap_cachemgr
utility provides caching for all parameters as
specified and used by the LDAP naming service clients. The
.B ldap_cachemgr
utility uses the cache files which are originally
created by executing the \fBldapclient\fR(1M) utility, as cold start files.
Updates to the cache files take place dynamically if profiles are used to
configure the client. See the
.B init
option to
.BR ldapclient (1M).
.sp
.LP
The
.B ldap_cachemgr
utility helps improve the performance of the
clients that are using LDAP as the Naming service repository. In order for
the LDAP naming services to function properly, the \fBldap_cachemgr\fR
daemon must be running.
.B ldap_cachemgr
also improves system security by
making the configuration files readable by superuser only.
.sp
.LP
The cache maintained by this daemon is shared by all the processes that
access LDAP Naming information. All processes access this cache through a
door call. On startup,
.B ldap_cachemgr
initializes the cache from the
cache files. See
.BR ldapclient (1M).
Thus, the cache survives machine
reboots.
.sp
.LP
The
.B ldap_cachemgr
daemon also acts as its own administration tool. If
an instance of
.B ldap_cachemgr
is already running, commands are passed
transparently to the running version.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -g
.ad
.sp .6
.RS 4n
Print current configuration and statistics to standard output. This is the
only option executable without superuser privileges.
.RE

.sp
.ne 2
.mk
.na
.B -l
.I log-file
.ad
.sp .6
.RS 4n
Cause
.B ldap_cachemgr
to use a log file other than the default
.BR /var/ldap/cachemgr.log .
.RE

.SH EXAMPLES
.LP
.B Example 1
Stopping and Restarting the
.B ldap_cachemgr
Daemon
.sp
.LP
The following example shows how to stop and to restart the
.B ldap_cachemgr
daemon.

.sp
.in +2
.nf
example# svcadm disable network/ldap/client
example# svcadm enable network/ldap/client
.fi
.in -2
.sp

.LP
.B Example 2
Forcing
.B ldap_cachemgr
to Reread Configuration Files
.sp
.LP
The following example shows how to force
.B ldap_cachemgr
to reread the
.B /var/ldap/ldap_client_file
and
.BR /var/ldap/ldap_client_cred
files

.sp
.in +2
.nf
example# pkill -HUP ldap_cachemgr
.fi
.in -2
.sp

.SH FILES
.sp
.ne 2
.mk
.na
.B /var/ldap/cachemgr.log
.ad
.sp .6
.RS 4n
Default log file.
.RE

.sp
.ne 2
.mk
.na
.B /var/ldap/ldap_client_file
.ad
.br
.na
.B /var/ldap/ldap_client_cred
.ad
.sp .6
.RS 4n
Files containing the LDAP configuration of the client. These files are not
to be modified manually. Their content is not guaranteed to be human
readable. Use \fBldapclient\fR(1M) to update these files.
.RE

.SH WARNINGS
.sp
.LP
The
.B ldap_cachemgr
utility is included in the current Solaris release
on an uncommitted basis only. It is subject to change or removal in a future
minor release.
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWnisu
.TE

.SH SEE ALSO
.sp
.LP
.BR ldap (1),
.BR ldapadd (1),
.BR ldapdelete (1),
.BR ldaplist (1),
.BR ldapmodify (1),
.BR ldapmodrdn (1),
.BR ldapsearch (1),
.BR pkill (1),
.BR svcs (1),
.BR idsconfig (1M),
.BR ldapaddent (1M),
.BR ldapclient (1M),
.BR suninstall (1M),
.BR svcadm (1M),
.BR signal.h (3HEAD),
.BR resolv.conf (4),
.BR attributes (5),
.BR smf (5)
.SH NOTES
.sp
.LP
The
.B ldap_cachemgr
service is managed by the service management
facility,
.BR smf (5),
under the service identifier:
.sp
.in +2
.nf
svc:/network/ldap/client
.fi
.in -2
.sp

.sp
.LP
Administrative actions on this service, such as enabling, disabling, or
requesting restart, can be performed using
.BR svcadm (1M).
The service's
status can be queried using the
.BR svcs (1)
command.
