usr/src/man/man1m/link.1m
'\" te
.\" Copyright 1989 AT&T
.\" Copyright (c) 2002Sun Microsystems, Inc.  All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH link 1M "9 Oct 2002" "SunOS 5.11" "System Administration Commands"
.SH NAME
link, unlink \- link and unlink files and directories
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/link \fR \fIexisting-file\fR \fInew-file\fR
.fi

.LP
.nf
\fB/usr/xpg4/bin/link \fR \fIexisting-file\fR \fInew-file\fR
.fi

.LP
.nf
\fB/usr/sbin/unlink\fR \fIfile\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B link
and
.B unlink
commands link and unlink files and
directories. Only super-users can use these commands on directories.
.sp
.LP
Use
.B link
to create a new file that points to an existing file. The
.I existing-file
and
.I new-file
operands  specify the existing file
and newly-created files.  See
.BR OPERANDS .
.sp
.LP
.B link
and
.B unlink
directly invoke the
.BR link (2)
and
.BR unlink (2)
system calls, performing exactly what they are told to do
and abandoning all error checking. This differs from the
.BR ln (1)
command. See
.BR ln (1).
.sp
.LP
While linked files and directories can be removed using
.BR unlink ,
it is
safer to use
.BR rm (1)
and
.BR rmdir (1)
instead. See
.BR rm (1)
and
.BR rmdir (1).
.SS "/usr/xpg4/bin/link"
.sp
.LP
If the existing file being hard linked is itself a symbolic link, then the
newly created file
.RI ( new-file )
will be a hard link to the file
referenced by the symbolic link, not to the symbolic link object itself
.RI ( existing-file ).
.SH OPERANDS
.sp
.LP
The following operands are supported:
.sp
.ne 2
.mk
.na
.I existing-file
.ad
.RS 17n
.rt
Specifies the name of the existing file to be linked.
.RE

.sp
.ne 2
.mk
.na
.I file
.ad
.RS 17n
.rt
Specifies the name of the file to be unlinked.
.RE

.sp
.ne 2
.mk
.na
.I new-file
.ad
.RS 17n
.rt
Specifies the name of newly created (linked) file.
.RE

.SH ENVIRONMENT VARIABLES
.sp
.LP
See
.BR environ (5)
for descriptions of the following environment
variables that affect the execution of
.BR link :
.BR LANG ,
.BR LC_ALL ,
.BR LC_CTYPE ,
.BR LC_MESSAGES ,
and
.BR NLSPATH .
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SS "/usr/xpg4/bin/link"
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWxcu4
_
Interface StabilityStandard
.TE

.SH SEE ALSO
.sp
.LP
.BR ln (1),
.BR rm (1),
.BR link (2),
.BR unlink (2),
.BR attributes (5),
.BR environ (5),
.BR standards (5)
