usr/src/man/man1m/lms.1m
'\" te
.\" Copyright (c) 2009, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH lms 1M "3 Mar 2009" "SunOS 5.11" "System Administration Commands"
.SH NAME
lms \- allow applications to access the Intel Active Management
Technology
.SH SYNOPSIS
.LP
.nf
\fBlms\fR
.fi

.SH DESCRIPTION
.sp
.LP
The Local Manageability Service,
.BR lms ,
allows applications to access
the Intel Active Management Technology (Intel AMT) ME (Management Engine)
using the local HECI interface. LMS is dependent on the HECI driver.
.sp
.LP
To use
.BR lms ,
ensure that the Intel AMT Manageability Interface driver
is installed and connected to the ME.
.sp
.LP
.B lms
is intended to be run as a daemon. Messages from the service are
sent to the
.BR syslog .
LMS messages are marked with a source of
\fB"LMS"\fR.
.sp
.LP
For an example of how to enable the LMS service using SMF, see
.BR EXAMPLES .
.SH EXAMPLES
.LP
.B Example 1
Enabling the LMS service using SMF
.sp
.LP
The following example enables the LMS service using SMF:

.sp
.in +2
.nf
svcadm enable network/lms
.fi
.in -2
.sp

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Architecturex86
_
AvailabilitySUNWamt-lms
_
Interface StabilityVolatile
.TE

.SH SEE ALSO
.sp
.LP
.BR attributes (5),
.BR smf (5)
