usr/src/man/man1m/locator.1m
'\" te
.\" Copyright (c) 2001, Sun Microsystems, Inc. All Rights Reserved.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH locator 1M "4 Sept 2001" "SunOS 5.11" "System Administration Commands"
.SH NAME
locator \- location indicator control
.SH SYNOPSIS
.LP
.nf
\fB /usr/sbin/locator\fR [\fB-f\fR | \fB-n\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The locator command sets or queries the state of the system locator if such
a device exists.
.sp
.LP
Without options, the locator command reports the current state of the
system.
.sp
.LP
The privileges required to use this command are hardware dependent.
Typically, only the super user can get or set a locator.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -f
.ad
.RS 6n
.rt
Turns the locator off.
.RE

.sp
.ne 2
.mk
.na
.B -n
.ad
.RS 6n
.rt
Turns the locator on.
.RE

.SH EXAMPLES
.LP
.B Example 1
Using the
.B locator
Command on a Platform Which Has a
System Locator LED
.sp
.LP
When issued on a platform which has a system locator
.BR LED ,
the
following command turns the locator on:

.sp
.in +2
.nf
# \fBlocator \fB-n\fR
# \fBlocator\fR
The 'system' locator is on
.fi
.in -2
.sp

.LP
.B Example 2
Using the
.B locator
Command on a Platform Which Does
Not Have a System Locator LED
.sp
.LP
When issued on a platform which does not have a system locator
.BR LED ,
the following command attempts to turn the locator on. The command returns
an error message.

.sp
.in +2
.nf
# \fBlocator \fB-n\fR
\&'system' locator not found
.fi
.in -2
.sp

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 5n
.rt
Successful completion.
.RE

.sp
.ne 2
.mk
.na
.B 1
.ad
.RS 5n
.rt
Invalid command line input.
.RE

.sp
.ne 2
.mk
.na
.B 2
.ad
.RS 5n
.rt
The requested operation failed.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.sp
.LP
.BR attributes (5)
