usr/src/man/man1m/logadm.1m
'\" te
.\" Copyright (c) 2007 Sun Microsystems, Inc. All Rights Reserved.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH logadm 1M "23 May 2007" "SunOS 5.11" "System Administration Commands"
.SH NAME
logadm \- manage endlessly growing log files
.SH SYNOPSIS
.LP
.nf
\fBlogadm\fR
.fi

.LP
.nf
\fBlogadm\fR [\fB-\fIoptions\fR] \fIlogname\fR...
.fi

.SH DESCRIPTION
.sp
.LP
.B logadm
is a general log rotation tool that is suitable for running
from
.BR cron (1M).
.sp
.LP
Without arguments,
.B logadm
reads the
.B /etc/logadm.conf
file, and
for every entry found in that file checks the corresponding log file to see
if it should be rotated. Typically this check is done each morning by an
entry in the root's
.BR crontab .
.sp
.LP
If the
.I logname
argument is specified,
.B logadm
renames the
corresponding log file by adding a suffix so that the most recent log file
ends with \fB\&.0\fR (that is, \fIlogfile\fB\&.0\fR), the next most
recent ends with \fB\&.1\fR (that is, \fIlogfile\fB\&.1\fR), and so
forth. By default, ten versions of old log files are kept (that is,
\fIlogfile\fB\&.0\fR through \fIlogfile\fB\&.9\fR). At the point when
what would be the eleventh file is logged,
.B logadm
automatically
deletes the oldest version to keep the count of files at ten.
.sp
.LP
.B logadm
takes a number of
.IR options .
You can specify these options
on the command line or in the \fB/etc/logadm.conf\fR file. The \fBlogadm\fR
command searches \fB/etc/logadm.conf\fR for lines of the form \fIlogname\fR
.I options
.sp
.ne 2
.mk
.na
.I logname
.ad
.sp .6
.RS 4n
Identifies an entry in
.BR /etc/logadm.conf .
This can be a name or the
pathname of the log file. If you specify a log file, rather than a name, for
this field, it must be a fully qualified pathname.
.RE

.sp
.ne 2
.mk
.na
.I options
.ad
.sp .6
.RS 4n
Identifies command line options exactly as they would be entered on the
command line. This allows commonly used log rotation policies to be stored
in the
.B /etc/logadm.conf
file. See
.BR EXAMPLES .
.sp
If
.I options
are specified both in
.B /etc/logadm.conf
and on the
command line, those in the
.B /etc/logadm.conf
file are applied first.
Therefore, the command line options override those in
.BR /etc/logadm.conf .
.sp
Log file names specified in
.B /etc/logadm.conf
may contain filename
substitution characters such as
.B *
and
.BR ? ,
that are supported by
.BR csh (1).
.RE

.sp
.LP
Two options control when a log file is rotated. They are:
.B -s
size
.B -p
period.
.sp
.LP
When using more than one of these options at a time, there is an implied
.B and
between them. This means that all conditions must be met before
the log is rotated.
.sp
.LP
If neither of these two options are specified, the default conditions for
rotating a log file are: \fB-s 1b\fR
.BR "-p 1w" ,
which
means the log file is only rotated if the size is non-zero and if at least 1
week has passed since the last time it was rotated.
.sp
.LP
By specifying
.B "-p never"
as a rotation condition, any other
rotation conditions are ignored and
.B logadm
moves on to the expiration
of old log files. By specifying
.B "-p now"
as a rotation
condition, a log rotation is forced.
.sp
.LP
Unless specified by the
.BR -o ,
.BR -g ,
or
.B -m
options,
.B logadm
replaces the log file (after renaming it) by creating an empty
file whose owner, group ID, and permissions match the original file.
.sp
.LP
Three options control when old log files are expired:
.B -A
age
.BR -C
count
.B -S
size. These options expire the oldest log files until a
particular condition or conditions are met. For example, the combination
.B -C 5
and the
.B "-S 10m"
options expires old
log files until there are no more than 5 of the
.B and
their combined
disk usage is no more than 10 megabytes. If none of these options are
specified, the default expiration is
.B "-C 10"
which keeps ten
old log files. If no files are to be expired, use
.B "-C 0"
to
prevent expiration by default.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -a
.I post_command
.ad
.sp .6
.RS 4n
Execute the
.I post_command
after renaming the log file.
.I post_command
is passed to
.BR "sh -c" .
.sp
Specify
.I post_command
as a valid shell command. Use quotes to protect
spaces or shell metacharacters in
.IR post_command .
.sp
This option can be used to restart a daemon that is writing to the file.
When rotating multiple logs with one
.B logadm
command,
.I post_command
is executed only once after all the logs are rotated, not
once per rotated log.
.RE

.sp
.ne 2
.mk
.na
.B -A
.I age
.ad
.sp .6
.RS 4n
Delete any versions that have not been modified for the amount of time
specified by
.IR age .
.sp
Specify
.I age
as a number followed by an
.B h
.RB (hours), " d"
(days), \fBw\fR(weeks), \fBm\fR (months), or \fBy\fR (years).
.RE

.sp
.ne 2
.mk
.na
.B -b
.I pre_command
.ad
.sp .6
.RS 4n
Execute
.I pre_command
before renaming the log file. \fIpre_command\fR
is passed to
.BR "sh -c" .
.sp
Specify
.I pre_command
as a valid shell command. Use quotes to protect
spaces or shell metacharacters in the
.IR pre_command .
.sp
This option can be used to stop a daemon that is writing to the file. When
rotating multiple logs with one
.B logadm
command,
.I pre_command
is
executed only once before all the logs are rotated, not once per rotated
log.
.RE

.sp
.ne 2
.mk
.na
.B -c
.ad
.sp .6
.RS 4n
Rotate the log file by copying it and truncating the original logfile to
zero length, rather than renaming the file.
.RE

.sp
.ne 2
.mk
.na
.B -C
.I count
.ad
.sp .6
.RS 4n
Delete the oldest versions until there are not more than
.I count
files
left.
.sp
If no expire options (\fB-A\fR,
.BR -C ,
or
.BR -S )
are specified,
.B -C 10
is the default. To prevent the default expire rule
from being added automatically, specify
.B "-C 0"
\&.
.RE

.sp
.ne 2
.mk
.na
.B -e
.I mail_addr
.ad
.sp .6
.RS 4n
Send error messages by email to
.IR mail_addr .
.sp
As
.B logadm
is typically run from
.BR cron "(1M), error messages are"
captured by
.B cron
and mailed to the owner of the
.BR crontab .
.sp
This option is useful if you want the mail regarding error messages to go
to another address instead. If no errors are encountered, no mail message is
generated.
.RE

.sp
.ne 2
.mk
.na
.B -E
.I cmd
.ad
.sp .6
.RS 4n
Execute
.I cmd
to expire the file, rather than deleting the old log file
to expire it.
.sp
.I cmd
is passed it to
.BR "sh -c" .
The file is considered expired
after
.I cmd
completes. If the old log file is not removed or renamed by
the
.IR cmd ,
.B logadm
considers it for expiration the next time that
it runs on the specified log file. If present, the keyword
.B $file
is
expanded in the specified \fIcmd\fRto the name of the file being expired.
.sp
This option is useful for tasks such as mailing old log files to
administrators, or copying old log files to long term storage.
.RE

.sp
.ne 2
.mk
.na
.B -f
.I conf_file
.ad
.sp .6
.RS 4n
Use \fIconf_file\fR instead of \fB/etc/logadm.conf\fR.
.sp
.RB "This option allows non-root users to keep their own" " logadm"
configuration files.
.RE

.sp
.ne 2
.mk
.na
.B -g
.I group
.ad
.sp .6
.RS 4n
Create a new empty file with the
.B ID
specified by
.IR group ,
instead
of preserving the group
.B ID
of the log file.
.sp
Specify
.I group
by name or by numeric group
.BR ID ,
as accepted by
.BR chgrp (1).
.sp
This option requires the ability to change file group ownership using the
.BR chgrp (1)
command.
.RE

.sp
.ne 2
.mk
.na
.B -h
.ad
.sp .6
.RS 4n
Print a help message that describes
.BR logadm "'s options."
.RE

.sp
.ne 2
.mk
.na
.B -l
.ad
.sp .6
.RS 4n
Use local time rather than the Coordinated Universal Time (UTC) when naming
rotated log files (see the discussion of percent sequences in the templates
supplied with the
.B -t
option).
.RE

.sp
.ne 2
.mk
.na
.B -m
.I mode
.ad
.sp .6
.RS 4n
Create a new empty file with the mode specified by
.IR mode ,
instead of
preserving the mode of the log file.
.sp
Specify
.I mode
in any form that is accepted by the
.BR chmod (1)
command.
.RE

.sp
.ne 2
.mk
.na
.B -M
.I cmd
.ad
.sp .6
.RS 4n
Use
.I cmd
to rename the log file. If the keyword
.B $file
is
specified, it is expanded to the name of the log file. Similarly, the
keyword
.B $nfile
is expanded to the new name of the log file. The
.B $nfile
keyword is only available with commands provided with the
.B -M
option. After the command completes, the log file is replaced by
the rotate file. The default \fIcmd\fR is "\fB/bin/mv\fR
\fB$file\fB$nfile\fR".
.RE

.sp
.ne 2
.mk
.na
.B -n
.ad
.sp .6
.RS 4n
Print the actions that the
.B logadm
command will perform without
actually performing them.
.sp
This option is useful for checking arguments before making any changes to
the system.
.sp
It is important to remember, however, that since log rotating actions are
only printed with this option,
.B logadm
might not find files that need
expiring, but if run without the
.B "-n logadm"
might create a file
that needs expiring by performing the log rotating actions. Therefore, if
you see no files being expired with the
.B -n
option, files still might
be expired without it.
.RE

.sp
.ne 2
.mk
.na
.B -N
.ad
.sp .6
.RS 4n
Prevent an error message if the specified logfile does not exist. Normally,
.B logadm
produces an error message if the log file is not found. With
.BR -N ,
if the log file doesn't exist
.B logadm
moves on to the expire
rules (if any) and then to the next log file (if any), without creating the
empty replacement log file.
.RE

.sp
.ne 2
.mk
.na
.B -o
.I owner
.ad
.sp .6
.RS 4n
Create the new empty file with
.IR owner ,
instead of preserving the owner
of the log file.
.sp
Specify
.I owner
in any form that is accepted by the
.BR chown (1)
command.
.RE

.sp
.ne 2
.mk
.na
.B -p
.I period
.ad
.sp .6
.RS 4n
Rotate a log file after the specified time period
.RI ( period ).
.sp
Specify
.I period
as a number followed by
.B d
for days,
.B h
for
hours,
.B w
for weeks,
.B m
for months (30 days) or
.B y
for years.
There are also two special values for period:
.B now
and
.BR never .
"\fB-p now\fR" forces log rotation. "\fB-p never\fR"
forces no log rotation.
.RE

.sp
.ne 2
.mk
.na
.B -P
.I timestamp
.ad
.sp .6
.RS 4n
Used by
.B logadm
to record the last time the log was rotated in
.BR /etc/logadm.conf .
.sp
This option uses
.I timestamp
to determine if the log rotation period
has passed. The format of
.I timestamp
matches the format generated by
.BR ctime (3C),
with quotes around it to protect embedded spaces.
.I timestamp
is always recorded in the Coordinated Universal Time (UTC)
timezone.
.RE

.sp
.ne 2
.mk
.na
.B -r
.ad
.sp .6
.RS 4n
Remove any entries corresponding to the specified
.I logname
from the
.BR /etc/logadm.conf .
.RE

.sp
.ne 2
.mk
.na
.B -R
.I cmd
.ad
.sp .6
.RS 4n
Run the
.I cmd
when an old log file is created by a log rotation. If the
keyword
.B $file
is embedded in the specified command, it is expanded to
the name of the old log file just created by log rotation.
.sp
This option is useful for processing log file contents after rotating the
log.
.I cmd
is executed by passing it to
.BR "sh -c" .
When rotating
multiple logs with one logadm command, the command supplied with
.B -R
is
executed once every time a log is rotated. This is useful for
post-processing a log file (that is, sorting it, removing uninteresting
lines, etc.). The
.B -a
option is a better choice for restarting daemons
after log rotation.
.RE

.sp
.ne 2
.mk
.na
.B -s
.I size
.ad
.sp .6
.RS 4n
Rotate the log file only if its size is greater than or equal to
.IR size .
.sp
Specify
.I size
as a number followed by the letter
.B b
for bytes,
.B k
for kilobytes,
.B m
for megabytes, or
.B g
for gigabytes.
.RE

.sp
.ne 2
.mk
.na
.B -S
.I size
.ad
.sp .6
.RS 4n
Delete the oldest versions until the total disk space used by the old log
files is less than the specified size.
.sp
Specify
.I size
as a number followed by the letter
.B b
for bytes,
.B k
for kilobytes,
.B m
for megabytes, or
.B g
for gigabytes.
.RE

.sp
.ne 2
.mk
.na
.B -t
.I template
.ad
.sp .6
.RS 4n
Specify the template to use when renaming log files.
.sp
.I template
can be a simple name, such as
.BR /var/adm/oldfile ,
or it
can contain special keywords which are expanded by
.B logadm
and are in
the form \fB$\fIword\fR. Allowed sequences are:
.sp
.ne 2
.mk
.na
\fB$\fIbasename\fR
.ad
.sp .6
.RS 4n
The log file name, without the directory name
.RE

.sp
.ne 2
.mk
.na
\fB$\fIdirname\fR
.ad
.sp .6
.RS 4n
The directory of the file to be rotated
.RE

.sp
.ne 2
.mk
.na
\fB$\fIdomain\fR
.ad
.sp .6
.RS 4n
Expands to the output of
.BR domainname
.RE

.sp
.ne 2
.mk
.na
\fB$\fIfile\fR
.ad
.sp .6
.RS 4n
The full path name of the file to be rotated
.RE

.sp
.ne 2
.mk
.na
\fB$\fIisa\fR
.ad
.sp .6
.RS 4n
Expands to the output of
.BR "uname -p"
.RE

.sp
.ne 2
.mk
.na
\fB$\fImachine\fR
.ad
.sp .6
.RS 4n
Expands to the output of
.BR "uname -m"
.RE

.sp
.ne 2
.mk
.na
\fB$\fIn\fR
.ad
.sp .6
.RS 4n
The version number,
.B 0
is most recent,
.B 1
is next most recent,
and so forth
.RE

.sp
.ne 2
.mk
.na
\fB$\fIN\fR
.ad
.sp .6
.RS 4n
The same as $\fIn\fR, but starts at \fB1\fR instead of zero
.RE

.sp
.ne 2
.mk
.na
\fB$\fInodename\fR
.ad
.sp .6
.RS 4n
Expands to the output of
.BR "uname -n"
.RE

.sp
.ne 2
.mk
.na
\fB$\fIplatform\fR
.ad
.sp .6
.RS 4n
Expands to the output of
.BR "uname -i"
.RE

.sp
.ne 2
.mk
.na
\fB$\fIrelease\fR
.ad
.sp .6
.RS 4n
Expands to the output of
.BR "uname -r"
.RE

.sp
.ne 2
.mk
.na
\fB$\fIsecs\fR
.ad
.sp .6
.RS 4n
The number of seconds since
.BR "00:00:00 UTC, January 1,1970"
.RE

.sp
.ne 2
.mk
.na
\fB$\fIzonename\fR
.ad
.sp .6
.RS 4n
Expands to the output of
.BR zonename (1).
.RE

To actually have the dollar sign character in the file name, use
.BR $$ .
Any percent sequences allowed by \fBstrftime\fR(3C) are also allowed, for
example,
.B %d
expands to the day of the month. To actually have a
percent sign character in the file name, use
.BR %% .
Both dollar-sign
keywords and percent sequences can appear anywhere in the template. If the
template results in a pathname with non-existent directories, they are
created as necessary when rotating the log file.
.sp
If no
.B -t
option is specified, the default template is
.BR $file.$n .
Actual
.B rotation
of log files, where each version is shifted up until
it expires is done using the
.B $n
keyword. If the template does not
contain the
.B $n
keyword, the log file is simply renamed to the new name
and then the expire rules, if any, are applied.
.RE

.sp
.ne 2
.mk
.na
.B -T
.I pattern
.ad
.sp .6
.RS 4n
Normally
.B logadm
looks for a list of old log files by turning the
template (specified with the
.B -t
option) into a pattern and finding
existing files whose names match that pattern. The
.B -T
option causes
the given pattern to be used instead.
.sp
This option is useful if another program fiddles with the old log file
names, like a
.B cron
job to compress them over time. The pattern is in
the form of a pathname with special characters such as
.B *
and
.BR ?
as supported by
.BR csh (1)
filename substitution.
.RE

.sp
.ne 2
.mk
.na
.B -v
.ad
.sp .6
.RS 4n
Print information about the actions being executed in verbose mode.
.RE

.sp
.ne 2
.mk
.na
.B -V
.ad
.sp .6
.RS 4n
Validate the configuration file.
.sp
This option validates that an entry for the specified
.I logname
exists
in the
.B /etc/logadm.conf
file and is syntactically correct. If
.I logname
is not specified, all entries in the configuration file are
validated. If a
.B logname
argument is specified, the command validates
the syntax of that entry. If the entry is found, it is printed and the exit
value of the command is true. Otherwise the exit value is false.
.RE

.sp
.ne 2
.mk
.na
.B -w
.I entryname
.ad
.sp .6
.RS 4n
Write an entry into the config file (that is,
.BR /etc/logadm.conf )
that
corresponds to the current command line arguments. If an entry already
existed for the specified
.IR entryname ,
it is removed first. This is the
preferred method for updating
.BR /etc/logadm.conf ,
because it prevents
syntax errors. The
.I entryname
is an argument to an invocation of
.BR logadm .
.I entryname
might be chosen as something easy to remember
or it can be the pathname of the log file. If a pathname, rather than a name
is used, it must be a fully qualified pathname.
.sp
If no log file name is provided on a
.B logadm
command line, the entry
name is assumed to be the same as the log file name. For example, the
following two lines achieve the same thing, keeping two copies of rotated
log files:
.sp
.in +2
.nf
% logadm -C2 -w mylog /my/really/long/log/file/name
% logadm -C2 -w /my/really/long/log/file/name
.fi
.in -2
.sp

.RE

.sp
.ne 2
.mk
.na
.B -z
.I count
.ad
.sp .6
.RS 4n
Compress old log files after all other commands have been executed.
.I count
of the most recent log files are left uncompressed, therefore
making the
.I count
most recent files easier to peruse. Use \fIcount\fR
of zero to compress all old logs.
.sp
The compression is done with
.BR gzip (1)
and the resulting log file has
the suffix of
.BR \&.gz .
.RE

.SH OPERANDS
.sp
.LP
The following operands are supported:
.sp
.ne 2
.mk
.na
.I logname
.ad
.sp .6
.RS 4n
Identifies the name of the entry in
.BR /etc/logadm.conf .
If the log file
name is specified in the
.I logname
field, it is assumed that
.I logname
is the same as the actual log file name.
.RE

.SH EXAMPLES
.LP
.B Example 1
Rotating a File and Keeping Previous Versions
.sp
.LP
The following example rotates the
.B /var/adm/exacct/proc
file, keeping
ten previous versions in
.B /var/adm/exacct/proc.0
through
.BR /var/adm/exacct/proc.9 .

.sp
.LP
Tell
.B logadm
to copy the file and truncate it.

.sp
.in +2
.nf
 % logadm -c /var/adm/exacct/proc
.fi
.in -2
.sp

.LP
.B Example 2
Rotating syslog
.sp
.LP
The following example rotates
.B syslog
and keeps eight log files. Old
log files are put in the directory
.B /var/oldlogs
instead of
.BR /var/log :

.sp
.in +2
.nf
% logadm -C8 -t'/var/oldlogs/syslog.$n' /var/log/syslog
.fi
.in -2
.sp

.LP
.B Example 3
Rotating /var/adm/sulog and Expiring Based on Age
.sp
.LP
The following entry in the
.B /etc/logadm.conf
file rotates the
.B /var/adm/sulog
file and expires any copies older than 30 days.

.sp
.in +2
.nf
/var/adm/sulog -A 30d
.fi
.in -2
.sp

.LP
.B Example 4
Rotating Files and Expiring Based on Disk Usage
.sp
.LP
The following entry in the
.B /etc/logadm.conf
file rotates the
.B /var/adm/sulog
file and expires old log files when more than 100
megabytes are used by the sum of all the rotated log files.

.sp
.in +2
.nf
/var/adm/sulog -S 100m
.fi
.in -2
.sp

.LP
.B Example 5
Creating an Entry that Stores the Logfile Name
.sp
.LP
This example creates an entry storing the log file name and the fact that
we want to keep 20 copies in
.BR /etc/logadm.conf ,
but the
.BR -p
.B never
means the entry is ignored by the normal
.B logadm
run from
root's crontab every morning.

.sp
.in +2
.nf
% logadm -w locallog /usr/local/logfile -C20 -p never
.fi
.in -2
.sp

.sp
.LP
Use the following entry on the command line to override the
.BR -p
.B never
option:

.sp
.in +2
.nf
 % logadm -p now locallog
.fi
.in -2
.sp

.LP
.B Example 6
Rotating the apache Error and Access Logs
.sp
.LP
The following example rotates the apache error and access logs monthly to
filenames based on current year and month. It keeps the 24 most recent
copies and tells apache to restart after renaming the logs.

.sp
.LP
This command is run once, and since the
.B -w
option is specified, an
entry is made in
.B /etc/logadm.conf
so the apache logs are rotated from
now on.

.sp
.in +2
.nf
 % logadm -w apache -p 1m -C 24\e
     -t '/var/apache/old-logs/$basename.%Y-%m'\e
     -a '/usr/apache/bin/apachectl graceful'\e
     '/var/apache/logs/*{access,error}_log'
.fi
.in -2
.sp

.sp
.LP
This example also illustrates that the entry name supplied with the
.B -w
option doesn't have to match the log file name. In this example,
the entry name is
.B apache
and once the line has been run, the entry in
.B /etc/logadm.conf
can be forced to run by executing the following
command:

.sp
.in +2
.nf
% logadm -p now apache
.fi
.in -2
.sp

.sp
.LP
Because the expression matching the apache log file names was enclosed in
quotes, the expression is stored in
.BR /etc/logadm.conf ,
rather than the
list of files that it expands to. This means that each time \fBlogadm\fR
runs from
.B cron
it expands that expression and checks all the log files
in the resulting list to see if they need rotating.

.sp
.LP
The following command is an example without the quotes around the log name
expression. The shell expands the last argument into a list of log files
that exist at the time the command is entered, and writes an entry to
.B /etc/logadm.conf
that rotates the files.

.sp
.in +2
.nf
logadm -w apache /var/apache/logs/*_log
.fi
.in -2
.sp

.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/logadm.conf
.ad
.sp .6
.RS 4n
configuration file for
.B logadm
command
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
_
Interface StabilityEvolving
.TE

.SH SEE ALSO
.sp
.LP
.BR chgrp (1),
.BR chmod (1),
.BR chown (1),
.BR csh (1),
.BR gzip (1),
.BR cron (1M),
.BR ctime (3C),
.BR strftime (3C),
.BR logadm.conf (4),
.BR attributes (5)
.SH NOTES
.sp
.LP
When
.B logadm
applies expire conditions (supplied by the
.BR -A ,
.BR -C ,
and
.B -S
options), it deletes files, the oldest first, until
the conditions are satisfied. If the template used for naming the old logs
contained
.B $n
or
.BR $N ,
.B logadm
picks the highest value of
.B $n
or
.B $N
found in the old log file names first. If the template
used is something else,
.B logadm
uses the modification time to determine
which files to expire first. This may not be the expected behavior if an old
log file has been modified since it was rotated.
.sp
.LP
Depending on log file sizes and number of log files, log file rotations can
be very time-consuming.
.sp
.LP
By default,
.B logadm
works in
.BR GMT .
Therefore, all entries written
to the
.B /etc/logadm.conf
file (see
.BR logadm.conf (4))
will have a
.B GMT
timestamp. Users can use the
.B -l
option to set
.BR logadm
to local time.
