usr/src/man/man1m/lpadmin.1m
'\" te
.\" Copyright 1989 AT&T Copyright (c) 2006, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH lpadmin 1M "24 May 2006" "SunOS 5.11" "System Administration Commands"
.SH NAME
lpadmin \- configure the LP print service
.SH SYNOPSIS
.LP
.nf
\fBlpadmin\fR \fB-p\fR \fIprinter\fR {\fIoptions\fR}
.fi

.LP
.nf
\fBlpadmin\fR \fB-x\fR \fIdest\fR
.fi

.LP
.nf
\fBlpadmin\fR \fB-d\fR [\fIdest\fR]
.fi

.LP
.nf
\fBlpadmin\fR \fB-S\fR \fIprint-wheel\fR \fB-T\fR [\fB-A\fR \fIalert-type\fR] [\fB-W\fR \fIminutes\fR]
     [\fB-Q\fR \fIrequests\fR]
.fi

.SH DESCRIPTION
.sp
.LP
.B lpadmin
configures the LP print service by defining printers and
devices. It is used to add and change printers, to remove printers from
service, to set or change the system default destination, to define alerts
for printer faults, and to mount print wheels.
.SH OPTIONS
.sp
.LP
The
.B lpadmin
command has options for:
.RS +4
.TP
.ie t \(bu
.el o
Adding or changing a printer
.RE
.RS +4
.TP
.ie t \(bu
.el o
Removing a printer destination
.RE
.RS +4
.TP
.ie t \(bu
.el o
Setting or changing the system default destination
.RE
.RS +4
.TP
.ie t \(bu
.el o
Setting an alert for a print wheel
.RE
.sp
.LP
The options for each of the above categories are specified in the following
subsections.
.sp
.LP
Several options support the use of lists. A list might contain, for
example, user names, printers, printer forms, or content types. A list of
multiple items can have the form of either comma-separated names or have the
entire list enclosed by double quotes with a space between each name. For
example, both lists below are acceptable:
.sp
.in +2
.nf
one,two,three
"one two three"
.fi
.in -2

.SS "Adding or Changing a Printer"
.sp
.LP
The first form of the
.B lpadmin
command
.RB ( "lpadmin -p"
.I printer
.RI { options })
configures a new printer or changes the
configuration of an existing printer. It also starts the print scheduler.
.sp
.LP
When creating a new printer, one of three options
.RB ( -v ,
.BR -U ,
or
.BR -s )
must be supplied. In addition, only one of the following can be
supplied:
.BR -e ,
.BR -i ,
or
.BR -m ;
if none of these three options is
supplied, the model standard is used. The
.B -h
and
.B -l
options are
mutually exclusive. Printer and class names must be no longer than 14
characters and must consist entirely of the characters
.BR A -\fBZ\fR,
\fBa\fR-\fBz\fR, \fB0\fR-\fB9\fR, dash (\fB-\fR) and underscore
.RB ( _ ).
If
.B -s
is specified, the following options are invalid:
.BR -A ,
.BR -e ,
.BR -F ,
.BR -h ,
.BR -i ,
.BR -l ,
.BR -M ,
.BR -m ,
.BR -o ,
.BR -U ,
.BR -v ,
and
.BR -W .
.sp
.LP
The following options can appear in any order.
.sp
.ne 2
.mk
.na
\fB-A\fR
.I alert-type
[\fB-W\fR \fIminutes\fR]\fR
.ad
.sp .6
.RS 4n
The
.B -A
option is used to define an alert that informs the
administrator when a printer fault is detected, and periodically thereafter,
until the printer fault is cleared by the administrator. The
.I alert-types
are:
.sp
.ne 2
.mk
.na
.B mail
.ad
.RS 17n
.rt
Send the alert message using mail (see
.BR mail (1))
to the
administrator.
.RE

.sp
.ne 2
.mk
.na
.B write
.ad
.RS 17n
.rt
Write the message to the terminal on which the administrator is logged in.
If the administrator is logged in on several terminals, one is chosen
arbitrarily.
.RE

.sp
.ne 2
.mk
.na
.B quiet
.ad
.RS 17n
.rt
Do not send messages for the current condition. An administrator can use
this option to temporarily stop receiving further messages about a known
problem. Once the fault has been cleared and printing resumes, messages are
sent again when another fault occurs with the printer.
.RE

.sp
.ne 2
.mk
.na
.B showfault
.ad
.RS 17n
.rt
Attempt to execute a fault handler on each system that has a print job in
the queue. The fault handler is
.BR /etc/lp/alerts/printer .
It is invoked
with three parameters:
.IR printer_name ,
.BR date ,
.IR file_name .
The
.I file_name
is the name of a file containing the fault message.
.RE

.sp
.ne 2
.mk
.na
.B none
.ad
.RS 17n
.rt
Do not send messages; any existing alert definition for the printer is
removed. No alert is sent when the printer faults until a different
alert-type
.RB "(except " quiet )
is used.
.RE

.sp
.ne 2
.mk
.na
.I shell-command
.ad
.RS 17n
.rt
Run the
.I shell-command
each time the alert needs to be sent. The shell
command should expect the message in standard input. If there are blank
spaces embedded in the command, enclose the command in quotes. Notice that
the
.B mail
and
.B write
values for this option are equivalent to the
values
.B mail
.I user-name
and
.B write
.I user-name
respectively, where
.I user-name
is the current name for the
administrator. This is the login name of the person submitting this command
unless he or she has used the
.B su
command to change to another user ID.
If the
.B su
command has been used to change the user ID, then the
.I user-name
for the new ID is used.
.RE

.sp
.ne 2
.mk
.na
.B list
.ad
.RS 17n
.rt
Display the type of the alert for the printer fault. No change is made to
the alert.
.RE

When a fault occurs, the printing subsystem displays a message indicating
that printing for a specified printer has stopped and the reason for the
stoppage. The message also indicates that printing will restart in a few
minutes and that you can enter an
.B enable
command if you want to
restart sooner than that.
.sp
Following a fault that occurs in the middle of a print job, the job is
reprinted from the beginning. An exception to this occurs when you enter a
command, such as the one shown below, that changes the page list to be
printed.
.sp
.in +2
.nf
% \fBlp\fB \fB-i\fB \fIrequest-id\fR \fB-P\fB .\|.\|.\fR
.fi
.in -2
.sp

For a given print request, the presence of multiple reasons for failure
indicate multiple attempts at printing.
.sp
The
.B LP
print service can detect printer faults only through an
adequate fast filter and only when the standard interface program or a
suitable customized interface program is used. Furthermore, the level of
recovery after a fault depends on the capabilities of the filter.
.sp
If, instead of a single printer, the keyword
.B all
is displayed in an
alert, the alert applies to all printers.
.sp
If the
.B -W
option is not used to arrange fault alerting for
.IR printer ,
the default procedure is to mail one message to the
administrator of
.I printer
per fault. This is equivalent to specifying
.B -W once
or
.BR "-W 0" .
If
.I minutes
is a number
greater than zero, an alert is sent at intervals specified by
.IR minutes .
.RE

.sp
.ne 2
.mk
.na
.B -c
.I class
.ad
.sp .6
.RS 4n
Insert
.I printer
into the specified
.IR class .
.I class
is created
if it does not already exist. This option requires the
.B -U
.I dial-info
or
.B -v
.I device
options.
.RE

.sp
.ne 2
.mk
.na
.B -D
.I comment
.ad
.sp .6
.RS 4n
Save this
.I comment
for display whenever a user asks for a full
description of
.I printer
(see
.BR lpstat (1)).
The LP print service
does not interpret this comment.
.RE

.sp
.ne 2
.mk
.na
.B -e
.I printer
.ad
.sp .6
.RS 4n
Copy the interface program of an existing
.I printer
to be the interface
program for
.IR printer .
(Options
.B -i
and
.B -m
must not be
specified with this option.)
.RE

.sp
.ne 2
.mk
.na
\fB-f allow\fR:\fIform-list\fR
.ad
.br
.na
\fB-f deny\fR:\fIform-list\fR
.ad
.sp .6
.RS 4n
Allow or deny the forms in
.I form-list
to be printed on
.IR printer .
By default no forms are allowed on a new printer.
.sp
For each printer, the
.B LP
print service keeps two lists of forms: an
``allow-list'' of forms that can be used with the printer, and a
``deny-list'' of forms that cannot be used with the printer. With the
\fB-f allow\fR option, the forms listed are added to the
allow-list and removed from the deny-list. With the
.B "-f deny"
option, the forms listed are added to the deny-list and removed from the
allow-list.
.sp
If the allow-list is not empty, only the forms in the list can be used on
the printer, regardless of the contents of the deny-list. If the allow-list
is empty, but the deny-list is not, the forms in the deny-list cannot be
used with the printer. All forms can be excluded from a printer by
specifying
.BR "-f deny:all" .
All forms can be used on a printer
(provided the printer can handle all the characteristics of each form) by
specifying
.BR "-f allow:all" .
.sp
The
.B LP
print service uses this information as a set of guidelines for
determining where a form can be mounted. Administrators, however, are not
restricted from mounting a form on any printer. If mounting a form on a
particular printer is in disagreement with the information in the allow-list
or deny-list, the administrator is warned but the mount is accepted.
Nonetheless, if a user attempts to issue a print or change request for a
form and printer combination that is in disagreement with the information,
the request is accepted only if the form is currently mounted on the
printer. If the form is later unmounted before the request can print, the
request is canceled and the user is notified by mail.
.sp
If the administrator tries to specify a form as acceptable for use on a
printer that does not have the capabilities needed by the form, the command
is rejected.
.sp
Notice the other use of
.BR -f ,
with the
.B -M
option, below.
.sp
The
.B -T
option must be invoked first with
.B lpadmin
to identify
the printer type before the
.B -f
option can be used.
.RE

.sp
.ne 2
.mk
.na
.B -F
.I fault-recovery
.ad
.sp .6
.RS 4n
This option specifies the recovery to be used for any print request that is
stopped because of a printer fault, according to the value of
.IR fault-recovery :
.sp
.ne 2
.mk
.na
.B continue
.ad
.RS 13n
.rt
Continue printing on the top of the page where printing stopped. This
requires a filter to wait for the fault to clear before automatically
continuing.
.RE

.sp
.ne 2
.mk
.na
.B beginning
.ad
.RS 13n
.rt
Start printing the request again from the beginning.
.RE

.sp
.ne 2
.mk
.na
.B wait
.ad
.RS 13n
.rt
Disable printing on
.I printer
and wait for the administrator or a user
to enable printing again.
.sp
During the wait, the administrator or the user who submitted the stopped
print request can issue a change request that specifies where printing
should resume. (See the
.B -i
option of the
.B lp
command.) If no
change request is made before printing is enabled, printing resumes at the
top of the page where stopped, if the filter allows; otherwise, the request
is printed from the beginning.
.RE

.RE

.sp
.ne 2
.mk
.na
.B -h
.ad
.sp .6
.RS 4n
Indicate that the device associated with the printer is hardwired. If
neither of the mutually exclusive options,
.B -h
and
.BR -l ,
is
specified,
.B -h
is assumed.
.RE

.sp
.ne 2
.mk
.na
.B -i
.I interface
.ad
.sp .6
.RS 4n
Establish a new interface program for
.IR printer .
.I interface
is the
pathname of the new program. (The
.B -e
and
.B -m
options must not be
specified with this option.)
.RE

.sp
.ne 2
.mk
.na
.B -I
.I content-type-list
.ad
.sp .6
.RS 4n
Allow
.I printer
to handle print requests with the content types listed
in a
.IR content-type-list .
.sp
The type
.B simple
is recognized as the default content type for files
in the UNIX system. A
.B simple
type of file is a data stream containing
only printable
.B ASCII
characters and the following control
characters:
.sp

.sp
.TS
tab();
cw(1.83i) cw(1.83i) cw(1.83i)
lw(1.83i) lw(1.83i) lw(1.83i)
.
Control CharOctal ValueMeaning
BACKSPACE10Move back one char, except
 at beginning of line
TAB11Move to next tab stop
LINEFEED12Move to beginning of
 (newline) next line
FORMFEED14Move to beginning of
 next page
RETURN15Move to beginning of
 current line
.TE

To prevent the print service from considering
.B simple
a valid type for
the printer, specify either an explicit value (such as the printer type) in
the
.IR content-type-list ,
or an empty list. If you do want
.B simple
included along with other types, you must include
.B simple
in the
.IR content-type-list .
.sp
In addition to content types defined by the print administrator, the type
.B PostScript
is recognized and supported by the Solaris print subsystem.
This includes filters to support
.B PostScript
as the printer content
type.
.sp
The type
.B any
is recognized as a special content type for files. When
declared as the input type for a printer, it signals the print sub-system
not to do any filtering on the file before sending it to the printer.
.sp
Except for
.B simple
and
.BR any ,
each
.I content-type
name is
determined by the administrator. If the printer type is specified by the
.B -T
option, then the printer type is implicitly considered to be also a
valid content type.
.RE

.sp
.ne 2
.mk
.na
.B -l
.ad
.sp .6
.RS 4n
Indicate that the device associated with
.I printer
is a login terminal.
The LP scheduler
.RB ( lpsched )
disables all login terminals automatically
each time it is started. (The
.B -h
option must not be specified with
this option.)
.RE

.sp
.ne 2
.mk
.na
.B -m
.I model
.ad
.sp .6
.RS 4n
Select
.I model
interface program, provided with the
.B LP
print
service, for the printer. (Options
.B -e
and
.B -i
must not be
specified with this option.)
.RE

.sp
.ne 2
.mk
.na
.B -M -f
.I form-name
.RB [ -a " [" "-o filebreak" ]]
[\fB-t\fR \fItray-number\fR]]\fR
.ad
.sp .6
.RS 4n
Mount the form
.I form-name
on
.IR printer .
Print requests that need
the pre-printed form
.I form-name
is printed on
.IR printer .
If more
than one printer has the form mounted and the user has specified
.BR any
(with the
.B -d
option of the
.B lp
command) as the printer
destination, then the print request is printed on the one printer that also
meets the other needs of the request.
.sp
The page length and width, and character and line pitches needed by the
form are compared with those allowed for the printer, by checking the
capabilities in the
.B terminfo
database for the type of printer. If the
form requires attributes that are not available with the printer, the
administrator is warned but the mount is accepted. If the form lists a print
wheel as mandatory, but the print wheel mounted on the printer is different,
the administrator is also warned but the mount is accepted.
.sp
If the
.B -a
option is given, an alignment pattern is printed, preceded
by the same initialization of the physical printer that precedes a normal
print request, with one exception: no banner page is printed. Printing is
assumed to start at the top of the first page of the form. After the pattern
is printed, the administrator can adjust the mounted form in the printer and
press return for another alignment pattern (no initialization this time),
and can continue printing as many alignment patterns as desired. The
administrator can quit the printing of alignment patterns by typing
.BR q .
.sp
If the
.B "-o filebreak"
option is given, a formfeed is inserted
between each copy of the alignment pattern. By default, the alignment
pattern is assumed to correctly fill a form, so no formfeed is added.
.sp
If the
.B -t
.I tray-number
option is specified, printer tray
.I tray-number
is used.
.sp
A form is ``unmounted'' either by mounting a new form in its place or by
using the
.B "-f none"
option. By default, a new printer has no form
mounted.
.sp
Notice the other use of
.B -f
without the
.B -M
option above.
.RE

.sp
.ne 2
.mk
.na
.B -M -S
.I print-wheel
.ad
.sp .6
.RS 4n
Mount the
.I print-wheel
on
.IR printer .
Print requests that need the
.I print-wheel
are printed on
.IR printer .
If more than one printer has
.I print-wheel
mounted and the user has specified
.B any
(with the
.B -d
option of the
.B lp
command) as the printer destination, then
the print request is printed on the one printer that also meets the other
needs of the request.
.sp
If the
.I print-wheel
is not listed as acceptable for the printer, the
administrator is warned but the mount is accepted. If the printer does not
take print wheels, the command is rejected.
.sp
A print wheel is ``unmounted'' either by mounting a new print wheel in its
place or by using the option
.BR "-S none" .
By default, a new printer
has no print wheel mounted.
.sp
Notice the other uses of the
.B -S
option without the
.B -M
option
described below.
.RE

.sp
.ne 2
.mk
.na
.B -n
.I ppdfilename
.ad
.sp .6
.RS 4n
Specify a
.B PPD
file for creating and modifying printer queues.
.I ppdfilename
is the full path and file name to the
.B PPD
file. Used
in conjunction with the
.BR -p ,
.BR -d ,
.BR -x ,
or
.B -S
options.
.RE

.sp
.ne 2
.mk
.na
.B -o
.I option
.ad
.sp .6
.RS 4n
The
.B -o
option defines default printer configuration values given to
an interface program. The default can be explicitly overwritten for
individual requests by the user (see
.BR lp (1)),
or taken from a
preprinted form description (see
.BR lpforms (1M)
and
.BR lp (1)).
.sp
There are several options which are predefined by the system. In addition,
any number of key-value pairs can be defined. See the section "Predefined
Options Used with the \fB-o\fR Option", below.
.RE

.sp
.ne 2
.mk
.na
.B -P
.I paper-name
.ad
.sp .6
.RS 4n
Specify a paper type list that the printer supports.
.RE

.sp
.ne 2
.mk
.na
.B -r
.I class
.ad
.sp .6
.RS 4n
Remove
.I printer
from the specified
.IR class .
If
.I printer
is
the last member of
.IR class ,
then
.I class
is removed.
.RE

.sp
.ne 2
.mk
.na
.B -S
.I list
.ad
.sp .6
.RS 4n
Allow either the print wheels or aliases for character sets named in
.I list
to be used on the printer.
.sp
If the printer is a type that takes print wheels, then
.I list
is a
comma or space separated list of print wheel names. These are the only print
wheels considered mountable on the printer. (You can always force a
different print wheel to be mounted.) Until the option is used to specify a
list, no print wheels are considered mountable on the printer, and print
requests that ask for a particular print wheel with this printer are
rejected.
.sp
If the printer is a type that has selectable character sets, then
.I list
is a list of character set name ``mappings'' or aliases. Each
``mapping'' is of the form
.I known-name=alias
The
.I known-name
is a
character set number preceded by
.B cs
(such as
.B cs3
for character
set three) or a character set name from the
.B terminfo
database entry
.BR csnm .
See
.BR terminfo (4).
If this option is not used to specify a
list, only the names already known from the
.B terminfo
database or
numbers with a prefix of
.B cs
is acceptable for the printer. If
.I list
is the word
.BR none ,
any existing print wheel lists or
character set aliases are removed.
.sp
Notice the other uses of the
.B -S
with the
.B -M
option described
above.
.sp
The
.B -T
option must be invoked first with
.B lpadmin
to identify
the printer type before the
.B -S
option can be used.
.RE

.sp
.ne 2
.mk
.na
.B -s
.I system-name
.ad
.sp .6
.RS 4n
The
.B -s
option can be used for both remote or local printers. For
remote printers:
.sp
.ne 2
.mk
.na
\fB-s\fR \fIsystem-name\fR[\fB!\fIprinter-name\fR] (UUCP format)\fR
.ad
.br
.na
\fB-s\fR \fIprinter-name\fB@\fIsystem-name\fR (RCMD format)\fR
.ad
.sp .6
.RS 4n
Make a remote printer (one that must be accessed through another system)
accessible to users on your system.
.I system-name
is the name of the
.RI "remote system on which the remote printer is located it." " printer-name"
is the name used on the remote system for that printer. For example, if you
want to access
.I printer1
on
.I system1
and you want it called
.I printer2
on your system:
.sp
.in +2
.nf
\fB-p\fR \fIprinter2\fR \fB-s\fR \fIsystem1\fB!\fIprinter1\fR
.fi
.in -2
.sp

.sp
.in +2
.nf
\fB-p\fR \fIprinter2\fR \fB-s\fR \fIprinter1\fB@\fIsystem1\fR
.fi
.in -2
.sp

.RE

.sp
.ne 2
.mk
.na
\fB-s\fR \fIscheme\fB://\fIend-point\fR (URI format)\fR
.ad
.sp .6
.RS 4n
Make a remote printer (one that must be accessed through another system)
.RB "accessible to users on your system. The supported schemes include" " lpd"
and
.BR ipp .
Specify URI's using the
.B lpd
format as follows:
.sp
.in +2
.nf
\fBlpd://\fIserver\fR/\fIprinters\fR/\fIqueue\fB[#Solaris]\fR
.fi
.in -2
.sp

URI's using the
.B ipp
format are defined by the remote print server.
They are generally of the format:
.sp
.in +2
.nf
\fBipp://\fIserver\fB/\fIprinters\fB/\fIqueue\fR
.fi
.in -2
.sp

In either case,
.I server
specifies the hostname or IP address of the
remote print server,
.I queue
specifies the name of the print queue on
the remote print server, and the optional
.BR #Solaris specifies
that the
remote print server is a Solaris server when
.B lpd
URI format is being
used.
.sp
For example:
.sp
.in +2
.nf
\fB-p\fR \fIprinter\fR \fB-s\fR \fBlpd://\fIserver\fB/\fIprinters\fB/\fIqueue\fB#Solaris\fR
\fB-p\fR \fIprinter\fR \fB-s\fR \fBipp://\fIserver\fB/\fIprinters\fB/\fIqueue\fR
.fi
.in -2
.sp

.RE

For local printers:
.sp
.ne 2
.mk
.na
\fB-s\fR "\fBlocalhost\fR"\fR
.ad
.RS 18n
.rt
Use
.B localhost
for the
.I system-name
to be used by the print
service. In an environment where the nodename is variable, print queues are
invalidated when the nodename changes. Using
.B localhost
as the
.I system-name
allows print queues to be maintained across changing
nodenames. The
.IR system-name ,
as used by the print service, is only set
to
.B localhost
when explicitely set with this option; by default,
.B lpadmin
sets
.I system-name
to
.IR nodename .
For example, if you
want to configure a new printer on the local system, and want it called
.IR printer3 :
.sp
.B -p
.I printer3
.B -s
.I localhost
.B -v
.I device
.sp
This option should never be used when creating name service maps.
.RE

.RE

.sp
.ne 2
.mk
.na
.B -T
.I printer-type-list
.ad
.sp .6
.RS 4n
Identify the printer as being of one or more
.IR printer-type "s. Each"
.I printer-type
is used to extract data from the
.B terminfo
database;
this information is used to initialize the printer before printing each
user's request. Some filters might also use a
.I printer-type
to convert
content for the printer. If this option is not used, the default
.I printer-type
is
.BR unknown .
No information is extracted from
.B terminfo
so each user request is printed without first initializing
the printer. Also, this option must be used if the following are to work:
.BR "-o cpi" ,
.BR "-o lpi" ,
.B -o
width,
and
.B "-o length"
options of the
.B lpadmin
and
.BR lp
commands, and the
.B -S
.RB "and " -f " options of the " lpadmin 
command.
.sp
If the
.I printer-type-list
contains more than one type, then the
.I content-type-list
of the
.B -I
option must either be specified as
\fBsimple\fR, as empty (\fB-I\fB ""\fR), or not specified at all.
.RE

.sp
.ne 2
.mk
.na
.BI -t number-of-trays
.ad
.sp .6
.RS 4n
Specify the number of trays when creating the printer.
.RE

.sp
.ne 2
.mk
.na
\fB-u\fR \fBallow:\fIlogin-ID-list\fR
.ad
.br
.na
\fB-u\fR \fBdeny:\fIlogin-ID-list\fR
.ad
.sp .6
.RS 4n
Allow or deny the users in
.I login-ID-list
access to the printer. By
default all users are allowed on a new printer. The
.I login-ID-list
argument can include any or all of the following constructs:
.sp
.ne 2
.mk
.na
.I login-ID
.ad
.RS 24n
.rt
a user on any system
.RE

.sp
.ne 2
.mk
.na
\fIsystem-name\fB!\fIlogin-ID\fR
.ad
.RS 24n
.rt
a user on system
.IR system-name
.RE

.sp
.ne 2
.mk
.na
.IB system-name !all
.ad
.RS 24n
.rt
all users on system
.IR system-name
.RE

.sp
.ne 2
.mk
.na
.BI all! login-ID
.ad
.RS 24n
.rt
a user on all systems
.RE

.sp
.ne 2
.mk
.na
.B all
.ad
.RS 24n
.rt
all users on all systems
.RE

For each printer, the
.B LP
print service keeps two lists of users: an
``allow-list'' of people allowed to use the printer, and a ``deny-list'' of
people denied access to the printer. With the
.B "-u allow"
option, the users listed are added to the allow-list and removed from the
deny-list. With the
.B "-u deny"
option, the users listed are
added to the deny-list and removed from the allow-list.
.sp
If the allow-list is not empty, only the users in the list can use the
printer, regardless of the contents of the deny-list. If the allow-list is
empty, but the deny-list is not, the users in the deny-list cannot use the
printer. All users can be denied access to the printer by specifying
.BR "-u deny:all" .
All users can use the printer by specifying
.BR "-u allow:all" .
.RE

.sp
.ne 2
.mk
.na
\fR
.ad
.sp .6
.RS 4n
The
.B -U
option allows your print service to access a remote printer.
(It does not enable your print service to access a remote printer service.)
Specifically,
.B -U
assigns the ``dialing'' information
.I dial-info
to the printer.
.I dial-info
is used with the
.B dial
routine to call
the printer. Any network connection supported by the Basic Networking
Utilities works.
.I dial-info
can be either a phone number for a modem
connection, or a system name for other kinds of connections. Or, if
.B -U
.B direct
is given, no dialing takes place, because the name
.B direct
is reserved for a printer that is directly connected. If a system name is
given, it is used to search for connection details from the file
.B /etc/uucp/Systems
or related files. The Basic Networking Utilities are
required to support this option. By default,
.B "-U direct"
is
assumed.
.RE

.sp
.ne 2
.mk
.na
.B -v
.I device
.ad
.sp .6
.RS 4n
Associate a
.I device
with
.IR printer .
.I device
is the path name
of a file that is writable by
.BR lp .
Notice that the same
.IR device
can be associated with more than one printer.
.RE

.sp
.ne 2
.mk
.na
\fB-v\fR \fIscheme\fB://\fIend-point\fR
.ad
.sp .6
.RS 4n
Associate a network attached device with printer.
.sp
.I scheme
is the method or protocol used to access the network attached
device and
.I end-point
is the information necessary to contact that
network attached device. Use of this device format requires the use of the
.B uri
interface script and can only be used with the
.B smb
scheme at
this time.
.sp
For example:
.sp
.in +2
.nf
# lpadmin \fB-p\fR \fIqueue\fR \fB-v\fR \fBsmb://smb-\fIservice\fB/\fIprinter\fR \fB-m\fR \fBuri\fR
.fi
.in -2
.sp

See the
.B /usr/sfw/man/man1m/smbspool.1m
man page for details.
.RE

.SS "Removing a Printer Destination"
.sp
.LP
The
.B -x
.I dest
option removes the destination
.I dest
(a
printer or a class), from the
.B LP
print service. If
.I dest
is a
printer and is the only member of a class, then the class is deleted, too.
If
.I dest
is
.BR all ,
all printers and classes are removed. If there
are no remaining local printers and the scheduler is still running, the
scheduler is shut down.
.sp
.LP
No other
.I options
are allowed with
.BR -x .
.SS "Setting/Changing the System Default Destination"
.sp
.LP
The
.B -d
[\fIdest\fR] option makes
.I dest
(an existing printer or
class) the new system default destination. If
.I dest
is not supplied,
then there is no system default destination. No other
.I options
are
allowed with
.BR -d .
.SS "Setting an Alert for a Print Wheel"
.sp
.ne 2
.mk
.na
.B -S
.I print-wheel
[\fB-A\fR \fIalert-type\fR] [\fB-W\fR
.IR minutes ]
[\fB-Q\fR \fIrequests\fR] \fB-T\fR
.ad
.sp .6
.RS 4n
The
.B -S
.I print-wheel
option is used with the
.BR -A
.I alert-type
option to define an alert to mount the print wheel when
there are jobs queued for it. If this command is not used to arrange
alerting for a print wheel, no alert is sent for the print wheel. Notice the
other use of
.BR -A ,
with the
.B -p
option, above.
.sp
The
.I alert-types
are:
.sp
.ne 2
.mk
.na
.B mail
.ad
.RS 17n
.rt
Send the alert message using the
.B mail
command to the administrator.
.RE

.sp
.ne 2
.mk
.na
.B write
.ad
.RS 17n
.rt
Write the message, using the
.B write
command, to the terminal on which
the administrator is logged in. If the administrator is logged in on several
terminals, one is arbitrarily chosen.
.RE

.sp
.ne 2
.mk
.na
.B quiet
.ad
.RS 17n
.rt
Do not send messages for the current condition. An administrator can use
this option to temporarily stop receiving further messages about a known
problem. Once the
.I print-wheel
has been mounted and subsequently
unmounted, messages are sent againwhen the number of print requests reaches
the threshold specified by the
.B -Q
option.
.RE

.sp
.ne 2
.mk
.na
.B none
.ad
.RS 17n
.rt
Do not send messages until the
.B -A
option is given again with a
different
.I alert-type
(other than
.BR quiet ).
.RE

.sp
.ne 2
.mk
.na
.I shell-command
.ad
.RS 17n
.rt
Run the
.I shell-command
each time the alert needs to be sent. The shell
command should expect the message in standard input. If there are blanks
embedded in the command, enclose the command in quotes. Notice that the
.B mail
and
.B write
values for this option are equivalent to the
values
.B mail
.I user-name
and
.B write
.I user-name
respectively, where
.I user-name
is the current name for the
administrator. This is the login name of the person submitting this command
unless he or she has used the
.B su
command to change to another user ID.
If the
.B su
command has been used to change the user ID, then the
.I user-name
for the new ID is used.
.RE

.sp
.ne 2
.mk
.na
.B list
.ad
.RS 17n
.rt
Display the type of the alert for the print wheel on standard output. No
change is made to the alert.
.RE

The message sent appears as follows:
.sp
.in +2
.nf
The print wheel \fIprint-wheel\fR needs to be mounted
on the printer(s):
\fIprinter\fR(\fIinteger1\fRrequests) \fIinteger2\fR print requests
await this print wheel.
.fi
.in -2
.sp

The printers listed are those that the administrator had earlier specified
were candidates for this print wheel. The number
.I integer1
listed next
to each printer is the number of requests eligible for the printer. The
number
.I integer2
shown after the printer list is the total number of
requests awaiting the print wheel. It is less than the sum of the other
numbers if some requests can be handled by more than one printer.
.sp
If the
.I print-wheel
is
.BR all ,
the alerting defined in this command
applies to all print wheels already defined to have an alert.
.sp
If the
.B -W
option is not given, the default procedure is that only one
message is sent per need to mount the print wheel. Not specifying the
.B -W
option is equivalent to specifying
.B "-W once"
or
.BR "-W 0" .
If
.I minutes
is a number greater than zero, an alert
is sent at intervals specified by
.IR minutes .
.sp
If the
.B -Q
option is also given, the alert is sent when a certain
number (specified by the argument
.IR requests )
of print requests that
need the print wheel are waiting. If the
.B -Q
option is not given, or
.I requests
is 1 or
.B any
(which are both the default), a message is
sent as soon as anyone submits a print request for the print wheel when it
is not mounted.
.RE

.SH PREDEFINED OPTIONS USED WITH THE \fB-o\fR OPTION
.sp
.LP
A number of options, described below, are predefined for use with
.BR -o .
These options are used for adjusting printer capabilities, adjusting printer
port characteristics, configuring network printers, and controlling the use
of banner. The
.B -o
also supports an arbitrary
\fIkeyword\fR=\fIvalue\fR format, which is referred to below as an
undefined option.
.SS "Adjusting Printer Capabilities"
.sp
.LP
The
.BR length ,
.BR width ,
.BR cpi ,
and
.B lpi
parameters can be
used in conjunction with the
.B -o
option to adjust printer capabilities.
The format of the parameters and their values is as follows:
.sp
.in +2
.nf
length=\fIscaled-decimal-number\fR
width=\fIscaled-decimal-number\fR
cpi=\fIscaled-decimal-number\fR
lpi=\fIscaled-decimal-number\fR
.fi
.in -2
.sp

.sp
.LP
The term
.I scaled-decimal-number
refers to a non-negative number used
to indicate a unit of size. The type of unit is shown by a ``trailing''
letter attached to the number. Three types of
.I scaled-decimal-numbers
can be used with the LP print service: numbers that show sizes in
centimeters (marked with a trailing
.BR c );
numbers that show sizes in
inches (marked with a trailing
.BR i );
and numbers that show sizes in
units appropriate to use (without a trailing letter), that is, lines,
characters, lines per inch, or characters per inch.
.sp
.LP
The option values must agree with the capabilities of the type of physical
printer, as defined in the terminfo database for the printer type. If they
do not, the command is rejected.
.sp
.LP
The defaults are defined in the
.B terminfo
entry for the specified
printer type. The defaults can be reset by:
.sp
.in +2
.nf
\fBlpadmin -p \fIprintername\fR -o length=
lpadmin -p \fIprintername\fR -o width=
lpadmin -p \fIprintername\fR -o cpi=
lpadmin -p \fIprintername\fR -o lpi=\fR
.fi
.in -2
.sp

.SS "Adjusting Printer Port Characteristics"
.sp
.LP
You use the
.B stty
keyword in conjunction with the o option to adjust
printer port characteristics. The general form of the
.B stty
portion of
the command is:
.sp
.in +2
.nf
\fBstty="'\fIstty-option-list\fR'"
.fi
.in -2
.sp

.sp
.LP
The
.I stty-option-list
is not checked for allowed values, but is passed
directly to the
.B stty
program by the standard interface program. Any
error messages produced by
.B stty
when a request is processed (by the
standard interface program) are mailed to the user submitting the request.
.sp
.LP
The default for
.B stty
is:
.sp
.in +2
.nf
stty="'9600 cs8 -cstopb -parenb ixon
     -ixany opost -olcuc onlcr
     -ocrnl -onocr
     -onlret -ofill nl0 cr0 tab0 bs0 vt0 ff0'"
.fi
.in -2
.sp

.sp
.LP
The default can be reset by:
.sp
.in +2
.nf
\fBlpadmin -p \fIprintername\fR -o stty=\fR
.fi
.in -2
.sp

.SS "Configuring Network Printers"
.sp
.LP
The
.BR dest ,
.BR protocol ,
.BR bsdctrl ,
and
.B timeout
parameters
are used in conjunction with the
.B -o
option to configure network
printers. The format of these keywords and their assigned values is as
follows:
.sp
.in +2
.nf
dest=\fIstring\fR protocol=\fIstring\fR bsdctrl=\fIstring\fR \e
     timeout=\fInon-negative-integer-seconds\fR
.fi
.in -2
.sp

.sp
.LP
These four options are provided to support network printing. Each option is
passed directly to the interface program; any checking for allowed values is
done there.
.sp
.LP
The value of
.B dest
is the name of the destination for the network
printer; the semantics for value
.B dest
are dependent on the printer and
the configuration. There is no default.
.sp
.LP
The value of option
.B protocol
sets the over-the-wire protocol to the
printer. The default for option
.B protocol
is
.BR bsd .
The value of
option
.B bsdctrl
sets the print order of control and data files (BSD
protocol only); the default for this option is
.BR "control file first" .
The
value of option
.B timeout
sets the seed value for backoff time when the
printer is busy. The default value for the
.B timeout
option is
.BR 10
seconds. The defaults can be reset by:
.sp
.in +2
.nf
\fBlpadmin -p \fIprintername\fR -o protocol=
lpadmin -p \fIprintername\fR \fB-o bsdctrl=\fR
lpadmin -p \fIprintername\fR -o timeout=
.fi
.in -2
.sp

.SS "Controlling the Use of the Banner Page"
.sp
.LP
Use the following commands to control the use of the banner page:
.sp
.in +2
.nf
\fBlpadmin -p \fIprinter\fR -o nobanner\fR
\fBlpadmin -p \fIprinter\fR -o banner\fR
\fBlpadmin -p \fIprinter\fR -o banner=always\fR
\fBlpadmin -p \fIprinter\fR -o banner=never\fR
\fBlpadmin -p \fIprinter\fR -o banner=optional\fR
.fi
.in -2
.sp

.sp
.LP
.RB "The first and fifth commands (" "-o nobanner" " and " -o 
.BR banner=optional )
are equivalent. The default is to print the banner
page, unless a user specifies
.B "-o nobanner"
on an
.B lp
command
line.
.sp
.LP
.RB "The second and third commands (" "-o banner" " and " -o 
.BR banner=always )
are equivalent. Both cause a banner page to be printed
always, even if a user specifies
.B "lp -o"
.BR nobanner .
The root
user can override this command.
.sp
.LP
The fourth command
.RB ( "-o banner=never" )
causes a banner page never
to be printed, even if a user specifies
.B "lp -o"
.BR banner .
The
root user can override this command.
.SS "Undefined Options"
.sp
.LP
The
.B -o
option supports the use of arbitrary, user-defined options
with the following format:
.sp
.ne 2
.mk
.na
\fIkey\fB=\fIvalue\fR
.ad
.sp .6
.RS 4n
Each \fIkey\fB=\fIvalue\fR is passed directly to the interface
program. Any checking for allowed values is done in the interface program.
.sp
Any default values for a given \fIkey\fB=\fIvalue\fR option are
defined in the interface program. If a default is provided, it can be reset
by typing the key without any value:
.sp
.in +2
.nf
lpadmin -p \fIprintername\fR -o \fIkey\fR=
.fi
.in -2
.sp

.RE

.sp
.ne 2
.mk
.na
.B "lpadmin -p"
.I printer
.B -o foo | nofoo
.ad
.sp .6
.RS 4n
Sets boolean values
.BR "foo=true | foo=false" .
.RE

.SH EXAMPLES
.sp
.LP
In the following examples,
.I prtr
can be any name up to 14 characters
and can be the same name as the
.BR ping "(1M) name."
.LP
.B Example 1
Configuring an HP Postscript Printer with a Jet Direct
Network Interface
.sp
.LP
The following example configures an HP postscript printer with a jet direct
network interface:

.sp
.in +2
.nf
example# \fBlpadmin -p \fIprtr\fR -v /dev/null -m netstandard \e
          -o dest=\fIping_name_of_prtr\fR:9100 -o protocol=tcp -T PS -I \e
           postscript\fR
example# \fBenable \fIprtr\fR
example# \fBaccept \fIprtr\fR
.fi
.in -2
.sp

.LP
.B Example 2
Configuring a Standard Postscript Network Printer
.sp
.LP
The following example configures a standard postscript network printer:

.sp
.in +2
.nf
example# \fBlpadmin -p \fIprtr\fR -v /dev/null -m netstandard \e
         -o dest=\fIping_name_of_prtr\fR -T PS -I postscript\fR
example# \fBenable \fIprtr\fR
example# \fBaccept \fIprtr\fR
.fi
.in -2
.sp

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 12n
.rt
Successful completion.
.RE

.sp
.ne 2
.mk
.na
.B non-zero
.ad
.RS 12n
.rt
An error occurred.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B /var/spool/lp/*
.ad
.RS 26n
.rt

.RE

.sp
.ne 2
.mk
.na
.B /etc/lp
.ad
.RS 26n
.rt

.RE

.sp
.ne 2
.mk
.na
.B /etc/lp/alerts/printer
.ad
.RS 26n
.rt
Fault handler for
.BR lpadmin
.RE

.sp
.ne 2
.mk
.na
.B /etc/printers.conf
.ad
.RS 26n
.rt
System printer configuration database
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWpcu
_
Interface StabilityObsolete
.TE

.SH SEE ALSO
.sp
.LP
.BR enable (1),
.BR lp (1),
.BR lpstat (1),
.BR mail (1),
.BR stty (1),
.BR accept (1M),
.BR lpforms (1M),
.BR lpsched (1M),
.BR lpsystem (1M),
.BR ping (1M),
.BR dial (3NSL),
.BR terminfo (4),
.BR attributes (5)
.sp
.LP
\fR
.SH NOTES
.sp
.LP
When using lpadmin to provide access to a remote printer, remote
configuration data is stored in
.BR /etc/printers.conf .
This data includes
a
.B bsdaddr
and a
.B printer-uri-supported
attribute. The data in
this file can be shared through the use of a network name service or
replicated across multiple systems. If the data is shared, it is important
to make sure that the
.B bsdaddr
and
.B printer-uri-supported
contain
hostname information that is correctly resolved on all hosts sharing this
data. Also, the
.B printer-uri-supported
is the preferred means of
accessing remote print service. The
.B bsdaddr
is supplied for backward
compatability with Solaris 2.6-10 systems.
