usr/src/man/man1m/lpfilter.1m
'\" te
.\" Copyright (c) 2000, Sun Microsystems, Inc.  All Rights Reserved
.\" Copyright 1989 AT&T
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH lpfilter 1M "3 Apr 1997" "SunOS 5.11" "System Administration Commands"
.SH NAME
lpfilter \- administer filters used with the LP print service
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/lpfilter\fR \fB-f\fR \fIfilter-name\fR
     {\fB-\fR | \fB-i\fR | \fB-l\fR | \fB-x\fR | \fB-F\fR \fIpathname\fR}
.fi

.SH DESCRIPTION
.sp
.LP
The \fBlpfilter\fR command is used to add, change, delete, or list a filter
used with the
.B LP
print service. These  filters convert the content of
a file to have a content type acceptable to a printer.
.SH OPTIONS
.sp
.LP
Arguments consist of the \fB-f\fIfilter-name\fR option and exactly one
of the arguments appearing within braces (\fB{\fR\|\fB}\fR) in the
SYNOPSIS.
.sp
.ne 2
.mk
.na
\fB\(mi\fR
.ad
.RS 18n
.rt
Adds or changes a filter as specified from standard input. The format of
the input is specified below. If \fB-f all\fR is specified with the
\fB\(mi\fR option, the specified change is made to all existing filters.
This is not useful.
.RE

.sp
.ne 2
.mk
.na
\fB-f\fR \fIfilter-name\fR
.ad
.RS 18n
.rt
Specifies the  \fIfilter-name\fR of the filter to be added, changed, reset,
deleted, or listed. The  filter name
.B all
is a special filter name
defined below. The  \fB-f\fR option is required.
.RE

.sp
.ne 2
.mk
.na
\fB-F\fR \fIpathname\fR
.ad
.RS 18n
.rt
Adds or changes a filter as specified by the contents of the file
.IR pathname .
The format of the file's contents is specified below. If
\fB-f\fB all\fR is specified with the \fB-F\fR option, the
specified change is made to all existing filters. This is not useful.
.RE

.sp
.ne 2
.mk
.na
.B -i
.ad
.RS 18n
.rt
Resets a filter to its default settings. Using  \fB-f\fB all\fR
with the
.B -i
option restores  all filters for which predefined
settings are available to their original settings.
.RE

.sp
.ne 2
.mk
.na
.B -l
.ad
.RS 18n
.rt
Lists a filter description. Using \fB-f all\fR with the \fB-l\fR
option produces a list of all filters.
.RE

.sp
.ne 2
.mk
.na
.B -x
.ad
.RS 18n
.rt
Deletes a filter. Using \fB-f all\fR with the
.B -x
option results
in all filters being deleted.
.RE

.SH USAGE
.SS "Adding or Changing a Filter"
.sp
.LP
The filter named in the \fB-f\fR option is added to the filter table. If
the filter already exists, its description is changed to reflect the new
information in the input.
.sp
.LP
When  \fB\(mi\fR is specified, standard input supplies the filter
description. When
.B -F
is specified, the file
.I pathname
supplies
the filter description. One of these two options must be specified to add or
change a filter.
.sp
.LP
When an existing filter is changed with the
.B -F
or \fB\(mi\fR option,
lines in the filter description that are not specified in the new
information are not changed. When a new filter is added with this command,
unspecified lines receive default values. See below.
.sp
.LP
Filters are used to convert the content  of a request from its initial type
.RB "into a type acceptable to a printer. For a given print request, the" " LP"
print service knows the following:
.RS +4
.TP
.ie t \(bu
.el o
The content type of the request (specified by
.B "lp -T"
or
determined implicitly).
.RE
.RS +4
.TP
.ie t \(bu
.el o
The name of the printer (specified by 
.BR "lp -d" ).
.RE
.RS +4
.TP
.ie t \(bu
.el o
The printer type (specified by
.BR "lpadmin -T" ).
.sp
The printer type is intended to be a printer model, but some people specify
it with a content type even though
.B "lpadmin -I"
is intended for
this purpose.
.RE
.RS +4
.TP
.ie t \(bu
.el o
The content types acceptable to the printer (specified by \fBlpadmin\fR
\fB-I\fB)\fR.
.sp
The values specified by the
.B "lpadmin -T"
are treated as if they
were specified by the
.B -I
option as well.
.RE
.RS +4
.TP
.ie t \(bu
.el o
The modes of printing asked for by the originator of the request (specified
by various options to
.BR lp ).
.RE
.sp
.LP
The system uses the above information to construct a list of  one or more
filters that converts the document's content type into a content type
acceptable to the printer and consumes all
.B lp
arguments that invoke
filters (\fB-y\fR and \fB-P\fR).
.sp
.LP
The contents of the file (specified by the
.B -F
option) and the input
stream from standard input (specified by  \fB\(mi\fR) must consist of a
series of lines, such that each line conforms to the syntax specified by one
of the seven lines below. All lists are comma or space separated. Each item
contains a description.
.sp
.in +2
.nf
\fBInput types: \fIcontent-type-list\fR
\fBOutput types: \fIcontent-type-list\fR
\fBPrinter types: \fIprinter-type-list\fR
\fBPrinters: \fIprinter-list\fR
\fBFilter type: \fIfilter-type\fR
\fBCommand: \fIshell-command\fR
\fBOptions: \fItemplate-list\fR
.fi
.in -2
.sp

.sp
.ne 2
.mk
.na
.B Input types
.ad
.RS 17n
.rt
This gives the content types that can be accepted by the filter. The
default is
.BR any .
The document content type must  be a member of this
list for the initial filter in the sequence.
.RE

.sp
.ne 2
.mk
.na
.B Output types
.ad
.RS 17n
.rt
This gives the content types that the filter can  produce from any of the
input (content) types.  The default is
.BR any .
The intersection of the
output types of this list and the content types acceptable to the printer
(from \fBlpadmin -I\fR and \fBlpadmin \fB-T\fR) must be non-null
for the last filter in the sequence.  For adjacent filters in the sequence,
the intersection of output types of one and the input types of the next must
be non-null.
.RE

.sp
.ne 2
.mk
.na
.B Printer types
.ad
.RS 17n
.rt
This gives the printer types for which this  printer can be used. The
\fBLP\fR print service will restrict the use of  the filter to these printer
types (from
.BR "lpadmin -T" ).
The default is
.BR any .
.RE

.sp
.ne 2
.mk
.na
.B Printers
.ad
.RS 17n
.rt
This gives the names of the printers for which the filter can be used. The
\fBLP\fR print service will restrict the use of the filter to just the
printers named. The default is
.BR any .
.RE

.sp
.ne 2
.mk
.na
.B Filter type
.ad
.RS 17n
.rt
This marks the filter as a
.B slow
filter or a \fBfast\fR filter. Slow
filters are generally those that take a long time to convert their input
(that is, minutes or hours). They are run before the job is scheduled for a
printer, to keep the printers from being tied up  while the filter is
running. If a listed printer is on a remote system, the filter type for it
must have the value
.BR slow .
That is, if a client defines a filter, it
must be a slow filter. Fast filters are generally those that convert their
input quickly (that is, faster than the printer can process the data), or
those that must be connected to the printer when run. Fast filters will be
given to the interface program to run while connected  to the physical
printer.
.RE

.sp
.ne 2
.mk
.na
.B Command
.ad
.RS 17n
.rt
This specifies which program to run to invoke the filter. The full program
pathname as well as fixed options must  be included in the
.IR shell-command ;
additional options are constructed, based on the
characteristics of each print request and on the
.B Options
field. A
command must be given for each filter. The command must accept a data stream
as standard input and produce the converted data stream on its standard
output. This allows filter pipelines to be constructed to convert data not
handled by a single filter.
.RE

.sp
.ne 2
.mk
.na
.B Options
.ad
.RS 17n
.rt
This is a comma-separated list of templates used by the
.B LP
print
service to construct options to the filter from the  characteristics of each
print request listed in the table later. The
.B -y
and
.BR "- P"
arguments to the
.B lp
command cause a filter sequence to be built even
if there is no need for a conversion of content types.
.sp
In general, each template is of the following form:
.sp
\fIkeyword pattern \fB=\fR \fIreplacement\fR
.sp
The
.I keyword
names the characteristic that the template attempts to
map into a filter-specific option; each valid
.I keyword
is listed in the
table below.
.sp
A
.I pattern
is one of the following:  a literal pattern of one of the
forms listed in the table, a single asterisk
.RB ( * ),
or a regular
expression. If
.I pattern
matches  the value of the characteristic, the
template fits and is used to generate a filter-specific option. The
\fIreplacement\fR is what will be used as the option.
.sp
Regular expressions are the same as those found on the
.BR regexp (5)
manual page. This includes the \fB\e(\fR\&.\|.\|.\fB\e)\fR and \fB\e\fIn\fR
constructions, which can be used to extract portions of the \fIpattern\fR
for copying into the
.IR replacement ,
and the
.BR & ,
which can be used
to copy the entire
.I pattern
into the
.IR replacement .
.sp
The
.I replacement
can also contain a
.BR * ;
it too, is replaced with
the entire
.IR pattern ,
just like the
.B &
of
.BR regexp (5).
.RE

.sp
.LP
The keywords are:
.sp
.in +2
.nf
lp Option          Characteristic   \fIkeyword\fR         Possible \fIpatterns\fR

-T                Content type      INPUT           content-type
                  (input)

Not applicable    Content type      OUTPUT          content-type
                  (output)

not applicable    Printer type      TERM            printer-type

-d                Printer name      PRINTER         \fIprinter-name\fR

-f, -o cpi=       Character pitch   CPI             integer

-f, -o lpi=       Line pitch        LPI             integer

-f, -o length=    Page length       LENGTH          integer

-f, -o width=     Page width        WIDTH           integer

-P                Pages to print    PAGES           page-list

-S                Character set     CHARSET         character-set-name
                  Print wheel       CHARSET         print-wheel-name

-f                Form name         FORM            form-name

-y                Modes             MODES           mode

-n                Number of         COPIES          \fIinteger\fR
                  copies
.fi
.in -2
.sp

.SS "Resetting a Filter to Defaults"
.sp
.LP
If the filter named is one originally  delivered with the
.B LP
print
service, the
.B -i
option restores the original filter description.
.SS "Deleting a Filter"
.sp
.LP
The
.B -x
option is used to delete the filter  specified in filter-name
from the
.B LP
filter table.
.SS "Listing a Filter Description"
.sp
.LP
The
.B -l
option is used to list the description of the filter named
in filter-name. If the command is  successful, the following message is sent
to standard output:
.sp
.in +2
.nf
\fBInput types: \fIcontent-type-list\fR
\fBOutput types: \fIcontent-type-list\fR
\fBPrinter types: \fIprinter-type-list\fR
\fBPrinters: \fIprinter-list\fR
\fBFilter type: \fIfilter-type\fR
\fBCommand: \fIshell-command\fR
\fBOptions: \fItemplate-list\fR
.fi
.in -2
.sp

.sp
.LP
If the command fails, an error message is sent to standard error.
.SS "Large File Behavior"
.sp
.LP
See
.BR largefile (5)
for the description of the behavior of
\fBlpfilter\fR when encountering files greater than or equal to 2 Gbyte (
2^31 bytes).
.SH EXAMPLES
.LP
\fBExample 1\fR Printing with the landscape option
.sp
.LP
For example, the template

.sp
.in +2
.nf
\fBMODES landscape = \fB-l\fR
.fi
.in -2
.sp

.sp
.LP
shows that if a print request is submitted with the
.BR -y
\fBlandscape\fR option, the filter will be given the option \fB-l\fR.

.LP
\fBExample 2\fR Selecting the printer type
.sp
.LP
As another example, the template

.sp
.in +2
.nf
\fBTERM * = \fB-T\fB *\fR
.fi
.in -2
.sp

.sp
.LP
shows that the filter will be given the option
.B -T
.I printer-type
for whichever
.I printer-type
is associated with a print request using
the filter.

.LP
\fBExample 3\fR Using the keywords table
.sp
.LP
Consider the template

.sp
.in +2
.nf
\fBMODES prwidth\e=\e(.*\e) = \fB-w\fB\e1\fR
.fi
.in -2
.sp

.sp
.LP
Suppose a user gives the command

.sp
.in +2
.nf
\fBlp -y prwidth=10\fR
.fi
.in -2
.sp

.sp
.LP
From the table above, the
.B LP
print service determines that the
\fB-y\fR option is handled by a \fBMODES\fR template. The  \fBMODES\fR
template here works because the  pattern prwidth=) matches the prwidth=10
given by  the user. The replacement -w1 causes the
.B LP
print service
to generate the filter option
.BR -w10 .
If necessary, the
.B LP
print
service will construct a filter pipeline by concatenating several filters to
handle the user's file and all the print options. See
.BR sh (1)
for a
description of a pipeline. If the print service constructs a filter
pipeline, the
.B INPUT
and
.B OUTPUT
values used for each filter in
the pipeline are the types of input and output for that  filter, not for the
entire pipeline.

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 12n
.rt
Successful completion.
.RE

.sp
.ne 2
.mk
.na
.I non-zero
.ad
.RS 12n
.rt
An error occurred.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWpsu
.TE

.SH SEE ALSO
.sp
.LP
.BR lp (1),
.BR sh (1),
.BR lpadmin (1M),
.BR attributes (5),
\fBlargefile\fR(5), \fBregexp\fR(5)
.sp
.LP
\fR
.SH NOTES
.sp
.LP
If the
.B lp
command specifies more than one document, the filtering
chain is determined by the first document. Other documents may have a
different format, but they will print correctly only if the filter chain is
able to handle their format.
