usr/src/man/man1m/lpmove.1m
'\" te
.\" Copyright (c) 2006 Sun Microsystems, Inc. All Rights Reserved.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH lpmove 1M "6 Jun 2006" "SunOS 5.11" "System Administration Commands"
.SH NAME
lpmove \- move print requests
.SH SYNOPSIS
.LP
.nf
\fBlpmove\fR [\fIrequest-ID\fR] \fIdestination\fR
.fi

.LP
.nf
\fBlpmove\fR \fIsource\fR \fIdestination\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B lpmove
command moves print requests queued by
.BR lp (1)
or
.BR lpr (1B)
between destinations.
.sp
.LP
The first form of
.B lpmove
moves specific print requests
(\fIrequest-ID\fR) to a specific \fIdestination\fR.
.sp
.LP
The second form of the
.B lpmove
command moves all print requests from
one destination (\fIdestination1\fR) to another
.RI ( destination2 ).
This
form of
.B lpmove
also rejects new print requests for
.IR destination1 .

.sp
.LP
\fBlpmove\fR moves individual requests or entire queues only within an
instance of a print service, not between a local and a remote queues or
local queues on different instances of a print service. Requests can only be
moved if the print service or protocol supports it. The LP print server and
IPP print protocol both support moving requests between queues. The BSD
print protocol does not.
.sp
.LP
When moving requests,
.B lpmove
does not check the acceptance status of
the destination to which the print requests are being moved (see
.BR accept (1M)).
\fBlpmove\fR does not move requests that have options
(for example, content type or requiring a special form) that cannot be
handled by the new destination.
.SH OPERANDS
.sp
.LP
The following operands are supported:
.sp
.ne 2
.mk
.na
.I request-ID
.ad
.RS 15n
.rt
The specific print request to be moved. Specify
.I request-ID
as the
identifier associated with a print request as reported by
.BR lpstat .
See
.BR lpstat (1).
.RE

.sp
.ne 2
.mk
.na
.I destination
.ad
.RS 15n
.rt
The name of the printer or class of printers (see
.BR lpadmin (1M))
to
which
.B lpmove
moves a \fIspecified\fR print request. Specify
\fIdestination\fR using atomic, URI-style (\fIscheme\fR://\fIendpoint\fR),
POSIX-style (\fIserver\fB:\fIdestination\fR) syntax.
.RE

.sp
.ne 2
.mk
.na
.I source
.ad
.RS 15n
.rt
The name of the destination from which
.B lpmove
moves
.I all
print
requests. Specify
.I destination
using atomic, URI-style
(\fIscheme\fB://\fIendpoint\fR), POSIX-style
(\fIserver\fB:\fIdestination\fR) syntax.
.RE

.sp
.LP
See
.BR printers.conf (4)
for information regarding the naming conventions
for atomic names and
.BR standards (5)
for information regarding POSIX.
.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 12n
.rt
Successful completion.
.RE

.sp
.ne 2
.mk
.na
.B non-zero
.ad
.RS 12n
.rt
An error occurred.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
\fB/etc/printers.conf\fR
.ad
.RS 24n
.rt
System printer configuration database
.RE

.sp
.ne 2
.mk
.na
.B $HOME/.printers
.ad
.RS 24n
.rt
User-configurable printer database
.RE

.sp
.ne 2
.mk
.na
.B ou=printers
.ad
.RS 24n
.rt
LDAP version of \fB/etc/printers.conf\fR
.RE

.sp
.ne 2
.mk
.na
\fBprinters.conf.byname\fR
.ad
.RS 24n
.rt
\fBNIS\fR version of \fB/etc/printers.conf\fR
.RE

.sp
.ne 2
.mk
.na
.B printers.org_dir
.ad
.RS 24n
.rt
\fBNIS+\fR version of \fB/etc/printers.conf\fR
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWlp-cmds
_
Interface StabilityObsolete
.TE

.SH SEE ALSO
.sp
.LP
.BR lp (1),
.BR lpr (1B),
.BR lpstat (1),
.BR accept (1M),
.BR lpadmin (1M),
.BR lpsched (1M),
.BR printers.conf (4),
.BR attributes (5),
.BR standards (5)
.sp
.LP
.I System Administration Guide: Solaris Printing
.SH NOTES
.sp
.LP
When IPP is in use, the user is prompted for a passphsrase if the remote
print service is configured to require authentication.
