usr/src/man/man1m/lpsched.1m
'\" te
.\" Copyright 1989 AT&T  Copyright (c) 2004 Sun Microsystems, Inc.  All Rights Reserved.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH lpsched 1M "3 Sep 2004" "SunOS 5.11" "System Administration Commands"
.SH NAME
lpsched \- start the LP print service
.SH SYNOPSIS
.LP
.nf
\fBlpsched\fR [\fB-f\fR \fInum_filters\fR] [\fB-n\fR \fInum_notifiers\fR] [\fB-p\fR \fIfd_limit\fR]
     [\fB-r\fR \fIreserved_fds\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The 
.B lpsched
command  starts or restarts the 
.B LP
print
service.
.sp
.LP
The 
.B lpshut
command stops the 
.B LP
print service.  Printers that
are restarted using
.B lpsched
reprint (in their entirety) print requests
that were stopped by
.BR lpshut .
See 
.BR lpshut (1M).
.sp
.LP
It is recommended that you start  and stop the LP print service using
.BR svcadm (1M).
See
.BR NOTES .
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB-f\fI num_filters\fR
.ad
.RS 20n
.rt
Specifies the number of concurrent slow filters that may be run on a print
server. A default value of
.B 1
is used if none is specified. Depending
on server configuration, a value of 
.B 1
may cause printers to remain
idle while there are jobs queued to them.
.RE

.sp
.ne 2
.mk
.na
\fB-n\fI num_notifiers\fR
.ad
.RS 20n
.rt
Specifies the number of concurrent notification processes that can run on a
print server. A default value of 
.B 1
is used when none is specified.
.RE

.sp
.ne 2
.mk
.na
\fB-p\fI fd_limit\fR
.ad
.RS 20n
.rt
Specifies the file descriptor resource limit for the 
.BR lpsched
process. A default value of 
.B 4096
is used if none is specified. On
extremely large and active print servers, it may be necessary to increase
this value.
.RE

.sp
.ne 2
.mk
.na
\fB-r\fI reserved_fds\fR
.ad
.RS 20n
.rt
Specifies the number of file descriptors that the scheduler reserves for
internal communications under heavy load. A default value of 
.B 2
is
used when none is specified. It should not be necessary to modify this value
unless instructed to do so when troubleshooting problems under high load.
.RE

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 12n
.rt
Successful completion.
.RE

.sp
.ne 2
.mk
.na
.B non-zero
.ad
.RS 12n
.rt
An error occurred.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B /var/spool/lp/*
.ad
.RS 19n
.rt
\fBLP\fR print queue.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWpsu
.TE

.SH SEE ALSO
.sp
.LP
.BR lp (1),
.BR svcs (1),
.BR lpstat (1),
.BR lpadmin (1M),
.BR lpmove (1M),
.BR lpshut (1M),
.BR svcadm (1M),
.BR attributes (5),
\fBsmf\fR(5)
.sp
.LP
\fR
.SH NOTES
.sp
.LP
The
.B lpsched
service is managed by the service management facility,
\fBsmf\fR(5), under the service identifier:
.sp
.in +2
.nf
svc:/application/print/server
.fi
.in -2
.sp

.sp
.LP
Administrative actions on this service, such as enabling, disabling, or
requesting restart, can be performed using
.BR svcadm (1M).
The service's
status can be queried using the
.BR svcs (1)
command.
