usr/src/man/man1m/lpset.1m
'\" te
.\" Copyright (C) 2003, Sun Microsystems, Inc. All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH lpset 1M "23 May 2003" "SunOS 5.11" "System Administration Commands"
.SH NAME
lpset \- set printing configuration in /etc/printers.conf or other supported
databases
.SH SYNOPSIS
.LP
.nf
\fBlpset\fR [\fB-n\fR system | nisplus | fnsldap] [\fB-x\fR]
     [ [\fB-D\fR binddn] [\fB-w\fR passwd] [\fB-h\fR ldaphost]]
     [\fB-a\fR \fIkey=value\fR] [\fB-d\fR \fIkey\fR] \fIdestination\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B lpset
utility sets printing configuration information in the
system configuration databases. Use
.B lpset
to create and update printing
configuration in
.BR /etc/printers.conf ,
or
.B printers.org_dir
(NIS+).
See
.BR nsswitch.conf (4)
and
.BR printers.conf (4).
.sp
.LP
Only a superuser or a member of Group 14 may execute
.BR lpset .
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB-n system\fR|\fBnisplus\fR|\fBldap\fR
.ad
.RS 26n
.rt
Create or update the configuration information  for the
.IR destination
entry in
.BR /etc/printers.conf ,
\fBprinters.org_dir\fR (NIS+), or LDAP
printer contexts.
.B system
specifies that the information is created or
updated in
.BR /etc/printers.conf .
\fBnisplus\fR specifies that the
information is created or updated in the
.B printers.org_dir
NIS+ table.
\fBldap\fR specifies that the information is written to an LDAP server. See
\&.
.sp
If
.B -n
is not specified,
.B system
is the default.
.RE

.sp
.ne 2
.mk
.na
.B -x
.ad
.RS 26n
.rt
Remove all configuration for the
.I destination
entry from the database
specified by the
.B -n
option.
.RE

.sp
.ne 2
.mk
.na
\fB-a\fR \fIkey\fB=\fIvalue\fR
.ad
.RS 26n
.rt
Configure the specified \fIkey\fB=\fIvalue\fR pair for the
.IR destination .
See
.BR printers.conf (4)
for information regarding the
specification of \fIkey\fB=\fIvalue\fR pairs.
.RE

.sp
.ne 2
.mk
.na
\fB-d\fR \fIkey\fR
.ad
.RS 26n
.rt
Delete the configuration option specified by
.I key
for the
\fIdestination\fR entry. See
.BR printers.conf (4)
for information regarding
the specification of \fIkey\fR and  \fIkey\fB=\fIvalue\fR pairs.
.RE

.sp
.ne 2
.mk
.na
.B -D binddn
.ad
.RS 26n
.rt
Use the distinguished name (DN)
.B binddn
to bind to the LDAP directory
server.
.RE

.sp
.ne 2
.mk
.na
.B -w passwd
.ad
.RS 26n
.rt
Use
.B passwd
as the password for authentication to the LDAP directory
server.
.RE

.sp
.ne 2
.mk
.na
.B -h ldaphost
.ad
.RS 26n
.rt
Specify an alternate host on which the LDAP server is running. This option
is only used when
.B ldap
is specified as the naming service. If this
option is not specified, the default is the current host system.
.RE

.SH OPERANDS
.sp
.LP
The following operand is supported:
.sp
.ne 2
.mk
.na
.I destination
.ad
.RS 15n
.rt
Specifies the entry in 
.BR /etc/printers.conf ,
.BR printers.org_dir ,
or
LDAP, in which to create or modify information.
.I destination
names a
printer of class of printers. See
.BR lpadmin (1M).
Each entry in
\fBprinters.conf\fR describes one destination. Specify \fIdestination\fR
using atomic names. POSIX-style destination names are not acceptable. See
\fBprinters.conf\fR(4) for information regarding the naming conventions for
atomic names and
.BR standards (5)
for information regarding POSIX.
.RE

.SH EXAMPLES
.LP
\fBExample 1\fR Removing All Existing Printing Configuration Information
.sp
.LP
The following example removes all existing printing configuration
information for destination
.B dogs
from
.BR /etc/printers.conf :

.sp
.in +2
.nf
example% \fBlpset -x dogs\fR
.fi
.in -2
.sp

.LP
\fBExample 2\fR Setting a \fBkey=value\fR Pair
.sp
.LP
The following example sets the
.BR "user-equivalence =true"
\fIkey\fB=\fIvalue\fR pair for destination  \fBtabloid\fR in the NIS+
context:

.sp
.in +2
.nf
example% \fBlpset -n nisplus -a user-equivalence=true tabloid\fR
.fi
.in -2
.sp

.LP
\fBExample 3\fR Setting a \fBkey=value\fR Pair in LDAP
.sp
.in +2
.nf
example% \fBlpset -n ldap -h ldapl.xyz.com -D "cn=Directory Manager" \e
   -w passwd -a key1=value1 printer1\fR
.fi
.in -2
.sp

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 12n
.rt
Successful completion.
.RE

.sp
.ne 2
.mk
.na
.B non-zero
.ad
.RS 12n
.rt
An error occurred.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
\fB/etc/printers.conf\fR
.ad
.RS 26n
.rt
System configuration database.
.RE

.sp
.ne 2
.mk
.na
.BR printer.org_dir " (NIS+)"
.ad
.RS 26n
.rt
\fBNIS+\fR version of \fB/etc/printers.conf\fR.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWpcu
_
Stability LevelStable
.TE

.SH SEE ALSO
.sp
.LP
.BR ldap (1),
.BR lp (1),
.BR lpc (1B),
.BR lpq (1B),
.BR lpr (1B),
.BR lpstat (1),
.BR ldapclient (1M),
.BR lpadmin (1M),
.BR lpget (1M),
.BR nsswitch.conf (4),
.BR printers (4),
.BR printers.conf (4),
.BR attributes (5),
.BR standards (5)
.sp
.LP
\fR
.SH NOTES
.sp
.LP
If the
.B ldap
database is used, the printer administrator should be
mindful of the following when updating printer information.
.RS +4
.TP
1.
Because the domain information for the printer being updated is extracted
from the \fBldapclient\fR(1M) configuration, the LDAP server being updated
must host the same domain that is used by the current
.BR ldapclient (1M)
server.
.RE
.RS +4
.TP
2.
If the LDAP server being updated is a replica LDAP server, the updates will
be referred to the master LDAP server and completed there. The updates might
be out of sync and not appear immediatedly, as the replica server may not
have been updated by the master server.  For example, a printer that you
deleted by using
.B lpset
may still appear in the printer list you display
with
.B lpget
until the replica is updated from the master. Replica
servers vary as to how often they are updated from the master.  See \fISystem
Administration Guide: Solaris Printing\fR for information on LDAP server
replication.
.RE
.RS +4
.TP
3.
Although users can use the LDAP command line utilities
.BR ldapadd (1)
and
\fBldapmodify\fR(1) to update printer entries in the directory, the preferred
method is to use
.BR lpset .
Otherwise, if the
.B ldapadd
and
\fBldapmodify\fR utilities are used, the administrator must ensure that the
\fBprinter-name\fR attribute value is unique within the \fBou=printers\fR
container on the LDAP server. If the value is not unique, the result of
modifications done using
.B lpset
or the Solaris Print Manager,
.BR printmgr (1M)
may be unpredictable.
.RE
