usr/src/man/man1m/lpsystem.1m
'\" te
.\" Copyright 1989 AT&T  Copyright (c) 1999 Sun Microsystems, Inc.  All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH lpsystem 1M "19 Feb 1999" "SunOS 5.11" "System Administration Commands"
.SH NAME
lpsystem \- register remote systems with the print service
.SH DESCRIPTION
.sp
.LP
The
.B lpsystem
command is obsolete, and could be removed at any time.
The print system no longer uses the information generated by
.BR lpsystem .
See
.BR lpadmin (1M),
.BR lpusers (1M)
or
.BR printers.conf (4)
for
equivalent functionality.
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWpcu
_
Stability LevelObsolete*
.TE

.sp
.LP
* This command could be removed at any time.
.SH SEE ALSO
.sp
.LP
.BR lpadmin (1M),
.BR lpusers (1M),
.BR printers.conf (4),
.BR attributes (5)
