usr/src/man/man1m/lpsystem.1m
'\" te
.\" Copyright 1989 AT&T  Copyright (c) 1999 Sun Microsystems, Inc.  All Rights Reserved.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH lpsystem 1M "19 Feb 1999" "SunOS 5.11" "System Administration Commands"
.SH NAME
lpsystem \- register remote systems with the print service
.SH DESCRIPTION
.sp
.LP
The 
.B lpsystem
command is obsolete, and could be removed at any time.
The print system no longer uses the information generated by
.BR lpsystem .
See
.BR lpadmin (1M),
.BR lpusers (1M)
or 
.BR printers.conf (4)
for
equivalent functionality.
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWpcu
_
Stability LevelObsolete*
.TE

.sp
.LP
* This command could be removed at any time.
.SH SEE ALSO
.sp
.LP
.BR lpadmin (1M),
.BR lpusers (1M),
\fBprinters.conf\fR(4),
.BR attributes (5)
