usr/src/man/man1m/lpusers.1m
'\" te
.\" Copyright 1989 AT&T  Copyright (c) 1996 Sun Microsystems, Inc.  All Rights Reserved.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH lpusers 1M "19 Aug 1996" "SunOS 5.11" "System Administration Commands"
.SH NAME
lpusers \- set printing queue priorities
.SH SYNOPSIS
.LP
.nf
\fBlpusers\fR \fB-d\fR \fIpriority-level\fR
.fi

.LP
.nf
\fBlpusers\fR \fB-q\fR \fIpriority-level\fR \fB-u\fR \fIlogin-ID-list\fR
.fi

.LP
.nf
\fBlpusers\fR \fB-u\fR \fIlogin-ID-list\fR
.fi

.LP
.nf
\fBlpusers\fR \fB-q\fR \fIpriority-level\fR
.fi

.LP
.nf
\fBlpusers\fR \fB-l\fR
.fi

.SH DESCRIPTION
.sp
.LP
The \fBlpusers\fR command  sets limits to the queue priority level that can
be assigned to  jobs submitted by users of the LP print service.
.sp
.LP
The first form of the command (with \fB-d\fR) sets the system-wide priority
default to \fIpriority-level\fR, where \fIpriority-level\fR is a value of 0
to 39, with 0 being the highest priority. If a user does not specify a
priority level with a print request (see \fBlp\fR(1)), the default priority
level is used. Initially, the default priority level is 20.
.sp
.LP
The second form of the command (with \fB-q\fR and \fB-u\fR) sets the
default highest \fIpriority-level\fR (\|0-39\|) that the users in
\fIlogin-ID-list\fR can request when submitting a print request. The
\fIlogin-ID-list\fR argument may include  any or all of the following
constructs:
.sp
.ne 2
.mk
.na
\fIlogin-ID\fR
.ad
.RS 24n
.rt
A user on any system
.RE

.sp
.ne 2
.mk
.na
\fIsystem_name\fB!\fIlogin-ID\fR
.ad
.RS 24n
.rt
A user on the system \fIsystem_name\fR
.RE

.sp
.ne 2
.mk
.na
\fIsystem_name\fB!all\fR
.ad
.RS 24n
.rt
All users on system \fIsystem_name\fR
.RE

.sp
.ne 2
.mk
.na
\fBall!\fIlogin-ID\fR
.ad
.RS 24n
.rt
A user on all systems
.RE

.sp
.ne 2
.mk
.na
\fBall\fR
.ad
.RS 24n
.rt
All users on all systems
.RE

.sp
.LP
Users that have been given a limit cannot submit a print request with a
higher priority level than the one assigned, nor can they change a request
that has already been submitted to have a higher priority. Any print
requests submitted with priority levels higher than allowed will be given
the highest priority allowed.
.sp
.LP
The third form of the command (with \fB-u\fR)  removes any explicit
priority level for the specified users.
.sp
.LP
The fourth form of the command (with \fB-q\fR) sets the default highest
priority level for all users not explicitly covered by the use of the second
form of this command.
.sp
.LP
The last form of the command (with \fB-l\fR)  lists the default priority
level and the priority limits assigned to users.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB-d\fI priority-level\fR
.ad
.sp .6
.RS 4n
Set the system-wide priority default to \fIpriority-level\fR.
.RE

.sp
.ne 2
.mk
.na
\fB-l\fR
.ad
.sp .6
.RS 4n
List the default priority level and the priority limits assigned to
users.
.RE

.sp
.ne 2
.mk
.na
\fB-q\fI priority-level\fR
.ad
.sp .6
.RS 4n
Set the default highest priority level for all users not explicitly
covered.
.RE

.sp
.ne 2
.mk
.na
\fB-q\fI priority-level\fR \fB-u\fI login-ID-list\fR
.ad
.sp .6
.RS 4n
Set the default highest \fIpriority-level\fR that the users in
\fIlogin-ID-list\fR can request when submitting a print request.
.RE

.sp
.ne 2
.mk
.na
\fB-u\fI login-ID-list\fR
.ad
.sp .6
.RS 4n
Remove any explicit priority level for the specified users.
.RE

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
\fB0\fR
.ad
.RS 12n
.rt
Successful completion.
.RE

.sp
.ne 2
.mk
.na
\fBnon-zero\fR
.ad
.RS 12n
.rt
An error occurred.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWpsu
.TE

.SH SEE ALSO
.sp
.LP
\fBlp\fR(1), \fBattributes\fR(5)
