usr/src/man/man1m/lpusers.1m
'\" te
.\" Copyright 1989 AT&T  Copyright (c) 1996 Sun Microsystems, Inc.  All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH lpusers 1M "19 Aug 1996" "SunOS 5.11" "System Administration Commands"
.SH NAME
lpusers \- set printing queue priorities
.SH SYNOPSIS
.LP
.nf
\fBlpusers\fR \fB-d\fR \fIpriority-level\fR
.fi

.LP
.nf
\fBlpusers\fR \fB-q\fR \fIpriority-level\fR \fB-u\fR \fIlogin-ID-list\fR
.fi

.LP
.nf
\fBlpusers\fR \fB-u\fR \fIlogin-ID-list\fR
.fi

.LP
.nf
\fBlpusers\fR \fB-q\fR \fIpriority-level\fR
.fi

.LP
.nf
\fBlpusers\fR \fB-l\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B lpusers
command  sets limits to the queue priority level that can
be assigned to  jobs submitted by users of the LP print service.
.sp
.LP
The first form of the command (with
.BR -d )
sets the system-wide priority
default to
.IR priority-level ,
where
.I priority-level
is a value of 0
to 39, with 0 being the highest priority. If a user does not specify a
priority level with a print request (see
.BR lp (1)),
the default priority
level is used. Initially, the default priority level is 20.
.sp
.LP
The second form of the command (with
.B -q
and
.BR -u )
sets the
default highest
.I priority-level
(\|0-39\|) that the users in
.I login-ID-list
can request when submitting a print request. The
.I login-ID-list
argument may include  any or all of the following
constructs:
.sp
.ne 2
.mk
.na
.I login-ID
.ad
.RS 24n
.rt
A user on any system
.RE

.sp
.ne 2
.mk
.na
\fIsystem_name\fB!\fIlogin-ID\fR
.ad
.RS 24n
.rt
A user on the system
.IR system_name
.RE

.sp
.ne 2
.mk
.na
\fIsystem_name\fB!all\fR
.ad
.RS 24n
.rt
All users on system
.IR system_name
.RE

.sp
.ne 2
.mk
.na
\fBall!\fIlogin-ID\fR
.ad
.RS 24n
.rt
A user on all systems
.RE

.sp
.ne 2
.mk
.na
.B all
.ad
.RS 24n
.rt
All users on all systems
.RE

.sp
.LP
Users that have been given a limit cannot submit a print request with a
higher priority level than the one assigned, nor can they change a request
that has already been submitted to have a higher priority. Any print
requests submitted with priority levels higher than allowed will be given
the highest priority allowed.
.sp
.LP
The third form of the command (with
.BR -u )
removes any explicit
priority level for the specified users.
.sp
.LP
The fourth form of the command (with
.BR -q )
sets the default highest
priority level for all users not explicitly covered by the use of the second
form of this command.
.sp
.LP
The last form of the command (with
.BR -l )
lists the default priority
level and the priority limits assigned to users.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.BI -d " priority-level"
.ad
.sp .6
.RS 4n
Set the system-wide priority default to
.IR priority-level .
.RE

.sp
.ne 2
.mk
.na
.B -l
.ad
.sp .6
.RS 4n
List the default priority level and the priority limits assigned to
users.
.RE

.sp
.ne 2
.mk
.na
.BI -q " priority-level"
.ad
.sp .6
.RS 4n
Set the default highest priority level for all users not explicitly
covered.
.RE

.sp
.ne 2
.mk
.na
\fB-q\fI priority-level\fR \fB-u\fI login-ID-list\fR
.ad
.sp .6
.RS 4n
Set the default highest
.I priority-level
that the users in
.I login-ID-list
can request when submitting a print request.
.RE

.sp
.ne 2
.mk
.na
.BI -u " login-ID-list"
.ad
.sp .6
.RS 4n
Remove any explicit priority level for the specified users.
.RE

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 12n
.rt
Successful completion.
.RE

.sp
.ne 2
.mk
.na
.B non-zero
.ad
.RS 12n
.rt
An error occurred.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWpsu
.TE

.SH SEE ALSO
.sp
.LP
.BR lp (1),
.BR attributes (5)
