usr/src/man/man1m/makedbm.1m
'\" te
.\" Copyright (c) 1999, Sun Microsystems, Inc.  Copyright 1989 AT&T  All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH makedbm 1M "17 Aug 1999" "SunOS 5.11" "System Administration Commands"
.SH NAME
makedbm \- make a dbm file, or get a text file from a dbm file
.SH SYNOPSIS
.LP
.nf
\fBmakedbm\fR [\fB-b\fR] [\fB-l\fR] [\fB-s\fR] [\fB-E\fR] [\fB-i\fR \fIyp_input_file\fR]
     [\fB-o\fR \fIyp_output_name\fR] [\fB-d\fR \fIyp_domain_name\fR]
     [\fB-m\fR \fIyp_master_name\fR] [\fB-S\fR \fIdelimiter\fR]
     [\fB-D\fR \fInumber_of_delimiters\fR] \fIinfile\fR \fIoutfile\fR
.fi

.LP
.nf
\fBmakedbm\fR [\fB-u\fR \fIdbmfilename\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The
.B makedbm
utility takes the
.I infile
and converts it to a pair
of files in
.B ndbm
format (see
.BR ndbm (3C)),
namely
\fIoutfile\fB\&.pag\fR and \fIoutfile\fB\&.dir.\fR Each line of the
input file is converted to a single
.B dbm
record. All characters up to
the first
.B TAB
or
.B SPACE
form the key, and the rest of the line is
the data. If a line ends with `\e' (backslash), the data for that record is
continued on to the next line.
.B makedbm
does not treat `#' (pound-sign)
as a special character.
.sp
.LP
Because
.B makedbm
is mainly used in generating
.B dbm
files for the
.B NIS
name service, it generates a special entry with the key
.IR yp_last_modified ,
which is the date of
.I infile
(or the current
time, if
.I infile
is `\(mi').  The entries that have keys with the
prefix
.I yp_
are interpreted by
.B NIS
server utilities.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -b
.ad
.RS 27n
.rt
Insert the
.B YP_INTERDOMAIN
into the output.  This key causes
.BR ypserv (1M)
to use
.B DNS
for host name and address lookups for
hosts not found in the maps.
.RE

.sp
.ne 2
.mk
.na
.BI -d " yp_domain_name"
.ad
.RS 27n
.rt
Create a special entry with the key
.IR yp_domain_name .
.RE

.sp
.ne 2
.mk
.na
.B -D
.I number_of delimiters
.ad
.RS 27n
.rt
Specify
.I number_of_delimiters
to skip before forming the key.
.RE

.sp
.ne 2
.mk
.na
.B -E
.ad
.RS 27n
.rt
Delimiters are escaped.
.RE

.sp
.ne 2
.mk
.na
.BI -i " yp_input_file"
.ad
.RS 27n
.rt
Create a special entry with the key
.IR yp_input_file .
.RE

.sp
.ne 2
.mk
.na
.B -l
.ad
.RS 27n
.rt
Lower case. Convert the keys of the given map to lower case, so that, for
example, host name matches succeed independent of upper or lower case
distinctions.
.RE

.sp
.ne 2
.mk
.na
.BI -m " yp_master_name"
.ad
.RS 27n
.rt
Create a special entry with the key
.IR yp_master_name .
If no master host
name is specified,
.I yp_master_name
is set to the local host name.
.RE

.sp
.ne 2
.mk
.na
.BI -o " yp_output_name"
.ad
.RS 27n
.rt
Create a special entry with the key
.IR yp_output_name .
.RE

.sp
.ne 2
.mk
.na
.B -s
.ad
.RS 27n
.rt
Secure map. Accept connections from secure
.B NIS
networks only.
.RE

.sp
.ne 2
.mk
.na
.B -S
.I delimiter
.ad
.RS 27n
.rt
Specify the
.I delimiter
to use instead of the default delimiter for
forming the key.
.RE

.sp
.ne 2
.mk
.na
.BI -u " dbmfilename"
.ad
.RS 27n
.rt
Undo a
.B dbm
file.  Prints out the file in text format, one entry per
line, with a single space separating keys from values.
.RE

.SH OPERANDS
.sp
.LP
The following operands are supported:
.sp
.ne 2
.mk
.na
.I infile
.ad
.RS 11n
.rt
Input file for
.BR makedbm .
If
.I infile
is `\fB\(mi\fR\&' (dash), the
standard input is read.
.RE

.sp
.ne 2
.mk
.na
.I outfile
.ad
.RS 11n
.rt
One of two output files in
.B ndbm
format: \fIoutfile\fB\&.pag\fR and
\fIoutfile\fB\&.dir.\fR
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.sp
.LP
.BR ypserv (1M),
.BR ndbm (3C),
.BR attributes (5)
