usr/src/man/man1m/makeuuid.1m
'\" te
.\" Copyright (c) 2008, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" Copyright (c) 1997 The Open Group
.\" Sun Microsystems, Inc. gratefully acknowledges
.\" The Open Group for permission to reproduce portions of its copyrighted documentation.
.\" Original documentation from The Open Group can be obtained online
.\" at http://www.opengroup.org/bookstore/.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH makeuuid 1M "6 Apr 2005" "SunOS 5.11" "System Administration Commands"
.SH NAME
makeuuid \- generate Universal Unique Identifiers
.SH SYNOPSIS
.LP
.nf
\fBmakeuuid\fR [\fB-e\fR \fIether\fR] [\fB-n\fR \fIcount\fR] [\fB-R\fR \fIroot\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The
.B makeuuid
command generates UUIDs (Universal Unique Identifiers)
conforming to the OSF DCE specification for UUIDs. The specification
states:
.sp
.LP
"A UUID is an identifier that is unique across both space and time, with
respect to the space of all UUIDs. A UUID can be used for multiple
purposes, from tagging objects with an extremely short lifetime, to reliably
identifying very persistent objects across a network.
.sp
.LP
"The generation of UUIDs does not require a registration authority for each
single identifier. Instead, it requires a unique value over space for each
UUID generator. This spatially unique value is [normally] specified as an
IEEE 802 address, which is usually already applied to network-connected
systems."
.sp
.LP
The
.B makeuuid
command generates one or more UUIDs on the standard
output.
.SH OPTIONS
.sp
.LP
The
.B makeuuid
command supports the following options:
.sp
.ne 2
.mk
.na
.B -e
.I ether
.ad
.RS 12n
.rt
Supplies an alternate address to be used in the generation of the UUIDs.
Normally, the system's Ethernet address is acquired and used during the
generation of a UUID. However, this requires root privileges to open and
read the network devices. If this is not possible, you must supply an
alternate Ethernet address.
.RE

.sp
.ne 2
.mk
.na
.B -n
.I count
.ad
.RS 12n
.rt
Generate multiple UUIDs. This option generates the specified number of
UUIDs, one per line. Using this form is more efficient than, and
functionally equivalent to, calling the
.B makeuuid
command multiple
times. This can be used, for example, when a large number of UUIDs need to
be generated for a given application.
.RE

.sp
.ne 2
.mk
.na
.B -R
.I root
.ad
.RS 12n
.rt
Use
.I root
as the root filesystem path when updating the shared state
file (see FILES). The shared state file must be writable by the user running
.BR makeuuid ,
otherwise no UUIDs will be generated and the command will
return in failure.
.LP
Note -
.sp
.RS 2
The root file system of any non-global zones must not be referenced with
the
.B -R
option. Doing so might damage the global zone's file system,
might compromise the security of the global zone, and might damage the
non-global zone's file system. See
.BR zones (5).
.RE
.RE

.SH USAGE
.sp
.LP
Normally, you run the
.B makeuuid
command with root privileges, as the
Ethernet address and state files can be easily accessed and updated. If this
is not possible, you must use the
.B -R
and
.B -e
options to specify
an alternate root and Ethernet address to use when calculating the UUIDs.
.SH EXAMPLES
.LP
.B Example 1
Generating Multiple UUIDs
.sp
.LP
The following command generates 3000 UUIDs:

.sp
.in +2
.nf
example# makeuuid -n 3000
.fi
.in -2
.sp

.LP
.B Example 2
Invoking Without Root Privileges
.sp
.LP
If you cannot obtain root privileges, you must specify an alternate
Ethernet address and state file location:

.sp
.in +2
.nf
example% makeuuid -e 11:22:33:44:55:66 -R /export/root/example2
.fi
.in -2
.sp

.sp
.LP
See the caveat on the use of the
.B -R
option in the description of that
option, above.

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 6n
.rt
Successful completion.
.RE

.sp
.ne 2
.mk
.na
.B 1
.ad
.RS 6n
.rt
Out of memory.
.RE

.sp
.ne 2
.mk
.na
.B -1
.ad
.RS 6n
.rt
Invalid Ethernet address given or access denied.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B /var/sadm/system/uuid_state
.ad
.sp .6
.RS 4n
UUID state file. Use of time values is one way that UUID generators, such
as
.BR makeuuid ,
guarantee uniqueness. A state file is a mechanism that
allows \fBmakeuuid\fR to "remember" the last time value it used so it can
increment that value for use in a new UUID. See the Internet Draft "UUIDs
and GUIDs," dated February 4, 1998, for details on the state file
mechanism.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWwsr2
.TE

.SH SEE ALSO
.sp
.LP
.BR prodreg (1M),
.BR intro (3),
.BR libwsreg (3LIB),
.BR attributes (5)
.SH NOTES
.sp
.LP
The formal UUID specification is in the OSF DCE specification, available at
.BR www.opengroup.org .
As of the date of publication of this man page, a
copy of the specification is available at:
.sp
.in +2
.nf
http://www.opengroup.org/onlinepubs/9629399/apdxa.htm
.fi
.in -2
.sp

.sp
.LP
Sun has no control over the availability of documents on the
.B www.opengroup.org
web site.
