usr/src/man/man1m/makedbm.1m
'\" te
.\" Copyright (c) 1999, Sun Microsystems, Inc.  Copyright 1989 AT&T  All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH makedbm 1M "17 Aug 1999" "SunOS 5.11" "System Administration Commands"
.SH NAME
makedbm \- make a dbm file, or get a text file from a dbm file
.SH SYNOPSIS
.LP
.nf
\fBmakedbm\fR [\fB-b\fR] [\fB-l\fR] [\fB-s\fR] [\fB-E\fR] [\fB-i\fR \fIyp_input_file\fR]
     [\fB-o\fR \fIyp_output_name\fR] [\fB-d\fR \fIyp_domain_name\fR]
     [\fB-m\fR \fIyp_master_name\fR] [\fB-S\fR \fIdelimiter\fR]
     [\fB-D\fR \fInumber_of_delimiters\fR] \fIinfile\fR \fIoutfile\fR
.fi

.LP
.nf
\fBmakedbm\fR [\fB-u\fR \fIdbmfilename\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The \fBmakedbm\fR utility takes the  \fIinfile\fR and converts it to a pair
of files in \fBndbm\fR format (see \fBndbm\fR(3C)), namely
\fIoutfile\fB\&.pag\fR and \fIoutfile\fB\&.dir.\fR Each line of the
input file is converted to a single \fBdbm\fR record. All characters up to
the first \fBTAB\fR or \fBSPACE\fR form the key, and the rest of the line is
the data. If a line ends with `\e' (backslash), the data for that record is
continued on to the next line. \fBmakedbm\fR does not treat `#' (pound-sign)
as a special character.
.sp
.LP
Because  \fBmakedbm\fR is mainly used in generating \fBdbm\fR files for the
\fBNIS\fR name service, it generates a special entry with the key
\fIyp_last_modified\fR, which is the date of \fIinfile\fR (or the current
time, if \fIinfile\fR is `\(mi').  The entries that have keys with the
prefix \fIyp_\fR are interpreted by \fBNIS\fR server utilities.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB-b\fR
.ad
.RS 27n
.rt
Insert the  \fBYP_INTERDOMAIN\fR into the output.  This key causes
\fBypserv\fR(1M) to use  \fBDNS\fR for host name and address lookups for
hosts not found in the maps.
.RE

.sp
.ne 2
.mk
.na
\fB-d\fI yp_domain_name\fR
.ad
.RS 27n
.rt
Create a special entry with the key \fIyp_domain_name\fR.
.RE

.sp
.ne 2
.mk
.na
\fB-D\fR \fInumber_of delimiters\fR
.ad
.RS 27n
.rt
Specify \fInumber_of_delimiters\fR to skip before forming the key.
.RE

.sp
.ne 2
.mk
.na
\fB-E\fR
.ad
.RS 27n
.rt
Delimiters are escaped.
.RE

.sp
.ne 2
.mk
.na
\fB-i\fI yp_input_file\fR
.ad
.RS 27n
.rt
Create a special entry with the key \fIyp_input_file\fR.
.RE

.sp
.ne 2
.mk
.na
\fB-l\fR
.ad
.RS 27n
.rt
Lower case. Convert the keys of the given map to lower case, so that, for
example, host name matches succeed independent of upper or lower case
distinctions.
.RE

.sp
.ne 2
.mk
.na
\fB-m\fI yp_master_name\fR
.ad
.RS 27n
.rt
Create a special entry with the key \fIyp_master_name\fR. If no master host
name is specified, \fIyp_master_name\fR is set to the local host name.
.RE

.sp
.ne 2
.mk
.na
\fB-o\fI yp_output_name\fR
.ad
.RS 27n
.rt
Create a special entry with the key \fIyp_output_name\fR.
.RE

.sp
.ne 2
.mk
.na
\fB-s\fR
.ad
.RS 27n
.rt
Secure map. Accept connections from secure  \fBNIS\fR networks only.
.RE

.sp
.ne 2
.mk
.na
\fB-S\fR \fIdelimiter\fR
.ad
.RS 27n
.rt
Specify the \fIdelimiter\fR to use instead of the default delimiter for
forming the key.
.RE

.sp
.ne 2
.mk
.na
\fB-u\fI dbmfilename\fR
.ad
.RS 27n
.rt
Undo a \fBdbm\fR file.  Prints out the file in text format, one entry per
line, with a single space separating keys from values.
.RE

.SH OPERANDS
.sp
.LP
The following operands are supported:
.sp
.ne 2
.mk
.na
\fIinfile\fR
.ad
.RS 11n
.rt
Input file for \fBmakedbm\fR. If \fIinfile\fR is `\fB\(mi\fR\&' (dash), the
standard input is read.
.RE

.sp
.ne 2
.mk
.na
\fIoutfile\fR
.ad
.RS 11n
.rt
One of two output files in \fBndbm\fR format: \fIoutfile\fB\&.pag\fR and
\fIoutfile\fB\&.dir.\fR
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.sp
.LP
\fBypserv\fR(1M), \fBndbm\fR(3C), \fBattributes\fR(5)
