usr/src/man/man1m/mdlogd.1m
'\" te
.\" Copyright (c) 2004, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH mdlogd 1M "3 Jun 2004" "SunOS 5.11" "System Administration Commands"
.SH NAME
mdlogd \- Solaris Volume Manager daemon
.SH SYNOPSIS
.LP
.nf
\fBmdlogd\fR
.fi

.SH DESCRIPTION
.sp
.LP
.B mdlogd
implements a simple daemon that watches the system console
looking for messages written by the Solaris Volume Manger. When a Solaris
Volume Manager message is detected,
.B mdlogd
sends a generic SNMP
trap.
.sp
.LP
To enable traps, you must configure
.B mdlogd
into the SNMP framework.
See\fR .
.SH USAGE
.sp
.LP
.B mdlogd
implements the following SNMP MIB:
.sp
.in +2
.nf
SOLARIS-VOLUME-MGR-MIB DEFINITIONS ::= BEGIN
        IMPORTS
                 enterprises FROM RFC1155-SMI
                 DisplayString FROM SNMPv2-TC;

        -- Sun Private MIB for Solaris Volume Manager


        sun       OBJECT IDENTIFIER ::= { enterprises 42 }
        sunSVM       OBJECT IDENTIFIER ::= { sun 104 }

        -- this is actually just the string from /dev/log that
        -- matches the md: regular expressions.
        -- This is an interim SNMP trap generator to provide
        -- information until a more complete version is available.

        -- this definition is a formalization of the old
        -- Solaris DiskSuite mdlogd trap mib.

        svmOldTrapString OBJECT-TYPE
                        SYNTAX DisplayString (SIZE (0..255))
                        ACCESS read-only
                        STATUS mandatory
                        DESCRIPTION
                        "This is the matched string that
                         was obtained from /dev/log."
        ::= { sunSVM 1 }

        -- SVM Compatibility ( error trap )

        svmNotice        TrapTRAP-TYPE
                        ENTERPRISE sunSVM
                        VARIABLES { svmOldTrapString }
                        DESCRIPTION
                                "SVM error log trap for NOTICE.
                                 This matches 'NOTICE: md:'"
        ::= 1

        svmWarningTrap  TRAP-TYPE
                        ENTERPRISE sunSVM
                        VARIABLES { svmOldTrapString }
                        DESCRIPTION
                                "SVM error log trap for WARNING..
                                 This matches 'WARNING: md:'"
        ::= 2

        svmPanicTrap    TRAP-TYPE
                        ENTERPRISE sunSVM
                        VARIABLES { svmOldTrapString }
                        DESCRIPTION
                                "SVM error log traps for PANIC..
                                This matches 'PANIC: md:'"
        ::= 3
END
.fi
.in -2

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWlvma, SUNWlvmr
_
Interface StabilityObsolete
.TE

.SH SEE ALSO
.sp
.LP
.BR snmpdx (1M),
.BR attributes (5)
.sp
.LP
\fR
