usr/src/man/man1m/mdmonitord.1m
'\" te
.\" Copyright (c) 2004, Sun Microsystems, Inc. All Rights Reserved.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH mdmonitord 1M "25 Jul 2004" "SunOS 5.11" "System Administration Commands"
.SH NAME
mdmonitord \- daemon to monitor metadevices
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/mdmonitord\fR [\fB-t\fR \fItime_interval\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The
.B mdmonitord
utility is part of Solaris Volume Manager. It monitors
and checks RAID1 (mirrors), RAID5 and hot spares.
.sp
.LP
There are two methods for checking:
.RS +4
.TP
.ie t \(bu
.el o
At fixed time intervals.
.RE
.RS +4
.TP
.ie t \(bu
.el o
When a RAID-1 (mirror), RAID-5, or hot spare fails. A failure generates  an
error event which triggers a check of these metadevices.
.RE
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -t
.ad
.RS 6n
.rt
Time interval in seconds.  The default value is 0, which causes probes to
occur only upon an error. If you want to run
.B mdmonitord
at a regular
interval, a value of 1800 (seconds, every half hour) is recommended as a
starting point.
.RE

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 6n
.rt
Successful completion.
.RE

.sp
.ne 2
.mk
.na
.B >0
.ad
.RS 6n
.rt
An error occurred.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWmdu
.TE

.SH SEE ALSO
.sp
.LP
.BR svcs (1),
.BR metaclear (1M),
.BR metadb (1M),
.BR metadetach (1M),
.BR metahs (1M),
.BR metainit (1M),
.BR metaoffline (1M),
.BR metaonline (1M),
.BR metaparam (1M),
.BR metarecover (1M),
.BR metarename (1M),
.BR metareplace (1M),
.BR metaroot (1M),
.BR metaset (1M),
.BR metassist (1M),
.BR metastat (1M),
.BR metasync (1M),
.BR metattach (1M),
.BR svcadm (1M),
.BR md.tab (4),
.BR md.cf (4),
.BR mddb.cf (4),
.BR md.tab (4),
.BR attributes (5),
.BR smf (5),
.BR md (7D)
.sp
.LP
\fR
.SH NOTES
.sp
.LP
Since frequent probes can affect performance, it is recommended that the
intervals between probes be limited.
.sp
.LP
The
.B mdmonitord
service is managed by the service management facility,
.BR smf (5),
under the service identifier:
.sp
.in +2
.nf
svc:/system/mdmonitor
.fi
.in -2
.sp

.sp
.LP
Administrative actions on this service, such as enabling, disabling, or
requesting restart, can be performed using
.BR svcadm (1M).
The service's
status can be queried using the
.BR svcs (1)
command.
