usr/src/man/man1m/metastat.1m
'\" te
.\" Copyright (c) 2004, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH metastat 1M "26 Mar 2006" "SunOS 5.11" "System Administration Commands"
.SH NAME
metastat \- display status for metadevice or hot spare pool
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/metastat\fR \fB-h\fR
.fi

.LP
.nf
\fB/usr/sbin/metastat\fR [\fB-a\fR] [\fB-B\fR] [\fB-D\fR] [\fB-c\fR] [\fB-i\fR] [\fB-p\fR] [\fB-q\fR]
     [\fB-s\fR \fIsetname\fR] [\fB-t\fR] [\fImetadevice.\|.\|.\fR] [\fIhot_spare_pool\fR.\|.\|.]
.fi

.LP
.nf
\fB/usr/sbin/metastat\fR [\fB-a\fR] [\fB-B\fR] [\fB-D\fR] [\fB-c\fR] [\fB-i\fR] [\fB-p\fR] [\fB-q\fR]
     [\fB-s\fR \fIsetname\fR] \fIcomponent\fR.\|.\|.
.fi

.SH DESCRIPTION
.sp
.LP
The
.B metastat
command displays the current status for each metadevice
(including stripes, concatenations, concatenations of stripes, mirrors,
RAID5, soft partitions, and trans devices) or hot spare pool, or of
specified metadevices, components, or hot spare pools.
.sp
.LP
It is helpful to run the
.B metastat
command after using the
.B metattach
command to view the status of the metadevice.
.sp
.LP
.B metastat
displays the state of each Solaris Volume Manager RAID-1
volume on the system. The possible states include:
.sp
.ne 2
.mk
.na
.B Okay
.ad
.RS 21n
.rt
The device reports no errors.
.RE

.sp
.ne 2
.mk
.na
.B Needs maintenance
.ad
.RS 21n
.rt
A problem has been detected. This requires that the system administrator
replace the failed physical device. Volumes displaying \fBNeeds
maintenance\fR have incurred no data loss, although additional failures
could risk data loss. Take action as quickly as possible.
.RE

.sp
.ne 2
.mk
.na
.B Last erred
.ad
.RS 21n
.rt
A problem has been detected. Data loss is a possibility. This might occur
if a component of a submirror fails and is not replaced by a hot spare,
therefore going into
.B "Needs maintenance"
state. If the corresponding
component also fails, it would go into
.B "Last erred"
state and, as there
is no remaining valid data source, data loss could be a possibility.
.RE

.sp
.ne 2
.mk
.na
.B Unavailable
.ad
.RS 21n
.rt
A device cannot be accessed, but has not incurred errors. This might occur
if a physical device has been removed with Solaris Dynamic Reconfiguration
(DR) features, thus leaving the Solaris Volume Manager volume unavailable.
It could also occur if an array or disk is powered off at system
initialization, or if a >1TB volume is present when the system is booted in
32-bit mode.
.sp
After the storage has been made available, run the
.B metastat
command
with the
.B -i
option to update the status of the metadevices. This
clears the unavailable state for accessible devices.
.RE

.sp
.LP
See the\fR  for instructions on replacing disks and handling volumes in
Needs maintenance or Last erred states.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -a
.ad
.RS 14n
.rt
Display all disk sets. Only metadevices in disk sets that are owned by the
current host are displayed.
.RE

.sp
.ne 2
.mk
.na
.B -B
.ad
.RS 14n
.rt
Display the current status of all of the 64-bit metadevices and hot
spares.
.RE

.sp
.ne 2
.mk
.na
.B -c
.ad
.RS 14n
.rt
Display concise output.
.sp
There is one line of output for each metadevice. The output shows the basic
structure and the error status, if any, for each metadevice.
.sp
The
.B -c
output format is distinct from the
.B -p
output format. The
.B -p
option does not display metadevice status and is not intended as
human-readable output.
.RE

.sp
.ne 2
.mk
.na
.B -D
.ad
.RS 14n
.rt
Display the current status of all of the descriptive name metadevices and
hotspares.
.RE

.sp
.ne 2
.mk
.na
.B -h
.ad
.RS 14n
.rt
Display usage message.
.RE

.sp
.ne 2
.mk
.na
.B -i
.ad
.RS 14n
.rt
Check the status of RAID-1 (mirror) volumes, RAID-5 volumes, and hot
spares. The inquiry checks each metadevice for accessibility, starting at
the top level metadevice. When problems are discovered, the metadevice state
databases are updated as if an error had occurred.
.RE

.sp
.ne 2
.mk
.na
.B -p
.ad
.RS 14n
.rt
Display the list of active metadevices and hot spare pools in the same
format as
.BR md.tab .
See
.BR md.tab (4).
.sp
The
.B -p
output is designed for snapshotting the configuration for
later recovery or setup.
.RE

.sp
.ne 2
.mk
.na
.B -q
.ad
.RS 14n
.rt
Display the status for metadevices without the device relocation
information.
.RE

.sp
.ne 2
.mk
.na
.B -s
.I setname
.ad
.RS 14n
.rt
Specify the name of the disk set on which
.B metastat
works. Using the
.B -s
option causes the command to perform its administrative function
within the specified disk set. Without this option, the command performs its
function on metadevices and hot spare pools in the local disk set.
.RE

.sp
.ne 2
.mk
.na
.B -t
.ad
.RS 14n
.rt
Display the current status and timestamp for the specified metadevices and
hot spare pools. The timestamp provides the date and time of the last state
change.
.RE

.SH OPERANDS
.sp
.LP
The following operands are supported:
.sp
.ne 2
.mk
.na
.I component
.ad
.RS 18n
.rt
Display the status of the component hosting a soft partition, including
extents, starting blocks, and block count.
.RE

.sp
.ne 2
.mk
.na
.I hot_spare_pool
.ad
.RS 18n
.rt
Display the status of the specified hot spare pool(s).
.RE

.sp
.ne 2
.mk
.na
.I metadevice
.ad
.RS 18n
.rt
Display the status of the specified metadevice(s). If a trans metadevice is
specified, the status of the master and log devices is also displayed. Trans
metadevices have been replaced by UFS logging. See
.BR NOTES .
.RE

.SH EXAMPLES
.LP
.B Example 1
Output Showing Mirror with Two Submirrors
.sp
.LP
The following example shows the partial output of the
.BR metastat
command after creating a mirror,
.BR opt_mirror ,
consisting of two
submirrors,
.B opt_sub1
and
.BR opt_sub2 .

.sp
.in +2
.nf
# metastat opt_mirror
opt_mirror: Mirror
    Submirror 0: opt_sub1
      State: Okay
    Submirror 1: opt_sub2
      State: Resyncing
    Resync in progress: 15 % done
    Pass: 1
    Read option: roundrobin (default)
    Write option: parallel (default)
    Size: 2006130 blocks
    .
    .
    .
.fi
.in -2
.sp

.LP
.B Example 2
Soft Partition on Mirror with Submirror
.sp
.LP
The following example shows the partial output of the
.BR metastat
command after creating a soft partition,
.BR d3 ,
on concat
.BR d2 ,
which
is built on a soft partition.

.sp
.in +2
.nf
# metastat
d2: Concat/Stripe
    Size: 204800 blocks
    Stripe 0:
        Device              Start Block  Dbase State        Hot Spare
        d0                         0     No    Okay

d0: Soft Partition
    Component: c0t3d0s0
    Status: Okay
    Size: 204800 blocks
        Extent              Start Block  Block count
             0                      129       204800

d3: Soft Partition
    Component: d2
    Status: Okay
    Size: 202752 blocks
         Extent              Start Block  Block count
              0                      129       202752
.fi
.in -2
.sp

.LP
.B Example 3
Trans Metadevice
.sp
.LP
The following example shows the output of the
.B metastat
command after
creating a trans metadevice.

.sp
.in +2
.nf
# metastat
d2: Concat/Stripe
    Size: 204800 blocks
    Stripe 0:
        Device              Start Block  Dbase State        Hot Spare
        d0                         0     No    Okay

d0: Soft Partition
    Component: c0t3d0s0
    Status: Okay
    Size: 204800 blocks
        Extent              Start Block  Block count
             0                      129       204800

d3: Soft Partition
    Component: d2
    Status: Okay
    Size: 202752 blocks
         Extent              Start Block  Block count
              0                      129       202752
.fi
.in -2
.sp

.LP
.B Example 4
Multi-owner disk set
.sp
.LP
The following example shows the output of the
.B metastat
command with a
multi-owner disk set and application-based mirror resynchronization option.
Application-based resynchronization is set automatically if needed.

.sp
.in +2
.nf
# metastat -s oban
oban/d100: Mirror
    Submirror 0: oban/d10
      State: Okay
    Submirror 1: oban/d11
      State: Okay
    Pass: 1
    Read option: roundrobin (default)
    Write option: parallel (default)
    Resync option: application based
    Owner: None
    Size: 1027216 blocks (501 MB)

oban/d10: Submirror of oban/d100
    State: Okay
    Size: 1027216 blocks (501 MB)
    Stripe 0:
        Device     Start Block  Dbase     State Reloc Hot Spare
        c1t3d0s0          0     No         Okay

oban/d11: Submirror of oban/d100
    State: Okay
    Size: 1027216 blocks (501 MB)
    Stripe 0:
        Device     Start Block  Dbase     State Reloc Hot Spare
        c1t4d0s0          0     No         Okay
.fi
.in -2
.sp

.SH WARNINGS
.sp
.LP
.B metastat
displays states as of the time the command is entered. It is
unwise to use the output of the
.B "metastat -p"
command to create a
.BR md.tab (4)
file for a number of reasons:
.RS +4
.TP
.ie t \(bu
.el o
The output of
.B "metastat -p"
might show hot spares being used.
.RE
.RS +4
.TP
.ie t \(bu
.el o
It might show mirrors with multiple submirrors. See \fBmetainit\fR(1M) for
instructions for creating multi-way mirrors using
.B metainit
and
.BR metattach .
.RE
.RS +4
.TP
.ie t \(bu
.el o
A slice may go into an error state after
.B "metastat -p"
is
issued.
.RE
.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 6n
.rt
Successful completion.
.RE

.sp
.ne 2
.mk
.na
.B >0
.ad
.RS 6n
.rt
An error occurred.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWmdr
_
Interface StabilityStable
.TE

.SH SEE ALSO
.sp
.LP
.BR mdmonitord (1M),
.BR metaclear (1M),
.BR metadb (1M),
.BR metadetach (1M),
.BR metahs (1M),
.BR metainit (1M),
.BR metaoffline (1M),
.BR metaonline (1M),
.BR metaparam (1M),
.BR metarecover (1M),
.BR metarename (1M),
.BR metareplace (1M),
.BR metaroot (1M),
.BR metaset (1M),
.BR metassist (1M),
.BR metasync (1M),
.BR metattach (1M),
.BR md.tab (4),
.BR md.cf (4),
.BR mddb.cf (4),
.BR md.tab (4),
.BR attributes (5),
.BR md (7D)
.sp
.LP
\fR
.SH NOTES
.sp
.LP
Trans metadevices have been replaced by UFS logging. Existing trans devices
are
.B not
logging--they pass data directly through to the underlying
device. See \fBmount_ufs\fR(1M) for more information about UFS logging.
