usr/src/man/man1m/metahs.1m
'\" te
.\" Copyright (c) 2003, Sun Microsystems, Inc. All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH metahs 1M "26 Mar 2006" "SunOS 5.11" "System Administration Commands"
.SH NAME
metahs \- manage hot spares and hot spare pools
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/metahs\fR [\fB-s\fR \fIsetname\fR] \fB-a\fR all \fIcomponent\fR
.fi

.LP
.nf
\fB/usr/sbin/metahs\fR [\fB-s\fR \fIsetname\fR] \fB-a\fR \fIhot_spare_pool\fR [\fIcomponent\fR]
.fi

.LP
.nf
\fB/usr/sbin/metahs\fR [\fB-s\fR \fIsetname\fR] \fB-d\fR \fIhot_spare_pool\fR [\fIcomponent\fR]
.fi

.LP
.nf
\fB/usr/sbin/metahs\fR [\fB-s\fR \fIsetname\fR] \fB-d\fR all \fIcomponent\fR
.fi

.LP
.nf
\fB/usr/sbin/metahs\fR [\fB-s\fR \fIsetname\fR] \fB-e\fR \fIcomponent\fR
.fi

.LP
.nf
\fB/usr/sbin/metahs\fR [\fB-s\fR \fIsetname\fR] \fB-r\fR \fIhot_spare_pool\fR \fIcomponent-old\fR
.fi

.LP
.nf
\fB/usr/sbin/metahs\fR [\fB-s\fR \fIsetname\fR] \fB-r\fR all \fIcomponent-old\fR \fIcomponent-new\fR
.fi

.LP
.nf
\fB/usr/sbin/metahs\fR [\fB-s\fR \fIsetname\fR] \fB-i\fR [\fIhot_spare_pool\fR]...
.fi

.SH DESCRIPTION
.sp
.LP
The
.B metahs
command manages existing hot spares and hot spare pools.
It is used to add, delete, enable, and replace components (slices) in hot
spare pools. Like the
.B metainit
command, the
.B metahs
command can
also create an initial hot spare pool. The
.B metahs
command does not
replace a component of a metadevice. This function is performed by the
\fBmetareplace\fR command.
.sp
.LP
Hot spares are always in one of three states: available, in-use, or broken.
Available hot spares are running and ready to accept data, but are not
currently being written to or read from. In-use hot spares are currently
being written to and read from. Broken hot spares are out of service and
should be repaired. The status of hot spares is displayed when \fBmetahs\fR
is invoked with the
.B -i
option.
.sp
.LP
Solaris Volume Manager supports storage devices and logical volumes,
including hot spares, greater than 1 terabyte (TB) when Solaris 10 is
running a 64-bit kernel.
.sp
.LP
If a system with large volumes or hot spares is rebooted under a 32-bit
.RB "Solaris 10 kernel, the large volumes are visible through" " metastat"
output, but they cannot be accessed, modified or deleted, and no new large
volumes can be created. Any volumes or file systems on a large volume in
this situation are also unavailable. If a system with large volumes is
rebooted under a version of Solaris prior to Solaris 10, Solaris Volume
Manager will not start. All large volumes must be removed before Solaris
Volume Manager runs under another version of the Solaris Operating
Environment. 
.SH OPTIONS
.sp
.LP
Root privileges are required for any of the following options except
.BR -i .
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB-a all\fR \fIcomponent\fR
.ad
.sp .6
.RS 4n
Add
.I component
to all hot spare pools.
.B all
is not case
sensitive.
.RE

.sp
.ne 2
.mk
.na
\fB-a\fR \fIhot_spare_pool\fR \fB[\fIcomponent\fB]\fR
.ad
.sp .6
.RS 4n
Add the
.I component
to the specified
.IR hot_spare_pool .
\fIhot_spare_pool\fR is created if it does not already exist.
.RE

.sp
.ne 2
.mk
.na
\fB-d all\fR \fIcomponent\fR
.ad
.sp .6
.RS 4n
Delete
.I component
from all the hot spare pools. The \fIcomponent\fR
cannot be deleted if it is in the in-use state.
.RE

.sp
.ne 2
.mk
.na
\fB-d\fR \fIhot_spare_pool\fR \fB[\fIcomponent\fB]\fR
.ad
.sp .6
.RS 4n
Delete
.IR hot_spare_pool ,
if the
.I hot_spare_pool
is both empty and
not referenced by a metadevice. If
.I component
is specified, it is
deleted from the
.IR hot_spare_pool .
Hot spares in the in-use state cannot
be deleted.
.RE

.sp
.ne 2
.mk
.na
\fB-e\fR \fIcomponent\fR
.ad
.sp .6
.RS 4n
Enable
.I component
to be available for use as a hot spare. The
\fIcomponent\fR can be enabled if it is in the broken state and has been
repaired. 
.RE

.sp
.ne 2
.mk
.na
\fB-i\fR \fB[\fIhot_spare_pool\fB\|.\|.\|.]\fR
.ad
.sp .6
.RS 4n
Display the status of the specified
.I hot_spare_pool
or for all hot
spare pools if one is not specified.
.RE

.sp
.ne 2
.mk
.na
\fB-r all\fR \fIcomponent-old component-new\fR
.ad
.sp .6
.RS 4n
Replace
.I component-old
with
.I component-new
in all hot spare pools
which have the component associated. Components cannot be replaced from any
hot spare pool if the old hot spare is in the in-use state.
.RE

.sp
.ne 2
.mk
.na
\fB-r\fR \fIhot_spare_pool component-old component-new\fR
.ad
.sp .6
.RS 4n
Replace
.I component-old
with
.I component-new
in the specified
.IR hot_spare_pool .
Components cannot be replaced from a hot spare pool if
the old hot spare is in the in-use state.
.RE

.sp
.ne 2
.mk
.na
\fB-s\fR \fIsetname\fR
.ad
.sp .6
.RS 4n
Specify the name of the diskset on which
.B metahs
works. Using the
\fB-s\fR option causes the command to perform its administrative function
within the specified diskset. Without this option, the command performs its
function on local hot spare pools.
.RE

.SH OPERANDS
.sp
.LP
The following operands are supported:
.sp
.ne 2
.mk
.na
.I component
.ad
.RS 18n
.rt
The logical name for the physical slice (partition) on a disk drive, such
as
.BR /dev/dsk/c0t0d0s2 .
.RE

.sp
.ne 2
.mk
.na
.I hot_spare_pool
.ad
.RS 18n
.rt
Names for hot spare pools can be any legal file name that is composed of
alphanumeric characters, a dash ("-"), an underscore ("_"), or a period
("."). Names must begin with a letter. The words "all" and "none" are
reserved and cannot be used.
.RE

.SH EXAMPLES
.LP
\fBExample 1\fR Adding a Hot Spare to a Hot Spare Pool
.sp
.LP
The following example adds a hot spare
.B /dev/dsk/c0t0d0s7
to a hot
spare pool
.BR mirror1_pool :

.sp
.in +2
.nf
# metahs -a mirror1_pool c0t0d0s7
.fi
.in -2
.sp

.sp
.LP
When the hot spare is added to the pool, the existing order of the hot
spares already in the pool is preserved. The new hot spare is added at the
end of the list of hot spares in the hot spare pool specified.

.LP
\fBExample 2\fR Adding a Hot Spare to All Currently Defined Pools
.sp
.LP
This example adds a hot spare to the hot spare pools that are currently
defined:

.sp
.in +2
.nf
# metahs -a all c0t0d0s7
.fi
.in -2
.sp

.sp
.LP
The keyword
.B all
in this example specifies adding the hot spare,
.BR /dev/dsk/c0t0d0s7 ,
to all the hot spare pools.

.LP
\fBExample 3\fR Deleting a Hot Spare
.sp
.LP
This example deletes a hot spare,
.BR /dev/dsk/c0t0d0s7 ,
from a hot spare
pool, \fBhsp003\fR:

.sp
.in +2
.nf
# metahs -d hsp003 c0t0d0s7
.fi
.in -2
.sp

.sp
.LP
When you delete a hot spare, the position of the remaining hot spares in
the pool changes to reflect the new order. For instance, if in this example
\fB/dev/dsk/c0t0d0s7\fR were the second of three hot spares, after deletion
the third hot spare would move to the second position.

.LP
\fBExample 4\fR Replacing a Hot Spare
.sp
.LP
This example replaces a hot spare that was previously defined:

.sp
.in +2
.nf
# metahs -r hsp001 c0t1d0s0 c0t3d0s0
.fi
.in -2
.sp

.sp
.LP
In this example, the hot spare
.B /dev/dsk/c0t1d0s0
is replaced by
.BR /dev/dsk/c0t3d0s0 .
The order of the hot spares does not change.

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 6n
.rt
Successful completion.
.RE

.sp
.ne 2
.mk
.na
.B >0
.ad
.RS 6n
.rt
An error occurred.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWmdu
_
Interface StabilityStable
.TE

.SH SEE ALSO
.sp
.LP
.BR mdmonitord (1M),
.BR metaclear (1M),
.BR metadb (1M),
.BR metadetach (1M),
.BR metainit (1M),
\fBmetaoffline\fR(1M),
.BR metaonline (1M),
.BR metaparam (1M),
.BR metarecover (1M),
.BR metarename (1M),
.BR metareplace (1M),
.BR metaroot (1M),
.BR metaset (1M),
.BR metassist (1M),
.BR metastat (1M),
.BR metasync (1M),
.BR metattach (1M),
.BR md.tab (4),
\fBmd.cf\fR(4),
\fBmddb.cf\fR(4), \fBmd.tab\fR(4),
.BR attributes (5),
.BR md (7D)
.sp
.LP
\fR
.SH WARNINGS
.sp
.LP
Do not create large (>1 TB) volumes if you expect to run the Solaris
Operating Environment with a 32-bit kernel or if you expect to use a version
of the Solaris Operating Environment prior to Solaris 10.
