usr/src/man/man1m/metassist.1m
'\" te
.\" Copyright (c) 2004, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH metassist 1M "22 Feb 2005" "SunOS 5.11" "System Administration Commands"
.SH NAME
metassist \- automated volume creation utility to support Solaris Volume
Manager
.SH SYNOPSIS
.LP
.nf
\fBmetassist\fR \fB-V\fR
.fi

.LP
.nf
\fBmetassist\fR \fB-?\fR
.fi

.LP
.nf
\fBmetassist\fR create [\fB-v\fR \fIn\fR] [\fB-c\fR] \fB-F\fR \fIconfig_file\fR
.fi

.LP
.nf
\fBmetassist\fR create [\fB-v\fR \fIn\fR] [\fB-c\fR | \fB-d\fR] \fB-F\fR \fIrequest_file\fR
.fi

.LP
.nf
\fBmetassist\fR create [\fB-v\fR \fIn\fR] [\fB-c\fR | \fB-d\fR] [\fB-f\fR] [\fB-n\fR \fIname\fR]
     [\fB-p\fR \fIdatapaths\fR] [\fB-r\fR \fIredundancy\fR]
     [\fB-a\fR \fIavailable\fR [,\fIavailable\fR,\&.\|.\|.]]
     [\fB-u\fR \fIunavailable\fR [,\fIunavailable\fR,\&.\|.\|.]] \fB-s\fR \fIsetname\fR \fB-S\fR \fIsize\fR
.fi

.LP
.nf
\fBmetassist\fR create \fB-?\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B metassist
command provides assistance, through automation, with
common Solaris Volume Manager tasks.
.SS "SUBCOMMANDS"
.sp
.LP
The following subcommands are supported:
.sp
.ne 2
.mk
.na
.B create
.ad
.RS 10n
.rt
The
.B create
subcommand creates one or more Solaris Volume Manager
volumes. You can specify this request on the command line or in a file
specified on the command line.
.sp
If you create a volume using the command line, you can specify the
characteristics of the volume in terms of the desired quality of service it
will provide - its size, the number of redundant copies of the data it
contains, the number of data paths by which it is accessible, and whether
faulty components are replaced automatically. The diskset in which the
volume will reside and the volume's size must be specified on the command
line in this form of the command.
.sp
If you create a volume using a request in a file, you can specify the
characteristics of the volume in terms of the quality of service they
provide, as on the command line. Alternatively, the file can specify the
types and component parts of the volume, (for example, mirrors, stripes,
concatenations, and their component slices). The file may also specify
volumes partly in terms of their types and partly in terms of their
component parts, and may specify the characteristics of more than one
volume. All volumes specified in a file must reside in the same diskset,
whose name must be specified in the file.
.sp
If you specify the
.B -c
or
.B -d
option on the command line, the
command runs without creating an actual volume or volumes. Instead, it
outputs either a a Bourne shell command script (\fB-c\fR option) or a volume
configuration (\fB-d\fR option). The command script, when run, creates the
specified volume or volumes. The volume configuration specifies the volume
or volumes in complete detail, naming all their components.
.sp
The input file given on the command line can take one of the following
forms:
.RS +4
.TP
.ie t \(bu
.el o
a volume request, which specifies a request for a volume with explicit
attributes and components, or matching a given quality of service
.RE
.RS +4
.TP
.ie t \(bu
.el o
a volume configuration, produced by a previous execution of the command
.RE
.RE

.SH OPTIONS
.sp
.LP
The following option is mandatory if you specify a volume request or volume
configuration in a file:
.sp
.ne 2
.mk
.na
.B -F
.I config_file
|
.I request_file
.ad
.sp .6
.RS 4n
Specify the volume request or volume configuration file to process. If
.I config_file
or
.I request_file
is
.BR - ,
it is read from standard
input.
.sp
The
.B -d
option cannot be specified when
.I inputfile
is a volume
configuration file.
.RE

.sp
.LP
The following options are mandatory if you specify a volume request on the
command line:
.sp
.ne 2
.mk
.na
.B -s
.I set
.ad
.RS 11n
.rt
Specify the disk set to use when creating volumes. All the volumes and hot
spare pools are created in this disk set. If necessary, disks are moved into
the diskset for use in the volumes and hot spare pools. If the diskset
doesn't exist the command creates it. This option is required.
.B metassist
works entirely within a named disk set. Use of the local, or
unnamed disk set, is not allowed.
.RE

.sp
.ne 2
.mk
.na
.B -S
.I size
.ad
.RS 11n
.rt
Specify the size of the volume to be created. The size argument consists of
a numeric value (a decimal can be specified) followed by KB, MB, GB, or TB,
indicating kilobytes, megabytes, gigabytes, or terabytes, respectively. Case
is ignored when interpreting this option. This option is required.
.RE

.sp
.LP
The following options are optional command line parameters:
.sp
.ne 2
.mk
.na
\fB-a\fR \fIdevice1\fB,\fIdevice2\fB,.\|.\|.\fR
.ad
.RS 26n
.rt
Explicitly specify the devices that can be used in the creation of this
volume. Named devices may be controllers or disks. Only used when specifying
a volume on the command line.
.RE

.sp
.ne 2
.mk
.na
.B -c
.ad
.RS 26n
.rt
Output the command script that would implement the specified or generated
volume configuration. The command script is not run, and processing stops at
this stage.
.RE

.sp
.ne 2
.mk
.na
.B -d
.ad
.RS 26n
.rt
Output the volume configuration that satisfies the specified or generated
volume request. No command script is generated or executed, and processing
stops at this stage.
.RE

.sp
.ne 2
.mk
.na
.B -f
.ad
.RS 26n
.rt
Specify whether the volume should support automatic component replacement
after a fault. If this option is specified, a mirror is created and its
submirrors are associated with a hot spare.
.RE

.sp
.ne 2
.mk
.na
.B -n
.I name
.ad
.RS 26n
.rt
Specify the name of the new volume. See
.BR metainit (1M)
for naming
guidelines.
.RE

.sp
.ne 2
.mk
.na
.B -p
.I n
.ad
.RS 26n
.rt
Specify the number of required paths to the storage volume. The value of
.I n
cannot be greater than the number of different physical paths and
logical paths to attached storage. Only used when specifying a volume on the
command line.
.RE

.sp
.ne 2
.mk
.na
.B -r
.I n
.ad
.RS 26n
.rt
Specify the redundancy level
.RB ( 0 -\fB4\fR)
of the data. The default is
.BR 0 .
Only used when specifying a volume on the command line. If
redundancy is
.BR 0 ,
a stripe is created. If redundancy is
.B 1
or
greater, a mirror with this number of submirrors is created. In this case,
the volume can suffer a disk failure on
.IB n -1
copies without data
loss. With the use of hot spares (see the
.B -f
option), a volume can
suffer a disk failure on
.IB n +hsps-1
volumes without data loss,
assuming non-concurrent failures.
.RE

.sp
.ne 2
.mk
.na
\fB-u\fR \fIdevice1\fB,\fIdevice2\fB,.\|.\|.\fR
.ad
.RS 26n
.rt
Explicitly specify devices to exclude in the creation of this volume. Named
devices can be controllers or disks. You can use this option alone, or to
exclude some of the devices listed as available with the
.B -a
option,
Only used when specifying a volume on the command line.
.RE

.sp
.ne 2
.mk
.na
.B -v
.I value
.ad
.RS 26n
.rt
Specify the level of verbosity. Values from
.B 0
to
.B 2
are
available, with higher numbers specifying more verbose output when the
command is run.
.B "-v 0"
indicates silent output, except for errors
or other critical messages. The default level is
.BR 1 .
.RE

.sp
.ne 2
.mk
.na
.B -V
.ad
.RS 26n
.rt
Display program version information.
.RE

.sp
.ne 2
.mk
.na
.B -?
.ad
.RS 26n
.rt
Display help information. This option can follow a subcommand for
subcommand-specific help.
.RE

.SH EXAMPLES
.LP
.B Example 1
Creating a Mirror
.sp
.LP
The following example creates a two-way, 36Gb mirror on available devices
from controller 1 and controller 2. It places the volume in diskset
.BR mirrorset .

.sp
.in +2
.nf
# metassist create -r 2 -a c1,c2 -s mirrorset -S 36GB
.fi
.in -2
.sp

.LP
.B Example 2
Creating a Mirror with Additional Fault Tolerance
.sp
.LP
The following example creates a two-way, 36Gb mirror on available devices
from controller 1 and controller 2. It provides additional fault tolerance
in the form of a hot spare. It places the volume in diskset
.BR mirrorset .

.sp
.in +2
.nf
# metassist create -f -r 2 -a c1,c2 -s mirrorset -S 36GB
.fi
.in -2
.sp

.LP
.B Example 3
Creating a Three-way Mirror and Excluding Devices
.sp
.LP
The following example creates a three-way, 180Gb mirror from storage
.RB "devices on controller 1 or controller 2. It excludes the disks" " c1t2d0"
and
.B c2t2d1
from the volume. It places the volume in diskset
.BR mirrorset .

.sp
.in +2
.nf
metassist create -r 3 -a c1,c2 -u c1t2d0, c2t2d1 \e
	-s mirrorset -S 180GB
.fi
.in -2
.sp

.LP
.B Example 4
Determining and Implementing a Configuration
.sp
.LP
The following example determines and implements a configuration satisfying
the request specified in a request file:

.sp
.in +2
.nf
# metassist create -F request.xml
.fi
.in -2
.sp

.LP
.B Example 5
Determining a Configuration and Saving It in a
volume-config File
.sp
.LP
The following example determines a configuration which satisfies the given
request. It saves the configuration in a volume-config file without
implementing it:

.sp
.in +2
.nf
# metassist create -d -F request.xml > volume-config
.fi
.in -2
.sp

.LP
.B Example 6
Determining a Configuration and Saving It in a Shell
Script
.sp
.LP
The following example determines a configuration which satisfies the given
request. It saves the configuration in a shell script without implementing
it:

.sp
.in +2
.nf
# metassist create -c -F request.xml > setupvols.sh
.fi
.in -2
.sp

.LP
.B Example 7
Implementing the Given volume-config
.sp
.LP
The following example implements the given volume-config:

.sp
.in +2
.nf
# metassist create -F config.xml
.fi
.in -2
.sp

.LP
.B Example 8
Converting the Given volume-config to a Shell Script
.sp
.LP
The following example converts the given volume-config to a shell script
that you can run later:

.sp
.in +2
.nf
# metassist create -c -F config.xml > setupvols.sh
.fi
.in -2
.sp

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 6n
.rt
Successful completion.
.RE

.sp
.ne 2
.mk
.na
.B >0
.ad
.RS 6n
.rt
An error occurred.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B /usr/share/lib/xml/dtd/volume-request.dtd
.ad
.sp .6
.RS 4n

.RE

.sp
.ne 2
.mk
.na
.B /usr/share/lib/xml/dtd/volume-defaults.dtd
.ad
.sp .6
.RS 4n

.RE

.sp
.ne 2
.mk
.na
.B /usr/share/lib/xml/dtd/volume-config.dtd
.ad
.sp .6
.RS 4n

.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWmdr
_
Inteface StabilityStable
.TE

.SH SEE ALSO
.sp
.LP
.BR mdmonitord (1M),
.BR metaclear (1M),
.BR metadb (1M),
.BR metadetach (1M),
.BR metahs (1M),
.BR metainit (1M),
.BR metaoffline (1M),
.BR metaonline (1M),
.BR metaparam (1M),
.BR metarecover (1M),
.BR metarename (1M),
.BR metareplace (1M),
.BR metaroot (1M),
.BR metaset (1M),
.BR metastat (1M),
.BR metasync (1M),
.BR metattach (1M),
.BR md.tab (4),
.BR md.cf (4),
.BR mddb.cf (4),
.BR md.tab (4),
.BR volume-config (4),
.BR volume-request (4),
.BR attributes (5),
.BR md (7D)
.SH NOTES
.sp
.LP
The quality of service arguments are mutually exclusive with the
.BR -F
.I inputfile
argument.
.sp
.LP
When specifying a request file or quality of service arguments on the
command line, the
.B /etc/default/metassist.xml
file is read for global
and per-disk set defaults.
.sp
.LP
Characteristics of this file are specified in the DTD, in
.BR /usr/share/lib/xml/dtd/volume-defaults.dtd .
.sp
.LP
Characteristics of the XML request file are specified in the DTD, in
.BR /usr/share/lib/xml/dtd/volume-request.dtd .
.sp
.LP
Characteristics of the XML configuration file are specified in the DTD, in
.BR /usr/share/lib/xml/dtd/volume-config.dtd .
.sp
.LP
This command must be run as root.
.sp
.LP
This command requires a functional Solaris Volume Manager configuration
before it runs.
