usr/src/man/man1m/metaimport.1m
'\" te
.\" Copyright (c) 2004, Sun Microsystems, Inc. All Rights Reserved.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH metaimport 1M "28 Oct 2005" "SunOS 5.11" "System Administration Commands"
.SH NAME
metaimport \- imports disk sets into existing Solaris Volume Manager
configurations
.SH SYNOPSIS
.LP
.nf
\fBmetaimport\fR \fB-s\fR \fIsetname\fR [\fB-n\fR] [\fB-f\fR] [\fB-v\fR] [\fIdisks\fR]...
.fi

.LP
.nf
\fBmetaimport\fR \fB-r\fR [\fB-v\fR] [\fIdisks\fR]...
.fi

.LP
.nf
\fBmetaimport\fR \fB-V\fR
.fi

.LP
.nf
\fBmetaimport\fR \fB-?\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B metaimport
command allows the importing of disk sets, including
replicated disk sets, into an existing Solaris Volume Manager configuration.
Replicated disk sets are disk sets created using remote replication
software.
.sp
.LP
The default Solaris Volume Manager configuration specifies a maximum number
of disk sets that can be configured. The
.B metaimport
command fails if
importing the disk set would result in exceeding the number of disk sets
configured on the system. To increase the number of disk sets allowed on a
system, see the\fR .
.sp
.LP
Use \fBmetaset\fR(1M) or \fBmetastat\fR(1M) to view the configuration of
the imported set.
.sp
.LP
You must run
.B metaimport
as root.
.sp
.LP
.B metaimport
requires a functional Solaris Volume Manager configuration
before it runs.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -f
.ad
.RS 14n
.rt
Force the import, even if a quorum of replicas from the imported disk set
is not available. This option could result in corrupt configurations and
should only be used when \fBmetaimport\fR fails with the "Insufficient
quorum detected; exiting" error. If only a partial disk set is available,
this option might be necessary to successfully import. Some or all data
could be corrupted or unavailable when importing a partial set or a set
lacking a replica quorum.
.RE

.sp
.ne 2
.mk
.na
.B -n
.ad
.RS 14n
.rt
Does not actually perform the operation, but shows the output or errors
that would have resulted from the operation, had it been run.
.RE

.sp
.ne 2
.mk
.na
.B -r
.ad
.RS 14n
.rt
Report on the non-configured disk sets found on the system. If no disk
device or LUN is specified,
.B metaimport
reports on all non-configured
disk sets attached to the system. When the name of one disk is specified,
.B metaimport
reports on the disk set (or virtual LUN) containing the
specified disk. If two or more disks are specified, metaimport reports on
the set (or sets, if they belong to different disk sets) containing the
specified disks. If two or more disks are specified, \fBmetaimport\fR
reports on the set (or sets, if they belong to different disk sets)
containing the specified disks.
.sp
This option can be used in conjunction with the
.B -v
option to give
verbose output on each disk set reported.
.RE

.sp
.ne 2
.mk
.na
.B -s
.I setname
.ad
.RS 14n
.rt
Specify the disk set name to use when importing. The imported disk set will
be called
.IR setname ,
without regard to the name it may have had on a
different system.
.RE

.sp
.ne 2
.mk
.na
.B -v
.ad
.RS 14n
.rt
Verbose. Provides detailed information about the
.B metadb
replica
location and status. It also provides detailed information about the disk
set configuration and status similar to the "\fBmetastat -c\fR" output.
.RE

.sp
.ne 2
.mk
.na
.B -V
.ad
.RS 14n
.rt
Version information.
.RE

.sp
.ne 2
.mk
.na
.B -?
.ad
.RS 14n
.rt
Display a help message.
.RE

.SH EXAMPLES
.LP
.B Example 1
Importing a Disk Set
.sp
.LP
The following example creates a disk set called
.B blue
and identifies
.B c1t5d0
as a disk containing a state database replica from the disk set
being imported.

.sp
.in +2
.nf
# metaimport -s blue c1t5d0
.fi
.in -2
.sp

.LP
.B Example 2
Reporting Disk Sets to Import
.sp
.LP
The following example scans all disks and LUNs attached to the system and
configured as part of the system. It scans for disks that could be part of a
disk set to be imported. Components that are already part of the Solaris
Volume Manager configuration are ignored.

.sp
.LP
This use of
.B metaimport
provides suggested forms of the
.B metaimport
command to use to actually import the disk sets that have
been found. You can specify a component on the command line to reduce the
scope of the scan and generate results more quickly.

.sp
.in +2
.nf
 # metaimport -r
.fi
.in -2
.sp

.SH EXIT STATUS
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 6n
.rt
Successful completion.
.RE

.sp
.ne 2
.mk
.na
.B >0
.ad
.RS 6n
.rt
An error occurred.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWmdu
_
Interface StabilityStable
.TE

.SH SEE ALSO
.sp
.LP
.BR mdmonitord (1M),
.BR metaclear (1M),
.BR metadb (1M),
.BR metadetach (1M),
.BR metahs (1M),
.BR metainit (1M),
.BR metaoffline (1M),
.BR metaonline (1M),
.BR metaparam (1M),
.BR metarecover (1M),
.BR metareplace (1M),
.BR metaroot (1M),
.BR metaset (1M),
.BR metastat (1M),
.BR metasync (1M),
.BR metattach (1M),
.BR md.tab (4),
.BR md.cf (4),
.BR mddb.cf (4),
.BR attributes (5)
.sp
.LP
\fR
