usr/src/man/man1m/metaoffline.1m
'\" te
.\" Copyright (c) 2004, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH metaoffline 1M "26 Mar 2006" "SunOS 5.11" "System Administration Commands"
.SH NAME
metaoffline, metaonline \- place submirrors offline and online
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/metaoffline\fR \fB-h\fR
.fi

.LP
.nf
\fB/usr/sbin/metaoffline\fR [\fB-s\fR \fIsetname\fR] [\fB-f\fR] \fImirror\fR \fIsubmirror\fR
.fi

.LP
.nf
\fB/usr/sbin/metaonline\fR \fB-h\fR
.fi

.LP
.nf
\fB/usr/sbin/metaonline\fR [\fB-s\fR \fIsetname\fR] \fImirror\fR \fIsubmirror\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B metaoffline
command prevents Solaris Volume Manager from reading
and writing to the submirror that has been taken offline. While the
submirror is offline, all writes to the mirror will be kept track of (by
region) and will be written when the submirror is brought back online. The
.B metaoffline
command can also be used to perform online backups: one
submirror is taken offline and backed up while the mirror remains
accessible. (However, if this is a two-way mirror, data redundancy is lost
while one submirror is offline.) The
.B metaoffline
command differs from
the
.B metadetach
command because it does not sever the logical
association between the submirror and the mirror. To completely remove a
submirror from a mirror, use the
.B metadetach
command.
.sp
.LP
A submirror that has been taken offline will only remain offline until the
.B metaonline
command is invoked or the system is rebooted.
.sp
.LP
When the
.B metaonline
command is used, reading from and writing to the
submirror resumes. A resync is automatically invoked to resync the regions
written while the submirror was offline. Writes are directed to the
submirror during resync. Reads, however, will come from a different
submirror. Once the resync operation completes, reads and writes are
performed on that submirror. The
.B metaonline
command is only effective
on a submirror of a mirror that has been taken offline.
.sp
.LP
The
.B metaoffline
and
.B metaonline
commands can not be used on RAID
1 volumes in application-based recovery (ABR) mode.
.sp
.LP
A submirror that has been taken offline with the
.B metaoffline
command
can only be mounted as read-only.
.SH OPTIONS
.sp
.LP
Root privileges are required for all of the following options except
.BR -h .
.sp
.ne 2
.mk
.na
.B -f
.ad
.RS 14n
.rt
Forces offlining of submirrors that have slices requiring maintenance.
.RE

.sp
.ne 2
.mk
.na
.B -h
.ad
.RS 14n
.rt
Displays usage message.
.RE

.sp
.ne 2
.mk
.na
.B -s
.I setname
.ad
.RS 14n
.rt
Specifies the name of the diskset on which
.B metaoffline
and
.B metaonline
will work. Using the
.B -s
option will cause the command
to perform its administrative function within the specified diskset. Without
this option, the command will perform its function on local metadevices.
.RE

.sp
.ne 2
.mk
.na
.I mirror
.ad
.RS 14n
.rt
Specifies the metadevice name of the mirror from which the submirror will
be either taken offline or put online.
.RE

.sp
.ne 2
.mk
.na
.I submirror
.ad
.RS 14n
.rt
Specifies the metadevice name of the submirror to be either taken offline
or put online.
.RE

.SH EXAMPLES
.LP
.B Example 1
Taking a Submirror Offline
.sp
.LP
This example takes one submirror,
.BR mymirror_sub1 ,
offline from mirror
.BR mymirror .

.sp
.in +2
.nf
# metaoffline mymirror mymirror_sub1
.fi
.in -2
.sp

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 6n
.rt
Successful completion.
.RE

.sp
.ne 2
.mk
.na
.B >0
.ad
.RS 6n
.rt
An error occurred.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWmdu
_
Interface StabilityStable
.TE

.SH SEE ALSO
.sp
.LP
.BR mdmonitord (1M),
.BR metaclear (1M),
.BR metadb (1M),
.BR metadetach (1M),
.BR metahs (1M),
.BR metainit (1M),
.BR metaparam (1M),
.BR metarecover (1M),
.BR metarename (1M),
.BR metareplace (1M),
.BR metaroot (1M),
.BR metaset (1M),
.BR metassist (1M),
.BR metastat (1M),
.BR metasync (1M),
.BR metattach (1M),
.BR md.tab (4),
.BR md.cf (4),
.BR mddb.cf (4),
.BR md.tab (4),
.BR attributes (5),
.BR md (7D)
.sp
.LP
\fR
.SH NOTES
.sp
.LP
The
.B metaonline
and
.B metaoffline
commands are not applicable to
mirrors in application-based recovery (ABR) mode.
