usr/src/man/man1m/metareplace.1m
'\" te
.\" Copyright (c) 2003, Sun Microsystems, Inc. All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH metareplace 1M "26 Mar 2006" "SunOS 5.11" "System Administration Commands"
.SH NAME
metareplace \- enable or replace components of submirrors or RAID5
metadevices
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/metareplace\fR \fB-h\fR
.fi

.LP
.nf
\fB/usr/sbin/metareplace\fR [\fB-s\fR \fIsetname\fR] \fB-e\fR \fImirror\fR \fIcomponent\fR
.fi

.LP
.nf
\fB/usr/sbin/metareplace\fR [\fB-s\fR \fIsetname\fR] \fImirror\fR \fIcomponent-old\fR \fIcomponent-new\fR
.fi

.LP
.nf
\fB/usr/sbin/metareplace\fR [\fB-s\fR \fIsetname\fR] \fB-e\fR \fIRAID\fR \fIcomponent\fR
.fi

.LP
.nf
\fB/usr/sbin/metareplace\fR [\fB-s\fR \fIsetname\fR] [\fB-f\fR] \fIRAID\fR \fIcomponent-old\fR \fIcomponent-new\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B metareplace
command is used to enable or replace components
(slices) within a submirror or a RAID5 metadevice.
.sp
.LP
When you replace a component, the
.B metareplace
command automatically
starts resyncing the new component with the rest of the metadevice. When the
resync completes, the replaced component becomes readable and writable. If
the failed component has been hot spare replaced, the hot spare is placed in
the available state and made available for other hot spare replacements.
.sp
.LP
Note that the new component must be large enough to replace the old
component.
.sp
.LP
A component may be in one of several states. The
.B "Last Erred"
and
the
.B Maintenance
states require action. Always replace components in
the
.B Maintenance
state first, followed by a resync and validation of
data. After components requiring maintenance are fixed, validated, and
resynced, components in the
.B "Last Erred"
state should be replaced.
To avoid data loss, it is always best to back up all data before replacing
\fBLast Erred\fR devices.
.SH OPTIONS
.sp
.LP
Root privileges are required for all of the following options except
.BR -h .
.sp
.ne 2
.mk
.na
.B -e
.ad
.RS 17n
.rt
Transitions the state of
.I component
to the available state and resyncs
the failed component. If the failed component has been hot spare replaced,
the hot spare is placed in the available state and made available for other
hot spare replacements. This command is useful when a component fails due to
human error (for example, accidentally turning off a disk), or because the
component was physically replaced. In this case, the replacement component
must be partitioned to match the disk being replaced before running the
\fBmetareplace\fR command.
.RE

.sp
.ne 2
.mk
.na
\fB-f\fR
.ad
.RS 17n
.rt
Forces the replacement of an errored component of a metadevice in which
multiple components are in error. The component determined by the
\fBmetastat\fR display to be in the ``Maintenance'' state must be replaced
first. This option may cause data to be fabricated since multiple components
are in error.
.RE

.sp
.ne 2
.mk
.na
.B -h
.ad
.RS 17n
.rt
Display help message.
.RE

.sp
.ne 2
.mk
.na
\fB-s\fR \fIsetname\fR
.ad
.RS 17n
.rt
Specifies the name of the diskset on which
.B metareplace
will work.
Using the
.B -s
option will cause the command to perform its
administrative function within the specified diskset. Without this option,
the command will perform its function on local metadevices.
.RE

.sp
.ne 2
.mk
.na
.I mirror
.ad
.RS 17n
.rt
The metadevice name of the mirror.
.RE

.sp
.ne 2
.mk
.na
.I component
.ad
.RS 17n
.rt
The logical name for the physical slice (partition) on a disk drive, such
as
.BR /dev/dsk/c0t0d0s2 .
.RE

.sp
.ne 2
.mk
.na
.I component-old
.ad
.RS 17n
.rt
The physical slice that is being replaced.
.RE

.sp
.ne 2
.mk
.na
.I component-new
.ad
.RS 17n
.rt
The physical slice that is replacing
.IR component-old .
.RE

.sp
.ne 2
.mk
.na
.I RAID
.ad
.RS 17n
.rt
The metadevice name of the RAID5 device.
.RE

.SH EXAMPLES
.LP
\fBExample 1\fR Recovering from Error Condition in RAID5 Metadevice
.sp
.LP
This example shows how to recover when a single component in a RAID5
metadevice is errored.

.sp
.in +2
.nf
# metareplace d10 c3t0d0s2 c5t0d0s2
.fi
.in -2
.sp

.sp
.LP
In this example, a RAID5 metadevice
.B d10
has an errored component,
.BR c3t0d0s2 ,
replaced by a new component,
.BR c5t0d0s2 .

.LP
\fBExample 2\fR Use of \fB-e\fR After Physical Disk Replacement
.sp
.LP
This example shows the use of the
.B -e
option after a physical disk in
a submirror (a submirror of mirror
.BR mymirror1 ,
in this case) has been
replaced.

.sp
.in +2
.nf
# metareplace -e mymirror1 c1t4d0s2
.fi
.in -2
.sp

.sp
.LP
Note: The replacement disk must be partitioned to match the disk it is
replacing before running the
.B metareplace
command.

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 6n
.rt
Successful completion.
.RE

.sp
.ne 2
.mk
.na
.B >0
.ad
.RS 6n
.rt
An error occurred.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWmdu
_
Interface StabilityStable
.TE

.SH SEE ALSO
.sp
.LP
.BR mdmonitord (1M),
.BR metaclear (1M),
.BR metadb (1M),
.BR metadetach (1M),
.BR metahs (1M),
.BR metainit (1M),
\fBmetaoffline\fR(1M), \fBmetaonline\fR(1M), \fBmetaparam\fR(1M),
.BR metarecover (1M),
.BR metarename (1M),
.BR metaroot (1M),
.BR metaset (1M),
.BR metassist (1M),
.BR metastat (1M),
.BR metasync (1M),
.BR metattach (1M),
.BR md.tab (4),
.BR md.cf (4),
\fBmddb.cf\fR(4), \fBmd.tab\fR(4),
.BR attributes (5),
.BR md (7D)
.sp
.LP
\fR
