usr/src/man/man1m/metadevadm.1m
'\" te
.\" Copyright (c) 2004, Sun Microsystems, Inc. All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH metadevadm 1M "26 Mar 2006" "SunOS 5.11" "System Administration Commands"
.SH NAME
metadevadm \- update metadevice information
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/metadevadm\fR [\fB-h\fR] [\fB-n\fR] [ [\fB-l\fR]\fB-r\fR] [\fB-s\fR \fIsetname\fR]
     [\fB-u\fR \fIdisk_specifier\fR] [\fB-v\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The
.B metadevadm
command facilitates the administration of device ID
entries in Solaris Volume Manager. Use this command when the pathname stored
in the metadevice state database no longer correctly addresses the device or
when a disk drive has had its device ID changed.
.sp
.LP
This command requires root privileges.
.SH OPTIONS
.sp
.LP
The following options are supported.
.sp
.ne 2
.mk
.na
.B -h
.ad
.RS 21n
.rt
Provide a help display.
.RE

.sp
.ne 2
.mk
.na
.B -l
.ad
.RS 21n
.rt
Specify that
.B metadevadm
log to \fBsyslog\fR(3C). \fBmetadevadm\fR
logs to the
.B DAEMON
facility at the
.B ERR
level by default. See
\fBsyslog.conf\fR(4) for additional information on changing logging levels.

.sp
Use this option anytime. It is most useful in startup scripts and less
useful interactively.
.RE

.sp
.ne 2
.mk
.na
.B -n
.ad
.RS 21n
.rt
Emulate the effect of a command, without making any changes to the
system.
.RE

.sp
.ne 2
.mk
.na
.B -r
.ad
.RS 21n
.rt
Recompute the pathname and disk specifier (including slice) associated with
all devices in the metadevice state database if the device supports device
IDs. If a device does not support device IDs or the device is not available,
then no action is taken for that device.
.sp
Use this option when the disk has been moved or readdressed.
.sp
This option is run automatically at boot time to detect device ID changes
and update the state database.
.RE

.sp
.ne 2
.mk
.na
\fB-s\fR \fIsetname\fR
.ad
.RS 21n
.rt
Specify the name of the disk set on which
.B metadevadm
works. This
option causes the command to perform its administrative function within the
specified disk set. Without this option, the command performs its function
on devices in the local disk set.
.RE

.sp
.ne 2
.mk
.na
\fB-u\fR \fIdisk_specifier\fR
.ad
.RS 21n
.rt
Obtain the device ID associated with the \fIdisk_specifier\fR (for example,
.BR c1t2d0 )
of a device and update the metadevice state database. If the
device ID has not changed this option does nothing. Use this option when a
disk drive has had its device ID changed during a firmware upgrade or due to
changing the controller of a storage subsystem.
.RE

.sp
.ne 2
.mk
.na
.B -v
.ad
.RS 21n
.rt
Execute in verbose mode. This option has no effect when used with
.BR -u .
Verbose is the default.
.RE

.SH EXAMPLES
.LP
\fBExample 1\fR Updating Device ID of Disk
.sp
.LP
The following example updates the device
.BR c2t3d0 :

.sp
.in +2
.nf
# metadevadm -u c2t3d0
Updating SLVM device relocation information for c2t3d0.
Old device reloc information: id19280192391293123012012010012012091398
New device reloc information: id19380192391293123012012010012012091398
.fi
.in -2
.sp

.sp
.LP
The following example is a variation of the preceding, using the full
pathname.

.sp
.in +2
.nf
# metadevadm -u /dev/dsk/c2t3d0
.fi
.in -2
.sp

.sp
.LP
The following example uses the
.B -n
option, which means that the
command is emulated, but does not take effect. Note that when the \fB-v\fR
option is used with
.BR -u ,
\fB-v\fR has no effect (verbose is the
default).

.sp
.in +2
.nf
# metadevadm -u -v -n c2t3d0
Updating SLVM device relocation information for c2t3d0.
Old device reloc information: id19280192391293123012012010012012091398
New device reloc information: id19380192391293123012012010012012091398
.fi
.in -2
.sp

.LP
\fBExample 2\fR Recomputing Pathnames
.sp
.LP
In the following example, all device names are valid.

.sp
.in +2
.nf
# metadevadm -r
Disk movement detected.
Updating device names in SLVM.
.fi
.in -2
.sp

.sp
.LP
In the following example, once again device names are valid.

.sp
.in +2
.nf
# metadevadm -r -v
Disk movement detected.
Updating device names in SLVM.
c0t0d0s0 changed to c0t0d1s0 from device relocation information
id12098123lkmklsdjaasdkfjadfjakds
.fi
.in -2
.sp

.sp
.LP
In the following example,
.B metadevadm
detects an invalid device
name.

.sp
.in +2
.nf
# metadevadm -r
Invalid device relocation information detected in SLVM.
Please check status of following disk(s):
c3t0d0
.fi
.in -2
.sp

.SH RETURN VALUES
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 5n
.rt
Command was successful.
.RE

.sp
.ne 2
.mk
.na
.B 1
.ad
.RS 5n
.rt
\fBmetadevadm\fR encountered an error condition.
.RE

.sp
.ne 2
.mk
.na
.B 2
.ad
.RS 5n
.rt
An invalid device ID was detected when using the
.B -r
option. This is
for use in the
.B rc2.d
script. See
.BR init.d (4).
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWmdu
_
Interface StabilityStable
.TE

.SH SEE ALSO
.sp
.LP
.BR mdmonitord (1M),
.BR metaclear (1M),
.BR metadb (1M),
.BR metadetach (1M),
.BR metahs (1M),
.BR metainit (1M),
\fBmetaoffline\fR(1M), \fBmetaonline\fR(1M), \fBmetaparam\fR(1M),
.BR metarecover (1M),
.BR metarename (1M),
.BR metareplace (1M),
.BR metaroot (1M),
.BR metaset (1M),
.BR metassist (1M),
.BR metastat (1M),
.BR metasync (1M),
.BR metattach (1M),
.BR md.tab (4),
.BR md.cf (4),
.BR mddb.cf (4),
.BR md.tab (4),
.BR attributes (5),
.BR md (7D)
.sp
.LP
\fR
