usr/src/man/man1m/metarename.1m
'\" te
.\" Copyright (c) 2003, Sun Microsystems, Inc. All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH metarename 1M "26 Mar 2006" "SunOS 5.11" "System Administration Commands"
.SH NAME
metarename \- rename metadevice or switch layered metadevice names
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/metarename\fR [\fB-s\fR \fIsetname\fR] \fImetadevice1\fR \fImetadevice2\fR
.fi

.LP
.nf
\fB/usr/sbin/metarename\fR [\fB-s\fR \fIsetname\fR] [\fB-f\fR] \fB-x\fR \fImetadevice1\fR \fImetadevice2\fR
.fi

.LP
.nf
\fB/usr/sbin/metarename\fR \fB-h\fR
.fi

.SH DESCRIPTION
.sp
.LP
There are two ways to use
.BR metarename ,
one with and one without the
\fB-x\fR option. The first method (without
.BR -x )
renames an existing
metadevice to a new name. This makes managing the metadevice namespace
easier. The metadevice being renamed cannot be mounted or open, nor can the
new name already exist. For example, to rename a metadevice that contains a
mounted file system, you would first need to unmount the file system.
.sp
.LP
With the second way to use
.BR metarename ,
using the
.B -x
option,
\fBmetarename\fR switches (exchanges) the names of an existing layered
metadevice and one of its subdevices. In Solaris Volume Manager terms, a
.RB "layered metadevice can be either a mirror or a trans metadevice. The" " -x"
option enables you to switch the metadevice names of a mirror and one of its
submirrors, or a trans metadevice and its master device.
.sp
.LP
\fBmetarename -x\fR makes it easier to mirror or unmirror an existing
stripe or concatenation, and to remove a trans device.
.sp
.LP
When used to mirror an existing stripe or concatenatation, you must stop
access to the device. For example, if the device contains a mounted file
system, you must first unmount the file system before doing the rename.
.sp
.LP
You can also use the
.B "metarename -x"
command to untrans a trans
metadevice from an existing device. This applies only to the master device.
You cannot remove a logging device with
.BR metarename .
Before you can
rename a trans device, you must detach the logging device. Then you must stop
access to the trans metadevice itself.
.sp
.LP
You cannot rename or switch metadevices that are in an error state or that
have subcomponents in an error state, or metadevices actively using a hot
spare replacement.
.sp
.LP
You can only switch metadevices that have a direct child/parent
relationship. You could not, for example, directly exchange a stripe in a
mirror that is a master device with the trans metadevice.
.sp
.LP
You must use the \fB-f\fR flag when switching members of a trans
metadevice.
.sp
.LP
Only metadevices can be switched, not slices.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB-f\fR
.ad
.RS 15n
.rt
Force the switching of trans metadevice members.
.RE

.sp
.ne 2
.mk
.na
.B -h
.ad
.RS 15n
.rt
Display a help message.
.RE

.sp
.ne 2
.mk
.na
\fB-s\fR \fIsetname\fR
.ad
.RS 15n
.rt
Specifies the name of the diskset on which
.B metarename
will work. Using
the
.B -s
option will cause the command to perform its administrative
function within the specified diskset. Without this option, the command will
perform its function on the local metadevices.
.RE

.sp
.ne 2
.mk
.na
.B -x
.ad
.RS 15n
.rt
Exchange the metadevice names
.I metadevice1
and
.IR metadevice2 .
.RE

.sp
.ne 2
.mk
.na
.I metadevice1
.ad
.RS 15n
.rt
Specifies the metadevice to be renamed or switched.
.RE

.sp
.ne 2
.mk
.na
.I metadevice2
.ad
.RS 15n
.rt
Specifies the target metadevice name for the rename or switch operation.
.RE

.SH EXAMPLES
.LP
\fBExample 1\fR Renaming a Metadevice
.sp
.LP
This example renames a metadevice named
.B d10
to
.BR account_records .
Note that
.B account_records
must not exist for the rename to succeed.

.sp
.in +2
.nf
# metarename d10 account_records
.fi
.in -2
.sp

.LP
\fBExample 2\fR Creating a Two-Way Mirror
.sp
.LP
This example creates a two-way mirror from an existing stripe named \fBd1\fR
with a mounted file system,
.BR /home2 .

.sp
.in +2
.nf
# metainit d2 1 1 c13d0s1
# metainit -f d20 -m d1
# umount /home2
# metarename -x d20 d1
# metattach d1 d2
# mount /home2
.fi
.in -2
.sp

.sp
.LP
First, a second concatenation
.BR d2 ,
is created. (\fBd1\fR already
exists.) The
.B metainit
command creates a one-way mirror,
.BR d20 ,
from
.BR d1 .
Next, you umount the file system and switch
.B d1
for
.BR d20 ,
making
.B d1
the top-level device (mirror). You attach the second
submirror,
.BR d2 ,
to create a two-way mirror. Lastly, you remount the file
system.

.LP
\fBExample 3\fR Mounting a Mirrored File System on Stripe
.sp
.LP
This example takes an existing mirror named
.B d1
with a mounted file
system, and ends up with the file system mounted on a stripe
.BR d1 .

.sp
.in +2
.nf
# umount /fs2
# metarename -x d1 d20
# metadetach d20 d1
# metaclear -r d20
# mount /fs2
.fi
.in -2
.sp

.sp
.LP
First, you unmount the file system, then switch the mirror
.B d1
and its
submirror
.BR d20 .
This makes the mirror into
.BR d20 .
Next, you detach
\fBd1\fR from
.BR d20 ,
then delete the mirror
.B d20
and its other
submirror. You then remount the file system.

.LP
\fBExample 4\fR Deleting a Trans Metadevice
.sp
.LP
This example deletes a trans metadevice named
.B d10
while its mount
point is
.BR /myhome .
The master device, which is a stripe, is named
.BR d2 .
The logging device, also a stripe, is named
.BR d5 .

.sp
.in +2
.nf
# umount /myhome
# metadetach d10
# metarename -f -x d10 d2
# metaclear d2
# metaclear d5
# fsck /dev/md/dsk/d10
# mount /myhome
.fi
.in -2
.sp

.sp
.LP
You umount the file system first, then detach the trans metadevice's logging
device. The trans metadevice is switched with the master device, making the
trans metadevice
.B d2
and the underlying stripe
.BR d10 .
You clear the
trans metadevice
.B d2
and the logging device
.BR d5 .
\fBd10\fR must be
\fBfsck\fR'd, and then the file system is remounted.

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 6n
.rt
Successful completion.
.RE

.sp
.ne 2
.mk
.na
.B >0
.ad
.RS 6n
.rt
An error occurred.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWmdu
_
Interface StabilityStable
.TE

.SH SEE ALSO
.sp
.LP
.BR mdmonitord (1M),
.BR metaclear (1M),
.BR metadb (1M),
.BR metadetach (1M),
.BR metahs (1M),
.BR metainit (1M),
.BR metaoffline (1M),
.BR metaonline (1M),
.BR metaparam (1M),
.BR metarecover (1M),
.BR metareplace (1M),
.BR metaroot (1M),
.BR metaset (1M),
.BR metassist (1M),
.BR metastat (1M),
.BR metasync (1M),
.BR metattach (1M),
.BR md.tab (4),
.BR md.cf (4),
.BR mddb.cf (4),
.BR md.tab (4),
.BR attributes (5),
.BR md (7D)
.sp
.LP
\fR
.SH LIMITATIONS
.sp
.LP
Renaming and exchanging metadevice names can only be used for metadevices. A
physical slice cannot be renamed to a metadevice, nor can a metadevice be
exchanged with a physical slice name.
.sp
.LP
Metadevice names are strings of the pattern \fId\fB<\fIxyz\fB>\fR
where
.I xyz
is a value between
.B 0
and
.BR 8192 .
You cannot use
logical names for metadevices.
.SH NOTES
.sp
.LP
Trans metadevices have been replaced by UFS logging. Existing trans devices
are
.B not
logging--they pass data directly through to the underlying
device. See \fBmount_ufs\fR(1M) for more information about UFS logging.
