usr/src/man/man1m/metasync.1m
'\" te
.\" Copyright (c) 2004, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH metasync 1M "27 Mar 2006" "SunOS 5.11" "System Administration Commands"
.SH NAME
metasync \- handle metadevice resync during reboot
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/metasync\fR \fB-h\fR
.fi

.LP
.nf
\fB/usr/sbin/metasync\fR [\fB-s\fR \fIsetname\fR] [\fIbuffer_size\fR] \fImetadevice\fR
.fi

.LP
.nf
\fB/usr/sbin/metasync\fR [\fB-s\fR \fIsetname\fR] \fB-r\fR [\fIbuffer_size\fR]
.fi

.LP
.nf
\fB/usr/sbin/metasync\fR \fB-p\fR \fImetadevice\fR
.fi

.LP
.nf
\fB/usr/sbin/metasync\fR \fB-c\fR \fImetadevice\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B metasync
command starts a resync operation on the specified
.IR metadevice .
All components that need to be resynced are resynced. If
the system crashes during a RAID5 initialization, or during a RAID5 resync,
either an initialization or resync restarts when the system reboots.
.sp
.LP
Applications are free to access a metadevice at the same time that it is
being resynced by
.BR metasync .
Also,
.B metasync
performs the copy
operations from inside the kernel, which makes the utility more efficient.
.sp
.LP
Use the
.B -r
option in boot scripts to resync all possible
submirrors.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -c
.I metadevice
.ad
.RS 17n
.rt
Cancels the resync that is in progress on the specified metadevice. The
resync will be stopped at its current point and can be resumed by running
the "\fBmetasync metadevice\fR" command. This option only applies to RAID1
volumes.
.RE

.sp
.ne 2
.mk
.na
.B -h
.ad
.RS 17n
.rt
Displays usage message.
.RE

.sp
.ne 2
.mk
.na
.B -p
.I metadevice
.ad
.RS 17n
.rt
Regenerates parity information for RAID5 metadevices.
.RE

.sp
.ne 2
.mk
.na
.B -s
.I setname
.ad
.RS 17n
.rt
Specifies the name of the diskset on which
.B metasync
will work. Using
the
.B -s
option will cause the command to perform its administrative
function within the specified diskset. Without this option, the command will
perform its function on local metadevices.
.RE

.sp
.ne 2
.mk
.na
.B -r
.ad
.RS 17n
.rt
Specifies that the
.B metasync
command handle special resync
requirements during a system reboot.
.B "metasync -r"
should only be
invoked from the
.B svc:/system/mdmonitor
.RB "service. The" " metasync"
command only resyncs those metadevices that need to be resynced.
.B metasync
schedules all the mirror resyncs according to their pass
numbers.
.sp
To override the default buffer_size value used by the
.B svc:/system/mdmonitor
service, you can edit
.B /etc/system
to
specify:
.sp
.in +2
.nf
set md_mirror:md_resync_bufsz = 2048
.fi
.in -2
.sp

so that resyncs occur as quickly as possible.
.RE

.SH OPERANDS
.sp
.ne 2
.mk
.na
.I buffer_size
.ad
.RS 15n
.rt
Specifies the size (number of 512-byte disk blocks) of the internal copy
buffer for the mirror resync. The size defaults to 1024 512-byte disk
blocks. It can be no more than 2048 blocks. For best performance (quickest
completion of the resync), 2048 blocks is the recommended size.
.RE

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 6n
.rt
Successful completion.
.RE

.sp
.ne 2
.mk
.na
.B >0
.ad
.RS 6n
.rt
An error occurred.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWmdu
.TE

.SH SEE ALSO
.sp
.LP
.BR mdmonitord (1M),
.BR metaclear (1M),
.BR metadb (1M),
.BR metadetach (1M),
.BR metahs (1M),
.BR metainit (1M),
.BR metaoffline (1M),
.BR metaonline (1M),
.BR metaparam (1M),
.BR metarecover (1M),
.BR metarename (1M),
.BR metareplace (1M),
.BR metaroot (1M),
.BR metaset (1M),
.BR metassist (1M),
.BR metastat (1M),
.BR metattach (1M),
.BR md.tab (4),
.BR md.cf (4),
.BR mddb.cf (4),
.BR md.tab (4),
.BR attributes (5),
.BR md (7D)
.sp
.LP
\fR
.SH NOTES
.sp
.LP
The
.B metasync
service is managed by the service management facility,
.BR smf (5),
under the service identifier:
.sp
.in +2
.nf
svc:/system/mdmonitor
.fi
.in -2
.sp

.sp
.LP
Administrative actions on this service, such as enabling, disabling, or
requesting restart, can be performed using
.BR svcadm (1M).
The service's
status can be queried using the
.BR svcs (1)
command.
