usr/src/man/man1m/metaparam.1m
'\" te
.\" Copyright (c) 2004, Sun Microsystems, Inc. All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH metaparam 1M "26 Mar 2006" "SunOS 5.11" "System Administration Commands"
.SH NAME
metaparam \- modify parameters of metadevices
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/metaparam\fR \fB-h\fR
.fi

.LP
.nf
\fB/usr/sbin/metaparam\fR [\fB-s\fR \fIsetname\fR]
     [\fIconcat/stripe\fR \fIor\fR \fIRAID5\fR \fIoptions\fR] \fIconcat/stripe\fR \fIRAID\fR
.fi

.LP
.nf
\fB/usr/sbin/metaparam\fR [\fB-s\fR \fIsetname\fR] [\fImirror\fR \fIoptions\fR] \fImirror\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B metaparam
command is used to display or modify current parameters
of metadevices.
.sp
.LP
If just the metadevice is specified as an argument to the
.BR metaparam
command, the current settings are displayed.
.sp
.LP
The
.B metaparam
command enables most metadevice (volume) parameters to be
changed. Only the interlace value cannot be changed by
.BR metaparam ,
because it is established when the metadevice is created and cannot be changed
thereafter.
.SH OPTIONS
.sp
.LP
Root privileges are required for all of the options.
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -h
.ad
.sp .6
.RS 4n
Displays usage message.
.RE

.sp
.ne 2
.mk
.na
\fB-s\fR \fIsetname\fR
.ad
.sp .6
.RS 4n
Specify the name of the diskset on which
.B metaparam
works. Using the
\fB-s\fR option causes the command to perform its administrative function
within the specified diskset. Without this option, the command performs its
function on local metadevices.
.RE

.SH CONCAT/STRIPE OR RAID5 OPTIONS
.sp
.ne 2
.mk
.na
\fB-h\fIhot_spare_pool\fR \fB| none\fR
.ad
.sp .6
.RS 4n
Specifies the hot spare pool to be used by a metadevice. If
.B none
is
specified, the metadevice is disassociated with the hot spare pool assigned to
it. If the metadevice is currently using a hot spare, then \fBmetaparam\fR
cannot replace the hot spare pool.
.RE

.sp
.ne 2
.mk
.na
\fIconcat/stripe\fR \fB|\fIRAID\fR
.ad
.sp .6
.RS 4n
Specifies the metadevice name of the concatenation, stripe, or concatenation
of stripes, or of the RAID5 metadevice.
.RE

.SH MIRROR OPTIONS
.sp
.ne 2
.mk
.na
\fB-r roundrobin | geometric | first\fR
.ad
.sp .6
.RS 4n
Modifies the read option for a mirror. The
.B -r
option must be followed
by either
.BR roundrobin ,
.BR geometric ,
or
.BR first .
.BR roundrobin ,
which is the default action under the
.B metainit
command, specifies
.RB "reading the disks in a round-robin (load balancing) method." " geometric"
allows for faster performance on sequential reads. \fBfirst\fR specifies
reading only from the first submirror.
.RE

.sp
.ne 2
.mk
.na
.B -w parallel | serial
.ad
.sp .6
.RS 4n
Modifies the write option for a mirror. The
.B -w
option must be followed
by either
.B parallel
or
.BR serial .
.BR parallel ,
the default action
under the
.B metainit
command, specifies that all writes are parallel.
\fBserial\fR specifies that all writes are serial.
.RE

.sp
.ne 2
.mk
.na
\fB-p\fR \fIpass_number\fR
.ad
.sp .6
.RS 4n
A number from 0-to-9 that specifies the order in which a mirror is resynced
during reboot. The default is 1. Smaller pass numbers are resynced first.
Equal pass numbers are run concurrently. If 0 is used, the mirror resync is
skipped. 0 should only be used for mirrors mounted as read-only, or as
.BR swap .
.RE

.sp
.ne 2
.mk
.na
.I mirror
.ad
.sp .6
.RS 4n
Specifies the metadevice name of the mirror.
.RE

.SH EXAMPLES
.LP
\fBExample 1\fR Associating Hot Spare Pool with RAID5 Metadevice
.sp
.LP
This example associates a hot spare pool,
.BR user_pool ,
with a RAID5
metadevice,
.BR user_raid .

.sp
.in +2
.nf
# metaparam -h user_pool user_raid
.fi
.in -2
.sp

.LP
\fBExample 2\fR Changing Read Option to Geometric
.sp
.LP
This example changes the read option on a mirror
.B d50
from the default
of roundrobin to geometric.

.sp
.in +2
.nf
# metaparam -r geometric d50
.fi
.in -2
.sp

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.sp .6
.RS 4n
Successful completion.
.RE

.sp
.ne 2
.mk
.na
.B >0
.ad
.sp .6
.RS 4n
An error occurred.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWmdu
_
Interface StabilityStable
.TE

.SH SEE ALSO
.sp
.LP
.BR mdmonitord (1M),
.BR metaclear (1M),
.BR metadb (1M),
.BR metadetach (1M),
.BR metahs (1M),
.BR metainit (1M),
\fBmetaoffline\fR(1M), \fBmetaonline\fR(1M), \fBmetarecover\fR(1M),
.BR metarename (1M),
.BR metareplace (1M),
.BR metaroot (1M),
.BR metaset (1M),
.BR metassist (1M),
.BR metastat (1M),
.BR metasync (1M),
.BR metattach (1M),
.BR md.tab (4),
.BR md.cf (4),
\fBmddb.cf\fR(4), \fBmd.tab\fR(4),
.BR attributes (5),
.BR md (7D)
.sp
.LP
\fR
