usr/src/man/man1m/metaset.1m
'\" te
.\" Copyright (c) 2008, Sun Microsystems, Inc. All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH metaset 1M "4 Mar 2009" "SunOS 5.11" "System Administration Commands"
.SH NAME
metaset \- configure disk sets
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/metaset\fR \fB-s\fR \fIsetname\fR [\fB-M\fB-a\fR \fB-h\fR \fIhostname\fR]
.fi

.LP
.nf
\fB/usr/sbin/metaset\fR \fB-s\fR \fIsetname\fR \fB-A\fR {enable | disable}
.fi

.LP
.nf
\fB/usr/sbin/metaset\fR \fB-s\fR \fIsetname\fR [\fB-A\fR {enable | disable}] \fB-a\fR \fB-h\fR \fIhostname\fR.\|.\|.
.fi

.LP
.nf
\fB/usr/sbin/metaset\fR \fB-s\fR \fIsetname\fR \fB-a\fR [\fB-l\fR \fIlength\fR] [\fB-L\fR] \fIdrivename.\|.\|.\fR
.fi

.LP
.nf
\fB/usr/sbin/metaset\fR \fB-s\fR \fIsetname\fR \fB-C\fR {take | release | purge}
.fi

.LP
.nf
\fB/usr/sbin/metaset\fR \fB-s\fR \fIsetname\fR \fB-d\fR [\fB-f\fR] \fB-h\fR \fIhostname.\|.\|.\fR
.fi

.LP
.nf
\fB/usr/sbin/metaset\fR \fB-s\fR \fIsetname\fR \fB-d\fR [\fB-f\fR] \fIdrivename.\|.\|.\fR
.fi

.LP
.nf
\fB/usr/sbin/metaset\fR \fB-s\fR \fIsetname\fR \fB-j\fR
.fi

.LP
.nf
\fB/usr/sbin/metaset\fR \fB-s\fR \fIsetname\fR \fB-r\fR
.fi

.LP
.nf
\fB/usr/sbin/metaset\fR \fB-s\fR \fIsetname\fR \fB-w\fR
.fi

.LP
.nf
\fB/usr/sbin/metaset\fR \fB-s\fR \fIsetname\fR \fB-t\fR [\fB-f\fR] [\fB-u\fR \fItagnumber\fR] [y]
.fi

.LP
.nf
\fB/usr/sbin/metaset\fR \fB-s\fR \fIsetname\fR \fB-b\fR
.fi

.LP
.nf
\fB/usr/sbin/metaset\fR \fB-s\fR \fIsetname\fR \fB-P\fR
.fi

.LP
.nf
\fB/usr/sbin/metaset\fR \fB-s\fR \fIsetname\fR \fB-q\fR
.fi

.LP
.nf
\fB/usr/sbin/metaset\fR \fB-s\fR \fIsetname\fR \fB-o\fR [\fB-h\fR \fIhostname\fR]
.fi

.LP
.nf
\fB/usr/sbin/metaset\fR [\fB-s\fR \fIsetname\fR]
.fi

.LP
.nf
\fB/usr/sbin/metaset\fR [\fB-s\fR \fIsetname\fR] \fB-a\fR | \fB-d\fR
     [ [m] \fImediator_host_list\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The \fBmetaset\fR command administers sets of disks in named disk sets. Named
disk sets include any disk set that is not in the local set. While disk sets
enable a high-availability configuration, Solaris Volume Manager itself does not
actually provide a high-availability environment.
.sp
.LP
A single-owner disk set configuration manages storage on a SAN or
fabric-attached storage, or provides namespace control and state database replica
management for a specified set of disks.
.sp
.LP
In a shared disk set configuration, multiple hosts are physically connected to
the same set of disks. When one host fails, another host has exclusive access to
the disks. Each host can control a shared disk set, but only one host can control
it at a time.
.sp
.LP
When you add a new disk to any disk set, Solaris Volume Manager checks the disk
format. If necessary, it repartitions the disk to ensure that the disk has an
appropriately configured reserved slice 7 (or slice 6 on an EFI labelled device)
with adequate space for a state database replica. The precise size of slice 7 (or
slice 6 on an EFI labelled device) depends on the disk geometry. For tradtional
disk sets, the slice is no less than 4 Mbytes, and probably closer to 6 Mbytes,
depending on where the cylinder boundaries lie. For multi-owner disk sets, the
slice is a minimum of 256 Mbytes. The minimal size for slice 7 might change in
the future. This change is based on a variety of factors, including the size of
the state database replica and information to be stored in the state database
replica.
.sp
.LP
For use in disk sets, disks must have a dedicated slice (six or seven) that
meets specific criteria:
.RS +4
.TP
.ie t \(bu
.el o
The slice must start at sector 0
.RE
.RS +4
.TP
.ie t \(bu
.el o
The slice must include enough space for disk label
.RE
.RS +4
.TP
.ie t \(bu
.el o
The state database replicas cannot be mounted
.RE
.RS +4
.TP
.ie t \(bu
.el o
The slice does not overlap with any other slices, including slice 2
.RE
.sp
.LP
If the existing partition table does not meet these criteria, or if the -L flag
is specified, Solaris Volume Manager repartitions the disk. A small portion of
each drive is reserved in slice 7 (or slice 6 on an EFI labelled device) for use
by Solaris Volume Manager. The remainder of the space on each drive is placed
into slice 0. Any existing data on the disks is lost by repartitioning.
.sp
.LP
After you add a drive to a disk set, it can be repartitioned as necessary, with
the exception that slice 7 (or slice 6 on an EFI labelled device) is not altered
in any way.
.sp
.LP
After a disk set is created and metadevices are set up within the set, the
metadevice name is in the following form:
.sp
.LP
\fB/dev/md/\fIsetname\fR/{\fBdsk\fR,\fBrdsk\fR}/\fBd\fInumber\fR
.sp
.LP
where \fIsetname\fR is the name of the disk set, and \fInumber\fR is the number
of the metadevice (\fB0\fR-\fB127\fR).
.sp
.LP
If you have disk sets that you upgraded from Solstice DiskSuite software, the
default state database replica size on those sets is 1034 blocks, not the 8192
block size from Solaris Volume Manager. Also, slice 7 on the disks that were
added under Solstice DiskSuite are correspondingly smaller than slice 7 on disks
that were added under Solaris Volume Manager.
.sp
.LP
If disks you add to a disk set have acceptable slice 7s (that start at cylinder
0 and that have sufficient space for the state database replica), they are not
reformatted.
.sp
.LP
Hot spare pools within local disk sets use standard Solaris Volume Manager
naming conventions. Hot spare pools with shared disk sets use the following
convention:
.sp
.LP
\fIsetname\fR/\fIhot_spare_pool\fR
.sp
.LP
where \fIsetname\fR is the name of the disk set, and \fIhot_spare_pool\fR is the
name of the hot spare pool associated with the disk set.
.SS "Multi-node Environment"
.sp
.LP
To create and work with a disk set in a multi\(emnode environment, \fBroot\fR
must be a member of Group 14 on all hosts, or the \fB/.rhosts\fR file must
contain an entry for all other host names. This is not required in a SunCluster
3.x enviroment.
.SS "Tagged data"
.sp
.LP
Tagged data occurs when there are different versions of a disk set's replicas.
This tagged data consists of the set owner's nodename, the hardware serial number
of the owner and the time it was written out to the available replicas. The
system administer can use this information to determine which replica contains
the correct data.
.sp
.LP
When a disk set is configured with an even number of storage enclosures and has
replicas balanced across them evenly, it is possible that up to half of the
replicas can be lost (for example, through a power failure of half of the storage
enclosures). After the enclosure that went down is rebooted, half of the replicas
are not recognized by SVM. When the set is retaken, the \fBmetaset\fR command
returns an error of "stale databases", and all of the metadevices are in a
read-only state.
.sp
.LP
Some of the replicas that are not recognized need to be deleted. The action of
deleting the replicas also causes updates to the replicas that are not being
deleted. In a dual hosted disk set environment, the second node can access the
deleted replicas instead of the existing replicas when it takes the set. This
leads to the possibility of getting the wrong replica record on a disk set take.
An error message is displayed, and user intervention is required.
.sp
.LP
Use the \fB-q\fR to query the disk set and the \fB-t\fR, \fB-u\fR, and \fB-y\fR,
options to select the tag and take the disk set. See \fBOPTIONS\fR.
.SS "Mediator Configuration"
.sp
.LP
SVM provides support for a low-end HA solution consisting of two hosts that
share only two strings of drives. The hosts in this type of configuration,
referred to as \fBmediators\fR or mediator hosts, run a special daemon,
\fBrpc.metamedd\fR(1M). The mediator hosts take on additional responsibilities to
ensure that data is available in the case of host or drive failures.
.sp
.LP
A mediator configuration can survive the failure of a single host or a single
string of drives, without administrative intervention. If both a host and a
string of drives fail (multiple failures), the integrity of the data cannot be
guaranteed. At this point, administrative intervention is required to make the
data accessible. See \fBmediator\fR(7D) for further details.
.sp
.LP
Use the \fB-m\fR option to add or delete a mediator host. See \fBOPTIONS\fR.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB-a\fR \fIdrivename\fR
.ad
.sp .6
.RS 4n
Add drives or hosts to the named set. For a drive to be accepted into a set, the
drive must not be in use within another metadevice or disk set, mounted on, or
swapped on. When the drive is accepted into the set, it is repartitioned and the
metadevice state database replica (for the set) can be placed on it. However, if
a slice 7 (or slice 6 on an EFI labelled device), starts at cylinder 0, and is
large enough to hold a state database replica, then the disk is not
repartitioned. Also, a drive is not accepted if it cannot be found on all hosts
specified as part of the set. This means that if a host within the specified set
is unreachable due to network problems, or is administratively down, the add
fails.
.sp
Specify a drive name in the form
\fBc\fInum\fBt\fInum\fBd\fInum\fR. Do not specify a slice number
(\fBs\fInum\fR). For drives in a Sun Cluster, you must specify a complete
pathname for each drive. Such a name has the form:
.sp
.in +2
.nf
/dev/did/[r]dsk/d\fInum\fR
.fi
.in -2
.sp

.RE

.sp
.ne 2
.mk
.na
\fB-a\fR | \fB-d\fR | \fB-m\fR \fImediator_host_list\fR
.ad
.sp .6
.RS 4n
Add (\fB-a\fR) or delete (\fB-d\fR) mediator hosts to the specified disk set. A
\fImediator_host_list\fR is the \fBnodename\fR(4) of the mediator host to be
added and (for adding) up to two other aliases for the mediator host. The
nodename and aliases for each mediator host are separated only by commas. Up to
three mediator hosts can be specified for the named disk set. Specify only the
nodename of that host as the argument to \fB-m\fR to delete a mediator host.
.sp
In a single \fBmetaset\fR command you can add or delete up to three mediator
hosts. See \fBEXAMPLES\fR.
.RE

.sp
.ne 2
.mk
.na
\fB-A\fR \fB{enable | disable}\fR
.ad
.sp .6
.RS 4n
Specify auto-take status for a disk set. If auto-take is enabled for a set, the
disk set is automatically taken at boot, and file systems on volumes within the
disk set can be mounted through \fB/etc/vfstab\fR entries. Only a single host can
be associated with an auto-take set, so attempts to add a second host to an
auto-take set or attempts to configure a disk set with multiple hosts as
auto-take fails with an error message. Disabling auto-take status for a specific
disk set causes the disk set to revert to normal behavior. That is, the disk set
is potentially shared (non-concurrently) among hosts, and unavailable for
mounting through \fB/etc/vfstab\fR.
.RE

.sp
.ne 2
.mk
.na
\fB-b\fR
.ad
.sp .6
.RS 4n
Insure that the replicas are distributed according to the replica layout
algorithm. This can be invoked at any time, and does nothing if the replicas are
correctly distributed. In cases where the user has used the \fBmetadb\fR command
to manually remove or add replicas, this command can be used to insure that the
distribution of replicas matches the replica layout algorithm.
.RE

.sp
.ne 2
.mk
.na
\fB-C\fR \fB{take | release | purge}\fR
.ad
.sp .6
.RS 4n
Do not interact with the Cluster Framework when used in a Sun Cluster 3
environment. In effect, this means do not modify the Cluster Configuration
Repository. These options should only be used to fix a broken disk set
configuration. 
.sp
.ne 2
.mk
.na
\fBtake\fR
.ad
.sp .6
.RS 4n
Take ownership of the disk set but do not inform the Cluster Framework that the
disk set is available. This option is not for use with a multi-owner disk set.
.RE

.sp
.ne 2
.mk
.na
\fBrelease\fR
.ad
.sp .6
.RS 4n
Release ownership of the disk set without informing the Cluster Framework. This
option should only be used if the disk set ownership was taken with the
corresponding \fB-C\fR \fBtake\fR option. This option is not for use with a
multi-owner disk set.
.RE

.sp
.ne 2
.mk
.na
\fBpurge\fR
.ad
.sp .6
.RS 4n
Remove the disk set without informing the Cluster Framework that the disk set
has been purged. This option should only be used when the disk set is not
accessible and requires rebuilding.
.RE

.RE

.sp
.ne 2
.mk
.na
\fB-d\fR \fIdrivename\fR
.ad
.sp .6
.RS 4n
Delete drives or hosts from the named disk set. For a drive to be deleted, it
must not be in use within the set. The last host cannot be deleted unless all of
the drives within the set are deleted. Deleting the last host in a disk set
destroys the disk set.
.sp
Specify a drive name in the form
\fBc\fInum\fBt\fInum\fBd\fInum\fR. Do not specify a slice number
(\fBs\fInum\fR). For drives in a Sun Cluster, you must specify a complete
pathname for each drive. Such a name has the form:
.sp
.in +2
.nf
/dev/did/[r]dsk/d\fInum\fR
.fi
.in -2
.sp

This option fails on a multi-owner disk set if attempting to withdraw the master
node while other nodes are in the set.
.RE

.sp
.ne 2
.mk
.na
\fB-f\fR
.ad
.sp .6
.RS 4n
Force one of three actions to occur: takes ownership of a disk set when used
with \fB-t\fR; deletes the last disk drive from the disk set; or deletes the last
host from the disk set. Deleting the last drive or host from a disk set requires
the \fB-d\fR option.
.sp
When used to forcibly take ownership of the disk set, this causes the disk set
to be grabbed whether or not another host owns the set. All of the disks within
the set are taken over (reserved) and fail fast is enabled, causing the other
host to panic if it had disk set ownership. The metadevice state database is read
in by the host performing the take, and the shared metadevices contained in the
set are accessible.
.sp
You can use this option to delete the last drive in the disk set, because this
drive would implicitly contain the last state database replica.
.sp
You can use \fB-f\fR option to delete hosts from a set. When specified with a
partial list of hosts, it can be used for one-host administration. One-host
administration could be useful when a host is known to be non-functional, thus
avoiding timeouts and failed commands. When specified with a complete list of
hosts, the set is completely deleted. It is generally specified with a complete
list of hosts to clean up after one-host administration has been performed.
.RE

.sp
.ne 2
.mk
.na
\fB-h\fR \fIhostname.\|.\|.\fR
.ad
.sp .6
.RS 4n
Specify one or more host names to be added to or deleted from a disk set. Adding
the first host creates the set. The last host cannot be deleted unless all of the
drives within the set have been deleted. The host name is not accepted if all of
the drives within the set cannot be found on the specified host. The host name is
the same name found in \fB/etc/nodename\fR.
.RE

.sp
.ne 2
.mk
.na
\fB-j\fR
.ad
.sp .6
.RS 4n
Join a host to the owner list for a multi-owner disk set. The concepts of take
and release, used with traditional disk sets, do not apply to multi-owner sets,
because multiple owners are allowed.
.sp
As a host boots and is brought online, it must go through three configuration
levels to be able to use a multi-owner disk set:
.RS +4
.TP
1.
It must be included in the cluster nodelist, which happens automatically in a
cluster or single-node sitatuion.
.RE
.RS +4
.TP
2.
It must be added to the multi-owner disk set with the \fB-a\fR \fB-h\fR options
documented elsewhere in this man page
.RE
.RS +4
.TP
3.
It must join the set. When the host is first added to the set, it is
automatically joined.
.RE
On manual restarts, the administrator must manually issue
.sp
.in +2
.nf
metaset \fB-s\fR \fImultinodesetname\fR \fB-j\fR
.fi
.in -2
.sp

to join the host to the owner list. After the cluster reconfiguration, when the
host reenters the cluster, the node is automatically joined to the set. The
\fBmetaset\fR \fB-j\fR command joins the host to all multi-owner sets that the
host has been added to. In a single node situation, joining the node to the disk
set starts any necessary resynchronizations.
.RE

.sp
.ne 2
.mk
.na
\fB-L\fR
.ad
.sp .6
.RS 4n
When adding a disk to a disk set, force the disk to be repartitioned using the
standard Solaris Volume Manager algorithm. See \fBDESCRIPTION\fR.
.RE

.sp
.ne 2
.mk
.na
\fB-l\fR \fIlength\fR
.ad
.sp .6
.RS 4n
Set the size (in blocks) for the metadevice state database replica. The length
can only be set when adding a new drive; it cannot be changed on an existing
drive. The default (and maximum) size is 8192 blocks, which should be appropriate
for most configurations. Replica sizes of less than 128 blocks are not
recommended.
.RE

.sp
.ne 2
.mk
.na
\fB-M\fR
.ad
.sp .6
.RS 4n
Specify that the disk set to be created or modified is a multi-owner disk set
that supports multiple concurrent owners.
.sp
This option is required when creating a multi-owner disk set. Its use is
optional on all other operations on a multi-owner disk set and has no effect.
Existing disk sets cannot be converted to multi-owner sets.
.RE

.sp
.ne 2
.mk
.na
\fB-o\fR
.ad
.sp .6
.RS 4n
Return an exit status of \fB0\fR if the local host or the host specified with
the \fB-h\fR option is the owner of the disk set.
.RE

.sp
.ne 2
.mk
.na
\fB-P\fR
.ad
.sp .6
.RS 4n
Purge the named disk set from the node on which the \fBmetaset\fR command is
run. The disk set must not be owned by the node that runs this command. If the
node does own the disk set, the command fails.
.sp
If you need to delete a disk set but cannot take ownership of the set, use the
\fB-P\fR option.
.RE

.sp
.ne 2
.mk
.na
\fB-q\fR
.ad
.sp .6
.RS 4n
Displays an enumerated list of tags pertaining to ``tagged data'' that can be
encountered during a take of the ownership of a disk set.
.sp
This option is not for use with a multi-owner disk set.
.RE

.sp
.ne 2
.mk
.na
\fB-r\fR
.ad
.sp .6
.RS 4n
Release ownership of a disk set. All of the disks within the set are released.
The metadevices set up within the set are no longer accessible.
.sp
This option is not for use with a multi-owner disk set.
.RE

.sp
.ne 2
.mk
.na
\fB-s\fR \fIsetname\fR
.ad
.sp .6
.RS 4n
Specify the name of a disk set on which \fBmetaset\fR works. If no \fIsetname\fR
is specified, all disk sets are returned.
.RE

.sp
.ne 2
.mk
.na
\fB-t\fR
.ad
.sp .6
.RS 4n
Take ownership of a disk set safely. If \fBmetaset\fR finds that another host
owns the set, this host is not be allowed to take ownership of the set. If the
set is not owned by any other host, all the disks within the set are owned by the
host on which \fBmetaset\fR was executed. The metadevice state database is read
in, and the shared metadevices contained in the set become accessible. The
\fB-t\fR option takes a disk set that has stale databases. When the databases are
stale, \fBmetaset\fR exits with code 66, and prints a message. At that point, the
only operations permitted are the addition and deletion of replicas. Once the
addition or deletion of the replicas has been completed, the disk set should be
released and retaken to gain full access to the data.
.sp
This option is not for use with a multi-owner disk set.
.RE

.sp
.ne 2
.mk
.na
\fB-u\fR \fItagnumber\fR
.ad
.sp .6
.RS 4n
Once a tag has been selected, a subsequent take with \fB-u\fR \fItagnumber\fR
can be executed to select the data associated with the given \fItagnumber\fR.
.RE

.sp
.ne 2
.mk
.na
\fBw\fR
.ad
.sp .6
.RS 4n
Withdraws a host from the owner list for a multi-owner disk set. The concepts of
take and release, used with traditional disk sets, do not apply to multi-owner
sets, because multiple owners are allowed.
.sp
Instead of releasing a set, a host can issue
.sp
.in +2
.nf
metaset -s \fImultinodesetname\fR -w
.fi
.in -2
.sp

to withdraw from the owner list. A host automatically withdraws on a reboot, but
can be manually withdrawn if it should not be able to use the set, but should be
able to rejoin at a later time. A host that withdrew due to a reboot can still
appear joined from other hosts in the set until a reconfiguration cycle occurs.

.sp
\fBmetaset\fR \fB-w\fR withdraws from ownership of all multi-owner sets of which
the host is a member. This option fails if you attempt to withdraw the master
node while other nodes are in the disk set owner list. This option cancels all
resyncs running on the node. A cluster reconfiguration process that is removing a
node from the cluster membership list effectively withdraws the host from the
ownership list.
.RE

.sp
.ne 2
.mk
.na
\fB-y\fR
.ad
.sp .6
.RS 4n
Execute a subsequent take. If the take operation encounters ``tagged data,'' the
take operation exits with code 2. You can then run the \fBmetaset\fR command with
the \fB-q\fR option to see an enumerated list of tags.
.RE

.SH EXAMPLES
.LP
\fBExample 1 \fRDefining a Disk Set
.sp
.LP
This example defines a disk set.

.sp
.in +2
.nf
# metaset -s relo-red -a -h red blue
.fi
.in -2
.sp

.sp
.LP
The name of the disk set is \fBrelo-red\fR. The names of the first and second
hosts added to the set are \fBred\fR and \fBblue\fR, respectively. (The hostname
is found in \fB/etc/nodename\fR.) Adding the first host creates the disk set. A
disk set can be created with just one host, with the second added later. The last
host cannot be deleted until all of the drives within the set have been
deleted.

.LP
\fBExample 2 \fRAdding Drives to a Disk Set
.sp
.LP
This example adds drives to a disk set.

.sp
.in +2
.nf
# metaset -s relo-red -a c2t0d0 c2t1d0 c2t2d0 c2t3d0 c2t4d0 c2t5d0
.fi
.in -2
.sp

.sp
.LP
The name of the previously created disk set is \fBrelo-red\fR. The names of the
drives are \fBc2t0d0\fR, \fBc2t1d0\fR, \fBc2t2d0\fR, \fBc2t3d0\fR, \fBc2t4d0\fR,
and \fBc2t5d0\fR. There is no slice identifier ("s\fIx\fR") at the end of the
drive names.

.LP
\fBExample 3 \fRAdding Multiple Mediator Hosts
.sp
.LP
The following command adds three mediator hosts to the specified disk set.

.sp
.in +2
.nf
# metaset -s mydiskset -a -m myhost1,alias1 myhost2,alias2 myhost3,alias3
.fi
.in -2
.sp

.LP
\fBExample 4 \fRPurging a Disk Set from the Node
.sp
.LP
The following command purges the disk set \fBrelo-red\fR from the node:

.sp
.in +2
.nf
# metaset -s relo-red -P
.fi
.in -2
.sp

.LP
\fBExample 5 \fRQuerying a Disk Set for Tagged Data
.sp
.LP
The following command queries the disk set \fBrelo-red\fR for a list of the
tagged data:

.sp
.in +2
.nf
# metaset -s relo-red -q
.fi
.in -2
.sp

.sp
.LP
This command produces the following results:
.sp
.in +2
.nf
The following tag(s) were found:
 1 - vha-1000c - Fri Sep 20 17:20:08 2002
 2 - vha-1000c - Mon Sep 23 11:01:27 2002
.fi
.in -2
.sp

.LP
\fBExample 6 \fRSelecting a tag and taking a Disk set
.sp
.LP
The following command selects a tag and takes the disk set \fBrelo-red\fR:

.sp
.in +2
.nf
# metaset -s relo-red -t -u 2
.fi
.in -2
.sp

.LP
\fBExample 7 \fRDefining a Multi-Owner Disk Set
.sp
.LP
The following command defines a multi-owner disk set:

.sp
.in +2
.nf
# metaset -s blue -M -a -h hahost1 hahost2
.fi
.in -2
.sp

.sp
.LP
The name of the disk set is \fBblue\fR. The names of the first and second hosts
added to the set are \fBhahost1\fR and \fBhahost2\fR, respectively. The hostname
is found in \fB/etc/nodename\fR. Adding the first host creates the multi-owner
disk set. A disk set can be created with just one host, with additional hosts
added later. The last host cannot be deleted until all of the drives within the
set have been deleted.

.SH FILES
.sp
.ne 2
.mk
.na
\fB/etc/lvm/md.tab\fR
.ad
.sp .6
.RS 4n
Contains list of metadevice configurations.
.RE

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
\fB0\fR
.ad
.sp .6
.RS 4n
Successful completion.
.RE

.sp
.ne 2
.mk
.na
\fB>0\fR
.ad
.sp .6
.RS 4n
An error occurred.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWmdu
_
Interface StabilityStable
.TE

.SH SEE ALSO
.sp
.LP
\fBmdmonitord\fR(1M), \fBmetaclear\fR(1M), \fBmetadb\fR(1M),
\fBmetadetach\fR(1M), \fBmetahs\fR(1M), \fBmetainit\fR(1M),
\fBmetaoffline\fR(1M), \fBmetaonline\fR(1M), \fBmetaparam\fR(1M),
\fBmetarecover\fR(1M), \fBmetarename\fR(1M), \fBmetareplace\fR(1M),
\fBmetaroot\fR(1M), \fBmetassist\fR(1M), \fBmetastat\fR(1M), \fBmetasync\fR(1M),
\fBmetattach\fR(1M), \fBmd.tab\fR(4), \fBmd.cf\fR(4), \fBmddb.cf\fR(4),
\fBmd.tab\fR(4), \fBattributes\fR(5), \fBmd\fR(7D)
.sp
.LP
\fR
.SH NOTES
.sp
.LP
Disk set administration, including the addition and deletion of hosts and
drives, requires all hosts in the set to be accessible from the network.
