usr/src/man/man1m/metattach.1m
'\" te
.\" Copyright (c) 2004, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH metattach 1M "20 Jun 2006" "SunOS 5.11" "System Administration Commands"
.SH NAME
metattach, metadetach \- attach or detach a metadevice
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/metattach\fR [\fB-h\fR]
.fi

.LP
.nf
\fB/usr/sbin/metattach\fR [\fB-s\fR \fIsetname\fR] \fImirror\fR [\fImetadevice\fR]
.fi

.LP
.nf
\fB/usr/sbin/metattach\fR [\fB-s\fR \fIsetname\fR] [\fB-i\fR \fIinterlace\fR] \fIconcat/stripe\fR \fIcomponent.\|.\|.\fR
.fi

.LP
.nf
\fB/usr/sbin/metattach\fR [\fB-s\fR \fIsetname\fR] \fIRAID\fR \fIcomponent.\|.\|.\fR
.fi

.LP
.nf
\fB/usr/sbin/metattach\fR [\fB-s\fR \fIsetname\fR] [\fB-A\fR \fIalignment\fR] \fIsoftpart\fR \fIsize\fR |\fI all\fR
.fi

.LP
.nf
\fB/usr/sbin/metadetach\fR [\fB-s\fR \fIsetname\fR] [\fB-f\fR] \fImirror\fR \fIsubmirror\fR
.fi

.LP
.nf
\fB/usr/sbin/metadetach\fR [\fB-s\fR \fIsetname\fR] [\fB-f\fR] \fItrans\fR
.fi

.SH DESCRIPTION
.sp
.LP
.B metattach
adds submirrors to a mirror, grows metadevices, or grows
soft partitions. Growing metadevices can be done without interrupting
service. To grow the size of a mirror or trans, the slices must be added to
the submirrors or to the master devices.
.sp
.LP
Solaris Volume Manager supports storage devices and logical volumes greater
than 1 terabyte (TB) when a system runs a 64-bit Solaris kernel. Support for
large volumes is automatic. If a device greater than 1 TB is created,
Solaris Volume Manager configures it appropriately and without user
intervention.
.sp
.LP
If a system with large volumes is rebooted under a 32-bit Solaris kernel,
the large volumes are visible through
.B metastat
output. Large volumes
cannot be accessed, modified or deleted, and no new large volumes can be
created. Any volumes or file systems on a large volume in this situation are
also unavailable. If a system with large volumes is rebooted under a version
of Solaris prior to the Solaris 9 4/03 release, Solaris Volume Manager does
not start. You must remove all large volumes before Solaris Volume Manager
runs under an earlier version of the Solaris Operating System.
.sp
.LP
Solaris Volume Manager supports one-to-four-way mirrors. You can only
attach a metadevice to a mirror if there are three or fewer submirrors
beneath the mirror. Once a new metadevice is attached to a mirror,
.B metattach
automatically starts a resync operation to the new
submirror.
.sp
.LP
.B metadetach
detaches submirrors from mirrors and logging devices from
trans metadevices.
.sp
.LP
When a submirror is detached from a mirror, it is no longer part of the
mirror, thus reads and writes to and from that metadevice by way of the
mirror are no longer performed through the mirror. Detaching the only
existing submirror is not allowed. Detaching a submirror that has slices
reported as needing maintenance
.RB "(by " metastat )
is not allowed unless
the
.B -f
(force) flag is used.
.sp
.LP
.B metadetach
also detaches the logging device from a trans. This step
is necessary before you can clear the trans volume. Trans metadevices have
been replaced by UFS logging. Existing trans devices are not logging. They
pass data directly through to the underlying device. See \fBmount_ufs\fR(1M)
for more information about UFS logging.
.sp
.LP
Detaching the logging device from a busy trans device is not allowed unless
the
.B -f
(force) flag is used. Even so, the logging device is not
actually detached until the trans is idle. The trans is in the
.I Detaching
state (\fBmetastat\fR) until the logging device is
detached.
.SH OPTIONS
.sp
.LP
Root privileges are required for all of the following options except
.BR -h .
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -A
.I alignment
.ad
.RS 16n
.rt
Set the value of the soft partition extent alignment. Use this option when
it is important specify a starting offset for the soft partition. It
preserves the data alignment between the metadevice address space and the
address space of the underlying physical device.
.sp
For example, a hardware device that does checksumming should not have its
I/O requests divided by Solaris Volume Manager. In this case, use a value
from the hardware configuration as the value for the alignment. When using
this option in conjunction with a software I/O load, the alignment value
corresponds to the I/O load of the application. This prevents I/O from being
divided unnecessarily and affecting performance.
.RE

.sp
.ne 2
.mk
.na
.B -f
.ad
.RS 16n
.rt
Force the detaching of metadevices that have components that need
maintenance or are busy. You can use this option only when a mirror is in a
maintenance state that can be fixed with \fBmetareplace\fR(1M). If the
mirror is in a maintenance state that can only be fixed with
.BR metasync (1M)
(as shown by the output of
.BR metastat (1M)),
.B metadetach -f
has no effect, because the mirrors must be
resynchronized before one of them can be detached.
.RE

.sp
.ne 2
.mk
.na
.B -h
.ad
.RS 16n
.rt
Display a usage message.
.RE

.sp
.ne 2
.mk
.na
.B -i
.I interlace
.ad
.RS 16n
.rt
Specify the interlace value for stripes, where
.B size
is a specified
value followed by either
.B k
for kilobytes,
.B m
for megabytes, or
.B b
for blocks. The units can be either uppercase or lowercase. If
.I size
is not specified, the size defaults to the interlace size of the
last stripe of the metadevice. When an interlace size change is made on a
stripe, it is carried forward on all stripes that follow.
.RE

.sp
.ne 2
.mk
.na
.B -s
.I setname
.ad
.RS 16n
.rt
Specify the name of the diskset on which the
.B metattach
command or the
.B metadetach
command works.. Using the
.B -s
option causes the
command to perform its administrative function within the specified diskset.
Without this option, the command performs its function on local
metadevices.
.RE

.SH OPERANDS
.sp
.LP
The following operands are supported:
.sp
.ne 2
.mk
.na
.I component
.ad
.RS 17n
.rt
The logical name for the physical slice (partition) on a disk drive, such
as
.BR /dev/dsk/c0t0d0s2 ,
being added to the concatenation, stripe,
concatenation of stripes, or RAID5 metadevice.
.RE

.sp
.ne 2
.mk
.na
.I concat/stripe
.ad
.RS 17n
.rt
The metadevice name of the concatenation, stripe, or concatenation of
stripes.
.RE

.sp
.ne 2
.mk
.na
.I log
.ad
.RS 17n
.rt
The metadevice name of the logging device to be attached to the trans
metadevice.
.RE

.sp
.ne 2
.mk
.na
.I metadevice
.ad
.RS 17n
.rt
The metadevice name to be attached to the mirror as a submirror. This
metadevice must have been previously created by the
.BR metainit
command.
.RE

.sp
.ne 2
.mk
.na
.I mirror
.ad
.RS 17n
.rt
The name of the mirror.
.RE

.sp
.ne 2
.mk
.na
.I RAID
.ad
.RS 17n
.rt
The metadevice name of the RAID5 metadevice.
.RE

.sp
.ne 2
.mk
.na
.I size
|
.I all
.ad
.RS 17n
.rt
The amount of space to add to the soft partition in
.B K
or
.B k
for
kilobytes,
.B M
or
.B m
for megabytes,
.B G
or
.B g
for
gigabytes,
.B T
or
.B t
for terabytes, and
.B B
or
.B b
for
blocks (sectors). All values represent powers of 2, and upper and lower case
options are equivalent. Only integer values are permitted. The literal
.B all
specifies that the soft partition should grow to occupy all
available space on the underlying volume.
.RE

.sp
.ne 2
.mk
.na
.I softpart
.ad
.RS 17n
.rt
The metadevice name of the existing soft partition.
.RE

.sp
.ne 2
.mk
.na
.I submirror
.ad
.RS 17n
.rt
The metadevice name of the submirror to be detached from the mirror.
.RE

.sp
.ne 2
.mk
.na
.I trans
.ad
.RS 17n
.rt
The metadevice name of the trans metadevice (not the master or logging
device).
.RE

.SH EXAMPLES
.LP
.B Example 1
Concatenating a New Slice to a Metadevice
.sp
.LP
This example concatenates a single new slice to an existing metadevice,
.BR Volume.1 .
Afterwards, you would use the \fBgrowfs\fR(1M) command to
expand the file system.

.sp
.in +2
.nf
# metattach Volume.1 /dev/dsk/c0t1d0s2
.fi
.in -2
.sp

.LP
.B Example 2
Detaching Logging Device from Trans Metadevice
.sp
.LP
This example detaches the logging device from a trans metadevice
.BR d9 .
Notice that you do not have to specify the logging device itself, as there
can only be one.

.sp
.in +2
.nf
# metadetach d9
.fi
.in -2
.sp

.LP
.B Example 3
Expanding a RAID5 Metadevice
.sp
.LP
This example expands a RAID5 metadevice,
.BR d45 ,
by attaching another
slice.

.sp
.in +2
.nf
# metattach d45 /dev/dsk/c3t0d0s2
.fi
.in -2
.sp

.sp
.LP
When you add additional slices to a RAID5 metadevice, the additional space
is devoted to data. No new parity blocks are allocated. The data on the
added slices is, however, included in the overall parity calculations, so it
is protected against single-device failure.

.LP
.B Example 4
Expanding a Soft Partition
.sp
.LP
The following example expands a soft partition,
.BR d42 ,
attaching all
space available on the underlying device.

.sp
.in +2
.nf
# metattach d42 all
.fi
.in -2
.sp

.sp
.LP
When you add additional space to a soft partition, the additional space is
taken from any available space on the slice and might not be contiguous with
the existing soft partition.

.LP
.B Example 5
Adding Space to Two-Way Mirror
.sp
.LP
This example adds space to a two-way mirror by adding a slice to each
submirror. Afterwards, you would use the \fBgrowfs\fR(1M) command to expand
the file system.

.sp
.in +2
.nf
# metattach d9 /dev/dsk/c0t2d0s5
# metattach d10 /dev/dsk/c0t3d0s5
.fi
.in -2
.sp

.sp
.LP
This example tells the mirror to grow to the size of the underlying
devices

.sp
.in +2
.nf
# metattach d11
.fi
.in -2
.sp

.sp
.LP
This example increases the size of the UFS on the device so the space can
be used.

.sp
.in +2
.nf
# growfs -M /export /dev/md/rdsk/d11
.fi
.in -2
.sp

.LP
.B Example 6
Detaching a Submirror from a Mirror
.sp
.LP
This example detaches a submirror,
.BR d2 ,
from a mirror,
.BR d4 .

.sp
.in +2
.nf
# metadetach d4 d2
.fi
.in -2
.sp

.LP
.B Example 7
Adding Four Slices to Metadevice
.sp
.LP
This example adds four slices to an existing metadevice,
.BR d9 .
Afterwards, you would use the \fBgrowfs\fR(1M) command to expand the file
system.

.sp
.in +2
.nf
# metattach d9 /dev/dsk/c0t1d0s2 /dev/dsk/c0t2d0s2 \
     /dev/dsk/c0t3d0s2 /dev/dsk/c0t4d0s2
.fi
.in -2
.sp

.LP
.B Example 8
Setting the Value of the Soft Partition Extent Alignment
.sp
.LP
This example shows how to set the alignment of the soft partition to 1mb
when the soft partition is expanded.

.sp
.in +2
.nf
# metattach -s red -A 2m d13 1m
.fi
.in -2
.sp

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 6n
.rt
Successful completion.
.RE

.sp
.ne 2
.mk
.na
.B >0
.ad
.RS 6n
.rt
An error occurred.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWmdu
_
Interface StabilityStable
.TE

.SH SEE ALSO
.sp
.LP
.BR mdmonitord (1M),
.BR metaclear (1M),
.BR metadb (1M),
.BR metahs (1M),
.BR metainit (1M),
.BR metaoffline (1M),
.BR metaonline (1M),
.BR metaparam (1M),
.BR metarecover (1M),
.BR metarename (1M),
.BR metareplace (1M),
.BR metaroot (1M),
.BR metaset (1M),
.BR metassist (1M),
.BR metastat (1M),
.BR metasync (1M),
.BR md.tab (4),
.BR md.cf (4),
.BR mddb.cf (4),
.BR md.tab (4),
.BR attributes (5),
.BR md (7D)
.sp
.LP
\fR
.SH WARNINGS
.sp
.LP
This section provides information regarding warnings for devices greater
than 1 TB and for multi-way mirrors.
.SS "Devices and Volumes Greater Than 1 TB"
.sp
.LP
Do not create large (>1 TB) volumes if you expect to run the Solaris
Operating System with a 32-bit kernel or if you expect to use a version of
the Solaris Operating System prior to Solaris 9 4/03.
.SS "Multi-Way Mirrors"
.sp
.LP
When a submirror is detached from its mirror, the data on the metadevice
might not be the same as the data that existed on the mirror prior to
running
.BR metadetach .
In particular, if the
.B -f
option was needed,
the metadevice and mirror probably do not contain the same data.
.SH NOTES
.sp
.LP
Trans metadevices have been replaced by UFS logging. Existing trans devices
are
.B not
logging. They pass data directly through to the underlying
device. See \fBmount_ufs\fR(1M) for more information about UFS logging.
