usr/src/man/man1m/metaclear.1m
'\" te
.\" Copyright (c) 2003, Sun Microsystems, Inc.  All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH metaclear 1M "26 Mar 2006" "SunOS 5.11" "System Administration Commands"
.SH NAME
metaclear \- delete active metadevices and hot spare pools
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/metaclear\fR \fB-h\fR
.fi

.LP
.nf
\fB/usr/sbin/metaclear\fR [\fB-s\fR \fIsetname\fR] \fB-a\fR [\fB-f\fR]
.fi

.LP
.nf
\fB/usr/sbin/metaclear\fR \fIcomponent\fR
.fi

.LP
.nf
\fB/usr/sbin/metaclear\fR [\fB-s\fR \fIsetname\fR] [\fB-f\fR] \fImetadevice.\|.\|.\fR \fIhot_spare_pool.\|.\|.\fR
.fi

.LP
.nf
\fB/usr/sbin/metaclear\fR [\fB-s\fR \fIsetname\fR] \fB-r\fR [\fB-f\fR] \fImetadevice.\|.\|.\fR \fIhot_spare_pool.\|.\|.\fR
.fi

.LP
.nf
\fB/usr/sbin/metaclear\fR [\fB-s\fR \fIsetname\fR] \fB-p\fR \fIcomponent\fR
.fi

.LP
.nf
\fB/usr/sbin/metaclear\fR [\fB-s\fR \fIsetname\fR] \fB-p\fR \fImetadevice\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B metaclear
command deletes the specified metadevice or
.IR hot_spare_pool ,
or purges all soft partitions from the designated
component. Once a metadevice or hot spare pool is deleted, it must be
re-created using
.B metainit
before it can be used again.
.sp
.LP
Any metadevice currently in use (open) cannot be deleted.
.SH OPTIONS
.sp
.LP
Root privileges are required for all of the following options except
.BR -h .
.sp
.ne 2
.mk
.na
.B -a
.ad
.RS 14n
.rt
Deletes all metadevices and configured hot spare pools in the set named by
.BR -s ,
or the local set by default.
.RE

.sp
.ne 2
.mk
.na
\fB-f\fR
.ad
.RS 14n
.rt
Deletes (forcibly) a metadevice that contains a subcomponent in an error
state.
.RE

.sp
.ne 2
.mk
.na
.B -h
.ad
.RS 14n
.rt
Displays usage message.
.RE

.sp
.ne 2
.mk
.na
.B -p
.ad
.RS 14n
.rt
Deletes (purges) all soft partitions from the specified metadevice or
component.
.RE

.sp
.ne 2
.mk
.na
.B -r
.ad
.RS 14n
.rt
Recursively deletes specified metadevices and hot spare pools, but does not
delete metadevices on which others depend.
.RE

.sp
.ne 2
.mk
.na
\fB-s\fR \fIsetname\fR
.ad
.RS 14n
.rt
Specifies the name of the diskset on which
.B metaclear
will work. Using
the
.B -s
option causes the command to perform its administrative
function within the specified diskset. Without this option, the command
performs its function on local metadevices and/or hot spare pools.
.RE

.SH OPERANDS
.sp
.ne 2
.mk
.na
\fImetadevice\fR \fI\&.\|.\|.\fR
.ad
.RS 24n
.rt
Specifies the name(s) of the metadevice(s) to be deleted.
.RE

.sp
.ne 2
.mk
.na
.I component
.ad
.RS 24n
.rt
Specifies the
.B c*d*t*s*
name(s) of the components containing soft
partitions to be deleted.
.RE

.sp
.ne 2
.mk
.na
\fIhot_spare_pool\fR \fI\&.\|.\|.\fR
.ad
.RS 24n
.rt
Specifies the name(s) of the hot spare pools to be deleted. Names for hot
spare pools can be any legal file name that is composed of alphanumeric
characters, a dash ("-"), an underscore ("_"), or a period ("."). Names must
begin with a letter. The words "all" and "none" are reserved and cannot be
used.
.RE

.SH EXAMPLES
.LP
\fBExample 1\fR Deleting Various Devices
.sp
.LP
The following example deletes a metadevice named
.BR d10 .

.sp
.in +2
.nf
# metaclear /dev/md/dsk/d10
.fi
.in -2
.sp

.sp
.LP
The following example deletes all local metadevices and hot spare pools on
the system.

.sp
.in +2
.nf
# metaclear -a
.fi
.in -2
.sp

.sp
.LP
The following example deletes a mirror,
.BR mymirror ,
with a submirror in
an error state.

.sp
.in +2
.nf
# metaclear -f mymirror
.fi
.in -2
.sp

.sp
.LP
The following example deletes a hot spare pool, \fBhsp001\fR.

.sp
.in +2
.nf
# metaclear hsp001
.fi
.in -2
.sp

.sp
.LP
The following example deletes a soft partition, \fBd23\fR.

.sp
.in +2
.nf
# metaclear d23
.fi
.in -2
.sp

.sp
.LP
The following example purges all soft partitions on the slice
\fBc2t3d5s2\fR if those partitions are not being used by other metadevices
or are not open.

.sp
.in +2
.nf
# metaclear -p c2t3d5s2
.fi
.in -2
.sp

.sp
.LP
The following example purges soft partitions from a metadevice.

.sp
.in +2
.nf
# metaclear -p d2
d3: Soft Partition is cleared
d4: Soft Partition is cleared
d5: Soft Partition is cleared
.fi
.in -2
.sp

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 6n
.rt
Successful completion.
.RE

.sp
.ne 2
.mk
.na
.B >0
.ad
.RS 6n
.rt
An error occurred.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWmdu
_
Interface StabilityStable
.TE

.SH SEE ALSO
.sp
.LP
.BR mdmonitord (1M),
.BR metadb (1M),
.BR metadetach (1M),
.BR metahs (1M),
.BR metainit (1M),
\fBmetaoffline\fR(1M),
.BR metaonline (1M),
.BR metaparam (1M),
.BR metarecover (1M),
.BR metarename (1M),
.BR metareplace (1M),
.BR metaroot (1M),
.BR metaset (1M),
.BR metassist (1M),
.BR metastat (1M),
.BR metasync (1M),
.BR metattach (1M),
.BR md.tab (4),
\fBmd.cf\fR(4),
\fBmddb.cf\fR(4), \fBmd.tab\fR(4),
.BR attributes (5),
.BR md (7D)
.sp
.LP
\fR
