usr/src/man/man1m/mkdevalloc.1m
'\" te
.\" Copyright 2001, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH mkdevalloc 1M "8 Oct 2003" "SunOS 5.11" "System Administration Commands"
.SH NAME
mkdevalloc \- Make device_allocate entries
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/mkdevalloc\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B mkdevalloc
command writes to standard out a set of
.BR device_allocate (4)
entries describing the system's frame buffer, audio
and removable media devices.
.sp
.LP
The
.B mkdevalloc
command is used by the
.BR init.d (4)
scripts to
create or update the
.B /etc/security/device_allocate
file.
.sp
.LP
Entries are generated based on the device special files found in
.BR /dev .
For the different categories of devices, the
.B mkdevalloc
command checks for the following files under
.BR /dev :
.sp
.in +2
.nf
audio           /dev/audio, /dev/audioctl, /dev/sound/.\|.\|.
tape            /dev/rst*, /dev/nrst*, /dev/rmt/.\|.\|.
floppy          /dev/diskette, /dev/fd*, /dev/rdiskette, /dev/rfd*
removable disk  /dev/sr*, /dev/nsr*, /dev/dsk/c0t?d0s?, /dev/rdsk/c0t?d0s?
frame buffer    /dev/fb
.fi
.in -2

.sp
.LP
All entries set the
.I device-minimum
and
.I device-maximum
fields to
the hex representations of
.B ADMIN_LOW
and
.BR ADMIN_HIGH ,
respectively. The
.I device-authorization
field is set to
.BR solaris.device.allocate ,
except for the
.B framebuffer
entry, where
it is set to
.BR * .
The
.IR device-name ,
.I device-type
and
.I device-clean
fields are set to the following values:
.sp
.in +2
.nf
                device-name      device-type   device-clean

audio           audio            audio         audio_clean_wrapper
tape            mag_tape_0,1,.\|.\|. st            st_clean
floppy          floppy_0,1,.\|.\|.   fd            disk_clean
removable disk  cdrom_0,1,.\|.\|.    sr            disk_clean
frame buffer    framebuffer      fb            /bin/true
.fi
.in -2

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
_
Interface StabilityObsolete
.TE

.SH SEE ALSO
.sp
.LP
.BR allocate (1),
.BR bsmconv (1M),
.BR attributes (5)
.SH NOTES
.sp
.LP
.B mkdevalloc
might not be supported in a future release of the Solaris
operating system.
