usr/src/man/man1m/mkfifo.1m
'\" te
.\" Copyright (c) 1992, X/Open Company Limited  All Rights Reserved
.\" Copyright 1989 AT&T
.\" Portions Copyright (c) 2009, Sun Microsystems, Inc.  All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\"
.\" Sun Microsystems, Inc. gratefully acknowledges The Open Group for
.\" permission to reproduce portions of its copyrighted documentation.
.\" Original documentation from The Open Group can be obtained online
.\" at http://www.opengroup.org/bookstore/.
.\"
.\" The Institute of Electrical and Electronics Engineers and The Open Group,
.\" have given us permission to reprint portions of their documentation.
.\"
.\" In the following statement, the phrase "this text" refers to portions
.\" of the system documentation.
.\"
.\" Portions of this text are reprinted and reproduced in electronic form in
.\" the Sun OS Reference Manual, from IEEE Std 1003.1, 2004 Edition, Standard
.\" for Information Technology -- Portable Operating System Interface (POSIX),
.\" The Open Group Base Specifications Issue 6, Copyright (C) 2001-2004 by the
.\" Institute of Electrical and Electronics Engineers, Inc and The Open Group.
.\" In the event of any discrepancy between these versions and the original
.\" IEEE and The Open Group Standard, the original IEEE and The Open Group
.\" Standard is the referee document.
.\"
.\" The original Standard can be obtained online at
.\" http://www.opengroup.org/unix/online.html.
.\"
.\" This notice shall appear on any product containing this material.
.\"
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH mkfifo 1M "11 Aug 2009" "SunOS 5.11" "System Administration Commands"
.SH NAME
mkfifo \- make FIFO special file
.SH SYNOPSIS
.LP
.nf
\fB/usr/bin/mkfifo\fR [\fB-m\fR \fImode\fR] \fIpath\fR...
.fi

.SS "ksh93"
.LP
.nf
mkfifo [ \fIoptions\fR ] \fIfile\fR...
.fi

.SH DESCRIPTION
.SS "/usr/bin/mkfifo"
.sp
.LP
The
.BR mkfifo " utility creates the "
.B FIFO
special files named by its
argument list. The arguments are taken sequentially, in the order specified;
and each
.B FIFO
special file is either created completely or, in the
case of an error or signal, not created at all.
.sp
.LP
If errors are encountered in creating one of the special files,
.B mkfifo
writes a diagnostic message to the standard error and continues
with the remaining arguments, if any.
.sp
.LP
.RB "The " mkfifo " utility calls the library routine " mkfifo (3C),
with
the
.I path
argument is passed as the
.I path
argument from the
command line, and
.I mode
is set to the equivalent of
.BR a=rw ,
modified by the current value of the file mode creation mask
.BR umask (1).
.SS "ksh93"
.sp
.LP
.RB "The " mkfifo " utility creates one or more " FIFO s.
By default, the
mode of the created FIFO is
.B a=rw
minus the bits set in
.BR umask (1).
.SH OPTIONS
.SS "/usr/bin/ksh93"
.sp
.LP
The following option is supported for
.BR /usr/bin/mkfifo :
.sp
.ne 2
.mk
.na
.B -m
.I mode
.ad
.RS 11n
.rt
Set the file permission bits of the newly-created
.B FIFO
to the
specified
.I mode
value. The
.I mode
option-argument will be the same
as the
.I mode
operand defined for the
.BR chmod (1)
command. In
<\fIsymbolic\fRmode> strings, the \fIop\fR characters
.B +
and \fB\(mi\fR
will be interpreted relative to an assumed initial mode of
.BR a=rw .
.RE

.SS "ksh93"
.sp
.LP
The following option is supported for
.BR ksh93 :
.sp
.ne 2
.mk
.na
.B -m
.I mode
.ad
.br
.na
.BI --mode= mode
.ad
.RS 15n
.rt
Set the mode of the created FIFO to
.IR mode .
The
.IR mode
option-argument is a symbolic or octal mode as in
.BR chmod (1).
Relative
modes assume an initial mode of
.BR a=rw .
.RE

.SH OPERANDS
.sp
.LP
The following operand is supported:
.sp
.ne 2
.mk
.na
.I file
.ad
.RS 8n
.rt
A path name of the
.B FIFO
special file to be created.
.RE

.SH USAGE
.sp
.LP
See
.BR largefile (5)
for the description of the behavior of
.B mkfifo
when encountering files greater than or equal to 2 Gbyte ( 2^31 bytes).
.SH ENVIRONMENT VARIABLES
.sp
.LP
See
.BR environ (5)
for descriptions of the following environment
variables that affect the execution of
.BR mkfifo :
.BR LANG ,
.BR LC_ALL ,
.BR LC_CTYPE ,
.BR LC_MESSAGES ,
and
.BR NLSPATH .
.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 6n
.rt
All the specified
.B FIFO
special files were created successfully.
.RE

.sp
.ne 2
.mk
.na
.B >0
.ad
.RS 6n
.rt
An error occurred.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWesu
_
Interface StabilityStandard
.TE

.SH SEE ALSO
.sp
.LP
.BR chmod (1),
.BR umask (1),
.BR mkfifo (3C),
.BR attributes (5),
.BR environ (5),
.BR largefile (5),
.BR standards (5)
