usr/src/man/man1m/mkfile.1m
'\" te
.\" Copyright (c) 2001, Sun Microsystems, Inc.  All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH mkfile 1M "20 Feb 2008" "SunOS 5.11" "System Administration Commands"
.SH NAME
mkfile \- create a file
.SH SYNOPSIS
.LP
.nf
\fBmkfile\fR [\fB-nv\fR] \fIsize\fR [g | k | b | m] \fIfilename\fR...
.fi

.SH DESCRIPTION
.sp
.LP
.B mkfile
creates one or more files that are suitable for use as
.B NFS-mounted
swap areas, or as local swap areas. When a root user
executes
.BR mkfile() ,
the sticky bit is set and the file is padded with
zeros by default.   When non-root users execute
.BR mkfile() ,
they must
manually set the sticky bit using
.BR chmod (1).
The default
.B size
is
in bytes, but it can be flagged as gigabytes, kilobytes, blocks, or
megabytes, with the
.BR g ,
.BR k ,
.BR b ,
or
.B m
suffixes,
respectively.
.SH OPTIONS
.sp
.ne 2
.mk
.na
.B -n
.ad
.RS 6n
.rt
Create an empty
.IR filename .
The size is noted, but disk blocks are not
allocated until data is written to them. Files created with this option
cannot be swapped over local UFS mounts.
.RE

.sp
.ne 2
.mk
.na
.B -v
.ad
.RS 6n
.rt
Verbose.  Report the names and sizes of created files.
.RE

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 6n
.rt
Success.
.RE

.sp
.ne 2
.mk
.na
.B >0
.ad
.RS 6n
.rt
An error occurred.
.RE

.SH USAGE
.sp
.LP
See
.BR largefile (5)
for the description of the behavior of \fBmkfile\fR
when encountering files greater than or equal to 2 Gbyte ( 2^31 bytes).
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
.BR chmod (1),
.BR swap (1M),
.BR attributes (5),
.BR largefile (5)
