usr/src/man/man1m/mkfs_udfs.1m
'\" te
.\" Copyright (c) 2000 Sun Microsystems, Inc. All Rights Reserved.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH mkfs_udfs 1M "17 Nov 2000" "SunOS 5.11" "System Administration Commands"
.SH NAME
mkfs_udfs \- construct a udfs file system
.SH SYNOPSIS
.LP
.nf
\fBmkfs\fR \fB-F udfs\fR [\fIgeneric_options\fR] [\fB-o\fR \fIspecific_options\fR] \fIraw_device_file\fR
     [\fIsize\fR]
.fi

.SH DESCRIPTION
.sp
.LP
This is the universal disk format file system (\fBudfs\fR) -specific module
of the \fBmkfs\fR command. \fBmkfs\fR constructs a \fBudfs\fR file system
with a root directory.
.SH OPTIONS
.sp
.LP
See \fBmkfs\fR(1M) for the list of supported
.IR generic_options .
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -o
.I specific_options
.ad
.RS 23n
.rt
Specify a \fBudfs\fR-specific option. Specify \fBudfs\fR file system
specific options in a comma-separated list with no intervening spaces. If
invalid options are specified, a warning message is printed and the invalid
options are ignored.
.sp
The following
.I specific_options
are available:
.sp
.ne 2
.mk
.na
.B N
.ad
.RS 16n
.rt
Print the file system parameters without actually creating the file
system.
.RE

.sp
.ne 2
.mk
.na
\fBlabel=\fIstring\fR
.ad
.RS 16n
.rt
Specify the label to be written into the volume header structures. Specify
.I string
as the name of the label. If
.I string
is not specified, a
default
.I string
is generated in the form of
.BR *NoLabel* .
.RE

.RE

.SH OPERANDS
.sp
.LP
The following operands are supported:
.sp
.ne 2
.mk
.na
.I raw_device_file
.ad
.RS 19n
.rt
 Specify the disk partition on which to write.
.RE

.sp
.ne 2
.mk
.na
.I size
.ad
.RS 19n
.rt
Specify the number of 512-byte blocks in the file system.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWudf
.TE

.SH SEE ALSO
.sp
.LP
\fBfsck\fR(1M),\fBmkfs\fR(1M), \fBattributes\fR(5)
.SH DIAGNOSTICS
.sp
.in +2
.nf
not currently a valid file system
.fi
.in -2
.sp

.sp
.LP
The specified device does not contain a valid
.B udfs
file system.
.sp
.in +2
.nf
Invalid size: larger than the partition size
.fi
.in -2
.sp

.sp
.LP
Number of blocks given as parameter to create the file system is larger than
the size of the device specified.
.sp
.in +2
.nf
is mounted can't mkfs
.fi
.in -2
.sp

.sp
.LP
Device is in use, cannot create file system when the device is in use.
.sp
.in +2
.nf
preposterous size
.fi
.in -2
.sp

.sp
.LP
Negative size parameter provided is invalid.
.sp
.in +2
.nf
sector size must be between 512, 8192 bytes
.fi
.in -2
.sp

.sp
.LP
Sector size given is not in the valid range.
.sp
.in +2
.nf
Volume integrity sequence descriptors too long
File set descriptor too long.
.fi
.in -2
.sp

.sp
.LP
Not enough space to create volume integrity sequence or file set
descriptor.
.sp
.in +2
.nf
mkfs: argument out of range
.fi
.in -2
.sp

.sp
.LP
One of the arguments is out of range.
.sp
.in +2
.nf
mkfs: bad numeric arg
.fi
.in -2
.sp

.sp
.LP
One of the arguments is potentially a bad numeric.
.SH NOTES
.sp
.LP
You can use \fBlofiadm\fR to create a file that appears to a \fBmkfs\fR
command (for example,
.B mkfs_pcfs
or
.BR mkfs_ufs )
as a raw device. You
can then use a
.B mkfs
command to create a file system on that device. See
.BR lofiadm (1M)
for examples of creating a UFS and a PC (FAT) file system
on a device created by
.BR lofiadm .
