usr/src/man/man1m/mknod.1m
'\" te
.\" Copyright 1989 AT&T  Copyright (c) 1996, Sun Microsystems, Inc.  All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH mknod 1M "16 Sep 1996" "SunOS 5.11" "System Administration Commands"
.SH NAME
mknod \- make a special file
.SH SYNOPSIS
.LP
.nf
\fBmknod\fR \fIname\fR b \fImajor\fR \fIminor\fR
.fi

.LP
.nf
\fBmknod\fR \fIname\fR c \fImajor\fR \fIminor\fR
.fi

.LP
.nf
\fBmknod\fR \fIname\fR p
.fi

.SH DESCRIPTION
.sp
.LP
.B mknod
makes a directory entry for a special file.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B b
.ad
.RS 5n
.rt
Create a block-type special file.
.RE

.sp
.ne 2
.mk
.na
.B c
.ad
.RS 5n
.rt
Create a character-type special file.
.RE

.sp
.ne 2
.mk
.na
.B p
.ad
.RS 5n
.rt
Create a FIFO (named pipe).
.RE

.SH OPERANDS
.sp
.LP
The following operands are supported:
.sp
.ne 2
.mk
.na
.I major
.ad
.RS 9n
.rt
The
.I major
device number.
.RE

.sp
.ne 2
.mk
.na
.I minor
.ad
.RS 9n
.rt
The
.I minor
device number; can be either decimal or octal. The
assignment of major device numbers is specific to each system. You must be
the super-user to use this form of the command.
.RE

.sp
.ne 2
.mk
.na
.I name
.ad
.RS 9n
.rt
A special file to be created.
.RE

.SH USAGE
.sp
.LP
See
.BR largefile (5)
for the description of the behavior of
.BR mknod
when encountering files greater than or equal to 2 Gbyte ( 2^31 bytes).
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.sp
.LP
.BR ftp (1),
.BR in.ftpd (1M),
.BR mknod (2),
.BR symlink (2),
.BR attributes (5),
.BR largefile (5)
.SH NOTES
.sp
.LP
If
.BR mknod (2)
is used to create a device, the major and minor device
numbers are always interpreted by the kernel running on that machine.
.sp
.LP
With the advent of physical device naming, it would be preferable to create
a symbolic link to the physical name of the device (in the \fB/devices\fR
subtree) rather than using
.BR mknod .
