usr/src/man/man1m/mkpwdict.1m
'\" te
.\" Copyright (c) 2004, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH mkpwdict 1M "1 Jun 2004" "SunOS 5.11" "System Administration Commands"
.SH NAME
mkpwdict \- maintain password-strength checking database
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/mkpwdict\fR [\fB-s\fR \fIdict1\fR,.\|.\|. ,\fIdictN\fR]
     [\fB-d\fR \fIdestination-path\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The
.B mkpwdict
command adds words to the dictionary-lookup database
used by
.BR pam_authtok_check (5)
and
.BR passwd (1).
.sp
.LP
Files containing words to be added to the database can be specified on the
command-line using the
.B -s
flag. These source files should have a
single word per line, much like
.BR /usr/share/lib/dict/words .
.sp
.LP
If
.B -s
is omitted,
.B mkpwdict
will use the value of
.B DICTIONLIST
specified in
.B /etc/default/passwd
(see
.BR passwd (1)).
.sp
.LP
The database is created in the directory specified by the
.B -d
option.
If this option is omitted,
.B mkpwdict
uses the value of
.B DICTIONDBDIR
specified in
.B /etc/default/passwd
(see
.BR passwd (1)).
The default location is
.BR /var/passwd .
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -s
.ad
.RS 6n
.rt
Specifies a comma-separated list of files containing words to be added to
the dictionary-lookup database.
.RE

.sp
.ne 2
.mk
.na
.B -d
.ad
.RS 6n
.rt
Specifies the target location of the dictionary-database.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/default/passwd
.ad
.RS 23n
.rt
See
.BR passwd (1).
.RE

.sp
.ne 2
.mk
.na
.B /var/passwd
.ad
.RS 23n
.rt
default destination directory
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
_
Interface StabilityEvolving
.TE

.SH SEE ALSO
.sp
.LP
.BR passwd (1),
.BR attributes (5),
.BR pam_authtok_check (5)
