usr/src/man/man1m/mmsadm.1m
'\" te
.\" Copyright (c) 2009, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH mmsadm 1M "16 Apr 2009" "SunOS 5.11" "System Administration Commands"
.SH NAME
mmsadm \- administration command for the Media Management System
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/mmsadm\fR [\fB-h\fR | \fB-?\fR]
.fi

.LP
.nf
\fBmmsadm\fR discover [\fB-H\fR] [\fB-t\fR library|drive|vol] [\fB-S\fR \fIACSLS-host\fR[:\fIport\fR]] \fB-a\fR
.fi

.LP
.nf
\fBmmsadm\fR create \fB-t\fR library|drive|mpool|dpool|app|voltype
     \fB-o\fR \fIoption\fR=\fIx\fR [\fB-o\fR \fIoption2\fR=\fIy\fR.\|.\|.] \fIname\fR
.fi

.LP
.nf
\fBmmsadm\fR delete \fB-t\fR library|drive|mpool|dpool|app|voltype
     [\fB-f\fR] \fIname\fR
.fi

.LP
.nf
\fBmmsadm\fR set \fB-t\fR library|drive|mpool|dpool|app|voltype
     \fB-o\fR \fIoption\fR=\fIx\fR [\fB-o\fR \fIoption2\fR=\fIy\fR.\|.\|.] \fIname\fR
.fi

.LP
.nf
\fBmmsadm\fR list [\fB-vH\fR] \fB-t\fR library|drive|mpool|dpool|app|voltype
     \fB-o\fR \fIoption\fR=\fIx\fR [\fB-o\fR \fIoption2\fR=\fIy\fR.\|.\|.] [\fB-F\fR \fIfilter\fR [\fB-F\fR \fIfilter2\fR.\|.\|.] [\fIname\fR]
.fi

.LP
.nf
\fBmmsadm\fR passwd [\fB-P\fR \fIfile\fR] \fIname\fR
.fi

.LP
.nf
\fBmmsadm\fR online \fB-t\fR library|drive \fIname\fR
.fi

.LP
.nf
\fBmmsadm\fR offline \fB-t\fR library|drive \fIname\fR
.fi

.LP
.nf
\fBmmsadm\fR add-volume \fB-l\fR \fIlibrary\fR \fB-o\fR voltype=\fItype\fR \fB-x\fR \fIvol1\fR[,\fIvol2\fR,.\|.\|.] \fImpool\fR
.fi

.LP
.nf
\fBmmsadm\fR remove-volume \fB-x\fR [\fB-l\fR \fIlibrary\fR] [\fB-x\fR \fIvol1\fR[,\fIvol2\fR,.\|.\|.]] \fImpool\fR
.fi

.LP
.nf
\fBmmsadm\fR label [\fB-n\fR] [\fB-A\fR \fIapplication\fR] [\fB-l\fR \fIlibrary\fR]
     [\fB-P\fR \fIfile\fR]\fIvolume\fR[,\fIvolume\fR,.\|.\|.]]
.fi

.LP
.nf
\fBmmsadm\fR showreq [\fB-H\fR] [\fIdrivename\fR]
.fi

.LP
.nf
\fBmmsadm\fR accept [\fB-r\fR "\fIreason\fR"] \fIrequestid\fR
.fi

.LP
.nf
\fBmmsadm\fR reject [\fB-r\fR "\fIreason\fR"] \fIrequestid\fR
.fi

.LP
.nf
\fBmmsadm\fR dbbackup \fIdirectory\fR
.fi

.LP
.nf
\fBmmsadm\fR dbrestore \fIfile\fR
.fi

.LP
.nf
\fBmmsadm\fR mount [\fB-n\fR] [\fB-N\fR] [\fB-d\fR \fIdrive\fR] [\fB-D\fR \fIdensity\fR] \fB-A\fR \fIapplication\fR \fB-l\fR \fIlibrary\fR
     [\fB-P\fR \fIpasswordfile\fR] [\fB-u\fR \fIusername\fR] [\fB-b\fR \fIblocksize\fR] [\fB-R\fR]
     [\fB-M\fR \fImode\fR[,\fImode\fR.\|.\|.] \fIvolume\fR
.fi

.LP
.nf
\fBmmsadm\fR unmount [\fB-A\fR \fIapplication\fR] [\fB-P\fR \fIfile\fR] [\fB-f\fR] \fIvolume\fR|\fIpseudodevice\fR
.fi

.SH DESCRIPTION
.sp
.LP
The Media Management System (MMS) is a software interface that manages
removable storage media such as tape libraries, tape drives, media pools,
tape volumes, and disk resources that emulate tape drives and tape volumes.
It is an implementation of the IEEE 1244 specification for removable
media.
.sp
.LP
The MMS consists of an MM server and database that control various library
managers and drive managers. Administrators use
.B mmsadm
and its
subcommands to configure and maintain storage resources from a variety of
vendors. The MMS management commands, such as
.BR mmsadm ,
construct and
issue the most frequently-used Media Management Protocol (MMP) commands,
handling all events and acknowledgments. The MMP is defined in the IEEE 1244
specification.
.sp
.LP
The
.BR mmsinit "(1M) command must be run to initialize MMS on a system"
before you can use the
.B mmsadm
command.
.sp
.LP
The
.B mmsadm
command is RBAC-compliant. (See
.BR rbac (5).)
Required
authorizations vary among individual subcommands and are listed in the
descriptions of those subcommands.
.SH SUB-COMMANDS
.sp
.LP
The
.B mmsadm
supports the subcommands listed below. Each subcommand
description includes a description of that subcommand's options and
operands. A
.B mmsadm
command takes the form:
.sp
.in +2
.nf
# \fBmmsadm\fR \fIsubcommand\fR [\fIoptions\fR]
.fi
.in -2
.sp

.SS "\fBdiscover\fR Subcommand"
.sp
.LP
The
.B discover
subcommand displays the library, drives, or volumes on
an Automated Control System Library Server (ACSLS) server, or the tape
drives connected to the local system. Use this command to determine what
resources are available and whether they have been configured for use with
MMS.
.sp
.LP
.B discover
requires the
.B solaris.smf.read.mms
authorization. The
subcommand has the following syntax:
.sp
.in +2
.nf
\fBmmsadm discover\fR [\fB-H\fR] [\fB-t\fR \fBlibrary\fR|\fBdrive\fR|\fBvol\fR]
     [\fB-S\fR \fIACSLS-host\fR[:\fIport\fR]] \fB-a\fR
.fi
.in -2
.sp

.sp
.LP
The subcommand options are described as follows.
.sp
.ne 2
.mk
.na
.B -a
.ad
.sp .6
.RS 4n
Displays all discovered resources, including those configured for MMS. By
default, only unconfigured resources are displayed.
.RE

.sp
.ne 2
.mk
.na
.B -H
.ad
.sp .6
.RS 4n
Displays the resources in a manner parseable by scripts. The display does
not include headers and it separates fields with a tab character.
.RE

.sp
.ne 2
.mk
.na
\fB-S\fR \fIACSLS-host\fR[:\fIport\fR]\fR
.ad
.sp .6
.RS 4n
Displays resources managed by the specified server and port. The default
port number is 50004. If the
.B -S
option is not used, the command
displays tape drives connected to the local system.
.RE

.sp
.ne 2
.mk
.na
\fB-t library\fR|\fBdrive\fR|\fBvol\fR
.ad
.sp .6
.RS 4n
Displays only the specified type of resource:
.sp
.ne 2
.mk
.na
.B -t library
.ad
.sp .6
.RS 4n
Shows discovered libraries.
.RE

.sp
.ne 2
.mk
.na
.B -t drive
.ad
.sp .6
.RS 4n
Shows discovered drives.
.RE

.sp
.ne 2
.mk
.na
.B -t vol
.ad
.sp .6
.RS 4n
Shows discovered volumes.
.RE

If this option is not used, library and drive resources are included in the
display. The number of volumes can be large so their discovery must be
requested explicitly.
.RE

.SS "\fBcreate\fR and \fBset\fR Subcommands"
.sp
.LP
The
.B create
subcommand configures the resource to be managed by MMS.
The
.B set
subcommand modifies the attributes of a resource managed by
MMS. These subcommands share a common set of options.
.sp
.LP
ACSLS-controlled libraries and disk archiving libraries are supported.
Libraries must be configured before any drive pool and drives managed in
that library can be configured, or any volumes managed by the library added
to media pools.
.B voltype
must be configured before adding volumes to
media pools.
.sp
.LP
The
.B create
and
.B set
subcommands require the
.BR solaris.smf.modify.mms ,
.BR solaris.smf.value.mms ,
.BR solaris.mms.* ,
and
.B solaris.smf.read.mms
authorizations, with the
exception of changing tracing attributes. If changing the size of trace
files or trace level, only
.B solaris.mms.device.log
and
.B solaris.smf.read.mms
authorizations are required.
.sp
.LP
These subcommands have the following syntax:
.sp
.in +2
.nf
\fBcreate\fR \fB-t\fR \fBlibrary|drive|mpool|dpool|app|voltype\fR
     \fB-o\fR \fIoption\fR=\fIx\fR [\fB-o\fR \fIoption2\fR=\fIy\fR.\|.\|.] \fIname\fR

\fBset\fR \fB-t\fR \fBlibrary|drive|mpool|dpool|app|voltype\fR
     \fB-o\fR \fIoption\fR=\fIx\fR [\fB-o\fR \fIoption2\fR=\fIy\fR.\|.\|.] \fIname\fR
.fi
.in -2
.sp

.sp
.LP
The subcommand options and operand are described as follows.
.sp
.ne 2
.mk
.na
.B -t
.I type
.ad
.sp .6
.RS 4n
Specifies the type of resource being created or modified.
.I type
can be
one of:
.sp
.ne 2
.mk
.na
.B library
.ad
.RS 11n
.rt
Tape library
.RE

.sp
.ne 2
.mk
.na
.B drive
.ad
.RS 11n
.rt
Tape or disk archiving drive
.RE

.sp
.ne 2
.mk
.na
.B mpool
.ad
.RS 11n
.rt
Media pool
.RE

.sp
.ne 2
.mk
.na
.B dpool
.ad
.RS 11n
.rt
Drive pool
.RE

.sp
.ne 2
.mk
.na
.B app
.ad
.RS 11n
.rt
MMS-aware application
.RE

.sp
.ne 2
.mk
.na
.B voltype
.ad
.RS 11n
.rt
An MMS construct to map tape cartridge types (such as LTO3) to a
user-defined type. Allows the user to specify a default cartridge size for
this type of tape.
.RE

.RE

.sp
.ne 2
.mk
.na
\fB-o\fR \fIoption\fR=\fIx\fR [\fB-o\fR \fIoption2\fR=\fIy\fR.\|.\|.]\fR
.ad
.sp .6
.RS 4n
Options are key/value pairs and are specific to the resource type.
.sp
Library Options:
.sp
.ne 2
.mk
.na
\fBhwtype=\fItype\fR
.ad
.sp .6
.RS 4n
Specify one of the supported library types: L180, L500, L700, SL500,
SL8500, or SL3000. This option is required for
.B create
operations.
.RE

For disk archiving libraries, specify
.BR DISK .
.sp
The following are options for real network attached libraries.
.sp
.ne 2
.mk
.na
\fBacs=\fIacs_number\fR
.ad
.sp .6
.RS 4n
Specifies the ACSLS ACS number for the library, as shown by the
.B discover
subcommand. Required for
.BR create .
.RE

.sp
.ne 2
.mk
.na
\fBlsm=\fIlsm_number\fR
.ad
.sp .6
.RS 4n
Specifies the ACSLS LSM number for the library, as shown by the
.B discover
subcommand. Required for
.BR create .
.RE

.sp
.ne 2
.mk
.na
\fBserialno=\fIserial_num\fR
.ad
.sp .6
.RS 4n
Specifies the serial number of the library as reported by the
.B discover
subcommand. Required for
.BR create .
.RE

.sp
.ne 2
.mk
.na
\fBacsls=\fIhost\fR[:\fIport\fR]\fR
.ad
.sp .6
.RS 4n
Identifies the host and port number of the ACSLS server controlling the
library. If not specified, the default port is
.BR 50004 .
Required for
.BR create .
.RE

The following are options for disk archiving libraries.
.sp
.ne 2
.mk
.na
\fBdkpath=\fIpath\fR
.ad
.sp .6
.RS 4n
Defines the default path of the DISK library. The path specifies the parent
directory of the library and its name must not be the last component of the
path.
.RE

.sp
.ne 2
.mk
.na
\fBdkaltpath=\fIhost1\fR@\fIdirectory1\fR[,\fIhost2\fR@\fIdirectory2\fR]\fR
.ad
.sp .6
.RS 4n
Defines the path of a
.B DISK
library in a host which cannot use the
default path to access the
.B DISK
library. The path specifies the parent
directory of the library and its name must not be the last component of the
path.
.RE

All libraries have the following options.
.sp
.ne 2
.mk
.na
.B msg-level=emergency|alert|critical|error|warning|notice|
.ad
.br
.na
.B information|debug
.ad
.sp .6
.RS 4n
Specifies the level of detail in messages written to the log file. The
default level is
.BR error .
.RE

.sp
.ne 2
.mk
.na
.B trace-level=emergency|alert|critical|error|warning|
.ad
.br
.na
.B notice|information|debug
.ad
.sp .6
.RS 4n
Specifies the level of detail in messages written to the trace file. The
default level is
.BR error .
.RE

.sp
.ne 2
.mk
.na
\fBtrace-file-size=\fIsize\fR
.ad
.sp .6
.RS 4n
Specifies the maximum size of the trace file before it is rotated and
restarted. Specify the size using a value and the character that identifies
the unit:
.RS +4
.TP
.ie t \(bu
.el o
.B K
for kilobytes
.RE
.RS +4
.TP
.ie t \(bu
.el o
.B M
for megabytes
.RE
.RS +4
.TP
.ie t \(bu
.el o
.B G
for gigabytes
.RE
The default size is 10 megabytes. To set the maximum size of the trace file
to 15 megabytes (for example), enter:
.sp
.in +2
.nf
trace-file-size=15M
.fi
.in -2
.sp

.RE

Drive Options:
.sp
.ne 2
.mk
.na
\fBhwtype=\fItype\fR
.ad
.sp .6
.RS 4n
Specifies the drive type as reported from the
.B discover
subcommand.
Required for
.BR create .
.RE

.sp
.ne 2
.mk
.na
\fBserialno=\fIserial\fR
.ad
.sp .6
.RS 4n
Specifies the serial number of the drive as reported from the discover
subcommand. Required for
.BR create .
.RE

.sp
.ne 2
.mk
.na
\fBlibrary=\fIlibrary_name\fR
.ad
.sp .6
.RS 4n
Defines the MMS identifier of the library controlling this drive as
reported from the
.B list
subcommand. Required for
.BR create .
.RE

.sp
.ne 2
.mk
.na
\fBconnection=\fIhost\fR,[\fIhost\fR]\fR
.ad
.sp .6
.RS 4n
Identifies the host name or IP address to which the drive is physically
connected. If the drive is multiported, enter each host separated by a
comma. Required for
.BR create .
.RE

.sp
.ne 2
.mk
.na
\fBapps=\fIapp1\fR[,\fIapp2\fR,.\|.\|.]\fR
.ad
.sp .6
.RS 4n
Specifies which applications registered with MMS can use this drive. To
specify that more than one application can use this drive, enter each
application name, separated by commas.
.RE

.sp
.ne 2
.mk
.na
.B msg-level=emergency|alert|critical|error|warning|notice|
.ad
.br
.na
.B information|debug
.ad
.sp .6
.RS 4n
Specifies the level of detail in messages written to the log file. The
default level is
.BR error .
.RE

.sp
.ne 2
.mk
.na
.B trace-level=emergency|alert|critical|error|warning|
.ad
.br
.na
.B notice|information|debug
.ad
.sp .6
.RS 4n
Specifies the level of detail in messages written to the trace file. The
default level is
.BR error .
.RE

.sp
.ne 2
.mk
.na
\fBtrace-file-size=\fIsize\fR
.ad
.sp .6
.RS 4n
Specifies the maximum size of the trace file before it is rotated and
restarted. Specify the size using a value and the character that identifies
the unit:
.RS +4
.TP
.ie t \(bu
.el o
.B K
for kilobytes
.RE
.RS +4
.TP
.ie t \(bu
.el o
.B M
for megabytes
.RE
.RS +4
.TP
.ie t \(bu
.el o
.B G
for gigabytes
.RE
The default size is 10 megabytes. To set the maximum size of the trace file
to 15 megabytes (for example), enter:
.sp
.in +2
.nf
trace-file-size=15M
.fi
.in -2
.sp

.RE

.sp
.ne 2
.mk
.na
\fBunload-time=\fInum_minutes\fR
.ad
.sp .6
.RS 4n
Specifies the maximum time an unused volume is left in a drive before it is
ejected. After an application has finished using a volume, it is often left
in the drive. This is to speed up requests if the same volume is needed
again in a short amount of time. This option ensures the drive is emptied
and available to load other volumes when requested. The default number of
minutes is
.BR 60 .
.RE

.sp
.ne 2
.mk
.na
.B reserve=yes|no
.ad
.sp .6
.RS 4n
Defines whether access to a drive is enforced. Use
.B yes
to use SCSI
reserve and release commands to enforce access to the drive. Use
.B no
to
not use SCSI reservations. Use
.B no
only if the drive behaves improperly
when access is enforced, or if the drive does not support the SCSI
reservation commands. The default value is
.BR yes .
.RE

Drive Pool Options
.sp
Specifies which applications registered with MMS can use this drive pool.
To specify that more than one application can use this pool, enter each
application name, separated by commas.
.sp
Media Pool Options
.sp
.ne 2
.mk
.na
\fBapps=\fIapp1\fR[,\fIapp2\fR,.\|.\|.]\fR
.ad
.sp .6
.RS 4n
Specifies which applications registered with MMS can use this media pool.
To specify that more than one application can use this pool, enter each
application name, separated by commas.
.RE

Application Options
.sp
.ne 2
.mk
.na
\fBretain=\fInum_days\fR
.ad
.sp .6
.RS 4n
Specifies the number of days that the volume's data is preserved after the
expiration date defined by the application for a volume. The default value
is 0.
.RE

.sp
.ne 2
.mk
.na
.B validate-expiration=yes|no
.ad
.sp .6
.RS 4n
Specifies whether overwriting unexpired files is allowed. Use
.B no
to
allow overwriting of unexpired volume files. Use
.B yes
to prevent
overwriting unexpired volume files. The default value is
.BR no .
.RE

.sp
.ne 2
.mk
.na
.B validate-volid=yes|no
.ad
.sp .6
.RS 4n
Specifies whether the volume identifier is verified. Use
.B yes
to
verify that the volume ID obtained from the
.B "mmsadm mount"
command
matches the volume identifier on the volume label. Use
.B no
to specify
that this verification is not done. The default value is
.BR yes .
.RE

.sp
.ne 2
.mk
.na
.B validate-filename=yes|no
.ad
.sp .6
.RS 4n
Specifies whether the file name is verified. Use
.B yes
to verify that
the file name obtained from the
.B "mmsadm mount"
command matches the file
name on the HDR1 header label of the file. Use
.B no
to specify that this
verification is not done. The default value is
.BR no .
.RE

.sp
.ne 2
.mk
.na
.B overwrite-existing=yes|no|ask
.ad
.sp .6
.RS 4n
This option is only for unlabeled volumes that are not blank. It specifies
whether the data on an unlabeled volume can be overwritten. The default is
.B yes
to indicate data can be overwritten. Use
.B no
to reject any
write requests. Use
.B ask
to prompt an operator for his wish when a
write request is received.
.RE

System Options
.sp
.ne 2
.mk
.na
.B log-level=emergency|alert|critical|error|warning|notice|
.ad
.br
.na
.B information|debug
.ad
.sp .6
.RS 4n
Specifies the level of detail in messages written to the log file. The
default level is
.BR error .
.RE

.sp
.ne 2
.mk
.na
\fBnum-restarts=\fInum\fR
.ad
.sp .6
.RS 4n
Specifies the number of attempts to start a failed daemon before the drive
or library associated with the daemon is disabled and requires the \fBmmsadm
online\fR command to be run after the problem with the system or device is
resolved. Use a value of -1 for unlimited restart attempts. The default
value is
.BR 3 .
.RE

.sp
.ne 2
.mk
.na
.B attended=yes|no
.ad
.sp .6
.RS 4n
Specify whether MMS makes operator requests when an operation cannot be
automatically satisfied. An example of such a case would be if a \fBmount\fR
request was made for a tape volume that had been physically removed from a
library. The default action,
.BR yes ,
indicates that an operator is
available to respond. Use
.B no
to specify that no operator is available.
If no operator is available, all operator requests are rejected.
.RE

.sp
.ne 2
.mk
.na
\fBnum-sockets=\fInum\fR
.ad
.sp .6
.RS 4n
Specifies the number of open file descriptors the MM daemon can have at one
time. On a resource-constrained system, set this value to a number between
30 and 65536. It is not recommended to set the value to less than 256. The
default value is
.BR -1 ,
meaning an unlimited number of file
descriptors.
.RE

.sp
.ne 2
.mk
.na
\fBdisk-timeout=\fIseconds\fR
.ad
.sp .6
.RS 4n
Specifies the time a disk archiving drive manager waits for the file system
containing a disk archiving volume to become available. It is strongly
recommended to set the time to a minimum of 120 seconds (two minutes). Use a
value of
.B 0
to specify no expiration time.
.RE

.B dkvol
Options
.sp
.ne 2
.mk
.na
\fBdirname=\fIpath\fR
.ad
.sp .6
.RS 4n
Required by (and only valid for)
.BR create .
Specifies the directory in
which the new disk archiving volume will created.
.RE

.sp
.ne 2
.mk
.na
\fBsize=\fInum\fR
.ad
.sp .6
.RS 4n
Valid only for
.BR create .
Specifies the size, in megabytes, of the disk
archiving volume.
.RE

.sp
.ne 2
.mk
.na
.B readonly=true|false
.ad
.sp .6
.RS 4n
Sets the volume to read-only or to allow write operations. The default is
.BR false ,
meaning that the disk archiving volume is writeable.
.RE

.sp
.ne 2
.mk
.na
\fBmpool=\fIpool_name\fR
.ad
.sp .6
.RS 4n
Media pool to which this disk archiving volume will be added after it is
created. This option is required for
.BR create .
.RE

.B dkdrive
Options
.sp
.ne 2
.mk
.na
\fBapps=\fIapp1\fR[,\fIapp2\fR,.\|.\|.]\fR
.ad
.sp .6
.RS 4n
Specifies which applications registered with MMS can use this drive. To
specify that more than one application can use this drive, enter each
application name, separated by commas.
.RE

.sp
.ne 2
.mk
.na
.B msg-level=emergency|alert|critical|error|warning|notice|
.ad
.br
.na
.B information|debug
.ad
.sp .6
.RS 4n
Specifies the level of detail in messages written to the log file. The
default level is
.BR error .
.RE

.sp
.ne 2
.mk
.na
.B trace-level=emergency|alert|critical|error|warning|
.ad
.br
.na
.B notice|information|debug
.ad
.sp .6
.RS 4n
Specifies the level of detail in messages written to the trace file. The
default level is
.BR error .
.RE

.sp
.ne 2
.mk
.na
\fBtrace-file-size=\fIsize\fR
.ad
.sp .6
.RS 4n
Specifies the maximum size of the trace file before it is rotated and
restarted. Specify the size using a value and the character that identifies
the unit:
.RS +4
.TP
.ie t \(bu
.el o
.B K
for kilobytes
.RE
.RS +4
.TP
.ie t \(bu
.el o
.B M
for megabytes
.RE
.RS +4
.TP
.ie t \(bu
.el o
.B G
for gigabytes
.RE
The default size is 10 megabytes. To set the maximum size of the trace file
to 15 megabytes (for example), enter:
.sp
.in +2
.nf
trace-file-size=15M
.fi
.in -2
.sp

.RE

.sp
.ne 2
.mk
.na
\fBunload-time=\fInum_minutes\fR
.ad
.sp .6
.RS 4n
Specifies the maximum time an unused volume is left in a drive before it is
ejected. After an application has finished using a volume, it is often left
in the drive. This is to speed up requests if the same volume is needed
again in a short amount of time. This option ensures the drive is emptied
and available to load other volumes when requested. The default number of
minutes is
.BR 60 .
.RE

.B voltype
Options
.sp
.ne 2
.mk
.na
\fBmediatype=\fItype\fR
.ad
.sp .6
.RS 4n
One of the supported media types:
.BR 9940 ,
.BR 9940_worm ,
.BR 9840 ,
.BR 9840_worm ,
.BR 9840C_worm ,
.BR 9840D_worm ,
.BR LTO1 ,
.BR LTO2 ,
.BR LTO3 ,
.BR LTO3_worm ,
.BR LTO4 ,
.BR LTO4_worm ,
.BR SDLT2 ,
and
.BR DISK .
This option is required for
.BR create .
.RE

.sp
.ne 2
.mk
.na
\fR
.ad
.br
.na
\fBsize=\fInum\fR
.ad
.sp .6
.RS 4n
The size, in megabytes, of the this volume type. This option is required
for
.BR create .
.RE

.RE

.sp
.LP
The
.B create
and
.B set
subcommands have the following operand.
.sp
.ne 2
.mk
.na
.I name
.ad
.sp .6
.RS 4n
Specifies the name of the resource being added or modified. With the
exception of applications, names are simple text strings, and they must be
unique for their resource type. Recommended naming conventions are:
.sp
For a library: \fBLIB_\fItype\fR_\fIserial\fR
.sp
.RB Example: " LIB_L180_MPC02209500"
.sp
For a drive: \fBDRV_\fItype\fR_\fIserial\fR
.sp
.RB Example: " DRV_T9940B_479000010675"
.sp
For a disk archive volume: \fBVOL_\fIxxxxxx\fR
.sp
Application names must reflect the name the application itself is going to
use when communicating with MMS. Check the application documentation to find
this value.
.RE

.SS "\fBdelete\fR Subcommand"
.sp
.LP
The
.B delete
subcommand deletes the entry for the specified resource
from the MMS configuration. Use caution when removing media pools, as this
might result in data loss. If the resource to be deleted is determined to be
in use, the operation will be rejected unless the
.B -f
option is
specified.
.sp
.LP
Deleting a library involves deleting all associated drives, and removing
volumes managed by this library from media pools. Deleting a library is
prohibited if any of its associated drives is actively in use, or any of its
volumes have been used by an application.
.sp
.LP
Deleting a drive is prohibited if it is actively in use.
.sp
.LP
Deleting a drive pool is prohibited if any of its drives is being used by
an application.
.sp
.LP
Deleting a media pool is prohibited if any of its volumes is being used by
an application.
.sp
.LP
Deleting an application will cause all volumes that have been used by that
application to be recycled and made available for reuse. Ensure that all
required data has been copied from these volumes before deleting the
application.
.sp
.LP
Deleting a
.B voltype
is prohibited if any volumes are assigned that
type. The
.B -f
option cannot be used to force this operation.
.sp
.LP
The
.B delete
subcommand requires the
.B solaris.smf.value.mms
and
.B solaris.mms.*
authorizations.
.sp
.LP
This subcommand has the following syntax:
.sp
.in +2
.nf
\fBmmsadm delete\fR \fB-t\fR \fBlibrary|drive|mpool|dpool|app|voltype\fR
     [\fB-f\fR] \fIname\fR
.fi
.in -2
.sp

.sp
.LP
The subcommand has the following options:
.sp
.ne 2
.mk
.na
.B -f
.ad
.sp .6
.RS 4n
Forces the removal of the specified resource, subject to the restrictions
outlined above.
.RE

.sp
.ne 2
.mk
.na
.B -t library|drive|mpool|dpool|app|voltype
.ad
.sp .6
.RS 4n
Specifies the type of resource being deleted.
.RE

.sp
.LP
The subcommand has the following operand:
.sp
.ne 2
.mk
.na
.I name
.ad
.sp .6
.RS 4n
Identifies the resource as reported by the
.B list
subcommand.
.RE

.SS "\fBlist\fR Subcommand"
.sp
.LP
The
.B list
subcommand displays all of the storage resources or messages
that meet the criteria specified in the options, filter, and name
parameters. This subcommand is available to any user.
.sp
.LP
This subcommand has the following syntax:
.sp
.in +2
.nf
\fBmmsadm list\fR [\fB-vH\fR] \fB-t\fR \fBlibrary|drive|mpool|dpool|app|voltype\fR
     \fB-o\fR \fIoption\fR[,\fB-o\fR \fIoption2\fR,.\|.\|.] [\fB-F\fR \fIfilter\fR [\fB-F\fR \fIfilter2\fR.\|.\|.] [\fIname\fR]
.fi
.in -2
.sp

.sp
.LP
The
.B list
subcommand has all of the options that are supported by the
.B create
and
.B set
subcommands. See the section on these subcommands
for descriptions of those options. In addition to these options, \fBlist\fR
has the options and operand listed below.
.sp
.ne 2
.mk
.na
.B -v
.ad
.sp .6
.RS 4n
Verbose.
.RE

.sp
.ne 2
.mk
.na
.B -H
.ad
.sp .6
.RS 4n
Displays the information in a manner parseable by scripts. The display does
not include headers and it separates fields with a tab character.
.RE

.sp
.ne 2
.mk
.na
.B -t
.I type
.ad
.sp .6
.RS 4n
One of:
.RS +4
.TP
.ie t \(bu
.el o
.B app
.RE
.RS +4
.TP
.ie t \(bu
.el o
.B drive
.RE
.RS +4
.TP
.ie t \(bu
.el o
.B library
.RE
.RS +4
.TP
.ie t \(bu
.el o
.B mpool
.RE
.RS +4
.TP
.ie t \(bu
.el o
.B dpool
.RE
.RS +4
.TP
.ie t \(bu
.el o
.B voltype
.RE
.RE

.sp
.ne 2
.mk
.na
\fB-o\fR \fIoption\fR[,\fB-o\fR \fIoption2\fR,.\|.\|.]\fR
.ad
.sp .6
.RS 4n
Specifies which properties of a resource are displayed. For example, to
list only drive names and their respective states, enter:
.sp
.in +2
.nf
% \fBmmsadm list -t drive -o name,state\fR
.fi
.in -2
.sp

.RE

.sp
.ne 2
.mk
.na
\fB-F\fR \fIfilter\fR [\fB-F\fR \fIfilter2\fR.\|.\|.]\fR
.ad
.sp .6
.RS 4n
Restricts the listed items to those with specified filter. Filter names are
the same as option names, and results are restricted to those resources that
match the option value. For example, to show all drives of type
.BR LTO4 ,
enter:
.sp
.in +2
.nf
# \fBmmsadm list -t drive -F hwtype=LTO4\fR
.fi
.in -2
.sp

Each resource type has its own options. All options are listed below. Most
options are in common with the
.B create
subcommand; see the section on
that subcommand for descriptions of these common options. Those options that
are supported only by the
.B list
subcommand have their descriptions
below.
.sp
Library Options
.sp
Options in common with
.BR set :
.RS +4
.TP
.ie t \(bu
.el o
.B acs
.RE
.RS +4
.TP
.ie t \(bu
.el o
.B acsls
.RE
.RS +4
.TP
.ie t \(bu
.el o
.B hwtype
.RE
.RS +4
.TP
.ie t \(bu
.el o
.B lsm
.RE
.RS +4
.TP
.ie t \(bu
.el o
.B msg-level
.RE
.RS +4
.TP
.ie t \(bu
.el o
.B serialno
.RE
.RS +4
.TP
.ie t \(bu
.el o
.B trace-file-size
.RE
.RS +4
.TP
.ie t \(bu
.el o
.B trace-level
.RE
The following library options are unique to
.BR list .
.sp
.ne 2
.mk
.na
.B create-time
.ad
.sp .6
.RS 4n
The date and time when the library was added to the MMS.
.RE

.sp
.ne 2
.mk
.na
.B state
.ad
.sp .6
.RS 4n
The current state of the library, one of
.BR ready ,
.BR offline ,
or
.BR broken .
.RE

Drive Options
.sp
Options in common with
.BR set :
.RS +4
.TP
.ie t \(bu
.el o
.B apps
.RE
.RS +4
.TP
.ie t \(bu
.el o
.B connection
.RE
.RS +4
.TP
.ie t \(bu
.el o
.B hwtype
.RE
.RS +4
.TP
.ie t \(bu
.el o
.B library
.RE
.RS +4
.TP
.ie t \(bu
.el o
.B msg-level
.RE
.RS +4
.TP
.ie t \(bu
.el o
.B reserve
.RE
.RS +4
.TP
.ie t \(bu
.el o
.B serialno
.RE
.RS +4
.TP
.ie t \(bu
.el o
.B trace-file-size
.RE
.RS +4
.TP
.ie t \(bu
.el o
.B trace-level
.RE
.RS +4
.TP
.ie t \(bu
.el o
.B unload-time
.RE
The following drive options are unique to
.BR list .
.sp
.ne 2
.mk
.na
.B create-time
.ad
.sp .6
.RS 4n
The date and time when the drive was added to the MMS.
.RE

.sp
.ne 2
.mk
.na
.B device-name
.ad
.sp .6
.RS 4n
The Unix device name of the drive, if available.
.RE

.sp
.ne 2
.mk
.na
.B last-mount
.ad
.sp .6
.RS 4n
The date and time when the drive was last mounted.
.RE

.sp
.ne 2
.mk
.na
.B state
.ad
.sp .6
.RS 4n
The current state of the drive, one of
.BR ready ,
.BR offline ,
or
.BR broken .
.RE

.sp
.ne 2
.mk
.na
.B total-mount-time
.ad
.sp .6
.RS 4n
The total amount of time the drive has had tapes mounted.
.RE

.sp
.ne 2
.mk
.na
.B volume
.ad
.sp .6
.RS 4n
The volume name of the volume loaded in the drive, if any.
.RE

Media Pool Options
.sp
There is one option in common with
.BR create ,
.BR apps .
.sp
The following media pool options are unique to
.BR list .
.sp
.ne 2
.mk
.na
.B create-time
.ad
.sp .6
.RS 4n
The date and time the media pool was created.
.RE

.sp
.ne 2
.mk
.na
.B free
.ad
.sp .6
.RS 4n
The total amount of free space remaining on volumes in the media pool.
.RE

.sp
.ne 2
.mk
.na
.B size
.ad
.sp .6
.RS 4n
The total capacity of the media pool.
.RE

.sp
.ne 2
.mk
.na
.B used
.ad
.sp .6
.RS 4n
The total amount of data on volumes in the media pool.
.RE

Application Options
.sp
All of the application options are in common with
.BR create .
These
options are as follows:
.RS +4
.TP
.ie t \(bu
.el o
.B overwrite-existing
.RE
.RS +4
.TP
.ie t \(bu
.el o
.B retain
.RE
.RS +4
.TP
.ie t \(bu
.el o
.B validate-expiration
.RE
.RS +4
.TP
.ie t \(bu
.el o
.B validate-filename
.RE
.RS +4
.TP
.ie t \(bu
.el o
.B validate-volid
.RE
System Options
.sp
Options in common with
.BR set :
.RS +4
.TP
.ie t \(bu
.el o
.B acsls-install-dir
.RE
.RS +4
.TP
.ie t \(bu
.el o
.B attended
.RE
.RS +4
.TP
.ie t \(bu
.el o
.B disk-timeout
.RE
.RS +4
.TP
.ie t \(bu
.el o
.B host
.RE
.RS +4
.TP
.ie t \(bu
.el o
.B log-file
.RE
.RS +4
.TP
.ie t \(bu
.el o
.B log-level
.RE
.RS +4
.TP
.ie t \(bu
.el o
.B port
.RE
.RS +4
.TP
.ie t \(bu
.el o
.B num-restarts
.RE
.RS +4
.TP
.ie t \(bu
.el o
.B num-sockets
.RE
There is one system option unique to
.BR list .
.sp
.ne 2
.mk
.na
.B active-sessions
.ad
.sp .6
.RS 4n
Brief listing of active sessions.
.RE

Volume Options
.sp
All of the volume options are unique to
.BR list .
.sp
.ne 2
.mk
.na
.B apps
.ad
.sp .6
.RS 4n
Lists the application that has stored data on this volume.
.RE

.sp
.ne 2
.mk
.na
.B create-time
.ad
.sp .6
.RS 4n
Date and time this volume was added to the MMS.
.RE

.sp
.ne 2
.mk
.na
.B free
.ad
.sp .6
.RS 4n
Amount of free space on the volume.
.RE

.sp
.ne 2
.mk
.na
.B last-mounted
.ad
.sp .6
.RS 4n
Date and time this volume was last mounted.
.RE

.sp
.ne 2
.mk
.na
.B library
.ad
.sp .6
.RS 4n
Lists the library controlling this volume.
.RE

.sp
.ne 2
.mk
.na
.B mpool
.ad
.sp .6
.RS 4n
Media pool, of which this volume is a member.
.RE

.sp
.ne 2
.mk
.na
.B num-mounts
.ad
.sp .6
.RS 4n
Number of times this volume has been mounted.
.RE

.sp
.ne 2
.mk
.na
.B size
.ad
.sp .6
.RS 4n
Size of the volume.
.RE

.sp
.ne 2
.mk
.na
.B total-mount-time
.ad
.sp .6
.RS 4n
Total amount of time this volume has been mounted.
.RE

.sp
.ne 2
.mk
.na
.B used
.ad
.sp .6
.RS 4n
Amount of data written to the volume.
.RE

.sp
.ne 2
.mk
.na
.B voltype
.ad
.sp .6
.RS 4n
Lists the volume type as was specified when the volume was added to a media
pool.
.RE

Volume Type Options
.sp
Both of the volume type options are unique to
.BR list .
.sp
.ne 2
.mk
.na
.B mtype
.ad
.sp .6
.RS 4n
MMS media type associated with this
.BR voltype .
.RE

.sp
.ne 2
.mk
.na
.B size
.ad
.sp .6
.RS 4n
Default size, in megabytes, for volumes of this type.
.RE

.RE

.SS "The \fBpasswd\fR Subcommand"
.sp
.LP
The
.B passwd
subcommand changes the password for the MMS administrator,
MMS Database administrator, or for MMS applications. If the
.B -P
option
is not specified, the user will be prompted to enter the password.
.sp
.LP
The
.B passwd
subcommand has the following syntax.
.sp
.in +2
.nf
\fBmmsadm passwd\fR [\fB-P\fR \fIpasswdfile\fR] \fIname\fR
.fi
.in -2
.sp

.sp
.LP
This subcommand requires the
.B solaris.smf.value.mms
and
.B solaris.mms.*
authorizations.
.sp
.LP
The
.B passwd
subcommand has the following option.
.sp
.ne 2
.mk
.na
.B -P
.I passwdfile
.ad
.sp .6
.RS 4n
Path to a temporary file containing the password.
.RE

.sp
.LP
The
.B passwd
subcommand has the following operand.
.sp
.ne 2
.mk
.na
.I name
.ad
.sp .6
.RS 4n
Use
.B admin
to change the MMS administrative password. Use
.B dbadmin
to change the MMS database administrative password. Use the
application name to change the password for any other application.
.RE

.SS "The \fBonline\fR and \fBoffline\fR Subcommands"
.sp
.LP
The
.B online
and
.B offline
subcommands control whether the
specified library or drive is available to clients. If a library is set to
.BR offline ,
all drives and volumes managed by that library are
unavailable. If a drive is set to
.BR offline ,
no volume can be mounted or
accessed on that drive.
.sp
.LP
The syntax for the
.B online
and
.B offline
subcommands is as
follows:
.sp
.in +2
.nf
\fBmmsadm online\fR \fB-t\fR \fBlibrary\fR | \fBdrive\fR \fIname\fR

\fBmmsadm offline\fR \fB-t\fR \fBlibrary\fR | \fBdrive\fR \fIname\fR
.fi
.in -2
.sp

.sp
.LP
The
.B online
and
.B offline
subcommands require the
.B solaris.smf.read.mms
and
.BR solaris.mms.device.state.*
authorizations.
.sp
.LP
The
.B online
and
.B offline
subcommands have the following option.
.sp
.ne 2
.mk
.na
.B -t library
|
.B drive
.ad
.sp .6
.RS 4n
Specifies the type of resource to make unavailable or to restore.
.sp
.ne 2
.mk
.na
.B drive
.ad
.sp .6
.RS 4n
Tape or disk archiving drive.
.RE

.sp
.ne 2
.mk
.na
.B library
.ad
.sp .6
.RS 4n
Tape library.
.RE

.RE

.sp
.LP
The
.B online
and
.B offline
subcommands have the following
operand.
.sp
.ne 2
.mk
.na
.I name
.ad
.sp .6
.RS 4n
Name of the library or drive, as reported by the
.B list
subcommand
.RE

.SS "The \fBlabel\fR Subcommand"
.sp
.LP
The
.B label
subcommand labels specified volumes. The subcommand has the
following syntax:
.sp
.in +2
.nf
\fBmmsadm label\fR [\fB-n\fR] \fB-l\fR \fIlibrary\fR \fB-A\fR \fIapplication\fR [\fB-P\fR \fIfile\fR]
     \fIvolume\fR[,\fIvolume\fR,.\|.\|.]
.fi
.in -2
.sp

.sp
.LP
The
.B label
subcommand requires the
.B solaris.smf.read.mms
and
.B solaris.mms.media.*
authorizations.
.sp
.LP
The
.B label
subcommand has the following options.
.sp
.ne 2
.mk
.na
.B -l
.I library
.ad
.sp .6
.RS 4n
Name of the library holding the volume.
.RE

.sp
.ne 2
.mk
.na
.B -n
.ad
.sp .6
.RS 4n
Do not mount the volume. If this is not specified, the specified volume
will be mounted and header labels will be written.
.RE

.sp
.ne 2
.mk
.na
.B -A
.I application
.ad
.sp .6
.RS 4n
Name of the application to which this volume will be assigned after
labeling.
.RE

.sp
.ne 2
.mk
.na
.B -P
.I file
.ad
.sp .6
.RS 4n
Path to a file containing the application password. If a file name is not
provided, the user is prompted for the password.
.RE

.sp
.LP
The
.B label
subcommand has the following operand.
.sp
.ne 2
.mk
.na
\fIvolume\fR[,\fIvolume\fR,.\|.\|.]\fR
.ad
.sp .6
.RS 4n
Volume(s) to be labeled.
.RE

.SS "The \fBadd-volume\fR Subcommand"
.sp
.LP
The
.B add-volume
subcommand adds new volumes to the specified media
pool. The subcommand has the following syntax:
.sp
.in +2
.nf
\fBmmsadm add-volume\fR \fB-l\fR \fIlibrary_name\fR \fB-o\fR \fBvoltype\fR=\fItype\fR
     \fB-x\fR \fIvol1\fR[,\fIvol2\fR,.\|.\|.] \fImpool\fR
.fi
.in -2
.sp

.sp
.LP
The
.B add-volume
subcommand requires the
.B solaris.smf.read.mms
and
.B solaris.mms.media.*
authorizations.
.sp
.LP
The
.B add-volume
subcommand has the following options.
.sp
.ne 2
.mk
.na
.B -l
.I library_name
.ad
.sp .6
.RS 4n
Name of the library from which volumes are selected.
.RE

.sp
.ne 2
.mk
.na
.BR "-o voltype" =\fItype\fR
.ad
.sp .6
.RS 4n
Volumes to be added will be assigned the
.B voltype
specified here. To
add volumes of different types to the same media pool, use the \fBmmsadm
add-volume\fR command multiple times, specifying a different \fBvoltype\fR
each time.
.RE

.sp
.ne 2
.mk
.na
\fB-x\fR \fIvol1\fR[,\fIvol2\fR,.\|.\|.]\fR
.ad
.sp .6
.RS 4n
A comma-separated list of unused volumes in the specified library.
.RE

.sp
.LP
The
.B add-volume
subcommand has the following operand.
.sp
.ne 2
.mk
.na
.I mpool
.ad
.sp .6
.RS 4n
Name of the media pool as reported by the
.B list
subcommand.
.RE

.SS "The \fBremove-volume\fR Subcommand"
.sp
.LP
The
.B remove-volume
subcommand removes volumes from the specified media
pools. If a volume is being used by an application, the force option,
.BR -f ,
is required. If the option is not included in the command, the
request is rejected. This subcommand prompts for confirmation unless
.B -f
is provided. The subcommand has the following syntax:
.sp
.in +2
.nf
\fBmmsadm remove-volume\fR \fB-f\fR \fB-x\fR [\fB-l\fR \fIlibrary\fR] \fIvol1\fR[,\fIvol2\fR,.\|.\|.] \fImpool\fR
.fi
.in -2
.sp

.sp
.LP
The
.B remove-volume
subcommand requires the \fBsolaris.smf.read.mms\fR
and
.B solaris.mms.media.*
authorizations.
.sp
.LP
The
.B remove-volume
subcommand has the following options.
.sp
.ne 2
.mk
.na
.B -f
.ad
.sp .6
.RS 4n
Forces the removal of the specified volume(s), even if they are in use by
an application.
.RE

.sp
.ne 2
.mk
.na
.B -l
.I library_name
.ad
.sp .6
.RS 4n
Name of the library from which volumes are removed.
.RE

.sp
.ne 2
.mk
.na
\fB-x\fR \fIvol1\fR[,\fIvol2\fR,.\|.\|.]\fR
.ad
.sp .6
.RS 4n
A comma-separated list of volumes.
.RE

.sp
.LP
The
.B remove-volume
subcommand has the following operand.
.sp
.ne 2
.mk
.na
.I mpool
.ad
.sp .6
.RS 4n
Name of the media pool as reported by the
.B list
subcommand.
.RE

.SS "The \fBshowreq\fR Subcommand"
.sp
.LP
The
.B showreq
subcommand lists any pending operator requests, each with
a request identifier. The subcommand has the following syntax:
.sp
.in +2
.nf
\fBmmsadm showreq\fR [\fB-H\fR] [\fIdrivename\fR]
.fi
.in -2
.sp

.sp
.LP
The
.B showreq
subcommand does not require any authorizations.
.sp
.LP
The
.B showreq
subcommand has the following option.
.sp
.ne 2
.mk
.na
.B -H
.ad
.sp .6
.RS 4n
Displays the requests in a manner parseable by scripts. The display does
not include headers; fields are separated with a tab character.
.RE

.sp
.LP
The
.B showreq
subcommand has the following operand.
.sp
.ne 2
.mk
.na
.I drivename
.ad
.sp .6
.RS 4n
Displays the requests only for the specified drive.
.RE

.SS "The \fBaccept\fR Subcommand"
.sp
.LP
The
.B accept
subcommand accepts the operator request so that the MMS
can proceed with the operation. The subcommand has the following syntax.
.sp
.in +2
.nf
\fBmmsadm accept\fR [\fB-r\fR "\fIresponse text\fR"] \fIrequestid\fR
.fi
.in -2
.sp

.sp
.LP
The
.B accept
subcommand requires the
.B solaris.mms.request.*
and
.B solaris.smf.read.mms
authorizations.
.sp
.LP
The
.B accept
subcommand has the following option.
.sp
.ne 2
.mk
.na
\fB-r\fR "\fIresponse text\fR"\fR
.ad
.sp .6
.RS 4n
Displays the text that explains the reason for the action.
.RE

.sp
.LP
The
.B accept
subcommand has the following operand.
.sp
.ne 2
.mk
.na
.I requestid
.ad
.sp .6
.RS 4n
The identifier of the operator request, as displayed by the \fBmmsadm
showreq\fR command.
.RE

.SS "The \fBreject\fR Subcommand"
.sp
.LP
The
.B reject
subcommand rejects the operator request. The subcommand
has the following syntax.
.sp
.in +2
.nf
\fBmmsadm reject\fR [\fB-r\fR "\fIresponse text\fR"] \fIrequestid\fR
.fi
.in -2
.sp

.sp
.LP
The
.B reject
subcommand requires the
.B solaris.mms.request.*
and
.B solaris.smf.read.mms
authorizations.
.sp
.LP
The
.B reject
subcommand has the following option.
.sp
.ne 2
.mk
.na
\fB-r\fR "\fIresponse text\fR"\fR
.ad
.sp .6
.RS 4n
Displays the text that explains the reason for the action.
.RE

.sp
.LP
The
.B reject
subcommand has the following operand.
.sp
.ne 2
.mk
.na
.I requestid
.ad
.sp .6
.RS 4n
The identifier of the operator request, as displayed by the \fBmmsadm
showreq\fR command.
.RE

.SS "The \fBdbbackup\fR Subcommand"
.sp
.LP
The
.B dbbackup
subcommand creates a backup file containing the contents
of the MMS database. This file can be used to restore the MMS database in
the case of accidental removal, corruption, or other destructive event. It
is strongly suggested this backup file be created on a regular basis, and
backed up as part of the system backups. The subcommand has the following
syntax.
.sp
.in +2
.nf
\fBmmsadm dbbackup\fR \fIdirectory\fR
.fi
.in -2
.sp

.sp
.LP
The
.B dbbackup
subcommand requires the
.BR solaris.smf.manage.mms ,
.BR solaris.smf.value.mms ,
and
.B solaris.mms.*
authorizations.
.sp
.LP
The
.B dbbackup
subcommand has the following operand.
.sp
.ne 2
.mk
.na
.I directory
.ad
.sp .6
.RS 4n
Specifies the location where the database backup files will be stored.
.RE

.SS "The \fBdbrestore\fR Subcommand"
.sp
.LP
The
.B dbrestore
subcommand restores the MMS database from the specified
file. The database is restored to the state it was in at the time the file
was created by the
.B "mmsadm dbbackup"
command. The subcommand has the
following syntax
.sp
.in +2
.nf
\fBmmsadm dbrestore\fR \fIfilename\fR
.fi
.in -2
.sp

.sp
.LP
The
.B dbrestore
subcommand requires the \fBsolaris.smf.manage.mms\fR
and
.B solaris.smf.value.mms
authorizations.
.sp
.LP
The
.B dbrestore
subcommand has the following operand.
.sp
.ne 2
.mk
.na
.I filename
.ad
.sp .6
.RS 4n
Specifies the complete pathname to the file containing the backup of the
MMS database.
.RE

.SS "The \fBmount\fR Subcommand"
.sp
.LP
The
.B mount
subcommand mounts a specified volume. The subcommand has
the following syntax.
.sp
.in +2
.nf
\fBmmsadm mount\fR [\fB-n\fR] [\fB-N\fR] [\fB-d\fR \fIdrive\fR] [\fB-D\fR \fIdensity\fR]
     \fB-A\fR \fIapplication\fR \fB-l\fR \fIlibrary\fR [\fB-P\fR \fIfile\fR] [\fB-u\fR \fIusername\fR]
     [\fB-b\fR \fIblocksize\fR] [\fB-R\fR] [\fB-M\fR \fImode\fR[,\fImode\fR.\|.\|.] \fIvolume\fR
.fi
.in -2
.sp

.sp
.LP
The
.B mount
subcommand requires the
\fBsolaris.mms.io.\fR[\fBread\fR|\fBwrite\fR|\fB*\fR] authorization.
.sp
.LP
The
.B mount
subcommand has the following options.
.sp
.ne 2
.mk
.na
.B -A
.I application
.ad
.sp .6
.RS 4n
Application name to be used when authenticating with the MM server. The
name is the identifer used by the application itself, according to its API
documentation.
.RE

.sp
.ne 2
.mk
.na
.B -b
.I blocksize
.ad
.sp .6
.RS 4n
Specifies the largest block that the application can write to the tape
drive for both variable and fixed blocks. Default is 262144. The maximum
size depends on the drive type:
.sp
.ne 2
.mk
.na
.B 9940 and 9840
.ad
.sp .6
.RS 4n
1 - 262144. If you specify
.B fixed
for the
.B -M
option (described
below), must be an even number.
.RE

.sp
.ne 2
.mk
.na
.B LTO (all models)
.ad
.sp .6
.RS 4n
1 - 16777215. If you specify
.B fixed
for the
.B -M
option (described
below).
.RE

The choice of variable or fixed block is specified in the argument to the
.B -M
(mode) option. If you specify
.BR fixed ,
then
.B -b
is the
block size because you can only read and write blocks in the block size you
specified.
.RE

.sp
.ne 2
.mk
.na
.B -d
.I drive
.ad
.sp .6
.RS 4n
Drive on which to mount a volume. If this option is not specified, the MM
server selects a drive based on availability and capability.
.RE

.sp
.ne 2
.mk
.na
.B -D
.I density
.ad
.sp .6
.RS 4n
Specifies the output density. Can be one of:
.RS +4
.TP
.ie t \(bu
.el o
.B high
.RE
.RS +4
.TP
.ie t \(bu
.el o
.B medium
.RE
.RS +4
.TP
.ie t \(bu
.el o
.B low
.RE
.RS +4
.TP
.ie t \(bu
.el o
.B compressed
.RE
.RS +4
.TP
.ie t \(bu
.el o
.B den_9840
.RE
.RS +4
.TP
.ie t \(bu
.el o
.B den_T9840C
.RE
.RS +4
.TP
.ie t \(bu
.el o
.B den_T9940A
.RE
.RS +4
.TP
.ie t \(bu
.el o
.B den_T9940B
.RE
.RE

.sp
.ne 2
.mk
.na
.B -l
.I library_name
.ad
.sp .6
.RS 4n
Library containing the volume to be mounted.
.RE

.sp
.ne 2
.mk
.na
\fB-M\fR \fImode\fR[,\fImode\fR.\|.\|.]\fR
.ad
.sp .6
.RS 4n
The
.I mode
argument can be one or more of
.BR creat ,
.BR old ,
.BR st_nobsd ,
.BR st_tm ,
.BR raw ,
.BR mms ,
.BR compression ,
.BR nocompression ,
.BR variable ,
.BR block .
.RE

.sp
.ne 2
.mk
.na
.B -n
.ad
.sp .6
.RS 4n
Specifies
.BR norewind .
.RE

.sp
.ne 2
.mk
.na
.B -N
.ad
.sp .6
.RS 4n
Specifies
.BR nowait .
.RE

.sp
.ne 2
.mk
.na
.B -P
.I file
.ad
.sp .6
.RS 4n
Path to a file containing the application password. If a file name is not
provided, the user is prompted for the password.
.RE

.sp
.ne 2
.mk
.na
.B -R
.ad
.sp .6
.RS 4n
Specifies a read-only mount. The default is read/write.
.RE

.sp
.ne 2
.mk
.na
.B -u
.I username
.ad
.sp .6
.RS 4n
Specifies the user who will own the pseudodevice created by
.BR mount .
.RE

.sp
.LP
The
.B mount
subcommand has the following operand.
.sp
.ne 2
.mk
.na
.I volume
.ad
.sp .6
.RS 4n
Volume to be mounted.
.RE

.SS "The \fBunmount\fR Subcommand"
.sp
.LP
The
.B unmount
subcommand unmounts the specified volume or MMS
pseudodevice. The subcommand has the following syntax.
.sp
.in +2
.nf
\fBmmsadm unmount\fR [\fB-f\fR] [\fB-l\fR \fIlibrary_name\fR] [\fB-A\fR \fIapplication\fR]
     [\fB-P\fR \fIfile\fR] \fIvolume\fR|\fIpseudodevice\fR
.fi
.in -2
.sp

.sp
.LP
The
.B unmount
subcommand requires the
\fBsolaris.mms.io.\fR[\fBread\fR|\fBwrite\fR|\fB*\fR] authorization.
.sp
.LP
The
.B unmount
subcommand has the following options.
.sp
.ne 2
.mk
.na
.B -A
.I application
.ad
.sp .6
.RS 4n
Application name to be used when authenticating with the MM server.
.RE

.sp
.ne 2
.mk
.na
.B -f
.ad
.sp .6
.RS 4n
Forces an unmount operation of this volume even if it is in use by another
user.
.RE

.sp
.ne 2
.mk
.na
.B -l
.I library_name
.ad
.sp .6
.RS 4n
Library containing the mounted volume. Required only if using the volume
name operand.
.RE

.sp
.ne 2
.mk
.na
.B -P
.I file
.ad
.sp .6
.RS 4n
Path to a temporary file containing the application password.
.RE

.sp
.LP
The
.B unmount
subcommand has one of the following operands.
.sp
.ne 2
.mk
.na
.I pseudodevice
.ad
.sp .6
.RS 4n
Device path as returned from the
.B "mmsadm mount"
command. If this form
of
.B unmount
is used, the library need not be specified.
.RE

.sp
.ne 2
.mk
.na
.I volume
.ad
.sp .6
.RS 4n
Volume to be unmounted.
.RE

.SH EXAMPLES
.LP
.B Example 1
Displaying Available Libraries
.sp
.LP
To display all libraries available to be managed by the MMS, enter:

.sp
.in +2
.nf
# \fBmmsadm discover -t library -S my-acsls-server\fR
.fi
.in -2
.sp

.LP
.B Example 2
Creating a Library
.sp
.LP
To create a library in the MMS, enter:

.sp
.in +2
.nf
# \fBmmsadm create -t library -o acsls=my-acsls-server -o acs=0 \e
-o lsm=1 -o hwtype=L180 -o serialno=7493476 LIB_L180_7493476\fR
.fi
.in -2
.sp

.LP
.B Example 3
Creating a Drive
.sp
.LP
To create a drive in the MMS, enter:

.sp
.in +2
.nf
# \fBmmsadm create -t drive -o library=LIB_L180_7493476 \e
-o hwtype=LTO2 -o serialno=6453805873 \e
-o connection=myhost DRV_LTO2_6453805873\fR
.fi
.in -2
.sp

.LP
.B Example 4
Making Library Available
.sp
.LP
To make a library available for use, enter:

.sp
.in +2
.nf
# \fBmmsadm online LIB_L180_7493476\fR
.fi
.in -2
.sp

.LP
.B Example 5
Registering an Application
.sp
.LP
To register an application, enter:

.sp
.in +2
.nf
# \fBmmsadm create -t app -P /var/tmp/app_passwd MyBackupApp\fR
.fi
.in -2
.sp

.LP
.B Example 6
Allowing an Application to Use a Drive
.sp
.LP
To allow the
.B MyBackupApp
application to use a drive, enter:

.sp
.in +2
.nf
# \fBmmsadm set -t drive -o apps=MyBackupApp DRV_LTO2_6453805873\fR
.fi
.in -2
.sp

.LP
.B Example 7
Listing Volumes in a Library
.sp
.LP
To show volumes in library
.B L700_99987004
of type
.BR LT03 ,
enter:

.sp
.in +2
.nf
# \fBmmsadm list -t vol -o library=L700_99987004 -F mtype=LTO3\fR
.fi
.in -2
.sp

.LP
.B Example 8
Listing Unconfigured Volumes
.sp
.LP
To show volumes not yet configured for the MMS, enter:

.sp
.in +2
.nf
# \fBmmsadm discover -t vol -S my_acsls_server\fR
.fi
.in -2
.sp

.LP
.B Example 9
Configure an MMS for Three Applications
.sp
.LP
The following sequence of commands illustrates the process of configuring a
Media Management System for three applications, engineering, finance, and
backup.

.sp
.LP
Initialize the MM server and set the administrator password to
.B mmsadm2008
in the password file,
.BR mmsadm_passwd :

.sp
.in +2
.nf
# \fBmmsinit -P ~/mmsadm_passwd\fR
.fi
.in -2
.sp

.sp
.LP
Create an application for the engineering application:

.sp
.in +2
.nf
# \fBmmsadm create -t app -P ~/eng_passwd eng\fR
.fi
.in -2
.sp

.sp
.LP
Create an application for the finance application:

.sp
.in +2
.nf
# \fBmmsadm create -t app -P ~/finance_passwd finance\fR
.fi
.in -2
.sp

.sp
.LP
Create an application for the backup application:

.sp
.in +2
.nf
# \fBmmsadm create -t app -P ~/backup_passwd backup\fR
.fi
.in -2
.sp

.sp
.LP
Create an L700 library named
.BR library1 :

.sp
.in +2
.nf
# \fBmmsadm create -t library -o acsls=mms-280-1 -o hwtype=L700 \e
-o acs=0 -o lsm=0 -o serialno=MPC02201638 library1\fR
.fi
.in -2
.sp

.sp
.LP
Create a drive pool named
.BR org_dpool ,
to be shared between the
engineering and finance applications:

.sp
.in +2
.nf
# \fBmmsadm create -t dpool -o apps=eng,finance org_dpool\fR
.fi
.in -2
.sp

.sp
.LP
Create a drive pool named
.BR shared_dpool ,
to be shared by the
engineering, finance, and backup applications:

.sp
.in +2
.nf
# \fBmmsadm create -t dpool -o apps=eng,finance,backup shared_dpool\fR
.fi
.in -2
.sp

.sp
.LP
Create an exclusive drive pool for the backup application named
.BR bk_dpool :

.sp
.in +2
.nf
# \fBmmsadm create -t dpool -o apps=backup bk_dpool\fR
.fi
.in -2
.sp

.sp
.LP
Add a 9940 drive named
.B drive1
shared by the engineering and finance
applications:

.sp
.in +2
.nf
# \fBmmsadm create -t drive -o hwtype=9940 -o serialno=479000002009 \e
-o library=library1 -o dpool=org_dpool drive1\fR
.fi
.in -2
.sp

.sp
.LP
Add a 9940 drive named
.B drive2
shared by the engineering, finance, and
backup applications:

.sp
.in +2
.nf
# \fBmmsadm create -t drive -o hwtype=9940 -o serialno=479000001954 \e
-o library=library1 -o dpool=shared_dpool drive2\fR
.fi
.in -2
.sp

.sp
.LP
Add an exclusive 9940 drive named
.B drive3
for the backup
application:

.sp
.in +2
.nf
# \fBmmsadm create -t drive -o hwtype=9940 -o serialno=479000001944 \e
-o library=library1 -o dpool=bk_dpool drive3\fR
.fi
.in -2
.sp

.sp
.LP
Create media pool for the engineering and finance applications named
.BR org_mpool :

.sp
.in +2
.nf
# \fBmmsadm create -t mpool -o apps=eng,finance org_mpool\fR
.fi
.in -2
.sp

.sp
.LP
Create an exclusive media pool for the backup application named
.BR bk_mpool :

.sp
.in +2
.nf
# \fBmmsadm create -t mpool -o apps=backup bk_mpool\fR
.fi
.in -2
.sp

.sp
.LP
Add three volumes to the engineering and finance media pool:

.sp
.in +2
.nf
# \fBmmsadm add-volume -l library1 -o voltype=9940 \e
-x 000220,000221,000222 org_mpool\fR
.fi
.in -2
.sp

.sp
.LP
Add two volumes to the backup media pool:

.sp
.in +2
.nf
# \fBmmsadm add-volume -l library1 -o voltype=9940 \e
-x 000230,000231 bk_mpool\fR
.fi
.in -2
.sp

.sp
.LP
Write a volume label on the volume. The volume becomes owned by the
engineering application. The finance or backup applications are, as a
result, not able to use the volume:

.sp
.in +2
.nf
# \fBmmsadm label -P ~/eng_passwd -l library1 -A eng 000220\fR
.fi
.in -2
.sp

.sp
.LP
Verify that the engineering application owns the volume:

.sp
.in +2
.nf
# \fBmmsadm label -P ~/finance_passwd -l library1 -A finance 000220\fR
.fi
.in -2
.sp

.sp
.LP
Write a volume label for the finance application:

.sp
.in +2
.nf
# \fBmmsadm label -P ~/finance_passwd -l library1 -A finance 000221\fR
.fi
.in -2
.sp

.sp
.LP
Write a volume label for the backup application:

.sp
.in +2
.nf
# \fBmmsadm label -P ~/backup_passwd -l library1 -A backup 000230\fR
.fi
.in -2
.sp

.sp
.LP
Mount media for the engineering, finance and backup applications. The
handle returned by the
.B mount
command will be used as a normal
.B /dev/rmt
entry:

.sp
.in +2
.nf
# \fBmmsadm mount -P ~/eng_passwd -l library1 -A eng 000220\fR
# \fBmmsadm mount -P ~/finance_passwd -l library1 -A finance 000221\fR
# \fBmmsadm mount -P ~/backup_passwd -l library1 -A backup 000230\fR
.fi
.in -2
.sp

.sp
.LP
Unmount the media and unload the drives:

.sp
.in +2
.nf
# \fBmmsadm unmount -P ~/eng_passwd -U -l library1 -A eng 000220\fR
# \fBmmsadm unmount -P ~/finance_passwd -U -l library1 -A finance 000221\fR
# \fBmmsadm unmount -P ~/backup_passwd -U -l library1 -A backup 000230\fR
.fi
.in -2
.sp

.LP
.B Example 10
Configure an MMS for Disk Archiving
.sp
.LP
The following sequence of commands configures a Media Management System for
disk archiving.

.sp
.LP
Create a test application:

.sp
.in +2
.nf
# \fBmmsadm create -t app -P ~/test_passwd test\fR
.fi
.in -2
.sp

.sp
.LP
Create a disk archiving library named
.BR dklib1 :

.sp
.in +2
.nf
# \fBmmsadm create -t library -o hwtype=DISK -o dkpath=/dskpool dklib1\fR
.fi
.in -2
.sp

.sp
.LP
Create a disk archiving media pool named
.BR dkcarts :

.sp
.in +2
.nf
# \fBmmsadm create -t mpool -o apps=test dkcarts\fR
.fi
.in -2
.sp

.sp
.LP
Create three 100 GB volumes for disk archiving and place the volumes in the
media pool:

.sp
.in +2
.nf
# \fBmmsadm add-volume -l dklib1 -o voltype=DISK -x 000000,000001,000002 \e
-o size=100g dkcarts\fR
.fi
.in -2
.sp

.sp
.LP
Create a disk archiving drive pool named
.BR dkdrives :

.sp
.in +2
.nf
# \fBmmsadm create -t dpool -o apps=test dkdrives\fR
.fi
.in -2
.sp

.sp
.LP
Create a disk archiving drive and place it in the drive pool:

.sp
.in +2
.nf
# \fBmmsadm create -t drive -o hwtype=DISK -o library=dklib1 \e
-o dpool=dkdrives dkdrive1\fR
.fi
.in -2
.sp

.sp
.LP
Create volume labels. The volume will be labeled when it is mounted:

.sp
.in +2
.nf
# \fBmmsadm label -P ~/test_passwd -n -l dklib1 -A test 000000\fR
# \fBmmsadm label -P ~/test_passwd -n -l dklib1 -A test 000001\fR
# \fBmmsadm label -P ~/test_passwd -n -l dklib1 -A test 000002\fR
.fi
.in -2
.sp

.sp
.LP
Mount the volume
.BR 000000 .
Use the returned tape handle in a subsequent
.B tar
command:

.sp
.in +2
.nf
# \fBmmsadm mount -P ~/test_passwd -n -l dklib1 -A test 000000\fR
.fi
.in -2
.sp

.sp
.LP
Show the file sizes of the disk archiving volume before creating
.BR tar
archive:

.sp
.in +2
.nf
% \fBls -la /dskpool/dklib1/000000\fR
.fi
.in -2
.sp

.sp
.LP
Create a disk archiving
.B tar
archive:

.sp
.in +2
.nf
# \fBtar -cvf\fR \fI<mms_handle>\fR \fB/var > /tmp/out$$ 2>&1\fR
.fi
.in -2
.sp

.sp
.LP
Show the file sizes of the disk archiving volume after creating the
.B tar
archive:

.sp
.in +2
.nf
% \fBls -la /dskpool/dklib1/000000\fR
.fi
.in -2
.sp

.sp
.LP
Unmount and unload the volume from the drive:

.sp
.in +2
.nf
# \fBmmsadm unmount -P ~/test_passwd -U -l dklib1 -A test 000000\fR
.fi
.in -2
.sp

.SH EXIT STATUS
.sp
.ne 2
.mk
.na
.B 0
.ad
.sp .6
.RS 4n
Command succeeded.
.RE

.sp
.ne 2
.mk
.na
.B >0
.ad
.sp .6
.RS 4n
An error occurred.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWmmsu
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
.BR mmsclient (1M),
.BR mmsexplorer (1M),
.BR mmsinit (1M),
.BR mount (1M),
.BR attributes (5),
.BR mms (5),
.BR rbac (5)
