usr/src/man/man1m/modload.1m
'\" te
.\" Copyright (c) 1993, Sun Microsystems, Inc.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH modload 1M "1 Dec 1993" "SunOS 5.11" "System Administration Commands"
.SH NAME
modload \- load a kernel module
.SH SYNOPSIS
.LP
.nf
\fBmodload\fR [\fB-p\fR] [\fB-e\fR \fIexec_file\fR] \fIfilename\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B modload
command loads the loadable module
.I filename
into
the running system.
.sp
.LP
.I filename
is an object file produced by
.BR "ld -r" .
If
.I filename
is an absolute pathname then the file specified by that
absolute path is loaded. If
.I filename
does not begin with a slash
(\fB/\fR), then the path to load 
.I filename
is relative to the current
directory unless the
.B -p
option is specified.
.sp
.LP
The kernel's
.B modpath
variable can be set using the
.BR /etc/system
file. The default value of the kernel's
.B modpath
variable is set to the
path where the operating system was loaded.  Typically this is \fB/kernel /usr/kernel\fR.
.sp
.LP
For example, the following command looks for
.BR \&./drv/foo :
.sp
.in +2
.nf
example# \fBmodload drv/foo\fR
.fi
.in -2
.sp

.sp
.LP
The following command looks for
.B /kernel/drv/foo
and then
.BR /usr/kernel/drv/foo :
.sp
.in +2
.nf
example# \fBmodload -p drv/foo\fR
.fi
.in -2
.sp

.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.BI -e " exec_file"
.ad
.RS 16n
.rt
Specify the name of a shell script or  executable image file that is
executed after the module is successfully loaded.  The first argument passed
is the module ID (in decimal). The other argument is module specific. The
module specific information is: the block and character major numbers for
drivers, the system call number for system calls, or, for  other module
types, the index into the appropriate kernel table. See 
.BR modinfo (1M)
.RE

.sp
.ne 2
.mk
.na
.B -p
.ad
.RS 16n
.rt
Use the kernel's internal modpath variable as the search path for the
module.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.sp
.LP
.BR ld (1),
.BR add_drv (1M),
.BR kernel (1M),
.BR modinfo (1M),
.BR modunload (1M),
.BR system (4),
.BR attributes (5),
.BR modldrv (9S),
.BR modlinkage (9S),
.BR modlstrmod (9S),
.BR module_info (9S)
.sp
.LP
\fR
.SH NOTES
.sp
.LP
Use
.BR add_drv "(1M) to add device drivers, not"
.BR modload .
See\fR
for procedures on adding device drivers.
