usr/src/man/man1m/monitor.1m
'\" te
.\" Copyright (c) 2003, Sun Microsystems, Inc.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH monitor 1M "24 Jul 2003" "SunOS 5.11" "System Administration Commands"
.SH NAME
monitor \- SPARC system PROM monitor
.SH SYNOPSIS
.LP
.nf
\fBSTOP\(miA\fR
.fi

.LP
.nf
\fBBREAK\fR
.fi

.LP
.nf
\fBinitial system power-on\fR
.fi

.LP
.nf
\fBexit from a client program, e.g., the Operating System\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B CPU
board of a workstation contains one or more
.B EPROMs
or
\fBEEPROMs.\fR The program which executes from the \fBPROMs\fR is referred
to as "the monitor". Among other things, the monitor performs system
initialization at power-on and provides a user interface.
.SS "Monitor Prompt"
.sp
.LP
The monitor of earlier workstations was known as the
.B SunMON
monitor
and displayed the
.B >
for its prompt. See the \fBSunMON MONITOR USAGE\fR
section for further details.
.sp
.LP
Existing workstations use a monitor which is known as the OpenBoot monitor.
The OpenBoot monitor typically displays
.B ok
as its prompt, but it may
also display the
.B >
prompt under certain circumstances.
.sp
.LP
If the \fB\&'auto-boot?'\fR \fBNVRAM\fR parameter is set to \fB\&'false'\fR
when the workstation is powered on, the system does not attempt to boot and
the monitor issues its prompt. If \fB\&'auto-boot'\fR is set to
\fB\&'true'\fR, the system initiates the boot sequence. The boot sequence
can be aborted by simultaneously pressing two keys on the system's keyboard:
\fBL1\fR and \fBA\fR (on older keyboards), or \fBStop\fR and \fBA\fR (on
newer keyboards).  Either a lower case
.B a
or an upper case
.BR A
works for the keyboard abort sequence.  If a console has been attached by
way of one of the system's serial ports then the abort sequence can be
accomplished by sending a
.BR BREAK .
See
.BR tip (1).
.sp
.LP
When the
.B NVRAM
\fB\&'security-mode'\fR parameter has been turned on,
or when the value of the \fB\&'sunmon-compat?'\fR parameter is true, then
the OpenBoot monitor displays the message: \fBType b (boot), c (continue),
or n (new command mode)\fR
.sp
.LP
and the
.B >
prompt appears.
.SH OPENBOOT PROM USAGE
.sp
.LP
Some of the more useful commands that can be issued from OpenBoot's \fBok
\fRprompt are described here.  Refer to the book for a complete list of
commands.
.SS "Help"
.sp
.LP
Help for various functional areas of the OpenBoot monitor can be obtained
by typing
.BR help .
The help listing provides a number of other key words
which can then be used in the help command to provide further details.
.SS "NVRAM Parameters"
.sp
.LP
Each workstation contains one or more
.B NVRAM
devices which contains
unique system ID information, as well as a set of user-configurable
parameters. The
.B NVRAM
parameters allow the user a certain level of
flexibility in configuring the system to act in a given manner under a
specific set of circumstances.
.sp
.LP
See \fBeeprom\fR(1M) for a description of the parameters and information
regarding setting the parameters from the OS level.
.sp
.LP
The following commands can be used at the OpenBoot monitor to access the
\fBNVRAM\fR parameters.
.sp
.ne 2
.mk
.na
.B printenv
.ad
.RS 18n
.rt
Used to list the
.B NVRAM
parameters, along with their default values
and current values.
.RE

.sp
.ne 2
.mk
.na
\fBsetenv\fI pn pv\fR
.ad
.RS 18n
.rt
Used to set or modify a parameter.  The
.I pn
represents the parameter
name, and
.I pv
represents the parameter value.
.RE

.sp
.ne 2
.mk
.na
\fBset-default\fR \fIpn\fR
.ad
.RS 18n
.rt
Used to set an individual parameter back to its default value.
.RE

.sp
.ne 2
.mk
.na
\fBset-defaults\fR
.ad
.RS 18n
.rt
Used to reset all parameters to their default values.  (Note that
\fB\&'set-defaults'\fR only affects parameters that have assigned default
values.)
.RE

.SS "Security Parameters"
.sp
.LP
Newer OpenBoot monitors contain user interfaces that support the storage
and listing of keys for later use by client programs.
.sp
.ne 2
.mk
.na
.B list-security-keys
.ad
.sp .6
.RS 4n
Lists the names of keys currently stored on a machine.
.RE

.sp
.ne 2
.mk
.na
\fBset-security-key\fR \fIkeyname\fR [ \fIkeydata\fR ]\fR
.ad
.sp .6
.RS 4n
Stores key data
.I keydata
in a key named
.IR keyname .
Actual key data
can be up to 32 bytes in length. The maximum length of
.I keyname
is 64
bytes, which allows for the hex-formatted ASCII used to present the key
data. If
.I keydata
is not present,
.I keyname
and its corresponding
data is deleted.
.RE

.SS "Hardware Checks and Diagnostics"
.sp
.LP
The following commands are available for testing or checking the system's
hardware. If the \fB\&'diag-switch?'\fR
.B NVRAM
parameter is set to true
when the system is powered on, then a Power-On Self Test (POST) diagnostic
is run, if present, sending its results messages to the system's serial port
A. Not all of the commands shown are available on all workstations.
.sp
.ne 2
.mk
.na
.B test-all
.ad
.RS 17n
.rt
Run the diagnostic tests on each device which has provided a self-test.
.RE

.sp
.ne 2
.mk
.na
\fBtest floppy\fR
.ad
.RS 17n
.rt
Run diagnostics on the system's floppy device.
.RE

.sp
.ne 2
.mk
.na
.B test /memory
.ad
.RS 17n
.rt
Run the main memory tests.  If the
.B NVRAM
parameter
\fB\&'diag-switch?'\fR is set to true, then all of main memory is tested.
If the parameter is false then only the amount of memory specified in the
\fB\&'selftest-#megs'\fR \fBNVRAM\fR parameter is tested.
.RE

.sp
.ne 2
.mk
.na
.B test net
.ad
.RS 17n
.rt
Test the network connection for the on-board network controller.
.RE

.sp
.ne 2
.mk
.na
.B watch-net
.ad
.RS 17n
.rt
Monitor the network attached to the on-board net controller.
.RE

.sp
.ne 2
.mk
.na
.B watch-net-all
.ad
.RS 17n
.rt
Monitor the network attached to the on-board net controller, as well as the
network controllers installed in SBus slots.
.RE

.sp
.ne 2
.mk
.na
.B watch-clock
.ad
.RS 17n
.rt
Test the system's clock function.
.RE

.SS "System Information"
.sp
.LP
The following commands are available for displaying information about the
system. Not all commands are available on all workstations.
.sp
.ne 2
.mk
.na
.B banner
.ad
.RS 18n
.rt
Display the power-on banner.
.RE

.sp
.ne 2
.mk
.na
\fB\&.enet-addr\fR
.ad
.RS 18n
.rt
Display the system's Ethernet address.
.RE

.sp
.ne 2
.mk
.na
\fB\&.idprom\fR
.ad
.RS 18n
.rt
Display the formatted contents of the
.BR IDPROM.
.RE

.sp
.ne 2
.mk
.na
\fBmodule-info\fR
.ad
.RS 18n
.rt
Display information about the system's processor(s).
.RE

.sp
.ne 2
.mk
.na
.B probe-scsi
.ad
.RS 18n
.rt
Identify the devices attached to the on-board
.B SCSI
controller.
.RE

.sp
.ne 2
.mk
.na
.B probe-scsi-all
.ad
.RS 18n
.rt
Identify the devices attached to the on-board
.B SCSI
controller as well
as those devices which are attached to SBus
.B SCSI
controllers.
.RE

.sp
.ne 2
.mk
.na
.B show-disks
.ad
.RS 18n
.rt
Display a list of the device paths for installed
.B SCSI
disk
controllers.
.RE

.sp
.ne 2
.mk
.na
.B show-displays
.ad
.RS 18n
.rt
Display a list of the device paths for installed display devices.
.RE

.sp
.ne 2
.mk
.na
.B show-nets
.ad
.RS 18n
.rt
Display a list of the device paths for installed Ethernet controllers.
.RE

.sp
.ne 2
.mk
.na
.B show-sbus
.ad
.RS 18n
.rt
Display list of installed SBus devices.
.RE

.sp
.ne 2
.mk
.na
.B show-tapes
.ad
.RS 18n
.rt
Display a list of the device paths for installed
.B SCSI
tape
controllers.
.RE

.sp
.ne 2
.mk
.na
.B show-ttys
.ad
.RS 18n
.rt
Display a list of the device paths for tty devices.
.RE

.sp
.ne 2
.mk
.na
\fB\&.traps\fR
.ad
.RS 18n
.rt
Display a list of the SPARC trap types.
.RE

.sp
.ne 2
.mk
.na
\fB\&.version\fR
.ad
.RS 18n
.rt
Display the version and date of the OpenBoot PROM.
.RE

.SS "Emergency Commands"
.sp
.LP
These commands must be typed from the keyboard, they do not work from a
console which is attached by way of the serial ports.  With the exception of
the
.B Stop-A
command, these commands are issued by pressing and holding
down the indicated keys on the keyboard immediately after the system has
been powered on.  The keys must be held down until the monitor has checked
their status.  The
.B Stop-A
command can be issued at any time after the
console display begins, and the keys do not need to be held down once
they've been pressed. The
.B "Stop-D, Stop-F"
and
.BR Stop-N
commands are not allowed when one of the security modes has been set.  Not
all commands are available on all workstations.
.sp
.ne 2
.mk
.na
.B Stop (L1)
.ad
.RS 17n
.rt
Bypass the Power-On Self Test (POST).  This is only effective if the system
has been placed into the diagnostic mode.
.RE

.sp
.ne 2
.mk
.na
.B Stop-A (L1-A)
.ad
.RS 17n
.rt
Abort the current operation and return to the monitor's default prompt.
.RE

.sp
.ne 2
.mk
.na
.B Stop-D (L1-D)
.ad
.RS 17n
.rt
Set the system's \fB\&'diag-switch?'\fR
.B NVRAM
parameter to
\fB\&'true'\fR, which places the system in diagnostic mode.  POST
diagnostics, if present, are run, and the messages are displayed by way of
the system's serial port A.
.RE

.sp
.ne 2
.mk
.na
.B Stop-F (L1-F)
.ad
.RS 17n
.rt
Enter the OpenBoot monitor before the monitor has probed the system for
devices. Issue the \fB\&'fexit'\fR command to continue with system
initialization.
.RE

.sp
.ne 2
.mk
.na
.B Stop-N (L1-N)
.ad
.RS 17n
.rt
Causes the
.B NVRAM
parameters to be reset to their default values.
Note that not all parameters have default values.
.RE

.SS "Line Editor Commands"
.sp
.LP
The following commands can be used while the monitor is displaying the
\fBok\fR prompt.  Not all of these editing commands are available on all
workstations.
.sp
.ne 2
.mk
.na
.B CTRL-A
.ad
.RS 10n
.rt
Place the cursor at the start of line.
.RE

.sp
.ne 2
.mk
.na
.B CTRL-B
.ad
.RS 10n
.rt
Move the cursor backward one character.
.RE

.sp
.ne 2
.mk
.na
.B ESC-B
.ad
.RS 10n
.rt
Move the cursor backward one word.
.RE

.sp
.ne 2
.mk
.na
.B CTRL-D
.ad
.RS 10n
.rt
Erase the character that the cursor is currently highlighting.
.RE

.sp
.ne 2
.mk
.na
.B ESC-D
.ad
.RS 10n
.rt
Erase the portion of word from the cursor's present position to the end of
the word.
.RE

.sp
.ne 2
.mk
.na
.B CTRL-E
.ad
.RS 10n
.rt
Place the cursor at the end of line.
.RE

.sp
.ne 2
.mk
.na
.B CTRL-F
.ad
.RS 10n
.rt
Move the cursor forward one character.
.RE

.sp
.ne 2
.mk
.na
.B ESC-F
.ad
.RS 10n
.rt
Move the cursor forward one word.
.RE

.sp
.ne 2
.mk
.na
.B CTRL-H
.ad
.RS 10n
.rt
Erase the character preceding the cursor (also use Delete or Back Space)
.RE

.sp
.ne 2
.mk
.na
.B ESC-H
.ad
.RS 10n
.rt
Erase the portion of the word which precedes the cursor (use also
.B CTRL-W)
.RE

.sp
.ne 2
.mk
.na
.B CTRL-K
.ad
.RS 10n
.rt
Erase from the cursor's present position to the end of the line.
.RE

.sp
.ne 2
.mk
.na
.B CTRL-L
.ad
.RS 10n
.rt
Show the command history list.
.RE

.sp
.ne 2
.mk
.na
.B CTRL-N
.ad
.RS 10n
.rt
Recall the next command from the command history list
.RE

.sp
.ne 2
.mk
.na
.B CTRL-P
.ad
.RS 10n
.rt
Recall a previous command from the command history list.
.RE

.sp
.ne 2
.mk
.na
.B CTRL-Q
.ad
.RS 10n
.rt
Quote the next character (used to type a control character).
.RE

.sp
.ne 2
.mk
.na
.B CTRL-R
.ad
.RS 10n
.rt
Retype the current line.
.RE

.sp
.ne 2
.mk
.na
.B CTRL-U
.ad
.RS 10n
.rt
Erase from the cursor's present position to the beginning of the line.
.RE

.sp
.ne 2
.mk
.na
.B CTRL-Y
.ad
.RS 10n
.rt
Insert the contents of the memory buffer into the line, in front (to the
left) of the cursor.
.RE

.SS "nvramrc"
.sp
.LP
The
.B nvramrc
is an area of the system's
.B NVRAM
where users may
store Forth programs. The programs which are stored in the
.B nvramrc
are
executed each time the system is reset, provided that the
\fB\&'use-nvramrc?'\fR \fBNVRAM\fR parameter has been set to \fB\&'true'\fR.
Refer to the book for information on how to edit and use the
.BR nvramrc .
.SS "Restricted Monitor"
.sp
.LP
The command \fB\&'old-mode'\fR is used to move OpenBoot into a restricted
monitor mode, causing the
.B >
prompt to be displayed.  Only three
commands are allowed while in the restricted monitor; the \fB\&'go'\fR
.RB "command (to resume a program which was interrupted with the" " Stop-A"
command), the \fB\&'n'\fR command (to return to the normal OpenBoot
monitor), and boot commands.  The restricted monitor's boot commands
approximate the older
.B SunMON
monitor's boot command syntax. If a
\fB\&'security-mode'\fR has been turned on then the restricted monitor
becomes the default monitor environment.  The restricted monitor may also
become the default environment if the \fB\&'sunmon-compat?'\fR  \fBNVRAM\fR
parameter is set to true.  Not all workstations have the
\fB\&'sunmon-compat?'\fR parameter.
.SH SUNMON PROM USAGE
.sp
.LP
The following commands are available systems with older
.BR SunMON -based
PROM:
.sp
.ne 2
.mk
.na
\fB+\fR|\fB\(mi\fR
.ad
.sp .6
.RS 4n
Increment or decrement the current address and display the contents of the
new location.
.RE

.sp
.ne 2
.mk
.na
\fB^C\fI source destination n\fR
.ad
.sp .6
.RS 4n
(caret-C) Copy, byte-by-byte, a block of length
.I n
from the
\fBsource\fR address to the \fIdestination\fR address.
.RE

.sp
.ne 2
.mk
.na
\fB^I \fIprogram\fR
.ad
.sp .6
.RS 4n
(caret-I) Display the compilation date and location of
.IR program .
.RE

.sp
.ne 2
.mk
.na
\fB^T \fIvirtual_address\fR
.ad
.sp .6
.RS 4n
(caret-T) Display the physical address to which
.I virtual_address
is
mapped.
.RE

.sp
.ne 2
.mk
.na
\fBb\fR [ \fB!\fR ] [ \fIdevice\fR [
\fB(\fIc\fB,\fIu\fB,\fIp\|\fB)\fR ] ] [
\fIpathname\fR ] [ \fIarguments_list\fR ]\fR
.ad
.sp .6
.RS 4n

.RE

.sp
.ne 2
.mk
.na
\fBb\fR[\fB?\fR]\fR
.ad
.sp .6
.RS 4n
Reset appropriate parts of the system and bootstrap a program.  A `\fB!\fR'
(preceding the
.I device
argument) prevents the system reset from
occurring. Programs can be loaded from various devices (such as a disk,
tape, or Ethernet). `\fBb\fR' with no arguments causes a default boot,
either from a disk, or from an Ethernet controller. `\fBb?\fR' displays all
boot devices and their
.IR device s.
.sp
.ne 2
.mk
.na
.I device
.ad
.RS 18n
.rt
one of
.sp
.ne 2
.mk
.na
.B le
.ad
.RS 6n
.rt
Lance Ethernet
.RE

.sp
.ne 2
.mk
.na
.B ie
.ad
.RS 6n
.rt
Intel Ethernet
.RE

.sp
.ne 2
.mk
.na
.B sd
.ad
.RS 6n
.rt
\fBSCSI\fR disk, CDROM
.RE

.sp
.ne 2
.mk
.na
.B st
.ad
.RS 6n
.rt
\fBSCSI\fR 1/4" or 1/2" tape
.RE

.sp
.ne 2
.mk
.na
\fBfd\fR
.ad
.RS 6n
.rt
Diskette
.RE

.sp
.ne 2
.mk
.na
.B id
.ad
.RS 6n
.rt
IPI disk
.RE

.sp
.ne 2
.mk
.na
.B mt
.ad
.RS 6n
.rt
Tape Master 9-track 1/2" tape
.RE

.sp
.ne 2
.mk
.na
.B xd
.ad
.RS 6n
.rt
Xylogics 7053 disk
.RE

.sp
.ne 2
.mk
.na
.B xt
.ad
.RS 6n
.rt
Xylogics 1/2" tape
.RE

.sp
.ne 2
.mk
.na
.B xy
.ad
.RS 6n
.rt
Xylogics 440/450 disk
.RE

.RE

.sp
.ne 2
.mk
.na
.I c
.ad
.RS 18n
.rt
A controller number (\fB0\fR if only one controller),
.RE

.sp
.ne 2
.mk
.na
.I u
.ad
.RS 18n
.rt
A unit number (\fB0\fR if only one driver), and
.RE

.sp
.ne 2
.mk
.na
.I p
.ad
.RS 18n
.rt
A partition.
.RE

.sp
.ne 2
.mk
.na
.I pathname
.ad
.RS 18n
.rt
A pathname for a program such as
.BR /stand/diag .
.RE

.sp
.ne 2
.mk
.na
.I arguments_list
.ad
.RS 18n
.rt
A list of up to seven arguments to pass to the program being booted.
.RE

.RE

.sp
.ne 2
.mk
.na
\fBc [\fIvirtual_address\fB]\fR
.ad
.sp .6
.RS 4n
Resume execution of a program. When given,
.I virtual_address
is the
address at which execution resumes. The default is the current \fBPC.\fR
Registers are restored to the values shown by the
.BR d ,
and
.BR r
commands.
.RE

.sp
.ne 2
.mk
.na
\fBd [\fIwindow_number\fB]\fR
.ad
.sp .6
.RS 4n
Display (dump) the state of the processor. The processor state is
observable only after:
.RS +4
.TP
.ie t \(bu
.el o
An unexpected trap was encountered.
.RE
.RS +4
.TP
.ie t \(bu
.el o
A user program dropped into the monitor  (by calling
.IR abortent ).
.RE
.RS +4
.TP
.ie t \(bu
.el o
The user manually entered the monitor by typing \fBL1\(miA\fR or
.B BREAK.
.RE
The display consists of the following:
.RS +4
.TP
.ie t \(bu
.el o
The special registers:
.B "PSR, PC,"
nPC,
.B "TBR, WIM,"
and
Y
.RE
.RS +4
.TP
.ie t \(bu
.el o
Eight global registers
.RE
.RS +4
.TP
.ie t \(bu
.el o
24 window registers (8
.IR in ,
8
.IR local ,
and 8
.IR out ),
corresponding to one of the 7 available windows.  If a Floating-Point Unit
is on board, its status register along with 32 floating-point registers are
also shown.
.RE
.sp
.ne 2
.mk
.na
.I window_number
.ad
.RS 17n
.rt
Display the indicated
.IR window_number ,
which can be any value between
\fB0\fR and
.BR 6 ,
inclusive.  If no window is specified and the
\fBPSR's\fR current window pointer contains a valid window number, registers
from the window that was active just prior to entry into the monitor are
displayed. Otherwise, registers from window 0 are displayed.
.RE

.RE

.sp
.ne 2
.mk
.na
\fBe\fR [\fIvirtual_address\fR]\|[\fIaction\fR] .\|.\|.\fR
.ad
.sp .6
.RS 4n
Open the 16-bit word at
.I virtual_address
(default zero).  The address
is interpreted in the address space defined by the
.B s
command. See the
\fBa\fR command for a description of \fIaction\fR.
.RE

.sp
.ne 2
.mk
.na
\fBf\fI virtual_address1 virtual_address2 pattern\fR 
[\fIsize\|\fR]\fR
.ad
.sp .6
.RS 4n
Fill the bytes, words, or long words from
.I virtual_address1
(lower) to
\fIvirtual_address2\fR (higher) with the constant,
.IR pattern .
The
\fBsize\fR argument can take one of the following values:
.sp
.ne 2
.mk
.na
.B b
.ad
.RS 5n
.rt
byte format (the default)
.RE

.sp
.ne 2
.mk
.na
.B w
.ad
.RS 5n
.rt
word format
.RE

.sp
.ne 2
.mk
.na
.B l
.ad
.RS 5n
.rt
long word format
.RE

For example, the following command fills the address block from
\fB0x1000\fR to \fB0x2000\fR with the word pattern, \fB0xABCD\fR:
.sp
\fBf 1000 2000 ABCD W\fR
.RE

.sp
.ne 2
.mk
.na
\fBg\fR [\fIvector\|\fR] [\fIargument\|\fR]\fR
.ad
.br
.na
\fBg\fR [\fIvirtual_address\|\fR] [\fIargument\fR\|]\fR
.ad
.sp .6
.RS 4n
Goto (jump to) a predetermined or default routine (first form), or to a
user-specified routine (second form).  The value of
.I argument
is passed
to the routine.  If the
.I vector
or
.I virtual_address
argument is
omitted, the value in the
.B PC
is used as the address to jump to.
.sp
To set up a predetermined routine to jump to, a user program must, prior to
executing the monitor's
.B g
command, set the variable
\fB*romp->v_vector_cmd\fR to be equal to the virtual address of the desired
routine. Predetermined routines need not necessarily return control to the
monitor.
.sp
The default routine, defined by the monitor, prints the user-supplied
\fIvector\fR according to the format supplied in
.IR argument .
This format
can be one of:
.sp
.ne 2
.mk
.na
.B %x
.ad
.RS 6n
.rt
hexadecimal
.RE

.sp
.ne 2
.mk
.na
.B %d
.ad
.RS 6n
.rt
decimal
.RE

.RE

.sp
.ne 2
.mk
.na
.B g0
.ad
.sp .6
.RS 4n
Force a panic and produce a crash dump  when the monitor is running as a
result of the system being interrupted,
.RE

.sp
.ne 2
.mk
.na
.B g4
.ad
.sp .6
.RS 4n
(Sun-4 systems only) Force a kernel stack trace  when the monitor is
running as a result of the system being interrupted,
.RE

.sp
.ne 2
.mk
.na
.B h
.ad
.sp .6
.RS 4n
Display the help menu for monitor commands and their descriptions. To
return to the monitor's basic command level, press
.B ESCAPE
or
.BR q
before pressing
.BR RETURN.
.RE

.sp
.ne 2
.mk
.na
\fBi\fR [\fIcache_data_offset\fR\|] [\fIaction\fR\|]\|.\|.\|.\fR
.ad
.sp .6
.RS 4n
Modify cache data
.B RAM
command.  Display and/or modify one or more of
the cache data addresses.  See the
.B a
command for a description of
.IR action .
.RE

.sp
.ne 2
.mk
.na
\fBj\fR [\fIcache_tag_offset\fR\|] [\fIaction\|\fR]\|.\|.\|.\fR
.ad
.sp .6
.RS 4n
Modify cache tag
.B RAM
command.  Display and/or modify the contents of
one or more of the cache tag addresses.  See the
.B a
command for a
description of
.IR action .
.RE

.sp
.ne 2
.mk
.na
\fBk [\fIreset_level\fB]\fR
.ad
.sp .6
.RS 4n
Reset the system, where
.I reset_level
is:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 5n
.rt
Reset
.B VMEbus,
interrupt registers, video monitor (Sun-4 systems).
This is the default.
.RE

.sp
.ne 2
.mk
.na
.B 1
.ad
.RS 5n
.rt
Software reset.
.RE

.sp
.ne 2
.mk
.na
.B 2
.ad
.RS 5n
.rt
.RB "Power-on reset. Resets and clears the memory. Runs the" " EPROM-based"
diagnostic self test, which can take several minutes, depending upon how
much memory is being tested.
.RE

.RE

.sp
.ne 2
.mk
.na
.B kb
.ad
.sp .6
.RS 4n
Display the system banner.
.RE

.sp
.ne 2
.mk
.na
\fBl\|\fR [\fIvirtual_address\fR\|]\|[\fIaction\fR]\|.\|.\|.\fR
.ad
.sp .6
.RS 4n
.RI "Open the long word (32 bit) at memory address" " virtual_address"
(default zero).  The address is interpreted in the address space defined by
the
.B s
command (below).  See the
.B a
command for a description of
.IR action .
.RE

.sp
.ne 2
.mk
.na
\fBm\|\fR [\fIvirtual_address\fR\|]\|[\fIaction\fR\|]\|.\|.\|.\fR
.ad
.sp .6
.RS 4n
Open the segment map entry that maps
.I virtual_address
(default zero).
The address is interpreted in the address space defined by the
.BR s
command. See the
.B a
command for a description of
.IR action .
.RE

.sp
.ne 2
.mk
.na
.B ne
.ad
.sp .6
.RS 4n

.RE

.sp
.ne 2
.mk
.na
.B ni
.ad
.sp .6
.RS 4n
Disable, enable, or invalidate the cache, respectively.
.RE

.sp
.ne 2
.mk
.na
\fBo\|\fR [\fIvirtual_address\fR\|]\|[action\fI]\|.\|.\|.\fR
.ad
.sp .6
.RS 4n
Open the byte location specified  by
.I virtual_address
(default zero).
The address is interpreted in the address space defined by the
.BR s
command. See the
.B a
command for a description of
.IR action .
.RE

.sp
.ne 2
.mk
.na
\fBp\|\fR [\fIvirtual_address\fR\|]\|[\fIaction\fR].\|.\|.\fR
.ad
.sp .6
.RS 4n
Open the page map entry that maps
.I virtual_address
(default zero) in
the address space defined by the
.B s
command. See the
.B a
command
for a description of
.IR action .
.RE

.sp
.ne 2
.mk
.na
\fBq\|\fR [\fIeeprom_offset\fR\|]\|[\fIaction\fR\|].\|.\|.\fR
.ad
.sp .6
.RS 4n
Open the
.B EEPROM
\fIeeprom_offset\fR (default zero) in the
\fBEEPROM\fR address space. All addresses are referenced from the beginning
or base of the
.B EEPROM
in physical address space, and a limit check is
performed to insure that no address beyond the
.B EEPROM
physical space
is accessed. This command is used to display or modify configuration
parameters, such as: the amount of memory to test during self test, whether
to display a standard or custom banner, if a serial port (A or B) is to be
the system console, etc. See the
.B a
command for a description of
.IR action .
.RE

.sp
.ne 2
.mk
.na
\fBr\|\fR [\fIregister_number\|\fR]\fR
.ad
.br
.na
\fBr\|\fR [\fIregister_type\|\fR]\fR
.ad
.br
.na
\fBr\|\fR [\fIw window_number\|\fR]\fR
.ad
.sp .6
.RS 4n
Display and/or modify one or more of the
.B IU
or
.B FPU
registers. A
hexadecimal
.I register_number
can be one of:
.sp
.ne 2
.mk
.na
.BR 0x00 \(mi\fB0x0f\fR
.ad
.RS 16n
.rt
window(0,i0)\(miwindow(0,i7), window(0,i0)\(emwindow(0,i7)
.RE

.sp
.ne 2
.mk
.na
.BR 0x16 \(mi\fB0x1f\fR
.ad
.RS 16n
.rt
window(1,i0)\(miwindow(1,i7), window(1,i0)\(emwindow(1,i7)
.RE

.sp
.ne 2
.mk
.na
.BR 0x20 \(mi\fB0x2f\fR
.ad
.RS 16n
.rt
window(2,i0)\(miwindow(2,i7), window(2,i0)\(emwindow(2,i7)
.RE

.sp
.ne 2
.mk
.na
.BR 0x30 \(mi\fB0x3f\fR
.ad
.RS 16n
.rt
window(3,i0)\(miwindow(3,i7), window(3,i0)\(emwindow(3,i7)
.RE

.sp
.ne 2
.mk
.na
.BR 0x40 \(mi\fB0x4f\fR
.ad
.RS 16n
.rt
window(4,i0)\(miwindow(4,i7), window(4,i0)\(emwindow(4,i7)
.RE

.sp
.ne 2
.mk
.na
.BR 0x50 \(mi\fB0x5f\fR
.ad
.RS 16n
.rt
window(5,i0)\(miwindow(5,i7), window(5,i0)\(emwindow(5,i7)
.RE

.sp
.ne 2
.mk
.na
.BR 0x60 \(mi\fB0x6f\fR
.ad
.RS 16n
.rt
window(6,i0)\(miwindow(6,i7), window(6,i0)\(emwindow(6,i7)
.RE

.sp
.ne 2
.mk
.na
.BR 0x70 \(mi\fB0x77\fR
.ad
.RS 16n
.rt
.B "g0, g1, g2, g3, g4, g5, g6, g7
.RE

.sp
.ne 2
.mk
.na
.BR 0x78 \(mi\fB0x7d\fR
.ad
.RS 16n
.rt
.B "PSR, PC,"
.B "nPC, WIM,"
.B TBR, Y.
.RE

.sp
.ne 2
.mk
.na
.BR 0x7e \(mi\fB0x9e\fR
.ad
.RS 16n
.rt
\fBFSR,\fR f0\(mif31
.RE

Register numbers can only be displayed after an unexpected trap, a user
program has entered the monitor using the
.I abortent
function, or the
user has entered the monitor by manually typing \fBL1\(miA\fR or
.B BREAK.
.sp
If a
.I register_type
is given, the first register of the indicated type
is displayed.
.I register_type
can be one of:
.sp
.ne 2
.mk
.na
\fBf\fR
.ad
.RS 5n
.rt
floating-point
.RE

.sp
.ne 2
.mk
.na
.B g
.ad
.RS 5n
.rt
global
.RE

.sp
.ne 2
.mk
.na
.B s
.ad
.RS 5n
.rt
special
.RE

If
.B w
and a
.I window_number
(\fB0\fR\(em\fB6\fR) are given, the
first \fIin\fR-register within the indicated window is displayed.  If
\fIwindow_number\fR is omitted, the window that was active just prior to
entering the monitor is used.  If the
.B PSR's
current window pointer is
invalid, window 0 is used.
.RE

.sp
.ne 2
.mk
.na
\fBs [\fIasi\fB])\fR
.ad
.sp .6
.RS 4n
Set or display the Address Space Identifier.  With no argument, \fBs\fR
displays the current Address Space Identifier.  The
.I asi
value can be
one of:
.sp
.ne 2
.mk
.na
.B 0x2
.ad
.RS 7n
.rt
control space
.RE

.sp
.ne 2
.mk
.na
.B 0x3
.ad
.RS 7n
.rt
segment table
.RE

.sp
.ne 2
.mk
.na
.B 0x4
.ad
.RS 7n
.rt
Page table
.RE

.sp
.ne 2
.mk
.na
.B 0x8
.ad
.RS 7n
.rt
user instruction
.RE

.sp
.ne 2
.mk
.na
.B 0x9
.ad
.RS 7n
.rt
supervisor instruction
.RE

.sp
.ne 2
.mk
.na
.B 0xa
.ad
.RS 7n
.rt
user data
.RE

.sp
.ne 2
.mk
.na
.B 0xb
.ad
.RS 7n
.rt
supervisor data
.RE

.sp
.ne 2
.mk
.na
.B 0xc
.ad
.RS 7n
.rt
flush segment
.RE

.sp
.ne 2
.mk
.na
.B 0xd
.ad
.RS 7n
.rt
flush page
.RE

.sp
.ne 2
.mk
.na
.B 0xe
.ad
.RS 7n
.rt
flush context
.RE

.sp
.ne 2
.mk
.na
\fB0xf\fR
.ad
.RS 7n
.rt
cache data
.RE

.RE

.sp
.ne 2
.mk
.na
\fBu\fR [ \fBecho\fR ]\fR
.ad
.sp .6
.RS 4n

.RE

.sp
.ne 2
.mk
.na
\fBu\fR [ \fIport\fR ] [ \fIoptions\fR ] [ \fIbaud_rate\fR ]\fR
.ad
.sp .6
.RS 4n

.RE

.sp
.ne 2
.mk
.na
\fBu\fR [ \fBu\fR ] [ \fIvirtual_address\fR ]\fR
.ad
.sp .6
.RS 4n
With no arguments, display the current I/O device characteristics
including: current input device, current output device, baud rates for
serial ports A and B, an input-to-output echo indicator, and virtual
addresses of mapped
.B UART
devices. With arguments, set or configure the
current I/O device.  With the
.B u
argument (\fBuu\fR.\|.\|.), set the
I/O device to be the
.I virtual_address
of a
.B UART
device currently
mapped.
.sp
.ne 2
.mk
.na
.B echo
.ad
.RS 13n
.rt
 Can be either
.B e
to enable input to be echoed to the output device, or
.BR ne ,
to indicate that input is not echoed.
.RE

.sp
.ne 2
.mk
.na
.I port
.ad
.RS 13n
.rt
Assign the indicated
.I port
.RI "to be the current I/O device." " port"
can be one of:
.sp
.ne 2
.mk
.na
.B a
.ad
.RS 5n
.rt
serial port A
.RE

.sp
.ne 2
.mk
.na
.B b
.ad
.RS 5n
.rt
serial port B
.RE

.sp
.ne 2
.mk
.na
.B k
.ad
.RS 5n
.rt
the workstation keyboard
.RE

.sp
.ne 2
.mk
.na
.B s
.ad
.RS 5n
.rt
the workstation screen
.RE

.RE

.sp
.ne 2
.mk
.na
.I baud_rate
.ad
.RS 13n
.rt
Any legal baud rate.
.RE

.sp
.ne 2
.mk
.na
.I options
.ad
.RS 11n
.rt
can be any combination of:
.sp
.ne 2
.mk
.na
.B i
.ad
.RS 6n
.rt
input
.RE

.sp
.ne 2
.mk
.na
.B o
.ad
.RS 6n
.rt
output
.RE

.sp
.ne 2
.mk
.na
.B u
.ad
.RS 6n
.rt
.B UART
.RE

.sp
.ne 2
.mk
.na
.B e
.ad
.RS 6n
.rt
echo input to output
.RE

.sp
.ne 2
.mk
.na
.B ne
.ad
.RS 6n
.rt
do not echo input
.RE

.sp
.ne 2
.mk
.na
.B r
.ad
.RS 6n
.rt
reset indicated serial port (\fBa\fR and
.B b
ports only)
.RE

If either
.B a
or
.B b
is supplied, and no
.I options
are given,
the serial port is assigned for both input and output.  If
.B k
is
supplied with no options, it is assigned for input only.  If
.B s
is
supplied with no options, it is assigned for output only.
.RE

.RE

.sp
.ne 2
.mk
.na
\fBv\fI virtual_address1 virtual_address2\fR  [\fBsize\fR]\fR
.ad
.sp .6
.RS 4n
Display the contents of
.I virtual_address1
(lower)
\fIvirtual_address2\fR (higher) in the format specified by \fBsize\fR:
.sp
.ne 2
.mk
.na
.B b
.ad
.RS 5n
.rt
byte format (the default)
.RE

.sp
.ne 2
.mk
.na
.B w
.ad
.RS 5n
.rt
word format
.RE

.sp
.ne 2
.mk
.na
.B l
.ad
.RS 5n
.rt
long word format
.RE

Enter return to pause for viewing; enter another return character to resume
the display.  To terminate the display at any time, press the space bar.
.sp
For example, the following command displays the contents of virtual address
space from address
.B 0x1000
to
.B 0x2000
in word format:
.sp
.B "v 1000" 2000 W
.RE

.sp
.ne 2
.mk
.na
\fBw\|\fR [\fIvirtual_address\|\fR]\|[\fIargument\|\fR]\fR
.ad
.sp .6
.RS 4n
Set the execution vector to a predetermined or default routine. Pass
\fIvirtual_address\fR and \fIargument\fR to that routine.
.sp
To set up a predetermined routine to jump to, a user program must, prior to
executing the monitor's
.B w
command, set the variable
\fB*romp->v_vector_cmd\fR to be equal to the virtual address of the desired
routine. Predetermined routines need not necessarily return control to the
monitor.
.sp
The default routine, defined by the monitor, prints the user-supplied
\fIvector\fR according to the format supplied in
.IR argument .
This format
can be one of:
.sp
.ne 2
.mk
.na
.B %x
.ad
.RS 6n
.rt
hexadecimal
.RE

.sp
.ne 2
.mk
.na
.B %d
.ad
.RS 6n
.rt
decimal
.RE

.RE

.sp
.ne 2
.mk
.na
.B x
.ad
.sp .6
.RS 4n
Display a menu of extended tests. These diagnostics permit additional
testing of such things as the I/O port connectors, video memory, workstation
memory and keyboard, and boot device paths.
.RE

.sp
.ne 2
.mk
.na
\fBy\|c\fI context_number\fR
.ad
.sp .6
.RS 4n

.RE

.sp
.ne 2
.mk
.na
\fBy\|p|s\|\fI context_number virtual_address\fR
.ad
.sp .6
.RS 4n
Flush the indicated context, context page, or context segment.
.sp
.ne 2
.mk
.na
.B c
.ad
.RS 5n
.rt
flush context
.IR context_number
.RE

.sp
.ne 2
.mk
.na
.B p
.ad
.RS 5n
.rt
flush the page beginning at
.I virtual_address
within context
.I context_number
.RE

.sp
.ne 2
.mk
.na
.B s
.ad
.RS 5n
.rt
flush the segment beginning at
.I virtual_address
within context
.I context_number
.RE

.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
ArchitectureSPARC
.TE

.SH SEE ALSO
.sp
.LP
.BR tip (1),
.BR boot (1M),
.BR eeprom (1M),
.BR attributes (5)
.sp
.LP

