usr/src/man/man1m/mount_hsfs.1m
'\" te
.\" Copyright 1989 AT&T Copyright (c) 2008, Sun Microsystems, Inc.  All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH mount_hsfs 1M "29 May 2008" "SunOS 5.11" "System Administration Commands"
.SH NAME
mount_hsfs \- mount hsfs file systems
.SH SYNOPSIS
.LP
.nf
\fBmount\fR \fB-F\fR hsfs [\fIgeneric_options\fR]
     [\fB-o\fR \fIFSType-specific_options\fR] [\fB-O\fR ] \fIspecial\fR | \fImount_point\fR
.fi

.LP
.nf
\fBmount\fR \fB-F\fR hsfs [\fIgeneric_options\fR]
     [\fB-o\fR \fIFSType-specific_options\fR] [\fB-O\fR] \fIspecial\fR \fImount_point\fR
.fi

.SH DESCRIPTION
.sp
.LP
.B mount
attaches an ISO 9660 filesystem (the High Sierra  file system,
.BR hsfs ,
is  a  draft predecessor to ISO 9660, so the name reflects the
filesystem's history) to  the  file  system hierarchy at the
.IR mount_point ,
which is the pathname of a directory. If
.I mount_point
has any contents prior to the mount operation, these are
hidden until the file system is unmounted.
.sp
.LP
If
.B mount
is invoked with
.I special
or
.I mount_point
as the
only arguments,
.B mount
will search
.B /etc/vfstab
to fill in the
missing arguments, including the
.IR FSType-specific_options ;
see
.BR mount (1M)
for more details.
.sp
.LP
The
.B hsfs
file system supports direct mounting of files containing the
file system as well as block devices. See
.BR mount (1M)
and
.BR lofiadm (1M).
.sp
.LP
A file system conforming to ISO 9660 can contain extensions that allow it
to overcome limitations of the original ISO 9660:1988 (version 1) standard.
The following types of extensions are supported by
.BR hsfs :
.sp
.ne 2
.mk
.na
.B Rock Ridge extensions
.ad
.sp .6
.RS 4n
This is the preferred type of extension as it allows file attributes, name
length, and types equivalent to those on other UNIX-style filesystems.
Example of supported features are device special files, POSIX permissions,
symbolic links, and filenames of up to 255 bytes in length. Rock Ridge
extensions also remove the ISO9660:1988 restriction on  maximum nesting
depth for directories (eight levels).
.B hsfs
automatically detects the
presence of Rock Ridge  extensions and uses them, unless mount options are
specified to disable the use of Rock Ridge or to use a different
extension.
.RE

.sp
.ne 2
.mk
.na
.B ISO9660:1999 (version 2) extensions
.ad
.sp .6
.RS 4n
The first version of ISO9660, released in 1988, supported  only uppercase
ASCII filenames of no more than 31 characters in length. ISO9660 version 2,
released in 1999,  provides an extension that allows filenames of at least
207 bytes that can use UTF-8 characters and removes the limitation on the
nesting depth for directories. Unlike Rock Ridge, it does not provide
support for UNIX-style file types and file attributes.
.B hsfs
automatically detects this extension and will use it for filename lookup if
no Rock Ridge extensions are found on the media.
.RE

.sp
.ne 2
.mk
.na
.B Joliet extensions
.ad
.sp .6
.RS 4n
The Joliet extension was devised by Microsoft to allow Unicode (UCS-2) long
filenames with CDROM-based media. It allows filename lengths of up to 110
Unicode characters and does not support UNIX-style file types and
attributes.
.B hsfs
falls back to using Joliet if such an extension is
present and neither Rock Ridge nor ISO9660 version 2 extensions are found.
.sp
If filenames are longer than the 64 UCS-2 characters officially allowed by
Microsoft (that is, 110 Unicode  characters), they can translate to up to
330 UTF-8 octets. Filenames that translate to more than 255 UTF-8 octets
will be truncated.
.RE

.SH OPTIONS
.sp
.ne 2
.mk
.na
.I generic_options
.ad
.sp .6
.RS 4n
See
.BR mount (1M)
for the list of supported options.
.RE

.sp
.ne 2
.mk
.na
.B -o
.ad
.sp .6
.RS 4n
Specify
.B hsfs
file system specific options.  If invalid options are
specified, a warning message is printed and the invalid options are ignored.
The following options are available:
.sp
.ne 2
.mk
.na
.B global
|
.B noglobal
.ad
.sp .6
.RS 4n
If
.B global
is specified and supported on the file system, and the
system in question is part of a cluster, the file system will be globally
visible on all nodes of the cluster. If
.B noglobal
is specified, the
mount will not be globally visible. The default behavior is
.BR noglobal .

.RE

.sp
.ne 2
.mk
.na
.B ro
.ad
.sp .6
.RS 4n
Mount the file system read-only.  This option is required.
.RE

.sp
.ne 2
.mk
.na
.B rr
|
.B nrr
.ad
.sp .6
.RS 4n
.RB "Enable (" rr ") or disable (" nrr )
the use of Rock Ridge.
.B rr
is
the default and need not be specified. If you use
.B nrr
and Rock Ridge
extensions are present in the file system, ignore them and search for other
available extensions or fall back to plain ISO9660.
.RE

.sp
.ne 2
.mk
.na
.B vers2
|
.B novers2
.ad
.sp .6
.RS 4n
Enable or disable the use of ISO9660 version 2  extensions. If
.B vers2
is specified and ISO9660 version 2 extensions are available,
.B hsfs
will
use ISO9660  version 2 even if the file system contains the preferred Rock
Ridge extensions as well. If
.B novers2
is specified, it will fall back
to using either Joliet extensions or plain ISO9660 even if ISO9660 version 2
extensions are available.
.RE

.sp
.ne 2
.mk
.na
.B joliet
|
.B nojoliet
.ad
.sp .6
.RS 4n
Enable or disable the use of Joliet extensions. If
.B joliet
is
specified and Joliet extensions are available,
.B hsfs
will use them
even if the file system contains the preferred Rock Ridge and/or ISO9660
version 2 extensions. If
.B nojoliet
is specified, it will fall back to
using plain ISO9660.
.RE

.sp
.ne 2
.mk
.na
.B notraildot
.ad
.sp .6
.RS 4n
File names on High Sierra file systems consist of a proper name and an
extension separated by a '.' (dot) character.  By default, the separating
dot is always considered part of the file's name for all file access
operations, even if there is no extension present. Specifying
.B notraildot
makes it optional to specify the trailing dot to access a
file whose name lacks an extension.
.sp
.B Exceptions:
This option is effective only on file systems for which
Rock Ridge, ISO9660 version 2 or Joliet extensions are not active, either
because they are not present on the CD-ROM, or they have been deliberately
disabled via the
.BR nrr ,
.B novers2
and
.B nojoliet
option. If
either extension is active,
.B hsfs
quietly ignores this option.
.RE

.sp
.ne 2
.mk
.na
.B nomaplcase
.ad
.sp .6
.RS 4n
File names on High Sierra/ISO9660 CD-ROMs with no extensions present should
be uppercase characters only. By default,
.B hsfs
maps file names read
from a
.B "non-Rock Ridge"
disk to all lowercase characters.
.B nomaplcase
turns off this mapping. The exceptions for
.B notraildot
discussed above apply to
.BR nomaplcase .
.RE

.RE

.sp
.ne 2
.mk
.na
.B -O
.ad
.sp .6
.RS 4n
Overlay mount.  Allow the file system to be mounted over an existing mount
point, making the underlying file system inaccessible.  If a mount is
attempted on a preexisting mount point without setting this flag, the mount
will fail, producing the error: \f(CWdevice busy\fR.
.RE

.SH EXAMPLES
.LP
.B Example 1
Mounting and Unmounting a DVD Image Directly
.sp
.LP
The following commands mount and unmount a DVD image.

.sp
.in +2
.nf
# \fBmount -F hsfs /images/solaris.iso /mnt/solaris-image\fR
# \fBumount /mnt/solaris-image\fR
.fi
.in -2
.sp

.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/mnttab
.ad
.sp .6
.RS 4n
table of mounted file systems
.RE

.sp
.ne 2
.mk
.na
.B /etc/vfstab
.ad
.sp .6
.RS 4n
list of default parameters for each file system
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.sp
.LP
.BR lofiadm (1M),
.BR mount (1M),
.BR mountall (1M),
.BR mount (2),
.BR mnttab (4),
.BR vfstab (4),
.B attributes
(5)
.SH NOTES
.sp
.LP
If the directory on which a file system is to be mounted is a symbolic
link, the file system is mounted on the directory to which the symbolic link
refers, rather than on top of the symbolic link itself.
