usr/src/man/man1m/mount_tmpfs.1m
'\" te
.\" Copyright (c) 2003, Sun Microsystems, Inc.  All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH mount_tmpfs 1M "24 Nov 2003" "SunOS 5.11" "System Administration Commands"
.SH NAME
mount_tmpfs \- mount tmpfs file systems
.SH SYNOPSIS
.LP
.nf
\fBmount\fR [\fB-F\fR tmpfs] [\fB-o\fR \fIspecific_options\fR] [\fB-O\fR] \fIspecial\fR \fImount_point\fR
.fi

.SH DESCRIPTION
.sp
.LP
.B tmpfs
is a memory based file system which uses kernel resources
relating to the
.B VM
system and page cache as a file system.
.sp
.LP
.B mount
attaches a
.B tmpfs
file system to the file system hierarchy
at the pathname location
.IR mount_point ,
which must already exist. If
.I mount_point
has any contents prior to the
.B mount
operation, these
remain hidden until the file system is once again unmounted. The attributes
(mode, owner, and group) of the root of the
.B tmpfs
filesystem are
inherited from the underlying
.IR mount_point ,
provided that those
attributes are determinable. If not, the root's attributes are set to their
default values.
.sp
.LP
The
.I special
argument is usually specified as
.B swap
but is in
fact disregarded and assumed to be the virtual memory resources within the
system.
.SH OPTIONS
.sp
.ne 2
.mk
.na
.B -o
.I specific_options
.ad
.RS 23n
.rt
Specify
.B tmpfs
file system specific options in a comma-separated list
with no intervening spaces. If invalid options are specified, a warning
message is printed and the invalid options are ignored. The following
options are available:
.sp
.ne 2
.mk
.na
\fBsize=\fIsz\fR
.ad
.RS 19n
.rt
The
.I sz
argument controls the size of this particular
.B tmpfs
file
system. If the argument is has a `k' suffix, the number will be interpreted
as a number of kilobytes. An `m' suffix will be interpreted as a number of
megabytes. No suffix is interpreted as bytes. In all cases, the actual size
of the file system is the number of bytes specified, rounded up to the
physical pagesize of the system.
.RE

.sp
.ne 2
.mk
.na
.B xattr
|
.B noxattr
.ad
.RS 19n
.rt
Allow or disallow the creation and manipulation of extended attributes. The
default is
.BR xattr .
See
.BR fsattr (5)
for a description of extended
attributes.
.RE

.RE

.sp
.ne 2
.mk
.na
.B -O
.ad
.RS 23n
.rt
Overlay  mount. Allow the file system to be mounted over an existing mount
point, making the underlying file system inaccessible. If a mount is
attempted on a pre-existing mount point without setting this flag, the mount
will fail, producing the error\f(CWdevice busy\fR.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/mnttab
.ad
.RS 15n
.rt
Table of mounted file systems
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.sp
.LP
.BR mount (1M),
.BR mkdir (2),
.BR mount (2),
.BR open (2),
.BR umount (2),
.BR mnttab (4),
.BR attributes (5),
.BR fsattr (5),
.BR tmpfs (7FS)
.SH NOTES
.sp
.LP
If the directory on which a file system is to be mounted is a symbolic
link, the file system is mounted on the directory to which the symbolic link
refers, rather than on top of the symbolic link itself.
