usr/src/man/man1m/mount.1m
'\" te
.\" Copyright (c) 2007, Sun Microsystems, Inc. All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH mount 1M "29 May 2008" "SunOS 5.11" "System Administration Commands"
.SH NAME
mount, umount \- mount or unmount file systems and remote resources
.SH SYNOPSIS
.LP
.nf
\fBmount\fR [\fB-p\fR | \fB-v\fR]
.fi

.LP
.nf
\fBmount\fR [\fB-F\fR \fIFSType\fR] [\fIgeneric_options\fR] [\fB-o\fR \fIspecific_options\fR]
     [\fB-O\fR] \fIspecial\fR | \fImount_point\fR
.fi

.LP
.nf
\fBmount\fR [\fB-F\fR \fIFSType\fR] [\fIgeneric_options\fR] [\fB-o\fR \fIspecific_options\fR]
     [\fB-O\fR] \fIspecial\fR \fImount_point\fR
.fi

.LP
.nf
\fBmount\fR \fB-a\fR [\fB-F\fR \fIFSType\fR] [\fB-V\fR] [\fIcurrent_options\fR]
     [\fB-o\fR \fIspecific_options\fR] [\fImount_point\fR]...
.fi

.LP
.nf
\fBumount\fR [\fB-f\fR] [\fB-V\fR] [\fB-o\fR \fIspecific_options\fR] \fIspecial\fR | \fImount_point\fR
.fi

.LP
.nf
\fBumount\fR \fB-a\fR [\fB-f\fR] [\fB-V\fR] [\fB-o\fR \fIspecific_options\fR] [\fImount_point\fR]...
.fi

.SH DESCRIPTION
.sp
.LP
\fBmount\fR attaches a file system to the file system hierarchy at the
.IR mount_point ,
which is the pathname of a directory. If
\fImount_point\fR has any contents prior to the \fBmount\fR operation, these
are hidden until the file system is unmounted.
.sp
.LP
\fBumount\fR unmounts a currently mounted file system, which may be
specified either as a
.I mount_point
or as
.IR special ,
the device on
which the file system resides.
.sp
.LP
The table of currently mounted file systems can be found by examining the
mounted file system information file. This is provided by a file system that
is usually mounted on
.BR /etc/mnttab .
The mounted file system information
is described in
.BR mnttab (4).
Mounting a file system adds an entry to the
mount table; a
.B umount
removes an entry from the table.
.sp
.LP
When invoked with both the
.I special
and
.I mount_point
arguments
and the
.B -F
option,
.B mount
validates all arguments except for
\fIspecial\fR and invokes the appropriate \fIFSType\fR-specific \fBmount\fR
module. If invoked with no arguments,
.B mount
lists all the mounted file
systems recorded in the mount table,
.BR /etc/mnttab .
If invoked with a
partial argument list (with only one of
.I special
or
.IR mount_point ,
or with both
.I special
or
.I mount_point
specified but not
.IR FSType ),
\fBmount\fR will search \fB/etc/vfstab\fR for an entry that
will supply the missing arguments. If no entry is found, and the special
argument starts with
.BR / ,
the default local file system type specified
in \fB/etc/default/fs\fR will be used. Otherwise the default remote file
system type will be used. The default remote file system type is determined
by the first entry in the \fB/etc/dfs/fstypes\fR file. After filling in
missing arguments,
.B mount
will invoke the \fIFSType\fR-specific
\fBmount\fR module.
.sp
.LP
For file system types that support it, a file can be mounted directly as a
file system by specifying the full path to the file as the special argument.
In such a case, the
.B nosuid
option is enforced. If specific file system
support for such loopback file mounts is not present, you can still use
\fBlofiadm\fR(1M) to mount a file system image. In this case, no special
options are enforced.
.sp
.LP
Only a user with sufficient privilege (at least
.BR PRIV_SYS_MOUNT )
can
mount or unmount file systems using
.B mount
and
.BR umount .
However,
any user can use
.B mount
to list mounted file systems and resources.
.SH OPTIONS
.sp
.ne 2
.mk
.na
\fB-F\fR \fIFSType\fR
.ad
.sp .6
.RS 4n
Used to specify the
.I FSType
on which to operate. The
.I FSType
must
be specified or must be determinable from
.BR /etc/vfstab ,
or by
consulting \fB/etc/default/fs\fR or \fB/etc/dfs/fstypes\fR.
.RE

.sp
.ne 2
.mk
.na
\fB-a\fR [ \fImount_points\fR. . . ]\fR
.ad
.sp .6
.RS 4n
Perform mount or umount operations in parallel, when possible.
.sp
If mount points are not specified,
.B mount
will mount all file systems
whose \fB/etc/vfstab\fR "mount at boot" field is \fByes\fR. If mount points
are specified, then \fB/etc/vfstab\fR "mount at boot" field will be
ignored.
.sp
If mount points are specified,
.B umount
will only
.B umount
those
mount points. If none is specified, then
.B umount
will attempt to
\fBunmount\fR all file systems in
.BR /etc/mnttab ,
with the exception of
certain system required file systems:
.BR / ,
.BR /usr ,
.BR /var ,
.BR /var/adm ,
.BR /var/run ,
.BR /proc ,
\fB/dev/fd\fR and
.BR /tmp .
.RE

.sp
.ne 2
.mk
.na
\fB-f\fR
.ad
.sp .6
.RS 4n
Forcibly unmount a file system.
.sp
Without this option,
.B umount
does not allow a file system to be
unmounted if a file on the file system is busy. Using this option can cause
data loss for open files; programs which access files after the file system
has been unmounted will get an error
.RB ( EIO ).
.RE

.sp
.ne 2
.mk
.na
.B -p
.ad
.sp .6
.RS 4n
Print the list of mounted file systems in the \fB/etc/vfstab\fR format.
Must be the only option specified. See
.BR BUGS .
.RE

.sp
.ne 2
.mk
.na
.B -v
.ad
.sp .6
.RS 4n
Print the list of mounted file systems in verbose format. Must be the only
option specified.
.RE

.sp
.ne 2
.mk
.na
.B -V
.ad
.sp .6
.RS 4n
Echo the complete command line, but do not execute the command.
\fBumount\fR generates a command line by using the options and arguments
provided by the user and adding to them information derived from
.BR /etc/mnttab .
This option should be used to verify and validate the
command line.
.RE

.sp
.ne 2
.mk
.na
.I generic_options
.ad
.sp .6
.RS 4n
Options that are commonly supported by most \fIFSType\fR-specific command
modules. The following options are available:
.sp
.ne 2
.mk
.na
.B -m
.ad
.sp .6
.RS 4n
Mount the file system without making an entry in
.BR /etc/mnttab .
.RE

.sp
.ne 2
.mk
.na
.B -g
.ad
.sp .6
.RS 4n
Globally mount the file system. On a clustered system, this globally mounts
the file system on all nodes of the cluster. On a non-clustered system this
has no effect.
.RE

.sp
.ne 2
.mk
.na
.B -o
.ad
.sp .6
.RS 4n
Specify \fIFSType\fR-specific options in a comma separated (without spaces)
list of suboptions and keyword-attribute pairs for interpretation by the
\fIFSType\fR-specific module of the command. (See \fBmount_ufs\fR(1M).) When
you use
.B -o
with a file system that has an entry in
.BR /etc/vfstab ,
any
.B mount
options entered for that file system in \fB/etc/vfstab\fR
are ignored.
.sp
The following options are supported:
.sp
.ne 2
.mk
.na
.B devices | nodevices
.ad
.sp .6
.RS 4n
Allow or disallow the opening of device-special files. The default is
.BR devices .
.sp
If you use
.B nosuid
in conjunction with
.BR devices ,
the behavior is
equivalent to that of
.BR nosuid .
.RE

.sp
.ne 2
.mk
.na
.B exec | noexec
.ad
.sp .6
.RS 4n
Allow or disallow executing programs in the file system. Allow or disallow
.BR mmap (2)
with
.B PROT_EXEC
for files within the file system. The
default is
.BR exec .
.RE

.sp
.ne 2
.mk
.na
.B loop
.ad
.sp .6
.RS 4n
Ignored for compatibility.
.RE

.sp
.ne 2
.mk
.na
.B nbmand | nonbmand
.ad
.sp .6
.RS 4n
Allow or disallow non-blocking mandatory locking semantics on this file
system. Non-blocking mandatory locking is disallowed by default.
.sp
If the file system is mounted with the
.B nbmand
option, then
applications can use the
.BR fcntl (2)
interface to place non-blocking
mandatory locks on files and the system enforces those semantics. If you
enable this option, it can cause standards conformant applications to see
unexpected errors.
.sp
To avoid the possibility of obtaining mandatory locks on system files, do
not use the
.B nbmand
option with the following file systems:
.sp
.in +2
.nf
/
/usr
/etc
/var
/proc
/dev
/devices
/system/contract
/system/object
/etc/mnttab
/etc/dfs/sharetab
.fi
.in -2
.sp

Do not use the
.B remount
option to change the
.B nbmand
disposition
of the file system. The
.B nbmand
option is mutually exclusive of the
global option. See
.BR -g .
.RE

.sp
.ne 2
.mk
.na
.B ro | rw
.ad
.sp .6
.RS 4n
Specify read-only or read-write. The default is
.BR rw .
.RE

.sp
.ne 2
.mk
.na
.B setuid | nosetuid
.ad
.sp .6
.RS 4n
Allow or disallow
.B setuid
or
.B setgid
execution. The default is
.BR setuid .
.sp
If you specify
.B setuid
in conjunction with
.BR nosuid ,
the behavior
is the same as
.BR nosuid .
.sp
\fBnosuid\fR is equivalent to \fBnosetuid\fR and
.BR nodevices .
When
\fBsuid\fR or \fBnosuid\fR is combined with \fBsetuid\fR or \fBnosetuid\fR
and
.B devices
or
.BR nodevices ,
the most restrictive options take
effect.
.sp
This option is highly recommended whenever the file system is shared by way
of NFS with the
.B root=
option. Without it, NFS clients could add
\fBsetuid\fR programs to the server or create devices that could open
security holes.
.RE

.sp
.ne 2
.mk
.na
.B suid | nosuid
.ad
.sp .6
.RS 4n
Allow or disallow
.B setuid
or
.B setgid
execution. The default is
.BR suid .
This option also allows or disallows opening any device-special
entries that appear within the filesystem.
.sp
\fBnosuid\fR is equivalent to \fBnosetuid\fR and
.BR nodevices .
When
\fBsuid\fR or \fBnosuid\fR is combined with \fBsetuid\fR or \fBnosetuid\fR
and
.B devices
or
.BR nodevices ,
the most restrictive options take
effect.
.sp
This option is highly recommended whenever the file system is shared using
NFS with the \fBroot=\fIoption\fR, because, without it, NFS clients could
add
.B setuid
programs to the server, or create devices that could open
security holes.
.RE

.RE

.sp
.ne 2
.mk
.na
.B -O
.ad
.sp .6
.RS 4n
Overlay mount. Allow the file system to be mounted over an existing mount
point, making the underlying file system inaccessible. If a mount is
attempted on a pre-existing mount point without setting this flag, the mount
will fail, producing the error "device busy".
.RE

.sp
.ne 2
.mk
.na
.B -r
.ad
.sp .6
.RS 4n
Mount the file system read-only.
.RE

.RE

.SH EXAMPLES
.LP
\fBExample 1\fR Mounting and Unmounting a DVD Image Directly
.sp
.LP
The following commands mount and unmount a DVD image.

.sp
.in +2
.nf
# \fBmount -F hsfs /images/solaris.iso /mnt/solaris-image\fR
# \fBumount /mnt/solaris-image\fR
.fi
.in -2
.sp

.SH USAGE
.sp
.LP
See
.BR largefile (5)
for the description of the behavior of
.BR mount
and
.B umount
when encountering files greater than or equal to 2 Gbyte (
2^31 bytes).
.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/mnttab
.ad
.sp .6
.RS 4n
Table of mounted file systems.
.RE

.sp
.ne 2
.mk
.na
\fB/etc/default/fs\fR
.ad
.sp .6
.RS 4n
Default local file system type. Default values can be set for the following
flags in
.BR /etc/default/fs .
For example: \fBLOCAL=ufs\fR
.sp
.ne 2
.mk
.na
.B LOCAL:
.ad
.sp .6
.RS 4n
The default partition for a command if no
.I FSType
is specified.
.RE

.RE

.sp
.ne 2
.mk
.na
\fB/etc/vfstab\fR
.ad
.sp .6
.RS 4n
List of default parameters for each file system.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.sp
.LP
\fBlofiadm\fR(1M), \fBmount_cachefs\fR(1M), \fBmount_hsfs\fR(1M),
\fBmount_nfs\fR(1M), \fBmount_pcfs\fR(1M),  \fBmount_smbfs\fR(1M),
\fBmount_tmpfs\fR(1M), \fBmount_udfs\fR(1M), \fBmount_ufs\fR(1M),
.BR mountall (1M),
.BR umountall (1M),
.BR fcntl (2),
.BR mmap (2),
.BR mnttab (4),
.BR vfstab (4),
.BR attributes (
5),
.BR largefile (5),
.BR privileges (5),
\fBlofs\fR(7FS), \fBpcfs\fR(7FS)
.SH NOTES
.sp
.LP
If the directory on which a file system is to be mounted is a symbolic
link, the file system is mounted on the directory to which the symbolic link
refers, rather than on top of the symbolic link itself.
.SH BUGS
.sp
.LP
The
.B "mount -p"
output is incorrect for
.BR cachefs .
