usr/src/man/man1m/mount_lofs.1m
'\" te
.\" Copyright (c) 2003, Sun Microsystems, Inc.  All Rights Reserved
.\" Copyright (c) 2012-2019, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH mount_lofs 1M "10 Oct 2019" "SunOS 5.11" "System Administration Commands"
.SH NAME
mount_lofs \- mount loopback file systems
.SH SYNOPSIS
.LP
.nf
\fBmount\fR [\fB-F\fR lofs] [\fB-o\fR \fIspecific_options\fR] [\fB-O\fR] \fIexisting\fR \fImount_point\fR
.fi

.SH DESCRIPTION
.sp
.LP
.B lofs
is a loopback filesystem.
.sp
.LP
.B mount
attaches a
.B lofs
file system to the file system hierarchy
at the pathname location
.IR mount_point ,
which must already exist. If
.I mount_point
has any contents prior to the
.B mount
operation, these
remain hidden until the file system is once again unmounted.
.sp
.LP
The
.I existing
argument is a directory that should be made available under an alternate path name.
.SH OPTIONS
.sp
.ne 2
.TP
.BI "-o " specific_options
Specify
.B lofs
file system specific options in a comma-separated list
with no intervening spaces. If invalid options are specified, a warning
message is printed and the invalid options are ignored. The following
options are available:
.RS
.sp
.ne 2
.TP
.BR sub " | " nosub
Allow or disallow
.B lofs
to follow mount points on the
.I existing
filesystem.
The default is
.BR sub .

.sp
.ne 2
.TP
.BR xattr " | " noxattr
Allow or disallow the creation and manipulation of extended attributes. The
default is
.BR xattr .
See
.BR fsattr (5)
for a description of extended
attributes.
.RE

.sp
.ne 2
.TP
.B -O
Overlay  mount. Allow the file system to be mounted over an existing mount
point, making the underlying file system inaccessible. If a mount is
attempted on a pre-existing mount point without setting this flag, the mount
will fail, producing the error\f(CWdevice busy\fR.

.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/mnttab
.ad
.RS 15n
.rt
Table of mounted file systems
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.sp
.LP
.BR mount (1M),
.BR mkdir (2),
.BR mount (2),
.BR open (2),
.BR umount (2),
.BR mnttab (4),
.BR attributes (5),
.BR fsattr (5),
.BR lofs (7FS)
.SH NOTES
.sp
.LP
If the directory on which a file system is to be mounted is a symbolic
link, the file system is mounted on the directory to which the symbolic link
refers, rather than on top of the symbolic link itself.
