usr/src/man/man1m/mount_udfs.1m
'\" te
.\" Copyright (c) 2008 Sun Microsystems, Inc. All Rights Reserved.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH mount_udfs 1M "12 May 2008" "SunOS 5.11" "System Administration Commands"
.SH NAME
mount_udfs \- mount a udfs file system
.SH SYNOPSIS
.LP
.nf
\fBmount\fR \fB-F\fR udfs [\fIgeneric_options\fR] [\fB-o\fR \fIspecific_options\fR]
     [\fB-O\fR] \fIspecial\fR \fImount_point\fR
.fi

.LP
.nf
\fBmount\fR \fB-F\fR udfs [\fIgeneric_options\fR] [\fB-o\fR \fIspecific_options\fR]
     [\fB-O\fR] \fIspecial\fR | \fImount_point\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B mount
utility attaches a \fBudfs\fR file system to the file
system hierarchy at the
.IR mount_point ,
which is the pathname of a
directory. If
.I mount_point
has any contents prior to the mount
operation, these are hidden until the file system is unmounted.
.sp
.LP
If mount is invoked with either
.I special
or
.I mount_point
as the
only arguments,
.B mount
searches \fB/etc/vfstab\fR to fill in the
missing arguments, including the
.IR specific_options .
See
.BR mount (1M).
.sp
.LP
The \fBudfs\fR file system supports direct mounting of files containing the
file system as well as block devices. See
.BR mount (1M)
and
.BR lofiadm (1M).
.sp
.LP
If
.I special
and
.I mount_point
are specified without any
\fIspecific_options\fR, the default is \fBrw\fR.
.sp
.LP
If the directory on which a file system is to be mounted is a symbolic
link, the file system is mounted on the directory to which the symbolic link
refers, rather than on top of the symbolic link itself.
.SH OPTIONS
.sp
.LP
See \fBmount\fR(1M) for the list of supported \fIgeneric_options\fR.
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB-o\fR \fIspecific_options\fR
.ad
.sp .6
.RS 4n
Specify \fBudfs\fR file system specific options in a comma-separated list
with no intervening spaces. The following \fIspecific_options\fR are
available:
.sp
.ne 2
.mk
.na
.B m
.ad
.sp .6
.RS 4n
Mount the file system without making an entry in
.BR /etc/mnttab .
.RE

.sp
.ne 2
.mk
.na
.B remount
.ad
.sp .6
.RS 4n
Remount the file system as read-write. The option is used in conjunction
with the
.B rw
option.
.sp
A file system mounted read-only can be remounted as read-write. This option
fails if the file system is not currently mounted.
.RE

.RE

.sp
.ne 2
.mk
.na
.B -O
.ad
.sp .6
.RS 4n
Overlay mount. Allow the file system to be mounted over an existing mount
point, making the underlying file system inaccessible. If a mount is
attempted on a pre-existing mount point without setting this flag, the mount
fails, producing the error \f(CWdevice busy\fR.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/mnttab
.ad
.sp .6
.RS 4n
Table of mounted file systems
.RE

.sp
.ne 2
.mk
.na
\fB/etc/vfstab\fR
.ad
.sp .6
.RS 4n
List of default parameters for each file system
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWudf
.TE

.SH SEE ALSO
.sp
.LP
\fBfsck\fR(1M), \fBfsck_udfs\fR(1M), \fBlofiadm\fR(1M), \fBmount\fR(1M),
.BR mountall (1M),
.BR mount (2),
.BR mnttab (4),
.BR vfstab (4),
.BR attributes (5)
.SH DIAGNOSTICS
.sp
.ne 2
.mk
.na
.B not super user
.ad
.sp .6
.RS 4n
The command is run by a non-root user. Run as root.
.RE

.sp
.ne 2
.mk
.na
.B no such device
.ad
.sp .6
.RS 4n
The device name specified does not exist.
.RE

.sp
.ne 2
.mk
.na
.B not a directory
.ad
.sp .6
.RS 4n
The specified mount point is not a directory.
.RE

.sp
.ne 2
.mk
.na
\fBis not an udfs file system\fR
.ad
.sp .6
.RS 4n
The device specified does not contain a udf 1.50 file system or the udfs
file system module is not available.
.RE

.sp
.ne 2
.mk
.na
.B is already mounted
.ad
.sp .6
.RS 4n
The specified device is already in use.
.RE

.sp
.ne 2
.mk
.na
.B not a block device
.ad
.sp .6
.RS 4n
The device specified is not a block device. Use block device to mount.
.RE

.sp
.ne 2
.mk
.na
.B write-protected
.ad
.sp .6
.RS 4n
The device is read-only.
.RE

.sp
.ne 2
.mk
.na
.B is corrupted. needs checking
.ad
.sp .6
.RS 4n
The file system is in an inconsistent state. Run
.BR fsck .
.RE

.SH NOTES
.sp
.LP
Copy-protected files can be stored on
.B DVD-ROM
media using Universal
Disk Format
.RB ( UDF ).
Reading these copy-protected files is not possible
as this involves an authentication process. Unless an authentication process
between the host and the drive is completed, reading these copy-protected
files after mounting and before the authentication process, returns an
error.
