usr/src/man/man1m/mpstat.1m
'\" te
.\" Copyright (c) 2004, Sun Microsystems, Inc.  All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH mpstat 1M "23 Mar 2009" "SunOS 5.11" "System Administration Commands"
.SH NAME
mpstat \- report per-processor or per-processor-set statistics
.SH SYNOPSIS
.LP
.nf
\fB/usr/bin/mpstat\fR [\fB-aq\fR] [\fB-p\fR | \fB-P\fR \fIset\fR] [\fB-T\fR u | d] [\fIinterval\fR [\fIcount\fR]]
.fi

.SH DESCRIPTION
.sp
.LP
The
.B mpstat
command reports processor statistics in tabular form. Each
row of the table represents the activity of one processor. The first table
summarizes all activity since boot. Each subsequent table summarizes
activity for the preceding interval. All values are rates listed as events
per second unless otherwise noted.
.sp
.LP
During execution of the kernel status command, the
.B state
of the
kernel can change. If relevant, a state change message is included in the
\fBmpstat\fR output, in one of the following forms:
.sp
.in +2
.nf
<<processor 3 moved from pset: -1 to: 1>>
<<pset destroyed: 1>>
<<pset created: 1>>
<<processors added: 1, 3>>
<<processors removed: 1, 3>>
.fi
.in -2
.sp

.sp
.LP
The
.B mpstat
command reports the following information:
.sp
.ne 2
.mk
.na
\fBCPU\fR or \fBSET\fR
.ad
.RS 14n
.rt
Without the
.B -a
option,
.B mpstat
reports
.B CPU
statistics for
a processor ID. With the
.B -a
option,
.B mpstat
reports
.BR SET
statistics for a processor set ID.
.RE

.sp
.ne 2
.mk
.na
\fBminf\fR
.ad
.RS 14n
.rt
minor faults
.RE

.sp
.ne 2
.mk
.na
\fBmjf\fR
.ad
.RS 14n
.rt
major faults
.RE

.sp
.ne 2
.mk
.na
.B xcal
.ad
.RS 14n
.rt
inter-processor cross-calls
.RE

.sp
.ne 2
.mk
.na
.B intr
.ad
.RS 14n
.rt
interrupts
.RE

.sp
.ne 2
.mk
.na
.B ithr
.ad
.RS 14n
.rt
interrupts as threads (not counting clock interrupt)
.RE

.sp
.ne 2
.mk
.na
.B csw
.ad
.RS 14n
.rt
context switches
.RE

.sp
.ne 2
.mk
.na
.B icsw
.ad
.RS 14n
.rt
involuntary context switches
.RE

.sp
.ne 2
.mk
.na
.B migr
.ad
.RS 14n
.rt
thread migrations (to another processor)
.RE

.sp
.ne 2
.mk
.na
.B smtx
.ad
.RS 14n
.rt
spins on mutexes (lock not acquired on first try)
.RE

.sp
.ne 2
.mk
.na
.B srw
.ad
.RS 14n
.rt
spins on readers/writer locks (lock not acquired on first try)
.RE

.sp
.ne 2
.mk
.na
.B syscl
.ad
.RS 14n
.rt
system calls
.RE

.sp
.ne 2
.mk
.na
.B usr
.ad
.RS 14n
.rt
percent user time
.RE

.sp
.ne 2
.mk
.na
.B sys
.ad
.RS 14n
.rt
percent system time
.RE

.sp
.ne 2
.mk
.na
.B wt
.ad
.RS 14n
.rt
the I/O wait time is no longer calculated as a percentage of \fBCPU\fR
time, and this statistic will always return zero.
.RE

.sp
.ne 2
.mk
.na
.B idl
.ad
.RS 14n
.rt
percent idle time
.RE

.sp
.ne 2
.mk
.na
.B sze
.ad
.RS 14n
.rt
number of processors in the requested processor set
.RE

.sp
.ne 2
.mk
.na
.B set
.ad
.RS 14n
.rt
processor set membership of each
.BR CPU
.RE

.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -a
.ad
.RS 13n
.rt
Aggregate output by processor set. Sort the output by set. The default
output is sorted by
.B CPU
number.
.RE

.sp
.ne 2
.mk
.na
.B -p
.ad
.RS 13n
.rt
Report processor set membership of each
.BR CPU .
Sort the output by set.
The default output is sorted by
.B CPU
number.
.RE

.sp
.ne 2
.mk
.na
\fB-P\fR \fIset\fR
.ad
.RS 13n
.rt
Display only those processors in the specified
.IR set .
.RE

.sp
.ne 2
.mk
.na
.B -q
.ad
.RS 13n
.rt
Suppress messages related to state changes.
.RE

.sp
.ne 2
.mk
.na
\fB-T u\fR |  \fBd\fR
.ad
.RS 13n
.rt
Specify
.B u
for a printed representation of the internal representation
of time. See
.BR time (2).
Specify
.B d
for standard date format. See
.BR date (1).
.RE

.sp
.ne 2
.mk
.na
.I interval
.ad
.RS 13n
.rt
Report once each
.I interval
seconds.
.RE

.sp
.ne 2
.mk
.na
.I count
.ad
.RS 13n
.rt
Only print
.I count
reports.
.RE

.SH EXAMPLES
.LP
\fBExample 1\fR Using \fBmpstat\fR to Generate User and System Operation
Statistics
.sp
.LP
The following command generates processor statistics over a five-second
interval in two reports. The command shows the processor set membership of
each
.BR CPU .
The default output is sorted by
.B CPU
number, aggregated
by
.IR "processor set" ,
for user (\fBusr\fR) and system (\fBsys\fR)
operations.

.sp
.in +2
.nf
example% \fBmpstat -ap 5 2\fR


SET minf mjf xcal intr ithr csw icsw migr smtx srw syscl usr sys wt idl sze
  0    6   0  355  291  190  22    0    0    0   0    43   0   2  0  43   1
  1   24  17  534  207  200  70    1    0    2   0   600   4   1  0  84   2
  2   19   7  353  325  318  44    0    0    5   0   345   1   1  0  94   3
  3   36   2  149  237  236  14    0    0    4   0    97   0   0  0  98   2
SET minf mjf xcal intr ithr csw icsw migr smtx srw syscl usr sys wt idl sze
  0    1   0  720  405  304  55    0    0   18   0    12   0  15  0  81   1
  1    0  69 1955  230  200 313   33    4   41   9  7086  34  10  0  19   2
  2    0  46  685  314  300 203   11    0   54   1  5287  36   6  0  28   3
  3    0   0   14  386  384   0    0    0    0   0     0   0   0  0 100   2
.fi
.in -2
.sp

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
_
Interface StabilitySee below.
.TE

.sp
.LP
Invocation is evolving. Human readable output is unstable.
.SH SEE ALSO
.sp
.LP
.BR sar (1),
.BR date (1),
.BR iostat (1M),
.BR sar (1M),
.BR vmstat (1M),
.BR time (2),
.BR attributes (5)
.SH NOTES
.sp
.LP
The sum of
.B CPU
utilization might vary slightly from 100 due to
rounding errors in the production of a percentage figure.
.sp
.LP
The total time used for
.B CPU
processing is the sum of
.B usr
and
\fBsys\fR output values, reported for user and system operations. The
\fBidl\fR value reports the time that the \fBCPU\fR is idle for any reason
other than pending disk I/O operations.
.sp
.LP
Run the
.B iostat
command with the
.B -x
option to report I/O service
times in
.B svc_t
output. The
.B iostat
utility also reports the same
.BR wt ,
user
.RB ( us ),
and system (\fBsy\fR) statistics. See
.BR iostat (1M)
for more information.
.sp
.LP
When executing in a
.B zone
and if the pools facility is active,
.BR mpstat (1M)
will only provide information for those processors which
are a member of the processor set of the pool to which the
.B zone
is
bound.
