usr/src/man/man1m/msgid.1m
'\" te
.\" Copyright (c) 2000, Sun Microsystems, Inc.  All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH msgid 1M "9 Oct 1998" "SunOS 5.11" "System Administration Commands"
.SH NAME
msgid \- generate message IDs
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/msgid\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B msgid
utility generates message
.BR ID s.
.sp
.LP
A message
.B ID
is a numeric identifier that uniquely identifies a
message. Although the probability of two distinct messages having the same
.B ID
is high, this can be greatly reduced with the appropriate priority or
facility.level designator (see \fBsyslogd\fR(1M)). Specifically, the message
.B ID
is a hash signature on the message's unexpanded format string,
generated by
.B STRLOG_MAKE_MSGID()
as defined in \fB<sys/strlog.h>\fR\&.

.sp
.LP
.BR syslogd (1M)
is a simple filter that takes strings as input and produces
those same strings, preceded by their message \fBID\fRs, as output. Every
message logged by
.BR syslogd "(1M) includes the message"
.BR ID .
The message
.B ID
is intended to serve as a small, language-independent identifier.
.SH EXAMPLES
.LP
.B Example 1
Using the msgid command to generate a message ID
.sp
.LP
The following example uses the
.B msgid
command to generate a message
.B ID
for the
.B echo
command.

.sp
.in +2
.nf
example# \fBecho hello | msgid\fR205790 hello
.fi
.in -2
.sp

.LP
.B Example 2
Using the msgid command to generate a message catalog
.sp
.LP
The following example uses the
.B msgid
command to enumerate all of the
messages in the binary
.BR ufs ,
to generate a message catalog.

.sp
.in +2
.nf
example# \fBstrings /kernel/fs/ufs | msgid\fR

137713 free:
    freeing free frag, dev:0x%lx, blk:%ld, cg:%d, ino:%lu, fs:%s
567420 ialloccg: block not in mapfs = %s
845546 alloc: %s: file system full
\&...
.fi
.in -2
.sp

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.sp
.LP
.BR syslogd (1M),
.BR attributes (5),
.BR log (7d)
