usr/src/man/man1m/mvdir.1m
'\" te
.\" Copyright 1989 AT&T  Copyright (c) 1997, Sun Microsystems, Inc.  All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH mvdir 1M "14 Mar 1997" "SunOS 5.11" "System Administration Commands"
.SH NAME
mvdir \- move a directory
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/mvdir\fR \fIdirname\fR \fIname\fR
.fi

.SH DESCRIPTION
.sp
.LP
\fBmvdir\fR moves directories within a file system. \fBdirname\fR must be a
directory. If
.I name
does not exist, it will be created as a directory. If
\fIname\fR does exist, and is a directory, \fBdirname\fR will be created as
.IR name/dirname .
\fBdirname\fR and  \fIname\fR may not be on the same path;
that is, one may not be subordinate to the other. For example:
.sp
.LP
.B "example% mvdir" x/y x/z
.sp
.LP
is legal, but
.sp
.LP
.B "example% mvdir" x/y x/y/z
.sp
.LP
is not.
.SH OPERANDS
.sp
.ne 2
.mk
.na
.B dirname
.ad
.RS 11n
.rt
The name of the directory that is to be moved to another directory in the
filesystem.
.RE

.sp
.ne 2
.mk
.na
.I name
.ad
.RS 11n
.rt
The name of the directory into which
.B dirname
is to be moved. If
\fIname\fR does not exist, it will be created. It may not be on the same path
as
.BR dirname .
.RE

.SH USAGE
.sp
.LP
See
.BR largefile (5)
for the description of the behavior of
.BR mvdir
when encountering files greater than or equal to 2 Gbyte ( 2^31 bytes).
.SH EXIT STATUS
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 6n
.rt
Successful operation.
.RE

.sp
.ne 2
.mk
.na
.B >0
.ad
.RS 6n
.rt
Operation failed.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.sp
.LP
.BR mkdir (1),
.BR mv (1),
.BR attributes (5),
.BR largefile (5)
