usr/src/man/man1m/named-checkconf.1m
'\" te
.\" Copyright (C) 2004  Internet Systems Consortium, Inc. ("ISC")
.\" Copyright (C) 2000-2002  Internet Software Consortium.
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND ISC DISCLAIMS ALL WARRANTIES WITH
.\" REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF MERCHANTABILITY
.\" AND FITNESS. IN NO EVENT SHALL ISC BE LIABLE FOR ANY SPECIAL, DIRECT,
.\" INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES WHATSOEVER RESULTING FROM
.\" LOSS OF USE, DATA OR PROFITS, WHETHER IN AN ACTION OF CONTRACT, NEGLIGENCE
.\" OR OTHER TORTIOUS ACTION, ARISING OUT OF OR IN CONNECTION WITH THE USE OR
.\" PERFORMANCE OF THIS SOFTWARE.
.\"
.\" Portions Copyright (c) 2004, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.TH named-checkconf 1M "24 Dec 2008" "SunOS 5.11" "System Administration Commands"
.SH NAME
named-checkconf \- named configuration file syntax checking tool
.SH SYNOPSIS
.LP
.nf
\fBnamed-checkconf\fR [\fB-vjz\fR] [\fB-t\fR \fIdirectory\fR] \fIfilename\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B named-checkconf
utility checks the syntax, but not the semantics,
of a named configuration file.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -t
.I directory
.ad
.RS 16n
.rt
Change the root directory to
.I directory
so that include directives in
the configuration file are processed as if run by a named configuration
whose root directory has been similarly changed.
.RE

.sp
.ne 2
.mk
.na
.B -v
.ad
.RS 16n
.rt
Print the version of the
.B named-checkconf
program and exit.
.RE

.sp
.ne 2
.mk
.na
.B -z
.ad
.RS 16n
.rt
Perform a test load of the master zones found in
.BR named.conf .
.RE

.sp
.ne 2
.mk
.na
.B -j
.ad
.RS 16n
.rt
When loading a zonefile, read the journal if it exists.
.RE

.SH OPERANDS
.sp
.LP
The following operands are supported:
.sp
.ne 2
.mk
.na
.I filename
.ad
.RS 12n
.rt
The name of the configuration file to be checked. If not specified, it
defaults to
.BR /etc/named.conf .
.RE

.SH EXIT STATUS
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 5n
.rt
No errors were detected.
.RE

.sp
.ne 2
.mk
.na
.B 1
.ad
.RS 5n
.rt
An error was detected.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWbind
_
Interface StabilityExternal
.TE

.SH SEE ALSO
.sp
.LP
.BR named (1M),
.BR attributes (5)
.sp
.LP
.IR "BIND 9 Administrator Reference Manual" ,
available at the ISC web
site.
