usr/src/man/man1m/ncaconfd.1m
'\" te
.\" Copyright (C) 2001, Sun Microsystems, Inc.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ncaconfd 1M "12 Oct 2004" "SunOS 5.11" "System Administration Commands"
.SH NAME
ncaconfd \- Solaris Network Cache and Accelerator (NCA) configuration
daemon
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/inet/ncaconfd\fR [\fB-al\fR ] \fIinterface1 \fR [\fIinterface2 .\|.\|.\fR]
.fi

.SH DESCRIPTION
.sp
.LP
Use the
.B ncaconfd
utility to set up NCA on a system. At boot time, the
.B ncakmod
initialization script reads in
.BR nca.if (4)
to determine on
which interface(s) NCA should run.
.B ncaconfd
then sets up the
interface.
.sp
.LP
.B ncaconfd
also operates as a daemon if the
.B nca_active
key is set
to enabled in
.BR ncakmod.conf (4)
file. In this case,
.B ncaconfd
will
continue as a daemon after all the NCA interfaces have been set up,
listening for routing changes. The changes are then passed to NCA to control
which interface NCA should use to make active outgoing TCP connnections.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -a
.ad
.RS 6n
.rt
Enable active connections.
.RE

.sp
.ne 2
.mk
.na
.B -l
.ad
.RS 6n
.rt
Enable logging.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/nca/ncakmod.conf
.ad
.RS 25n
.rt

.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWncau
_
Interface StabilityEvolving
.TE

.SH SEE ALSO
.sp
.LP
.BR nca (1),
.BR ncakmod (1),
.BR nca.if (4),
.BR ncakmod.conf (4),
.BR attributes (5)
