usr/src/man/man1m/ncheck_ufs.1m
'\" te
.\" Copyright 1989 AT&T  Copyright (c) 1997 Sun Microsystems, Inc.  All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ncheck_ufs 1M "18 Dec 1991" "SunOS 5.11" "System Administration Commands"
.SH NAME
ncheck_ufs \- generate pathnames versus i-numbers for ufs file systems
.SH SYNOPSIS
.LP
.nf
\fBncheck\fR \fB-F\fR ufs [\fIgeneric_options\fR] [\fB-o\fR m] [\fIspecial\fR]...
.fi

.SH DESCRIPTION
.sp
.LP
.B ncheck -F
.B ufs
generates a pathname versus i-number list
of files for the
.B ufs
file system residing on
.IR special .
Names of
directory files are followed by
.RB ` /. '.
.SH OPTIONS
.sp
.LP
See
.BR ncheck (1M)
for the list of
.I generic_options
supported.
.sp
.ne 2
.mk
.na
.B -o
.ad
.RS 6n
.rt
Specify
.B ufs
file system specific options. The available option is:

.sp
.ne 2
.mk
.na
.B m
.ad
.RS 5n
.rt
Print mode information.
.RE

.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.sp
.LP
.BR ff (1M),
.BR ncheck (1M),
.BR attributes (5)
.SH DIAGNOSTICS
.sp
.LP
When the file system structure is improper, `\fB??\fR' denotes the "parent"
of a parentless file and a pathname beginning with `\fB\&.\|.\|.\fR' denotes
a loop.
