usr/src/man/man1m/ncheck.1m
'\" te
.\" Copyright 1989 AT&T  Copyright (c) 2001, Sun Microsystems, Inc.  All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ncheck 1M "30 May 2001" "SunOS 5.11" "System Administration Commands"
.SH NAME
ncheck \- generate a list of path names versus i-numbers
.SH SYNOPSIS
.LP
.nf
\fBncheck\fR [\fB-F\fR \fIFSType\fR] [\fB-V\fR] [\fIgeneric_options\fR]
     [\fB-o\fR \fIFSType-specific_options\fR] [\fIspecial\fR]...
.fi

.SH DESCRIPTION
.sp
.LP
.B ncheck
with no options generates a path-name versus i-number list of
all files on
.IR special .
If
.I special
is not specified on the
command line the list is generated for all
.IR special "s in"
.B /etc/vfstab
which have a numeric
.BR fsckpass .
.I special
is the
raw device on which the file system exists.
.SH OPTIONS
.sp
.ne 2
.mk
.na
.B -F
.ad
.RS 19n
.rt
Specify the
.I FSType
on which to operate. The
.I FSType
should
either be specified here  or be determinable from
.B /etc/vfstab
by
finding an entry in the table that has a numeric
.B fsckpass
field and an
.B fsckdev
that matches
.IR special .
.RE

.sp
.ne 2
.mk
.na
.B -V
.ad
.RS 19n
.rt
Echo the complete command line, but do not execute the command. The command
line is generated by using the options and arguments provided by the user and
adding to them information derived from
.BR /etc/vfstab .
This option may
be used to verify and validate the command line.
.RE

.sp
.ne 2
.mk
.na
.I generic_options
.ad
.RS 19n
.rt
Options that are commonly supported by most FSType-specific command modules.
The following options are available:
.sp
.ne 2
.mk
.na
.BI -i " i-list"
.ad
.RS 13n
.rt
Limit the report to the files on the
.I i-list
that follows. The
.I i-list
must be separated by commas with no intervening spaces.
.RE

.sp
.ne 2
.mk
.na
.B -a
.ad
.RS 13n
.rt
Print the names "." and ".\|." which are ordinarily suppressed.
.RE

.sp
.ne 2
.mk
.na
.B -s
.ad
.RS 13n
.rt
Report only special files and files with set-user-ID mode. This option may
be used to detect violations of security policy.
.RE

.RE

.sp
.ne 2
.mk
.na
.B -o
.ad
.RS 19n
.rt
Specify
.I FSType-specific_options
in a comma separated (without spaces)
list of suboptions and keyword-attribute pairs for interpretation by the
FSType-specific module of the command.
.RE

.SH USAGE
.sp
.LP
See
.BR largefile (5)
for the description of the behavior of
.BR ncheck
when encountering files greater than or equal to 2 Gbyte ( 2^31 bytes).
.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/vfstab
.ad
.RS 15n
.rt
list of default parameters for each file system
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.sp
.LP
.BR vfstab (4),
.BR attributes (5),
.BR largefile (5)
Manual pages for
the FSType-specific modules of 
.B ncheck
.SH NOTES
.sp
.LP
This command may not be supported for all
.IR FSTypes .
