usr/src/man/man1m/ndd.1m
'\" te
.\" Copyright (C) 2007, Sun Microsystems, Inc. All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ndd 1M "13 Mar 2009" "SunOS 5.11" "System Administration Commands"
.SH NAME
ndd \- get and set driver configuration parameters
.SH SYNOPSIS
.LP
.nf
\fBndd\fR [\fB-set\fR] \fIdriver\fR \fIparameter\fR [\fIvalue\fR]
.fi

.SH DESCRIPTION
.sp
.LP
\fBndd\fR gets and sets selected configuration parameters in some kernel
drivers. Currently,
.B ndd
only supports the drivers that implement the
\fBTCP/IP\fR Internet protocol family. Each driver chooses which parameters
to make visible using
.BR ndd .
Since these parameters are usually tightly
coupled to the implementation, they are likely to change from release to
release. Some parameters may be read-only.
.sp
.LP
If the
.B -set
option is omitted,
.B ndd
queries the named
.IR driver ,
retrieves the value associated with the specified
.IR parameter ,
and prints it. If the
.B -set
.RB "option is given," " ndd"
passes
.IR value ,
which must be specified, down to the named \fIdriver\fR
which assigns it to the named
.IR parameter .
.sp
.LP
By convention, drivers that support
.B ndd
also support a special
read-only
.I parameter
named ``\fB?\fR'' which can be used to list the
parameters supported by the driver.
.SH EXAMPLES
.LP
\fBExample 1\fR Getting Parameters Supported By The TCP Driver
.sp
.LP
To see which parameters are supported by the TCP driver, use the following
command:

.sp
.in +2
.nf
example% \fBndd /dev/tcp \e?\fR
.fi
.in -2
.sp

.sp
.LP
The parameter name ``\fB?\fR'' may need to be escaped with a backslash to
prevent its being interpreted as a shell meta character.

.sp
.LP
The following command sets the value of the parameter \fIip_forwarding\fR
in the dual stack IP driver to zero. This disables IPv4 packet forwarding.

.sp
.in +2
.nf
example% \fBndd -set /dev/ip ip_forwarding 0\fR
.fi
.in -2
.sp

.sp
.LP
Similarly, in order to disable IPv6 packet forwarding, the value of
parameter \fIip6_forwarding\fR

.sp
.in +2
.nf
example% \fBndd -set /dev/ip ip6_forwarding 0\fR
.fi
.in -2
.sp

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.sp
.LP
.BR nca (1),
.BR dladm (1M),
.BR ioctl (2),
.BR attributes (5),
.BR arp (7P),
.BR ip (7P),
.BR ip6 (7P),
.BR tcp (7P),
.BR udp (7P)
.SH NOTES
.sp
.LP
The parameters supported by each driver may change from release to release.
Like programs that read
.BR /dev/kmem ,
user programs or shell scripts that
execute
.B ndd
should be prepared for parameter names to change.
.sp
.LP
The
.B ioctl()
command that
.B ndd
uses to communicate with drivers
is likely to change in a future release. User programs should avoid making
dependencies on it.
.sp
.LP
The use of
.B ndd
to administer Layer 2 (Data Link layer) drivers is
strongly discouraged as this capability is to be obsoleted in a future
release, replaced by \fBdladm\fR(1M). Please refer to the driver-specific
man page in section 7D of the SunOS man pages.
.sp
.LP
The meanings of many
.B ndd
parameters make sense only if you understand
how the driver is implemented.
.sp
.LP
If a TCP driver sends a report that is truncated, it could be because that
driver uses
.B ndd
for transporting  the report.
.B ndd
imposes a 64K
limit on such reports.
