usr/src/man/man1m/ndmpstat.1m
'\" te
.\" Copyright (c) 2007, Sun Microsystems, Inc. All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ndmpstat 1M "21 Jun 2007" "SunOS 5.11" "System Administration Commands"
.SH NAME
ndmpstat \- show NDMP backup progress statistics
.SH SYNOPSIS
.LP
.nf
\fBndmpstat\fR  [\fItapes\fR] [\fIinterval\fR [\fIcount\fR]]
.fi

.SH DESCRIPTION
.sp
.LP
The
.B ndmpstat
utility reports Network Data Management Protocol (NDMP)
statistics, among which are  NDMP worker threads, disk IO, tape IO, files
operation, performance, and backup activity.
.sp
.LP
.B ndmpstat
reports the aggregate statistics for all tapes and disks. In
order to obtain statistics for specific tape devices, the tape device name
should be passed as argument to the utility.
.sp
.LP
When invoked,
.B ndmpstat
begins its display with a one-line summary of
the NDMP daemon activity since the NDMP service was invoked.
.SS "Display Fields"
.sp
.LP
The fields in
.B ndmpstat
output are described as follows:
.sp
.ne 2
.mk
.na
.B wthr
.ad
.sp .6
.RS 4n
Report the number of worker threads in each  of  the four following
states:
.sp
.ne 2
.mk
.na
.B r
.ad
.sp .6
.RS 4n
the number of worker threads running
.RE

.sp
.ne 2
.mk
.na
.B w
.ad
.sp .6
.RS 4n
the number of blocked worker threads that are waiting for resources such as
I/O and paging
.RE

.sp
.ne 2
.mk
.na
.B b
.ad
.sp .6
.RS 4n
the number of backup operations currently running
.RE

.sp
.ne 2
.mk
.na
.B r
.ad
.sp .6
.RS 4n
the number of restore operations currently running
.RE

.RE

.sp
.ne 2
.mk
.na
.B file
.ad
.sp .6
.RS 4n
Report on usage of filesystem.
.sp
.ne 2
.mk
.na
.B rd
.ad
.sp .6
.RS 4n
the number of files being read
.RE

.sp
.ne 2
.mk
.na
.B wr
.ad
.sp .6
.RS 4n
the number of files being written
.RE

.RE

.sp
.ne 2
.mk
.na
.B disk
.ad
.sp .6
.RS 4n
Report the number of disk operations per interval.
.sp
.ne 2
.mk
.na
.B rd
.ad
.sp .6
.RS 4n
the number of disk blocks being read
.RE

.sp
.ne 2
.mk
.na
.B wr
.ad
.sp .6
.RS 4n
the number of disk blocks being written
.RE

.RE

.sp
.ne 2
.mk
.na
.B tape
.ad
.sp .6
.RS 4n
Report the number of tape operations per interval. There are slots for up
to four tapes, labeled with a single number. The number indicates the name
of the device under
.BR /dev/rmt .
.sp
.ne 2
.mk
.na
.B rd
.ad
.sp .6
.RS 4n
the number of tape blocks being read
.RE

.sp
.ne 2
.mk
.na
.B wr
.ad
.sp .6
.RS 4n
the number of tape blocks being written
.RE

.RE

.sp
.ne 2
.mk
.na
.B bytes
.ad
.sp .6
.RS 4n
Report the number of bytes transferred. This is the aggregate value of both
tape and disk devices. The number is in kilobytes.
.sp
.ne 2
.mk
.na
.B rd
.ad
.sp .6
.RS 4n
the number of kilobytes being read
.RE

.sp
.ne 2
.mk
.na
.B wr
.ad
.sp .6
.RS 4n
the number of kilobytes being written
.RE

.RE

.sp
.ne 2
.mk
.na
.B perf
.ad
.sp .6
.RS 4n
Displays a rough estimate of performance of the backup/restore operation in
megabytes per second.
.sp
.ne 2
.mk
.na
.B bk
.ad
.sp .6
.RS 4n
backup performance
.RE

.sp
.ne 2
.mk
.na
.B rs
.ad
.sp .6
.RS 4n
restore performance
.RE

.RE

.sp
.ne 2
.mk
.na
.B prcnt
.ad
.sp .6
.RS 4n
Display the comparative usage of resources, in percent.
.sp
.ne 2
.mk
.na
.B dsk
.ad
.sp .6
.RS 4n
disk I/O time
.RE

.sp
.ne 2
.mk
.na
.B tpe
.ad
.sp .6
.RS 4n
tape I/O time
.RE

.sp
.ne 2
.mk
.na
.B otr
.ad
.sp .6
.RS 4n
other time (memory or idle)
.RE

.RE

.sp
.LP
See
.BR EXAMPLES .
.SH OPERANDS
.sp
.LP
The following operands are supported:
.sp
.ne 2
.mk
.na
.I count
.ad
.RS 12n
.rt
Specifies the number of times that the statistics display is repeated.
.RE

.sp
.ne 2
.mk
.na
.I tape
.ad
.RS 12n
.rt
Specifies which tapes are to be given priority in the output. A command
line is limited to a maximum of four tape devices. A common tape name is
\fB/dev/rmt/\fIn\fR, where \fIn\fR is an integer.
.RE

.sp
.ne 2
.mk
.na
.I interval
.ad
.RS 12n
.rt
Specifies the number of seconds over which
.B ndmpstat
summarizes
activity. The specified interval remains in effect till the command is
terminated.
.RE

.SH EXAMPLES
.LP
.B Example 1
Using
.BR ndmpstat
.sp
.LP
The following command displays a summary of NDMP daemon activity at
five-second intervals.

.sp
.in +2
.nf
example% \fBndmpstat 5\fR
wthr     file      disk      tape        bytes      perf       prcnt
r w b r rd  wr    rd  wr   rd    wr     rd    wr   bk  rs  dsk  tpe  otr
1 0 3 6 50   9   1250  0  32544 4455   42335 3234   5  4   20   40   40
1 0 0 1  1   0    128  0    0   128     64    64    1  0    0   80   20
1 0 0 1  2   0    128  0    0     0     64     0    1  0   80    0   20
1 0 0 1  1   0    128  0    0     0     64     0    1  0   80    0   20
1 0 0 1  3   0    128  0    0     0     64     0    0  0   80    0   20
1 0 0 1  1   0    128  0    0   128     64    64    1  0    0   80   20
^C
example%
.fi
.in -2
.sp

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWndmpu
_
Interface StabilitySee below
.TE

.sp
.LP
Invocation is evolving. Human readable output is unstable.
.SH SEE ALSO
.sp
.LP
.BR iostat (1M),
.BR mpstat (1M),
.BR ndmpd (1M),
.BR ndmpadm (1M),
.BR attributes (5)
.SH NOTES
.sp
.LP
Performance numbers are not accurate and are rounded up at the MB/sec.
boundary.
