usr/src/man/man1m/ndmpadm.1m
'\" te
.\" Copyright (c) 2007, Sun Microsystems, Inc. All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ndmpadm 1M "24 Jun 2009" "SunOS 5.11" "System Administration Commands"
.SH NAME
ndmpadm \- administer Network Data Management Protocol activities
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/ndmpadm\fR [\fB-?\fR ] \fIsubcommand\fR [\fIoptions\fR] [\fIdirect-object\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The
.B ndmpadm
command can be used to query the
.BR ndmpd "(1M) daemon"
to get the status of active sessions, terminate a session, query backup
devices, and set or get the current NDMP (Network Data Management Protocol)
service variables and properties.
.B ndmpadm
is implemented as a set of
subcommands, many with their own direct object, which are described in the
section for a given subcommand. Certain subcommands support options, which
are described along with the subcommand.
.sp
.LP
The
.B ndmpadm
command supports the following subcommands:
.sp
.ne 2
.mk
.na
.B disable
.ad
.sp .6
.RS 4n
Disable the specified authentication password handling.
.RE

.sp
.ne 2
.mk
.na
.B enable
.ad
.sp .6
.RS 4n
Enable the specified authentication password handling.
.RE

.sp
.ne 2
.mk
.na
.B get
.ad
.sp .6
.RS 4n
Get the value of an NDMP configuration property.
.RE

.sp
.ne 2
.mk
.na
.B kill-sessions
.ad
.sp .6
.RS 4n
Terminate an active session.
.RE

.sp
.ne 2
.mk
.na
.B set
.ad
.sp .6
.RS 4n
Set the value of an NDMP configuration property.
.RE

.sp
.ne 2
.mk
.na
.B show-devices
.ad
.sp .6
.RS 4n
Get a list of tape devices connected to the server.
.RE

.sp
.ne 2
.mk
.na
.B show-sessions
.ad
.sp .6
.RS 4n
Display the details of active NDMP sessions.
.RE

.SH OPTIONS
.sp
.LP
The following option is supported:
.sp
.ne 2
.mk
.na
.B -?
.ad
.RS 6n
.rt
Display a list of all subcommands and options.
.RE

.SH SUB-COMMANDS
.sp
.LP
The
.B ndmpadm
command supports the subcommands described below.
.SS "\fBdisable\fR Subcommand"
.sp
.LP
The syntax for the
.B disable
subcommand is:
.sp
.in +2
.nf
# \fBndmpadm disable -a \fIauth-type\fR
.fi
.in -2
.sp

.sp
.LP
This subcommand disables the authentication type specified by
\fIauth-type\fR for an NDMP client's remote access. Valid values for
\fIauth-type\fR are \fBcram-md5\fR or
.BR cleartext .
.SS "\fBenable\fR Subcommand"
.sp
.LP
The syntax for the
.B enable
subcommand is:
.sp
.in +2
.nf
# \fBndmpadm enable -a \fIauth-type\fR -u \fIusername\fR
.fi
.in -2
.sp

.sp
.LP
This subcommand prompts for the user's password twice for confirmation and
activates the specified authentication type with the given username and
password for NDMP client access. Valid values for
.I auth-type
are
\fBcram-md5\fR or
.BR cleartext .
.SS "\fBget\fR Subcommand"
.sp
.LP
The syntax for the
.B get
subcommand is:
.sp
.in +2
.nf
# \fBndmpadm get [-p] [\fIproperty\fR] [[-p] \fIproperty\fR=\fIvalue\fR].\|.\|.\fR
.fi
.in -2
.sp

.sp
.LP
The property names are the same as used for the
.B set
subcommand and
are described below. If you do not specify a property, the \fBget\fR
subcommand returns all configuration properties.
.SS "\fBkill-sessions\fR Subcommand"
.sp
.LP
The
.B kill-sessions
subcommand allows you to terminate the session
number
.IR ID .
.sp
.LP
The syntax for the
.B kill-sessions
subcommand is:
.sp
.in +2
.nf
# \fBndmpadm kill-sessions \fIID\fR
.fi
.in -2
.sp

.SS "\fBset\fR Subcommand"
.sp
.LP
The syntax for the
.B set
subcommand is:
.sp
.in +2
.nf
# \fBndmpadm set [-p] \fIproperty\fR=\fIvalue\fR [[-p] \fIproperty\fR=\fIvalue\fR].\|.\|.\fR
.fi
.in -2
.sp

.sp
.LP
The properties you can set with the
.B set
subcommand are described in
the
.BR ndmp (4)
man page.
.SS "\fBshow-devices\fR Subcommand"
.sp
.LP
The syntax for the
.B show-devices
subcommand is:
.sp
.in +2
.nf
# \fBndmpadm show-devices\fR
.fi
.in -2
.sp

.sp
.LP
This subcommand lists the name, vendor, serial number, and other
information about the current tape drive and libraries connected to the
system.
.SS "\fBshow-sessions\fR Subcommand"
.sp
.LP
The
.B show-sessions
subcommand displays details of a session. The
syntax for the
.B show-sessions
subcommand is:
.sp
.in +2
.nf
# \fBndmpadm show-sessions [-i tape,scsi,data,mover] [\fIID\fR]\fR
.fi
.in -2
.sp

.sp
.LP
The
.B show-sessions
subcommand supports the following arguments:
.sp
.ne 2
.mk
.na
\fB-i tape\fR,\fBscsi\fR,\fBdata\fR,\fBmover\fR
.ad
.sp .6
.RS 4n
Identify a type of interface about which to obtain data. If no interface is
specified,
.B show-sessions
displays information for all types of
interfaces.
.RE

.sp
.ne 2
.mk
.na
.I ID
.ad
.sp .6
.RS 4n
Identifies a particular session about which to display data. If no \fIID\fR
is specified,
.B show-sessions
displays data for all sessions.
.RE

.SH EXAMPLES
.LP
\fBExample 1\fR Obtaining the Status of All NDMP Connections
.sp
.LP
The following command obtains status on all connections.

.sp
.in +2
.nf
# \fBndmpadm show-devices\fR
.fi
.in -2
.sp

.LP
\fBExample 2\fR Obtaining the Status of Certain Types of Connections
.sp
.LP
The following command obtains status on tape and SCSI interfaces.

.sp
.in +2
.nf
# \fBndmpadm show-sessions -i scsi,tape\fR
.fi
.in -2
.sp

.LP
\fBExample 3\fR Limiting Protocol Version
.sp
.LP
The following command limits the use of the NDMP protocol to version 3.

.sp
.in +2
.nf
# \fBndmpadm set -p version=3\fR
.fi
.in -2
.sp

.LP
\fBExample 4\fR Turning on Debugging
.sp
.LP
The following command enables debugging. It also sets the NDMP protocol to
version 3.

.sp
.in +2
.nf
# \fBndmpadm set -p debug-level=1 -p version=3\fR
.fi
.in -2
.sp

.LP
\fBExample 5\fR Obtaining Current Version Number
.sp
.LP
The following command obtains the version number of the currently running
NDMP.

.sp
.in +2
.nf
# \fBndmpadm get -p version\fR
.fi
.in -2
.sp

.LP
\fBExample 6\fR Disconnecting a Specific Session
.sp
.LP
The command shown below disconnects session 5. The session number was
previously obtained from an
.B "ndmpadm show-sessions"
command.

.sp
.in +2
.nf
# \fBndmpadm kill-session 5\fR
.fi
.in -2
.sp

.LP
\fBExample 7\fR Obtaining the Values for All NDMP Properties
.sp
.LP
The following command obtains the values for all NDMP properties.

.sp
.in +2
.nf
# \fBndmpadm get\fR
.fi
.in -2
.sp

.LP
\fBExample 8\fR Enabling CRAM-MD5 Authentication
.sp
.LP
The following command enables CRAM-MD5 authentication.

.sp
.in +2
.nf
# \fBndmpadm enable -a cram-md5 -u admin\fR
Enter new password:\fB*****\fR
Re-enter password:\fB*****\fR
.fi
.in -2
.sp

.LP
\fBExample 9\fR Disabling Clear Text Password Authentication
.sp
.LP
The following command disables clear text password authentication.

.sp
.in +2
.nf
# \fBndmpadm disable -a cleartext\fR
.fi
.in -2
.sp

.SH EXIT STATUS
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 5n
.rt
Successful completion.
.RE

.sp
.ne 2
.mk
.na
.B 1
.ad
.RS 5n
.rt
An error occurred, such as the
.B ndmpd
daemon is not running, that
prevented
.B ndmpadm
from contacting the demon.
.RE

.sp
.ne 2
.mk
.na
.B 2
.ad
.RS 5n
.rt
Invalid command-line options were specified.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWndmpu, SUNWndmpr
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
.BR dump (1),
.BR tar (1),
.BR ndmpd (1M),
.BR ndmpstat (1M),
.BR svccfg (1M),
.BR syslogd (1M),
.BR ndmp (4),
.BR attributes (5),
.BR smf (5)
.SH NOTES
.sp
.LP
The \fBndmpd\fR(1M) daemon is managed by the service management facility
(\fBsmf\fR(5)), under the service identifier:
.sp
.in +2
.nf
svc:/system/ndmpd
.fi
.in -2
.sp

.sp
.LP
Administrative actions on this service, such as setting and getting a
property can be alternatively performed using \fBsvccfg\fR(1M). For example
to enable Direct Access Recovery (DAR) mode:
.sp
.in +2
.nf
# \fBsvccfg -s svc:/system/ndmpd\fR
svc:/system/ndmpd> \fBsetprop ndmpd/dar-support = yes\fR
.fi
.in -2
.sp

.sp
.LP
\&.\|.\|.and to get the list of properties:
.sp
.in +2
.nf
# \fBsvccfg -s svc:/system/ndmpd\fR
svc:/system/ndmpd> \fBlistprop\fR
.fi
.in -2
.sp

