usr/src/man/man1m/netservices.1m
'\" te
.\" Copyright (c) 2006, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH netservices 1M "31 Aug 2006" "SunOS 5.11" "System Administration Commands"
.SH NAME
netservices \- enable or disable network services
.SH SYNOPSIS
.LP
.nf
\fBnetservices\fR open
.fi

.LP
.nf
\fBnetservices\fR limited
.fi

.SH DESCRIPTION
.sp
.LP
The
.B netservices
command uses the Solaris service management facility,
.BR smf (5),
to control services that accept over the network from remote
clients.
.sp
.LP
When
.B netservices
is invoked with the
.B limited
command-line
argument, all network services except the secure shell daemon, sshd(1M), are
either disabled or constrained to respond to local requests only.
.sp
.LP
Invoking netservices with the
.B open
command-line argument enables a
large set of network services, as in previous releases of Solaris.
.sp
.LP
To customize the configuration set enabled by
.BR netservices ,
use
.BR svcadm (1M)
to enable or disable individual services. Use
.BR svccfg (1M)
to set properties that determine whether a service accepts
input from remote clients. See the man pages for individual services for the
names of service instances and their properties.
.sp
.LP
Note that the
.B netservices
command has an interface stability of
Obsolete.
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
_
Interface StabilityObsolete
.TE

.SH SEE ALSO
.sp
.LP
.BR svcadm (1M),
.BR svccfg (1M),
.BR sshd (1M),
.BR attributes (5),
.BR smf (5)
