usr/src/man/man1m/netstat.1m
'\" te
.\" Copyright (C) 2002, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" Copyright 1989 AT&T
.\" Copyright (c) 1983 Regents of the University of California.  All rights reserved.
.\" The Berkeley software License Agreement specifies the terms and conditions for redistribution.
.TH netstat 1M "16 Jun 2009" "SunOS 5.11" "System Administration Commands"
.SH NAME
netstat \- show network status
.SH SYNOPSIS
.LP
.nf
\fBnetstat\fR [\fB-anvR\fR] [\fB-f\fR \fIaddress_family\fR] [\fB-P\fR \fIprotocol\fR]
.fi

.LP
.nf
\fBnetstat\fR \fB-g\fR [\fB-nv\fR] [\fB-f\fR \fIaddress_family\fR]
.fi

.LP
.nf
\fBnetstat\fR \fB-p\fR [\fB-n\fR] [\fB-f\fR \fIaddress_family\fR]
.fi

.LP
.nf
\fBnetstat\fR \fB-s\fR [\fB-f\fR \fIaddress_family\fR] [\fB-P\fR \fIprotocol\fR]
     [\fB-T\fR u | d ] [\fIinterval\fR [\fIcount\fR]]
.fi

.LP
.nf
\fBnetstat\fR \fB-m\fR [\fB-T\fR u | d ] [\fB-v\fR] [\fIinterval\fR [\fIcount\fR]]
.fi

.LP
.nf
\fBnetstat\fR \fB-i\fR [\fB-I\fR \fIinterface\fR] [\fB-an\fR] [\fB-f\fR \fIaddress_family\fR]
     [\fB-T\fR u | d ] [\fIinterval\fR [\fIcount\fR]]
.fi

.LP
.nf
\fBnetstat\fR \fB-r\fR [\fB-anvR\fR] [\fB-f\fR \fIaddress_family\fR | \fIfilter\fR]
.fi

.LP
.nf
\fBnetstat\fR \fB-M\fR [\fB-ns\fR] [\fB-f\fR \fIaddress_family\fR]
.fi

.LP
.nf
\fBnetstat\fR \fB-D\fR [\fB-I\fR \fIinterface\fR] [\fB-f\fR \fIaddress_family\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The
.B netstat
command displays the contents of certain network-related
data structures in various formats, depending on the options you select.
.sp
.LP
The
.B netstat
command has the several forms shown in the SYNOPSIS
section, above, listed as follows:
.RS +4
.TP
.ie t \(bu
.el o
The first form of the command (with no required arguments) displays a list
of active sockets for each protocol.
.RE
.RS +4
.TP
.ie t \(bu
.el o
The second, third, and fourth forms
.RB ( -g ,
.BR -p ,
and
.BR -s
options) display information from various network data structures.
.RE
.RS +4
.TP
.ie t \(bu
.el o
The fifth form (\fB-m\fR option) displays STREAMS memory statistics.
.RE
.RS +4
.TP
.ie t \(bu
.el o
The sixth form (\fB-i\fR option) shows the state of the interfaces.
.RE
.RS +4
.TP
.ie t \(bu
.el o
The seventh form (\fB-r\fR option) displays the routing table.
.RE
.RS +4
.TP
.ie t \(bu
.el o
The eighth form (\fB-M\fR option) displays the multicast routing table.
.RE
.RS +4
.TP
.ie t \(bu
.el o
The ninth form (\fB-D\fR option) displays the state of
.B DHCP
on one or
all interfaces.
.RE
.sp
.LP
These forms are described in greater detail below.
.sp
.LP
With no arguments (the first form),
.B netstat
displays connected
sockets for
.BR PF_INET ,
.BR PF_INET6 ,
and
.BR PF_UNIX ,
unless
modified otherwise by the
.B -f
option.
.SH OPTIONS
.sp
.ne 2
.mk
.na
.B -a
.ad
.sp .6
.RS 4n
Show the state of all sockets, all routing table entries, or all
interfaces, both physical and logical. Normally, listener sockets used by
server processes are not shown. Under most conditions, only interface, host,
network, and default routes are shown and only the status of physical
interfaces is shown.
.RE

.sp
.ne 2
.mk
.na
.B -f
.I address_family
.ad
.sp .6
.RS 4n
Limit all displays to those of the specified
.IR address_family .
The
value of
.I address_family
can be one of the following:
.sp
.ne 2
.mk
.na
.B inet
.ad
.RS 9n
.rt
For the
.B AF_INET
address family showing IPv4 information.
.RE

.sp
.ne 2
.mk
.na
.B inet6
.ad
.RS 9n
.rt
For the
.B AF_INET6
address family showing IPv6 information.
.RE

.sp
.ne 2
.mk
.na
.B unix
.ad
.RS 9n
.rt
For the
.B AF_UNIX
address family.
.RE

.RE

.sp
.ne 2
.mk
.na
.B -f
.I filter
.ad
.sp .6
.RS 4n
With
.B -r
only, limit the display of routes to those matching the
specified filter. A filter rule consists of a
.IR keyword :\fIvalue\fR
pair. The known keywords and the value syntax are:
.sp
.ne 2
.mk
.na
\fBaf:\fR{\fBinet\fR|\fBinet6\fR|\fBunix\fR|\fInumber\fR}\fR
.ad
.sp .6
.RS 4n
Selects an address family. This is identical to
.B -f
.I address_family
and both syntaxes are supported.
.RE

.sp
.ne 2
.mk
.na
\fBoutif\fR:{\fIname\fR|\fIifIndex\fR|\fBany\fR|\fBnone\fR}\fR
.ad
.sp .6
.RS 4n
Selects an output interface. You can specify the interface by name (such as
.BR hme0 )
or by
.B ifIndex
number (for example,
.BR 2 ).
If
.BR any
is used, the filter matches all routes having a specified interface
(anything other than null). If
.B none
is used, the filter matches all
routes having a null interface. Note that you can view the index number
(\fIifIndex\fR) for an interface with the
.B -a
option of
.BR ifconfig (1M).
.RE

.sp
.ne 2
.mk
.na
\fBdst\fR:{\fIip-address\fR[/\fImask\fR]|\fBany\fR|\fBnone\fR}\fR
.ad
.sp .6
.RS 4n
Selects a destination IP address. If specified with a mask length, then any
routes with matching or longer (more specific) masks are selected. If
.B any
is used, then all but addresses but 0 are selected. If
.B none
is used, then address 0 is selected.
.RE

.sp
.ne 2
.mk
.na
\fBflags:\fR[\fB+ -\fR]?[\fBABDGHLMSU\fR]\fB+\fR
.ad
.sp .6
.RS 4n
Selects routes tagged with the specified flags. By default, the flags as
specified must be set in order to match. With a leading
.BR + ,
the flags
specified must be set but others are ignored. With a leading
.BR - ,
the
flags specified must not be set and others are permitted.
.RE

You can specify multiple instances of
.B -f
to specify multiple filters.
For example:
.sp
.in +2
.nf
% netstat -nr -f outif:hme0 -f outif:hme1 -f dst:10.0.0.0/8
.fi
.in -2
.sp

The preceding command displays routes within network 10.0.0.0/8, with mask
length 8 or greater, and an output interface of either
.B hme0
or
.BR hme1 ,
and excludes all other routes.
.RE

.sp
.ne 2
.mk
.na
.B -g
.ad
.sp .6
.RS 4n
Show the multicast group memberships for all interfaces. If the
.B -v
option is included, source-specific membership information is also
displayed. See DISPLAYS, below.
.RE

.sp
.ne 2
.mk
.na
.B -i
.ad
.sp .6
.RS 4n
Show the state of the interfaces that are used for
.B IP
traffic.
Normally this shows statistics for the physical interfaces. When combined
with the
.B -a
option, this will also report information for the logical
interfaces. See
.BR ifconfig (1M).
.RE

.sp
.ne 2
.mk
.na
.B -m
.ad
.sp .6
.RS 4n
Show the STREAMS memory statistics.
.RE

.sp
.ne 2
.mk
.na
.B -n
.ad
.sp .6
.RS 4n
Show network addresses as numbers.
.B netstat
normally displays
addresses as symbols. This option may be used with any of the display
formats.
.RE

.sp
.ne 2
.mk
.na
.B -p
.ad
.sp .6
.RS 4n
Show the net to media tables. See DISPLAYS, below.
.RE

.sp
.ne 2
.mk
.na
.B -r
.ad
.sp .6
.RS 4n
Show the routing tables. Normally, only interface, host, network, and
default routes are shown, but when this option is combined with the
.B -a
option, all routes will be displayed, including cache. If you have not set
up a multicast route,
.B -ra
might not show any multicast routing
entries, although the kernel will derive such an entry if needed.
.RE

.sp
.ne 2
.mk
.na
.B -s
.ad
.sp .6
.RS 4n
Show per-protocol statistics. When used with the
.B -M
option, show
multicast routing statistics instead. When used with the
.B -a
option,
per-interface statistics will be displayed, when available, in addition to
statistics global to the system. See DISPLAYS, below.
.RE

.sp
.ne 2
.mk
.na
.B -T u
|
.B d
.ad
.sp .6
.RS 4n
Display a time stamp.
.sp
Specify
.B u
for a printed representation of the internal representation
of time. See
.BR time (2).
Specify
.B d
for standard date format. See
.BR date (1).
.RE

.sp
.ne 2
.mk
.na
.B -v
.ad
.sp .6
.RS 4n
Verbose. Show additional information for the sockets, STREAMS memory
statistics, routing table, and multicast group memberships.
.RE

.sp
.ne 2
.mk
.na
.B -I
.I interface
.ad
.sp .6
.RS 4n
Show the state of a particular interface.
.I interface
can be any valid
interface such as
.B hme0
or
.BR eri0 .
Normally, the status and
statistics for physical interfaces are displayed. When this option is
combined with the
.B -a
option, information for the logical interfaces is
also reported.
.RE

.sp
.ne 2
.mk
.na
.B -M
.ad
.sp .6
.RS 4n
Show the multicast routing tables. When used with the
.B -s
option, show
multicast routing statistics instead.
.RE

.sp
.ne 2
.mk
.na
.B -P
.I protocol
.ad
.sp .6
.RS 4n
Limit display of statistics or state of all sockets to those applicable to
.IR protocol .
The protocol can be one of
.BR ip ,
.BR ipv6 ,
.BR icmp ,
.BR icmpv6 ,
.BR icmp ,
.BR icmpv6 ,
.BR igmp ,
.BR udp ,
.BR tcp ,
.BR rawip .
.B rawip
can also be specified as
.BR raw .
The command
accepts protocol options only as all lowercase.
.RE

.sp
.ne 2
.mk
.na
.B -D
.ad
.sp .6
.RS 4n
Show the status of
.B DHCP
configured interfaces.
.RE

.sp
.ne 2
.mk
.na
.B -R
.ad
.sp .6
.RS 4n
This modifier displays extended security attributes for sockets and routing
table entries. The
.B -R
modifier is available only if the system is
configured with the Solaris Trusted Extensions feature.
.sp
With
.B -r
only, this option displays the routing entries' gateway
security attributes. See
.BR route (1M)
for more information on security
attributes.
.sp
When displaying socket information using the first form of the commmand,
this option displays additional information for Multi-Level Port(MLP)
sockets. This includes:
.RS +4
.TP
.ie t \(bu
.el o
The label for the peer if the socket is connected.
.RE
.RS +4
.TP
.ie t \(bu
.el o
The following flags can be appended to the socket's "State" output:
.RS

.sp
.ne 2
.mk
.na
.B P
.ad
.RS 5n
.rt
The socket is a MLP on zone-private IP addresses.
.RE

.sp
.ne 2
.mk
.na
.B S
.ad
.RS 5n
.rt
The socket is a MLP on IP addresses shared between zones.
.RE

.RE

.RE
.RE

.SH OPERANDS
.sp
.ne 2
.mk
.na
.I interval
.ad
.RS 12n
.rt
Display statistics accumulated since last display every
.IR interval
seconds, repeating forever, unless
.I count
is specified. When invoked
with
.IR interval ,
the first row of netstat output shows statistics
accumulated since last reboot.
.sp
The following options support
.IR interval :
.BR -i ,
.BR -m ,
.B -s
and
.BR -Ms .
Some values are configuration parameters and are just
redisplayed at each interval.
.RE

.sp
.ne 2
.mk
.na
.I count
.ad
.RS 12n
.rt
Display interface statistics the number of times specified by
.IR count ,
at the interval specified by
.IR interval .
.RE

.SH DISPLAYS
.SS "Active Sockets (First Form)"
.sp
.LP
The display for each active socket shows the local and remote address, the
send and receive queue sizes (in bytes), the send and receive windows (in
bytes), and the internal state of the protocol.
.sp
.LP
The symbolic format normally used to display socket addresses is either:
.sp
.in +2
.nf
\fBhostname\fR.\fIport\fR
.fi
.in -2
.sp

.sp
.LP
when the name of the host is specified, or
.sp
.in +2
.nf
\fInetwork\fR.\fIport\fR
.fi
.in -2
.sp

.sp
.LP
if a socket address specifies a network but no specific host.
.sp
.LP
The numeric host address or network number associated with the socket is
used to look up the corresponding symbolic hostname or network name in the
.I hosts
or
.I networks
database.
.sp
.LP
If the network or hostname for an address is not known, or if the
.B -n
option is specified, the numerical network address is shown. Unspecified, or
"wildcard", addresses and ports appear as an asterisk (\fB*\fR). For more
information regarding the Internet naming conventions, refer to
.BR inet (7P)
and
.BR inet6 (7P).
.sp
.LP
For SCTP sockets, because an endpoint can be represented by multiple
addresses, the verbose option
.RB ( -v )
displays the list of all the local
and remote addresses.
.SS "\fITCP Sockets\fR"
.sp
.LP
The possible state values for
.B TCP
sockets are as follows:
.sp
.ne 2
.mk
.na
.B BOUND
.ad
.RS 16n
.rt
Bound, ready to connect or listen.
.RE

.sp
.ne 2
.mk
.na
.B CLOSED
.ad
.RS 16n
.rt
Closed. The socket is not being used.
.RE

.sp
.ne 2
.mk
.na
.B CLOSING
.ad
.RS 16n
.rt
Closed, then remote shutdown; awaiting acknowledgment.
.RE

.sp
.ne 2
.mk
.na
.B CLOSE_WAIT
.ad
.RS 16n
.rt
Remote shutdown; waiting for the socket to close.
.RE

.sp
.ne 2
.mk
.na
.B ESTABLISHED
.ad
.RS 16n
.rt
Connection has been established.
.RE

.sp
.ne 2
.mk
.na
.B FIN_WAIT_1
.ad
.RS 16n
.rt
Socket closed; shutting down connection.
.RE

.sp
.ne 2
.mk
.na
.B FIN_WAIT_2
.ad
.RS 16n
.rt
Socket closed; waiting for shutdown from remote.
.RE

.sp
.ne 2
.mk
.na
.B IDLE
.ad
.RS 16n
.rt
Idle, opened but not bound.
.RE

.sp
.ne 2
.mk
.na
.B LAST_ACK
.ad
.RS 16n
.rt
Remote shutdown, then closed; awaiting acknowledgment.
.RE

.sp
.ne 2
.mk
.na
.B LISTEN
.ad
.RS 16n
.rt
Listening for incoming connections.
.RE

.sp
.ne 2
.mk
.na
.B SYN_RECEIVED
.ad
.RS 16n
.rt
Initial synchronization of the connection under way.
.RE

.sp
.ne 2
.mk
.na
.B SYN_SENT
.ad
.RS 16n
.rt
Actively trying to establish connection.
.RE

.sp
.ne 2
.mk
.na
.B TIME_WAIT
.ad
.RS 16n
.rt
Wait after close for remote shutdown retransmission.
.RE

.SS "\fISCTP Sockets\fR"
.sp
.LP
The possible state values for SCTP sockets are as follows:
.sp
.ne 2
.mk
.na
.B CLOSED
.ad
.RS 21n
.rt
Closed. The socket is not being used.
.RE

.sp
.ne 2
.mk
.na
.B LISTEN
.ad
.RS 21n
.rt
Listening for incoming associations.
.RE

.sp
.ne 2
.mk
.na
.B ESTABLISHED
.ad
.RS 21n
.rt
Association has been established.
.RE

.sp
.ne 2
.mk
.na
.B COOKIE_WAIT
.ad
.RS 21n
.rt
.B INIT
has been sent to the peer, awaiting acknowledgment.
.RE

.sp
.ne 2
.mk
.na
.B COOKIE_ECHOED
.ad
.RS 21n
.rt
State cookie from the INIT-ACK has been sent to the peer, awaiting
acknowledgement.
.RE

.sp
.ne 2
.mk
.na
.B SHUTDOWN_PENDING
.ad
.RS 21n
.rt
.B SHUTDOWN
has been received from the upper layer, awaiting
acknowledgement of all outstanding
.B DATA
from the peer.
.RE

.sp
.ne 2
.mk
.na
.B SHUTDOWN_SENT
.ad
.RS 21n
.rt
All outstanding data has been acknowledged in the
.BR SHUTDOWN_SENT
state.
.B SHUTDOWN
has been sent to the peer, awaiting acknowledgement.
.RE

.sp
.ne 2
.mk
.na
.B SHUTDOWN_RECEIVED
.ad
.RS 21n
.rt
.B SHUTDOWN
has been received from the peer, awaiting acknowledgement of
all outstanding
.BR DATA .
.RE

.sp
.ne 2
.mk
.na
.B SHUTDOWN_ACK_SENT
.ad
.RS 21n
.rt
All outstanding data has been acknowledged in the
.BR SHUTDOWN_RECEIVED
state.
.B SHUTDOWN_ACK
has been sent to the peer.
.RE

.SS "Network Data Structures (Second Through Fifth Forms)"
.sp
.LP
The form of the display depends upon which of the
.BR -g ,
.BR -m ,
.BR -p ,
or
.B -s
options you select.
.sp
.ne 2
.mk
.na
.B -g
.ad
.RS 6n
.rt
Displays the list of multicast group membership.
.RE

.sp
.ne 2
.mk
.na
.B -m
.ad
.RS 6n
.rt
Displays the memory usage, for example, STREAMS mblks.
.RE

.sp
.ne 2
.mk
.na
.B -p
.ad
.RS 6n
.rt
Displays the net to media mapping table. For IPv4, the address resolution
table is displayed. See
.BR arp (1M).
For IPv6, the neighbor cache is
displayed.
.RE

.sp
.ne 2
.mk
.na
.B -s
.ad
.RS 6n
.rt
Displays the statistics for the various protocol layers.
.RE

.sp
.LP
The statistics use the MIB specified variables. The defined values for
.B ipForwarding
are:
.sp
.ne 2
.mk
.na
.B forwarding(1)
.ad
.RS 21n
.rt
Acting as a gateway.
.RE

.sp
.ne 2
.mk
.na
.B not-forwarding(2)
.ad
.RS 21n
.rt
Not acting as a gateway.
.RE

.sp
.LP
The IPv6 and ICMPv6 protocol layers maintain per-interface statistics. If
the
.B -a
option is specified with the
.B -s
option, then the
per-interface statistics as well as the total sums are displayed. Otherwise,
just the sum of the statistics are shown.
.sp
.LP
For the second, third, and fourth forms of the command, you must specify at
least
.BR -g ,
.BR -p ,
or
.BR -s .
You can specify any combination of
these options. You can also specify
.B -m
(the fifth form) with any set
of the
.BR -g ,
.BR -p ,
and
.B -s
options. If you specify more than
one of these options,
.B netstat
displays the information for each one of
them.
.SS "Interface Status (Sixth Form)"
.sp
.LP
The interface status display lists information for all current interfaces,
one interface per line. If an interface is specified using the
.B -I
option, it displays information for only the specified interface.
.sp
.LP
The list consists of the interface name,
.B mtu
(maximum transmission
unit, or maximum packet size)(see
.BR ifconfig (1M)),
the network to which
the interface is attached, addresses for each interface, and counter
associated with the interface. The counters show the number of input
packets, input errors, output packets, output errors, and collisions,
respectively. For Point-to-Point interfaces, the Net/Dest field is the name
or address on the other side of the link.
.sp
.LP
If the
.B -a
option is specified with either the
.B -i
option or the
.B -I
option, then the output includes names of the physical
interface(s), counts for input packets and output packets for each logical
interface, plus additional information.
.sp
.LP
If the
.B -n
option is specified, the list displays the IP address
instead of the interface name.
.sp
.LP
If an optional
.I interval
is specified, the output will be continually
displayed in
.I interval
seconds until interrupted by the user or until
.I count
is reached. See OPERANDS.
.sp
.LP
The physical interface is specified using the
.B -I
option. When used
with the
.I interval
operand, output for the
.B -I
option has the
following format:
.sp
.in +2
.nf
input    eri0          output        input          (Total)   output
packets  errs  packets errs  colls   packets  errs  packets  errs   colls
227681   0     659471  1     502     261331   0     99597    1      502
10       0     0       0     0       10       0     0        0      0
8        0     0       0     0       8        0     0        0      0
10       0     2       0     0       10       0     2        0      0
.fi
.in -2
.sp

.sp
.LP
If the input interface is not specified, the first interface of address
family
.B inet
or
.B inet6
will be displayed.
.SS "Routing Table (Seventh Form)"
.sp
.LP
The routing table display lists the available routes and the status of
each. Each route consists of a destination host or network, and a gateway to
use in forwarding packets. The
.I flags
column shows the status of the
route. These flags are as follows:
.sp
.ne 2
.mk
.na
.B U
.ad
.RS 5n
.rt
Indicates route is
.BR up .
.RE

.sp
.ne 2
.mk
.na
.B G
.ad
.RS 5n
.rt
Route is to a gateway.
.RE

.sp
.ne 2
.mk
.na
.B H
.ad
.RS 5n
.rt
Route is to a host and not a network.
.RE

.sp
.ne 2
.mk
.na
.B M
.ad
.RS 5n
.rt
Redundant route established with the
.B -multirt
option.
.RE

.sp
.ne 2
.mk
.na
.B S
.ad
.RS 5n
.rt
Route was established using the
.B -setsrc
option.
.RE

.sp
.ne 2
.mk
.na
.B D
.ad
.RS 5n
.rt
Route was created dynamically by a redirect.
.RE

.sp
.LP
If the
.B -a
option is specified, there will be routing entries with the
following flags:
.sp
.ne 2
.mk
.na
.B A
.ad
.RS 5n
.rt
Combined routing and address resolution entries.
.RE

.sp
.ne 2
.mk
.na
.B B
.ad
.RS 5n
.rt
Broadcast addresses.
.RE

.sp
.ne 2
.mk
.na
.B L
.ad
.RS 5n
.rt
Local addresses for the host.
.RE

.sp
.LP
Interface routes are created for each interface attached to the local host;
the gateway field for such entries shows the address of the outgoing
interface.
.sp
.LP
The
.B use
column displays the number of packets sent using a combined
.RB "routing and address resolution (" A ") or a broadcast (" B )
route. For
a local
.RB ( L )
route, this count is the number of packets received, and
for all other routes it is the number of times the routing entry has been
used to create a new combined route and address resolution entry.
.sp
.LP
The
.I interface
entry indicates the network interface utilized for the
route.
.SS "Multicast Routing Tables (Eighth Form)"
.sp
.LP
The multicast routing table consists of the virtual interface table and the
actual routing table.
.SS "DHCP Interface Information (Ninth Form)"
.sp
.LP
The
.B DHCP
interface information consists of the interface name, its
current state, lease information, packet counts, and a list of flags.
.sp
.LP
The states correlate with the specifications set forth in
.IR "RFC 2131" .
.sp
.LP
Lease information includes:
.RS +4
.TP
.ie t \(bu
.el o
when the lease began;
.RE
.RS +4
.TP
.ie t \(bu
.el o
when lease renewal will begin; and
.RE
.RS +4
.TP
.ie t \(bu
.el o
when the lease will expire.
.RE
.sp
.LP
The flags currently defined include:
.sp
.ne 2
.mk
.na
.B BOOTP
.ad
.RS 11n
.rt
The interface has a lease obtained through
.B BOOTP
(IPv4 only).
.RE

.sp
.ne 2
.mk
.na
.B BUSY
.ad
.RS 11n
.rt
The interface is busy with a
.B DHCP
transaction.
.RE

.sp
.ne 2
.mk
.na
.B PRIMARY
.ad
.RS 11n
.rt
The interface is the primary interface. See
.BR dhcpinfo (1)
and
.BR ifconfig (1M).
.RE

.sp
.ne 2
.mk
.na
.B FAILED
.ad
.RS 11n
.rt
The interface is in failure state and must be manually restarted.
.RE

.sp
.LP
Packet counts are maintained for the number of packets sent, the number of
packets received, and the number of lease offers declined by the
.B DHCP
client. All three counters are initialized to zero and then incremented
while obtaining a lease. The counters are reset when the period of lease
renewal begins for the interface. Thus, the counters represent either the
number of packets sent, received, and declined while obtaining the current
lease, or the number of packets sent, received, and declined while
attempting to obtain a future lease.
.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/default/inet_type
.ad
.RS 26n
.rt
.B DEFAULT_IP
setting
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.sp
.LP
.BR arp (1M),
.BR dhcpinfo (1),
.BR dhcpagent (1M),
.BR ifconfig (1M),
.BR iostat (1M),
.BR kstat (1M),
.BR mibiisa (1M),
.BR savecore (1M),
.BR vmstat (1M),
.BR hosts (4),
.BR inet_type (4),
.BR networks (4),
.BR protocols (4),
.BR services (4),
.BR attributes (5),
.BR dhcp (5),
.BR kstat (7D),
.BR inet (7P),
.BR inet6 (7P)
.sp
.LP
Droms, R.,
.IR "RFC 2131, Dynamic Host Configuration Protocol" ,
Network
Working Group, March 1997.
.sp
.LP
Droms, R. \fIRFC 3315, Dynamic Host Configuration Protocol for IPv6 (DHCPv6)\fR. Cisco Systems. July 2003.
.SH NOTES
.sp
.LP
When displaying interface information,
.B netstat
honors the
.B DEFAULT_IP
setting in
.BR /etc/default/inet_type .
If it is set to
.BR IP_VERSION4 ,
then
.B netstat
will omit information relating to IPv6
interfaces, statistics, connections, routes and the like.
.sp
.LP
However, you can override the
.B DEFAULT_IP
setting in
.B /etc/default/inet_type
on the command-line. For example, if you have
used the command-line to explicitly request IPv6 information by using the
.B inet6
address family or one of the IPv6 protocols, it will override
the
.B DEFAULT_IP
setting.
.sp
.LP
If you need to examine network status information following a kernel crash,
use the
.BR mdb (1)
utility on the
.BR savecore "(1M) output."
.sp
.LP
The
.B netstat
utility obtains TCP statistics from the system by opening
.B /dev/tcp
and issuing queries. Because of this,
.B netstat
might
display an extra, unused connection in
.B IDLE
state when reporting
connection status.
.sp
.LP
Previous versions of
.B netstat
had undocumented methods for reporting
kernel statistics published using the
.BR kstat (7D)
facility. This
functionality has been removed. Use
.BR kstat (1M)
instead.
.sp
.LP
.B netstat
restricts its output to information that is relevant to the
zone in which
.B netstat
runs. (This is true for both shared-IP and
exclusive-IP zones.)
