usr/src/man/man1m/nfsmapid.1m
'\" te
.\" Copyright (c) 2004, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH nfsmapid 1M "30 Oct 2007" "SunOS 5.11" "System Administration Commands"
.SH NAME
nfsmapid \- NFS user and group id mapping daemon
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/nfs/nfsmapid\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B nfsmapid
daemon maps to and from NFS version 4
.B owner
and
.B owner_group
identification attributes and local
.B UID
and
.B GID
numbers used by both the NFS version 4 client and server.
.sp
.LP
.B nfsmapid
uses the
.B passwd
and
.B group
entries in the
.B /etc/nsswitch.conf
file to direct how it performs the mappings.
.sp
.LP
The
.B nfsmapid
daemon has no external, customer-accessible interfaces.
You can, however, administratively configure
.B nfsmapid
in one of the
following ways:
.RS +4
.TP
.ie t \(bu
.el o
Specify the
.B NFSMAPID_DOMAIN
parameter in
.BR nfs (4)
.RE
.RS +4
.TP
.ie t \(bu
.el o
Specify the
.B _nfsv4idmapdomain
DNS resource record.
.RE
.sp
.LP
Please refer to the\fR  for further details.
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWnfscu
.TE

.SH SEE ALSO
.sp
.LP
.BR svcs (1),
.BR automountd (1M),
.BR groupdel (1M),
.BR groupmod (1M),
.BR mount_nfs (1M),
.BR passmgmt (1M),
.BR svcadm (1M),
.BR share_nfs (1M),
.BR userdel (1M),
.BR usermod (1M),
.BR nfs (4),
.BR attributes (5),
.BR smf (5)
.sp
.LP
\fR
.SH NOTES
.sp
.LP
The
.B nfsmapid
service is managed by the service management facility,
.BR smf (5),
under the service identifier:
.sp
.in +2
.nf
svc:/network/nfs/mapid
.fi
.in -2
.sp

.sp
.LP
Administrative actions on this service, such as enabling, disabling, or
requesting restart, can be performed using
.BR svcadm (1M).
The service's
status can be queried using the
.BR svcs (1)
command.
.sp
.LP
If it is disabled, it will be enabled by
.BR mount_nfs (1M),
.BR share_nfs (1M),
and
.BR automountd "(1M), unless  its"
.B application/auto_enable
property is set to
.BR false .
.sp
.LP
.B nfsmapid
caches a user's UID and GID. If a user subsequently changes
a UID or GID, using one of the utilities listed below, the
.B nfsmapid
cache becomes stale. At this point, any NFS operation that gets or set
attributes will result in the exchange of this stale information. To resolve
this situation, restart
.BR nfsmapid ,
as follows:
.sp
.in +2
.nf
# \fBsvcadm restart svc:/network/nfs/mapid:default\fR
.fi
.in -2
.sp

.sp
.LP
The utilities that allow you to change UID and GID are:
.RS +4
.TP
.ie t \(bu
.el o
.BR usermod (1M)
.RE
.RS +4
.TP
.ie t \(bu
.el o
.BR userdel (1M)
.RE
.RS +4
.TP
.ie t \(bu
.el o
.BR groupmod (1M)
.RE
.RS +4
.TP
.ie t \(bu
.el o
.BR groupdel (1M)
.RE
.RS +4
.TP
.ie t \(bu
.el o
.BR passmgmt (1M)
.RE
.sp
.LP
The
.B nfsmapid
daemon might not exist in a future release of Solaris.
