usr/src/man/man1m/nfsstat.1m
'\" te
.\" Copyright (c) 2007, Sun Microsystems, Inc. All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH nfsstat 1M "16 Jun 2009" "SunOS 5.11" "System Administration Commands"
.SH NAME
nfsstat \- NFS statistics
.SH SYNOPSIS
.LP
.nf
\fBnfsstat\fR [\fB-cnrsza\fR] [\fB-T\fR u | d ] [\fB-v\fR \fIversion\fR] [\fIinterval\fR [\fIcount\fR]]
.fi

.LP
.nf
\fBnfsstat\fR \fB-m\fR [\fIpathname\fR].\|.\|.
.fi

.SH DESCRIPTION
.sp
.LP
\fBnfsstat\fR displays statistical information about the \fBNFS\fR and
\fBRPC\fR (Remote Procedure Call), interfaces to the kernel. It can also be
used to reinitialize this information. If no options are given the default
is as follows:
.sp
.LP
\fBnfsstat -csnra\fR
.sp
.LP
The default displays everything, but reinitializes nothing.
.SH OPTIONS
.sp
.ne 2
.mk
.na
.B -a
.ad
.sp .6
.RS 4n
Display
.B NFS_ACL
information.
.RE

.sp
.ne 2
.mk
.na
.B -c
.ad
.sp .6
.RS 4n
Display client information. Only the client side
.BR NFS ,
.BR RPC ,
and
\fBNFS_ACL\fR information is printed. Can be combined with the
.BR -n ,
.BR -r ,
and
.B -a
options to print client side
.BR NFS ,
.BR RPC ,
and
.B NFS_ACL
information only.
.RE

.sp
.ne 2
.mk
.na
\fB-m\fR [\fIpathname.\|.\|.\fR]\fR
.ad
.sp .6
.RS 4n
Display statistics for each
.B NFS
mounted file system. If
\fIpathname\fR is not specified, displays statistics for all NFS mounted
file systems. If
.I pathname
is specified, displays statistics for the
NFS mounted file systems indicated by
.IR pathname .
.sp
This includes the server name and address, mount flags, current read and
write sizes, the retransmission count, the attribute cache timeout values,
failover information, and the timers used for dynamic retransmission. The
dynamic retransmission timers are displayed only where dynamic
retransmission is in use. By default,
.B NFS
mounts over the
.BR TCP
protocols and
.B NFS
Version 3 mounts over either
.B TCP
or
.BR UDP
do not use dynamic retransmission.
.sp
If you specify the
.B -m
option, this is the only option that
\fBnfsstat\fR uses. If you specify other options with
.BR -m ,
you receive
an error message alerting that the
.B -m
flag cannot be combined with
other options.
.RE

.sp
.ne 2
.mk
.na
.B -n
.ad
.sp .6
.RS 4n
Display
.B NFS
information.
.B NFS
information for both the client
and server side are printed. Can be combined with the
.B -c
and
.BR -s
options to print client or server
.B NFS
information only.
.RE

.sp
.ne 2
.mk
.na
.B -r
.ad
.sp .6
.RS 4n
Display
.B RPC
information.
.RE

.sp
.ne 2
.mk
.na
.B -s
.ad
.sp .6
.RS 4n
Display server information.
.RE

.sp
.ne 2
.mk
.na
\fB-T u\fR | \fBd\fR
.ad
.sp .6
.RS 4n
Display a time stamp.
.sp
Specify
.B u
for a printed representation of the internal representation
of time. See
.BR time (2).
Specify
.B d
for standard date format. See
.BR date (1).
.RE

.sp
.ne 2
.mk
.na
\fB-v\fR \fIversion\fR
.ad
.sp .6
.RS 4n
Specify which NFS version for which to print statistics. When followed by
the optional \fIversion\fR argument, (\fB2\fR|\fB3\fR|\fB4\fR), specifies
statistics for that version. By default, prints statistics for all
versions.
.RE

.sp
.ne 2
.mk
.na
.B -z
.ad
.sp .6
.RS 4n
Zero (reinitialize) statistics. This option is for use by the super user
only, and can be combined with any of the above options to zero particular
sets of statistics after printing them.
.RE

.SH OPERANDS
.sp
.LP
The following operands are supported:
.sp
.ne 2
.mk
.na
.I count
.ad
.sp .6
.RS 4n
Display only count reports
.RE

.sp
.ne 2
.mk
.na
.I interval
.ad
.sp .6
.RS 4n
Report once each interval seconds.
.RE

.sp
.ne 2
.mk
.na
.I pathname
.ad
.sp .6
.RS 4n
Specify the pathname of a file in an NFS mounted file system for which
statistics are to be displayed.
.RE

.SH DISPLAYS
.sp
.LP
The server
.B RPC
display includes the following fields:
.sp
.ne 2
.mk
.na
.B badcalls
.ad
.sp .6
.RS 4n
The total number of calls rejected by the
.B RPC
layer (the sum of
\fBbadlen\fR and \fBxdrcall\fR as defined below).
.RE

.sp
.ne 2
.mk
.na
.B badlen
.ad
.sp .6
.RS 4n
The number of
.B RPC
calls with a length shorter than a minimum-sized
\fBRPC\fR call.
.RE

.sp
.ne 2
.mk
.na
.B calls
.ad
.sp .6
.RS 4n
The total number of
.B RPC
calls received.
.RE

.sp
.ne 2
.mk
.na
.B dupchecks
.ad
.sp .6
.RS 4n
The number of
.B RPC
calls that looked up in the duplicate request
cache.
.RE

.sp
.ne 2
.mk
.na
.B dupreqs
.ad
.sp .6
.RS 4n
The number of
.B RPC
calls that were found to be duplicates.
.RE

.sp
.ne 2
.mk
.na
.B nullrecv
.ad
.sp .6
.RS 4n
The number of times an
.B RPC
call was not available when it was thought
to be received.
.RE

.sp
.ne 2
.mk
.na
.B xdrcall
.ad
.sp .6
.RS 4n
The number of
.B RPC
calls whose header could not be
.BR XDR
decoded.
.RE

.sp
.LP
The server
.B NFS
display shows the number of
.B NFS
calls received
(\fBcalls\fR) and rejected
.RB ( badcalls ),
and the counts and percentages
for the various calls that were made.
.sp
.LP
The server
.B NFS_ACL
display shows the counts and percentages for the
various calls that were made.
.sp
.LP
The client
.B RPC
display includes the following fields:
.sp
.ne 2
.mk
.na
.B calls
.ad
.sp .6
.RS 4n
The total number of
.B RPC
calls made.
.RE

.sp
.ne 2
.mk
.na
.B badcalls
.ad
.sp .6
.RS 4n
The total number of calls rejected by the
.B RPC
layer.
.RE

.sp
.ne 2
.mk
.na
\fBbadverfs\fR
.ad
.sp .6
.RS 4n
The number of times the call failed due to a bad verifier in the
response.
.RE

.sp
.ne 2
.mk
.na
.B badxids
.ad
.sp .6
.RS 4n
The number of times a reply from a server was received which did not
correspond to any outstanding call.
.RE

.sp
.ne 2
.mk
.na
.B cantconn
.ad
.sp .6
.RS 4n
The number of times the call failed due to a failure to make a connection
to the server.
.RE

.sp
.ne 2
.mk
.na
.B cantsend
.ad
.sp .6
.RS 4n
The number of times a client was unable to send an
.B RPC
request over a
connectionless transport when it tried to do so.
.RE

.sp
.ne 2
.mk
.na
.B interrupts
.ad
.sp .6
.RS 4n
The number of times the call was interrupted by a signal before
completing.
.RE

.sp
.ne 2
.mk
.na
.B newcreds
.ad
.sp .6
.RS 4n
The number of times authentication information had to be refreshed.
.RE

.sp
.ne 2
.mk
.na
.B nomem
.ad
.sp .6
.RS 4n
The number of times the call failed due to a failure to allocate memory.
.RE

.sp
.ne 2
.mk
.na
.B retrans
.ad
.sp .6
.RS 4n
The number of times a call had to be retransmitted due to a timeout while
waiting for a reply from the server. Applicable only to
.B RPC
over
connection-less transports.
.RE

.sp
.ne 2
.mk
.na
.B timeouts
.ad
.sp .6
.RS 4n
The number of times a call timed out while waiting for a reply from the
server.
.RE

.sp
.ne 2
.mk
.na
.B timers
.ad
.sp .6
.RS 4n
The number of times the calculated time-out value was greater than or equal
to the minimum specified time-out value for a call.
.RE

.sp
.LP
The client
.B NFS
display shows the number of calls sent and rejected,
as well as the number of times a
.B CLIENT
handle was received
(\fBclgets\fR), the number of times the \fBCLIENT\fR handle cache had no
unused entries
.RB ( cltoomany ),
as well as a count of the various calls
and their respective percentages.
.sp
.LP
The client
.B NFS_ACL
display shows the counts and percentages for the
various calls that were made.
.sp
.LP
The
.B -m
option includes information about mount flags set by mount
options, mount flags internal to the system, and other mount information.
See
.BR mount_nfs (1M).
.sp
.LP
The following mount flags are set by mount options:
.sp
.ne 2
.mk
.na
.B grpid
.ad
.sp .6
.RS 4n
System V group id inheritance.
.RE

.sp
.ne 2
.mk
.na
.B hard
.ad
.sp .6
.RS 4n
Hard mount.
.RE

.sp
.ne 2
.mk
.na
.B intr
.ad
.sp .6
.RS 4n
Interrupts allowed on hard mount.
.RE

.sp
.ne 2
.mk
.na
.B llock
.ad
.sp .6
.RS 4n
Local locking being used (no lock manager).
.RE

.sp
.ne 2
.mk
.na
.B noac
.ad
.sp .6
.RS 4n
Client is not caching attributes.
.RE

.sp
.ne 2
.mk
.na
.B nointr
.ad
.sp .6
.RS 4n
No interrupts allowed on hard mount.
.RE

.sp
.ne 2
.mk
.na
.B nocto
.ad
.sp .6
.RS 4n
No close-to-open consistency.
.RE

.sp
.ne 2
.mk
.na
.B retrans
.ad
.sp .6
.RS 4n
\fBNFS\fR retransmissions.
.RE

.sp
.ne 2
.mk
.na
.B rpctimesync
.ad
.sp .6
.RS 4n
\fBRPC\fR time sync.
.RE

.sp
.ne 2
.mk
.na
.B rsize
.ad
.sp .6
.RS 4n
Read buffer size in bytes.
.RE

.sp
.ne 2
.mk
.na
.B sec
.ad
.sp .6
.RS 4n
\fBsec\fR has one of the following values:
.sp
.ne 2
.mk
.na
.B dh
.ad
.sp .6
.RS 4n
\fBdes\fR-style authentication (encrypted timestamps).
.RE

.sp
.ne 2
.mk
.na
.B krb5
.ad
.sp .6
.RS 4n
\fBkerberos v5\fR-style authentication.
.RE

.sp
.ne 2
.mk
.na
.B krb5i
.ad
.sp .6
.RS 4n
\fBkerberos v5\fR-style authentication with integrity.
.RE

.sp
.ne 2
.mk
.na
.B krb5p
.ad
.sp .6
.RS 4n
\fBkerberos v5\fR-style authentication with privacy.
.RE

.sp
.ne 2
.mk
.na
.B none
.ad
.sp .6
.RS 4n
No authentication.
.RE

.sp
.ne 2
.mk
.na
.B short
.ad
.sp .6
.RS 4n
Short hand UNIX-style authentication.
.RE

.sp
.ne 2
.mk
.na
.B sys
.ad
.sp .6
.RS 4n
UNIX-style authentication (UID, GID).
.RE

.RE

.sp
.ne 2
.mk
.na
\fBsoft\fR
.ad
.sp .6
.RS 4n
Soft mount.
.RE

.sp
.ne 2
.mk
.na
.B timeo
.ad
.sp .6
.RS 4n
Initial
.B NFS
timeout, in tenths of a second.
.RE

.sp
.ne 2
.mk
.na
.B wsize
.ad
.sp .6
.RS 4n
Write buffer size in bytes.
.RE

.sp
.LP
The following mount flags are internal to the system:
.sp
.ne 2
.mk
.na
.B acl
.ad
.sp .6
.RS 4n
Server supports
.BR NFS_ACL .
.RE

.sp
.ne 2
.mk
.na
.B down
.ad
.sp .6
.RS 4n
Server is down.
.RE

.sp
.ne 2
.mk
.na
.B dynamic
.ad
.sp .6
.RS 4n
Dynamic transfer size adjustment.
.RE

.sp
.ne 2
.mk
.na
.B link
.ad
.sp .6
.RS 4n
Server supports links.
.RE

.sp
.ne 2
.mk
.na
.B mirrormount
.ad
.sp .6
.RS 4n
Mounted automatically by means of the
.B mirrormount
mechanism.
.RE

.sp
.ne 2
.mk
.na
.B printed
.ad
.sp .6
.RS 4n
"Not responding" message printed.
.RE

.sp
.ne 2
.mk
.na
.B readdir
.ad
.sp .6
.RS 4n
Use
.B readdir
instead of
.BR readdirplus .
.RE

.sp
.ne 2
.mk
.na
.B symlink
.ad
.sp .6
.RS 4n
Server supports symbolic links.
.RE

.sp
.LP
The following flags relate to additional mount information:
.sp
.ne 2
.mk
.na
.B proto
.ad
.sp .6
.RS 4n
Protocol.
.RE

.sp
.ne 2
.mk
.na
.B vers
.ad
.sp .6
.RS 4n
\fBNFS\fR version.
.RE

.sp
.LP
The
.B -m
option also provides attribute cache timeout values. The
following fields in
.B -m
ouput provide timeout values for attribute
cache:
.sp
.ne 2
.mk
.na
.B acdirmax
.ad
.sp .6
.RS 4n
Maximum seconds to hold cached directory attributes.
.RE

.sp
.ne 2
.mk
.na
.B acdirmin
.ad
.sp .6
.RS 4n
Minimum seconds to hold cached directory attributes.
.RE

.sp
.ne 2
.mk
.na
.B acregmax
.ad
.sp .6
.RS 4n
Maximum seconds to hold cached file attributes.
.RE

.sp
.ne 2
.mk
.na
.B acregmin
.ad
.sp .6
.RS 4n
Minimum seconds to hold cached file attributes.
.RE

.sp
.LP
The following fields in
.B -m
output provide failover information:
.sp
.ne 2
.mk
.na
.B currserver
.ad
.sp .6
.RS 4n
Which server is currently providing
.B NFS
service. See the\fR for
additional details.
.RE

.sp
.ne 2
.mk
.na
\fBfailover\fR
.ad
.sp .6
.RS 4n
How many times a new server has been selected.
.RE

.sp
.ne 2
.mk
.na
.B noresponse
.ad
.sp .6
.RS 4n
How many times servers have failed to respond.
.RE

.sp
.ne 2
.mk
.na
.B remap
.ad
.sp .6
.RS 4n
How many times files have been re-evaluated to the new server.
.RE

.sp
.LP
The fields in
.B -m
output shown below provide information on dynamic
retransmissions. These items are displayed only where dynamic retransmission
is in use.
.sp
.ne 2
.mk
.na
.B cur
.ad
.sp .6
.RS 4n
Current backed-off retransmission value, in milliseconds.
.RE

.sp
.ne 2
.mk
.na
.B dev
.ad
.sp .6
.RS 4n
Estimated deviation, in milliseconds.
.RE

.sp
.ne 2
.mk
.na
.B srtt
.ad
.sp .6
.RS 4n
The value for the smoothed round-trip time, in milliseconds.
.RE

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.sp .6
.RS 4n
Successful completion.
.RE

.sp
.ne 2
.mk
.na
.B >0
.ad
.sp .6
.RS 4n
An error occurred.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWnfscu
.TE

.SH SEE ALSO
.sp
.LP
.BR mount_nfs (1M),
.BR attributes (5)
.sp
.LP
\fR
.sp
.LP
\fR
