usr/src/man/man1m/nfsstat.1m
'\" te
.\" Copyright (c) 2007, Sun Microsystems, Inc. All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH nfsstat 1M "16 Jun 2009" "SunOS 5.11" "System Administration Commands"
.SH NAME
nfsstat \- NFS statistics
.SH SYNOPSIS
.LP
.nf
\fBnfsstat\fR [\fB-cnrsza\fR] [\fB-T\fR u | d ] [\fB-v\fR \fIversion\fR] [\fIinterval\fR [\fIcount\fR]]
.fi

.LP
.nf
\fBnfsstat\fR \fB-m\fR [\fIpathname\fR]...
.fi

.SH DESCRIPTION
.sp
.LP
\fBnfsstat\fR displays statistical information about the \fBNFS\fR and
\fBRPC\fR (Remote Procedure Call), interfaces to the kernel. It can also be
used to reinitialize this information. If no options are given the default
is as follows:
.sp
.LP
\fBnfsstat\fR \fB-csnra\fR
.sp
.LP
The default displays everything, but reinitializes nothing.
.SH OPTIONS
.sp
.ne 2
.mk
.na
\fB-a\fR
.ad
.sp .6
.RS 4n
Display \fBNFS_ACL\fR information.
.RE

.sp
.ne 2
.mk
.na
\fB-c\fR
.ad
.sp .6
.RS 4n
Display client information. Only the client side \fBNFS\fR, \fBRPC\fR, and
\fBNFS_ACL\fR information is printed. Can be combined with the \fB-n\fR,
\fB-r\fR, and \fB-a\fR options to print client side \fBNFS\fR, \fBRPC\fR,
and \fBNFS_ACL\fR information only.
.RE

.sp
.ne 2
.mk
.na
\fB-m\fR [\fIpathname...\fR]\fR
.ad
.sp .6
.RS 4n
Display statistics for each \fBNFS\fR mounted file system. If
\fIpathname\fR is not specified, displays statistics for all NFS mounted
file systems. If \fIpathname\fR is specified, displays statistics for the
NFS mounted file systems indicated by \fIpathname\fR.
.sp
This includes the server name and address, mount flags, current read and
write sizes, the retransmission count, the attribute cache timeout values,
failover information, and the timers used for dynamic retransmission. The
dynamic retransmission timers are displayed only where dynamic
retransmission is in use. By default, \fBNFS\fR mounts over the \fBTCP\fR
protocols and \fBNFS\fR Version 3 mounts over either \fBTCP\fR or \fBUDP\fR
do not use dynamic retransmission.
.sp
If you specify the \fB-m\fR option, this is the only option that
\fBnfsstat\fR uses. If you specify other options with \fB-m\fR, you receive
an error message alerting that the \fB-m\fR flag cannot be combined with
other options.
.RE

.sp
.ne 2
.mk
.na
\fB-n\fR
.ad
.sp .6
.RS 4n
Display \fBNFS\fR information. \fBNFS\fR information for both the client
and server side are printed. Can be combined with the \fB-c\fR and \fB-s\fR
options to print client or server \fBNFS\fR information only.
.RE

.sp
.ne 2
.mk
.na
\fB-r\fR
.ad
.sp .6
.RS 4n
Display \fBRPC\fR information.
.RE

.sp
.ne 2
.mk
.na
\fB-s\fR
.ad
.sp .6
.RS 4n
Display server information.
.RE

.sp
.ne 2
.mk
.na
\fB-T\fR \fBu\fR | \fBd\fR
.ad
.sp .6
.RS 4n
Display a time stamp.
.sp
Specify \fBu\fR for a printed representation of the internal representation
of time. See \fBtime\fR(2). Specify \fBd\fR for standard date format. See
\fBdate\fR(1).
.RE

.sp
.ne 2
.mk
.na
\fB-v\fR \fIversion\fR
.ad
.sp .6
.RS 4n
Specify which NFS version for which to print statistics. When followed by
the optional \fIversion\fR argument, (\fB2\fR|\fB3\fR|\fB4\fR), specifies
statistics for that version. By default, prints statistics for all
versions.
.RE

.sp
.ne 2
.mk
.na
\fB-z\fR
.ad
.sp .6
.RS 4n
Zero (reinitialize) statistics. This option is for use by the super user
only, and can be combined with any of the above options to zero particular
sets of statistics after printing them.
.RE

.SH OPERANDS
.sp
.LP
The following operands are supported:
.sp
.ne 2
.mk
.na
\fIcount\fR
.ad
.sp .6
.RS 4n
Display only count reports
.RE

.sp
.ne 2
.mk
.na
\fIinterval\fR
.ad
.sp .6
.RS 4n
Report once each interval seconds.
.RE

.sp
.ne 2
.mk
.na
\fIpathname\fR
.ad
.sp .6
.RS 4n
Specify the pathname of a file in an NFS mounted file system for which
statistics are to be displayed.
.RE

.SH DISPLAYS
.sp
.LP
The server \fBRPC\fR display includes the following fields:
.sp
.ne 2
.mk
.na
\fBbadcalls\fR
.ad
.sp .6
.RS 4n
The total number of calls rejected by the \fBRPC\fR layer (the sum of
\fBbadlen\fR and \fBxdrcall\fR as defined below).
.RE

.sp
.ne 2
.mk
.na
\fBbadlen\fR
.ad
.sp .6
.RS 4n
The number of \fBRPC\fR calls with a length shorter than a minimum-sized
\fBRPC\fR call.
.RE

.sp
.ne 2
.mk
.na
\fBcalls\fR
.ad
.sp .6
.RS 4n
The total number of \fBRPC\fR calls received.
.RE

.sp
.ne 2
.mk
.na
\fBdupchecks\fR
.ad
.sp .6
.RS 4n
The number of \fBRPC\fR calls that looked up in the duplicate request
cache.
.RE

.sp
.ne 2
.mk
.na
\fBdupreqs\fR
.ad
.sp .6
.RS 4n
The number of \fBRPC\fR calls that were found to be duplicates.
.RE

.sp
.ne 2
.mk
.na
\fBnullrecv\fR
.ad
.sp .6
.RS 4n
The number of times an \fBRPC\fR call was not available when it was thought
to be received.
.RE

.sp
.ne 2
.mk
.na
\fBxdrcall\fR
.ad
.sp .6
.RS 4n
The number of \fBRPC\fR calls whose header could not be \fBXDR\fR
decoded.
.RE

.sp
.LP
The server \fBNFS\fR display shows the number of \fBNFS\fR calls received
(\fBcalls\fR) and rejected (\fBbadcalls\fR), and the counts and percentages
for the various calls that were made.
.sp
.LP
The server \fBNFS_ACL\fR display shows the counts and percentages for the
various calls that were made.
.sp
.LP
The client \fBRPC\fR display includes the following fields:
.sp
.ne 2
.mk
.na
\fBcalls\fR
.ad
.sp .6
.RS 4n
The total number of \fBRPC\fR calls made.
.RE

.sp
.ne 2
.mk
.na
\fBbadcalls\fR
.ad
.sp .6
.RS 4n
The total number of calls rejected by the \fBRPC\fR layer.
.RE

.sp
.ne 2
.mk
.na
\fBbadverfs\fR
.ad
.sp .6
.RS 4n
The number of times the call failed due to a bad verifier in the
response.
.RE

.sp
.ne 2
.mk
.na
\fBbadxids\fR
.ad
.sp .6
.RS 4n
The number of times a reply from a server was received which did not
correspond to any outstanding call.
.RE

.sp
.ne 2
.mk
.na
\fBcantconn\fR
.ad
.sp .6
.RS 4n
The number of times the call failed due to a failure to make a connection
to the server.
.RE

.sp
.ne 2
.mk
.na
\fBcantsend\fR
.ad
.sp .6
.RS 4n
The number of times a client was unable to send an \fBRPC\fR request over a
connectionless transport when it tried to do so.
.RE

.sp
.ne 2
.mk
.na
\fBinterrupts\fR
.ad
.sp .6
.RS 4n
The number of times the call was interrupted by a signal before
completing.
.RE

.sp
.ne 2
.mk
.na
\fBnewcreds\fR
.ad
.sp .6
.RS 4n
The number of times authentication information had to be refreshed.
.RE

.sp
.ne 2
.mk
.na
\fBnomem\fR
.ad
.sp .6
.RS 4n
The number of times the call failed due to a failure to allocate memory.
.RE

.sp
.ne 2
.mk
.na
\fBretrans\fR
.ad
.sp .6
.RS 4n
The number of times a call had to be retransmitted due to a timeout while
waiting for a reply from the server. Applicable only to \fBRPC\fR over
connection-less transports.
.RE

.sp
.ne 2
.mk
.na
\fBtimeouts\fR
.ad
.sp .6
.RS 4n
The number of times a call timed out while waiting for a reply from the
server.
.RE

.sp
.ne 2
.mk
.na
\fBtimers\fR
.ad
.sp .6
.RS 4n
The number of times the calculated time-out value was greater than or equal
to the minimum specified time-out value for a call.
.RE

.sp
.LP
The client \fBNFS\fR display shows the number of calls sent and rejected,
as well as the number of times a \fBCLIENT\fR handle was received
(\fBclgets\fR), the number of times the \fBCLIENT\fR handle cache had no
unused entries (\fBcltoomany\fR), as well as a count of the various calls
and their respective percentages.
.sp
.LP
The client \fBNFS_ACL\fR display shows the counts and percentages for the
various calls that were made.
.sp
.LP
The \fB-m\fR option includes information about mount flags set by mount
options, mount flags internal to the system, and other mount information.
See \fBmount_nfs\fR(1M).
.sp
.LP
The following mount flags are set by mount options:
.sp
.ne 2
.mk
.na
\fBgrpid\fR
.ad
.sp .6
.RS 4n
System V group id inheritance.
.RE

.sp
.ne 2
.mk
.na
\fBhard\fR
.ad
.sp .6
.RS 4n
Hard mount.
.RE

.sp
.ne 2
.mk
.na
\fBintr\fR
.ad
.sp .6
.RS 4n
Interrupts allowed on hard mount.
.RE

.sp
.ne 2
.mk
.na
\fBllock\fR
.ad
.sp .6
.RS 4n
Local locking being used (no lock manager).
.RE

.sp
.ne 2
.mk
.na
\fBnoac\fR
.ad
.sp .6
.RS 4n
Client is not caching attributes.
.RE

.sp
.ne 2
.mk
.na
\fBnointr\fR
.ad
.sp .6
.RS 4n
No interrupts allowed on hard mount.
.RE

.sp
.ne 2
.mk
.na
\fBnocto\fR
.ad
.sp .6
.RS 4n
No close-to-open consistency.
.RE

.sp
.ne 2
.mk
.na
\fBretrans\fR
.ad
.sp .6
.RS 4n
\fBNFS\fR retransmissions.
.RE

.sp
.ne 2
.mk
.na
\fBrpctimesync\fR
.ad
.sp .6
.RS 4n
\fBRPC\fR time sync.
.RE

.sp
.ne 2
.mk
.na
\fBrsize\fR
.ad
.sp .6
.RS 4n
Read buffer size in bytes.
.RE

.sp
.ne 2
.mk
.na
\fBsec\fR
.ad
.sp .6
.RS 4n
\fBsec\fR has one of the following values:
.sp
.ne 2
.mk
.na
\fBdh\fR
.ad
.sp .6
.RS 4n
\fBdes\fR-style authentication (encrypted timestamps).
.RE

.sp
.ne 2
.mk
.na
\fBkrb5\fR
.ad
.sp .6
.RS 4n
\fBkerberos v5\fR-style authentication.
.RE

.sp
.ne 2
.mk
.na
\fBkrb5i\fR
.ad
.sp .6
.RS 4n
\fBkerberos v5\fR-style authentication with integrity.
.RE

.sp
.ne 2
.mk
.na
\fBkrb5p\fR
.ad
.sp .6
.RS 4n
\fBkerberos v5\fR-style authentication with privacy.
.RE

.sp
.ne 2
.mk
.na
\fBnone\fR
.ad
.sp .6
.RS 4n
No authentication.
.RE

.sp
.ne 2
.mk
.na
\fBshort\fR
.ad
.sp .6
.RS 4n
Short hand UNIX-style authentication.
.RE

.sp
.ne 2
.mk
.na
\fBsys\fR
.ad
.sp .6
.RS 4n
UNIX-style authentication (UID, GID).
.RE

.RE

.sp
.ne 2
.mk
.na
\fBsoft\fR
.ad
.sp .6
.RS 4n
Soft mount.
.RE

.sp
.ne 2
.mk
.na
\fBtimeo\fR
.ad
.sp .6
.RS 4n
Initial \fBNFS\fR timeout, in tenths of a second.
.RE

.sp
.ne 2
.mk
.na
\fBwsize\fR
.ad
.sp .6
.RS 4n
Write buffer size in bytes.
.RE

.sp
.LP
The following mount flags are internal to the system:
.sp
.ne 2
.mk
.na
\fBacl\fR
.ad
.sp .6
.RS 4n
Server supports \fBNFS_ACL\fR.
.RE

.sp
.ne 2
.mk
.na
\fBdown\fR
.ad
.sp .6
.RS 4n
Server is down.
.RE

.sp
.ne 2
.mk
.na
\fBdynamic\fR
.ad
.sp .6
.RS 4n
Dynamic transfer size adjustment.
.RE

.sp
.ne 2
.mk
.na
\fBlink\fR
.ad
.sp .6
.RS 4n
Server supports links.
.RE

.sp
.ne 2
.mk
.na
\fBmirrormount\fR
.ad
.sp .6
.RS 4n
Mounted automatically by means of the \fBmirrormount\fR mechanism.
.RE

.sp
.ne 2
.mk
.na
\fBprinted\fR
.ad
.sp .6
.RS 4n
"Not responding" message printed.
.RE

.sp
.ne 2
.mk
.na
\fBreaddir\fR
.ad
.sp .6
.RS 4n
Use \fBreaddir\fR instead of \fBreaddirplus\fR.
.RE

.sp
.ne 2
.mk
.na
\fBsymlink\fR
.ad
.sp .6
.RS 4n
Server supports symbolic links.
.RE

.sp
.LP
The following flags relate to additional mount information:
.sp
.ne 2
.mk
.na
\fBproto\fR
.ad
.sp .6
.RS 4n
Protocol.
.RE

.sp
.ne 2
.mk
.na
\fBvers\fR
.ad
.sp .6
.RS 4n
\fBNFS\fR version.
.RE

.sp
.LP
The \fB-m\fR option also provides attribute cache timeout values. The
following fields in \fB-m\fR ouput provide timeout values for attribute
cache:
.sp
.ne 2
.mk
.na
\fBacdirmax\fR
.ad
.sp .6
.RS 4n
Maximum seconds to hold cached directory attributes.
.RE

.sp
.ne 2
.mk
.na
\fBacdirmin\fR
.ad
.sp .6
.RS 4n
Minimum seconds to hold cached directory attributes.
.RE

.sp
.ne 2
.mk
.na
\fBacregmax\fR
.ad
.sp .6
.RS 4n
Maximum seconds to hold cached file attributes.
.RE

.sp
.ne 2
.mk
.na
\fBacregmin\fR
.ad
.sp .6
.RS 4n
Minimum seconds to hold cached file attributes.
.RE

.sp
.LP
The following fields in \fB-m\fR output provide failover information:
.sp
.ne 2
.mk
.na
\fBcurrserver\fR
.ad
.sp .6
.RS 4n
Which server is currently providing \fBNFS\fR service. See the \fR for
additional details.
.RE

.sp
.ne 2
.mk
.na
\fBfailover\fR
.ad
.sp .6
.RS 4n
How many times a new server has been selected.
.RE

.sp
.ne 2
.mk
.na
\fBnoresponse\fR
.ad
.sp .6
.RS 4n
How many times servers have failed to respond.
.RE

.sp
.ne 2
.mk
.na
\fBremap\fR
.ad
.sp .6
.RS 4n
How many times files have been re-evaluated to the new server.
.RE

.sp
.LP
The fields in \fB-m\fR output shown below provide information on dynamic
retransmissions. These items are displayed only where dynamic retransmission
is in use.
.sp
.ne 2
.mk
.na
\fBcur\fR
.ad
.sp .6
.RS 4n
Current backed-off retransmission value, in milliseconds.
.RE

.sp
.ne 2
.mk
.na
\fBdev\fR
.ad
.sp .6
.RS 4n
Estimated deviation, in milliseconds.
.RE

.sp
.ne 2
.mk
.na
\fBsrtt\fR
.ad
.sp .6
.RS 4n
The value for the smoothed round-trip time, in milliseconds.
.RE

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
\fB0\fR
.ad
.sp .6
.RS 4n
Successful completion.
.RE

.sp
.ne 2
.mk
.na
\fB>0\fR
.ad
.sp .6
.RS 4n
An error occurred.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWnfscu
.TE

.SH SEE ALSO
.sp
.LP
\fBmount_nfs\fR(1M), \fBattributes\fR(5)
.sp
.LP
\fR
.sp
.LP
\fR
