usr/src/man/man1m/nis_cachemgr.1m
'\" te
.\" Copyright (C) 2005, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH nis_cachemgr 1M "13 Aug 2004" "SunOS 5.11" "System Administration Commands"
.SH NAME
nis_cachemgr \- NIS+ utility to cache location information about NIS+
servers
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/nis_cachemgr\fR [\fB-i\fR] [\fB-v\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The
.B nis_cachemgr
daemon maintains a cache of NIS+ directory objects
and active servers for domains. It is responsible for locating servers for a
domain on behalf of client processes.  This improves performance because
only one process has to search for servers. The cache contains location
information necessary to contact the NIS+ servers. This includes transport
addresses, information neeeded to authenticate the server, and a time to
live field which gives a hint on how long the directory object can be
cached. The cache helps to improve the performance of the clients that are
traversing the NIS+ name space.
.B nis_cachemgr
should be running on all
the machines that are using NIS+. However, it is not required that the
.B nis_cachemgr
program be running in order for NIS+ requests to be
serviced.
.sp
.LP
The cache maintained by this program is shared by all the processes that
access NIS+ on a machine. The cache is maintained in a file that is memory
mapped by all the processes. See
.BR mmap (2).
On start up,
.B nis_cachemgr
initializes the cache from the cold start file and
preserves unexpired entries that already exist in the cache file. See
.BR nisinit (1M).
Thus, the cache survives machine reboots.
.sp
.LP
The
.B nis_cachemgr
program is normally started from a system startup
script.
.BR nisshowcache (1M)
can be used to look at the cached objects and
active servers.
.sp
.LP
The \fBnisprefadm\fR(1M) command can be used to control which NIS+ servers
the
.B nis_cachemgr
program will try to select.
.sp
.LP
The
.B nis_cachemgr
program makes NIS+ requests under the NIS+ principal
name of the host on which it runs. Before running
.BR nis_cachemgr ,
security credentials for the host should be added to the
.BR cred.org_dir
table in the host's domain using \fBnisaddcred\fR(1M). Credentials of type
.B DES
will be needed if the NIS+ service is operating at security level
2 (see
.BR rpc.nisd (1M)).
See the section, below. Additionally, a
"\fBkeylogin \fB-r\fR" should be done on the machine.
.sp
.LP
.B svc:/network/rpc/keyserv:default
is required for NIS+ operation. See
.BR NOTES .
.SH OPTIONS
.sp
.ne 2
.mk
.na
.B -i
.ad
.RS 6n
.rt
Force
.B nis_cachemgr
to ignore the previous cache file and reinitialize
the cache from just the cold start file. By default, the cache manager
initializes itself from both the cold start file and the old cache file,
thereby maintaining the entries in the cache across machine reboots.
.RE

.sp
.ne 2
.mk
.na
.B -v
.ad
.RS 6n
.rt
This flag sets verbose mode. In this mode, the
.B nis_cachemgr
program
logs not only errors and warnings, but also additional status messages. The
additional messages are logged using \fBsyslog\fR(3C) with a priority of
.BR LOG_INFO .
.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B /var/nis/NIS_SHARED_DIRCACHE
.ad
.sp .6
.RS 4n
the shared cache file
.RE

.sp
.ne 2
.mk
.na
.B /var/nis/NIS_COLD_START
.ad
.sp .6
.RS 4n
the coldstart file
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.sp
.LP
.BR keylogin (1),
.BR svcs (1),
.BR nisaddcred (1M),
.BR nisinit (1M),
.BR nisprefadm (1M),
.BR nisshowcache (1M),
.BR rpc.nisd (1M),
.BR svcadm (1M),
.BR mmap (2),
.BR rpc (3NSL),
.BR syslog (3C),
.BR nisfiles (4),
.BR attributes (5),
.BR smf (5)
.SH DIAGNOSTICS
.sp
.LP
The
.B nis_cachemgr
daemon logs error messages and warnings using
.BR syslog (3C).
Error messages are logged to the
.B DAEMON
facility
with a priority of
.B LOG_ERR
\&. Warning messages are logged with a
priority of
.BR LOG_WARNING .
Additional status messages can be obtained
using the
.B -v
option.
.SH NOTES
.sp
.LP
NIS+ might not be supported in future releases of the Solaris operating
system. Tools to aid the migration from NIS+ to LDAP are available in the
current Solaris release. For more information, visit
http://www.sun.com/directory/nisplus/transition.html.
.sp
.LP
The
.B nis_cachemgr
service is managed by the service management
facility,
.BR smf (5),
under the service identifier:
.sp
.in +2
.nf
svc:/network/rpc/nisplus:default
.fi
.in -2
.sp

.sp
.LP
Administrative actions on this service, such as enabling, disabling, or
requesting restart, can be performed using
.BR svcadm (1M).
The service's
status can be queried using the
.BR svcs (1)
command.
