usr/src/man/man1m/nisaddent.1m
'\" te
.\" Copyright (C) 2005, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH nisaddent 1M "17 Aug 2006" "SunOS 5.11" "System Administration Commands"
.SH NAME
nisaddent \- create NIS+ tables from corresponding /etc files or NIS maps
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/nis/nisaddent\fR [\fB-D\fR \fIdefaults\fR] [\fB-Paorv\fR] [\fB-t\fR \fItable\fR] \fItype\fR
     [\fInisdomain\fR]
.fi

.LP
.nf
\fB/usr/lib/nis/nisaddent\fR [\fB-D\fR \fIdefaults\fR] [\fB-Paprmov\fR] \fB-f\fR \fIfile\fR
     [\fB-t\fR \fItable\fR] \fItype\fR [\fInisdomain\fR]
.fi

.LP
.nf
\fB/usr/lib/nis/nisaddent\fR [\fB-D\fR \fIdefaults\fR] [\fB-Parmv\fR] [\fB-t\fR \fItable\fR] \fB-y\fR \fIypdomain\fR
     [\fB-Y\fR \fImap\fR] \fItype\fR [\fInisdomain\fR]
.fi

.LP
.nf
\fB/usr/lib/nis/nisaddent\fR \fB-d\fR [\fB-AMoq\fR] [\fB-t\fR \fItable\fR] \fItype\fR
     [\fInisdomain\fR]
.fi

.SH DESCRIPTION
.sp
.LP
.B nisaddent
creates entries in NIS+ tables from their corresponding
.B /etc
files and NIS maps. This operation is customized for each of the
standard tables that are used in the administration of Solaris systems. The
.B type
argument specifies the type of the data being processed. Legal
values for this type are one of
.BR aliases ,
.BR bootparams ,
.BR ethers ,
.BR group ,
.BR hosts ,
.BR ipnodes ,
.BR netid ,
.BR netmasks ,
.BR networks ,
.BR passwd ,
.BR protocols ,
.BR publickey ,
.BR rpc ,
.BR services ,
.BR shadow ,
or
.BR timezone
for the standard tables, or
.B key-value
for a generic two-column (key,
value) table. For a site specific table, which is not of \fBkey-value\fR
type, one can use
.BR nistbladm (1)
to administer it.
.sp
.LP
The NIS+ tables should have already been created by
.BR nistbladm (1),
.BR nissetup (1M),
or
.BR nisserver (1M).
.sp
.LP
It is easier to use \fBnispopulate\fR(1M) instead of
.B nisaddent
to
populate the system tables.
.sp
.LP
By default,
.B nisaddent
reads from the standard input and adds this
data to the NIS+ table associated with the
.B type
specified on the
command line. An alternate NIS+ table may be specified with the \fB-t\fR
option. For type
.BR key-value ,
a table specification is required.
.sp
.LP
Note that the
.I data
type can be different than the table name
(\fB-t\fR). For example, the automounter tables have \fBkey-value\fR as the
table type.
.sp
.LP
Although, there is a
.I shadow
data type, there is no corresponding
.I shadow
table. Both the shadow and the passwd data is stored in the
.B passwd
table itself.
.sp
.LP
Files may be processed using the
.B -f
option, and NIS version 2 (
.BR YP )
maps may be processed using the
.B -y
option. The merge option
is not available when reading data from standard input.
.sp
.LP
When a
.I ypdomain
is specified, the
.B nisaddent
command takes its
input from the
.B dbm
files for the appropriate NIS map
(\fBmail.aliases\fR,
.BR bootparams ,
.BR ethers.byaddr ,
.BR group.byname ,
.BR hosts.byaddr ,
.BR hosts.byname ,
\fBipnodes.byaddr\fR,\fBipnodes.byname\fR, \fBnetid.byname\fR,
.BR netmasks.byaddr ,
.BR networks.byname ,
.BR passwd.byname ,
.BR protocols.byname ,
.BR publickey.byname ,
.BR rpc.bynumber ,
.BR services.byname ,
or
.BR timezone.byname ).
An alternate NIS map may
be specified with the
.B -Y
option. For type
.BR key-value ,
a map
specification is required. The map must be in the
\fB/var/yp/\fIypdomain\fR directory on the local machine. Note that
.I ypdomain
is case sensitive. \fBypxfr\fR(1M) can be used to get the NIS
maps.
.sp
.LP
If a
.I nisdomain
is specified,
.B nisaddent
operates on the NIS+
table in that NIS+ domain, otherwise the default domain is used.
.sp
.LP
In terms of performance, loading up the tables is fastest when done through
the dbm files
.RB ( -y ).
.sp
.LP
To accommodate other credential entries used by other authentication
mechanisms stored in the
.B cred.org_dir
table, the
.B publickey
dump
output has been modified to include a special algorithm
.B type
field.
This format is incompatible with older versions of
.BR nisaddent .
To
produce dumps that can be read by older versions of
.B nisaddent,
or to
load dumps created by such older versions, use the
.B -o
option.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -a
.ad
.RS 15n
.rt
Add the file or map to the NIS+ table without deleting any existing
entries. This option is the default. Note that this mode only propagates
additions and modifications, not deletions.
.RE

.sp
.ne 2
.mk
.na
.B -A
.ad
.RS 15n
.rt
All data. This option specifies that the data within the table and all of
the data in tables in the initial table's concatenation path be returned.
.RE

.sp
.ne 2
.mk
.na
.B -d
.ad
.RS 15n
.rt
Dump the NIS+ table to the standard output in the appropriate format for
the given
.BR type .
For tables of type
.BR key-value ,
use
.BR niscat (1)
instead. To dump the
.B cred
table, dump the
.B publickey
and the
.B netid
types.
.RE

.sp
.ne 2
.mk
.na
.B -D
.I defaults
.ad
.RS 15n
.rt
This option specifies a different set of defaults to be used during this
operation. The
.I defaults
string is a series of tokens separated by
colons. These tokens represent the default values to be used for the generic
object properties. All of the legal tokens are described below.
.sp
.ne 2
.mk
.na
.B ttl=time
.ad
.RS 19n
.rt
This token sets the default time to live for objects that are created by
this command. The value
.B time
is specified in the format as defined by
the
.BR nischttl (1)
command. The default is 12 hours.
.RE

.sp
.ne 2
.mk
.na
\fBowner=\fIownername\fR
.ad
.RS 19n
.rt
This token specifies that the
.B NIS+
principal
.I ownername
should
own the created object. The default for this value is the principal who is
executing the command.
.RE

.sp
.ne 2
.mk
.na
\fBgroup=\fIgroupname\fR
.ad
.RS 19n
.rt
This token specifies that the group
.I groupname
should be the group
owner for the object that is created. The default is
.IR NULL .
.RE

.sp
.ne 2
.mk
.na
\fBaccess=\fIrights\fR
.ad
.RS 19n
.rt
This token specifies the set of access rights that are to be granted for
the given object. The value
.I rights
is specified in the format as
defined by the
.BR nischmod (1)
command. The default is
.sp
.in +2
.nf
\(mi\|\(mi\|\(mi\|\(mirmcdr\|\(mi\|\(mi\|\(mir\|\(mi\|\(mi\|\(mi
.fi
.in -2
.sp

.RE

.RE

.sp
.ne 2
.mk
.na
.B -f
.I file
.ad
.RS 15n
.rt
Specify that
.B file
should be used as the source of input (instead of
the standard input).
.RE

.sp
.ne 2
.mk
.na
.B -m
.ad
.RS 15n
.rt
Merge the file or map with the NIS+ table. This is the most efficient way
to bring an NIS+ table up to date with a file or NIS map when there are only
a small number of changes. This option adds entries that are not already in
the database, modifies entries that already exist (if changed), and deletes
any entries that are not in the source. Use the
.B -m
option whenever the
database is large and replicated, and the map being loaded differs only in a
few entries. This option reduces the number of update messages that have to
be sent to the replicas. Also see the
.B -r
option.
.RE

.sp
.ne 2
.mk
.na
.B -M
.ad
.RS 15n
.rt
Master server only. This option specifies that lookups should be sent to
the master server. This guarantees that the most up-to-date information is
seen at the possible expense that the master server may be busy, or that it
may be made busy by this operation.
.RE

.sp
.ne 2
.mk
.na
.B -o
.ad
.RS 15n
.rt
Use strictly conforming
.B publickey
files. Dumps will not add the
algorithm
.B type
field used by additional authentication mechanisms that
might be configured using \fBnisauthconf\fR(1M). 192-bit keys that are
dumped using this option can be read by previous versions of
.BR nisaddent .
However, the algorithm field will be lost and assumed to be
"0" when read. Use the \fB-o\fR option when reading \fBpublickey\fR files
from previous versions of
.B nisaddent
to avoid warnings about the
missing algorithm field.
.RE

.sp
.ne 2
.mk
.na
.B -p
.ad
.RS 15n
.rt
Process the password field when loading password information from a file.
By default, the password field is ignored because it is usually not valid
(the actual password appears in a shadow file).
.RE

.sp
.ne 2
.mk
.na
.B -P
.ad
.RS 15n
.rt
Follow concatenation path. This option specifies that lookups should follow
the concatenation path of a table if the initial search is unsuccessful.
.RE

.sp
.ne 2
.mk
.na
.B -q
.ad
.RS 15n
.rt
Dump tables in "quick" mode. The default method for dumping tables
processes each entry individually. For some tables, for example, hosts,
multiple entries must be combined into a single line, so extra requests to
the server must be made. In "quick" mode, all of the entries for a table are
retrieved in one call to the server, so the table can be dumped more
quickly. However, for large tables, there is a chance that the process will
run out of virtual memory and the table will not be dumped.
.RE

.sp
.ne 2
.mk
.na
.B -r
.ad
.RS 15n
.rt
Replace the file or map in the existing NIS+ table by first deleting any
existing entries, and then add the entries from the source (\fB/etc\fR
files, or NIS+ maps). This option has the same effect as the \fB-m\fR
option. The use of this option is
.I strongly
discouraged due to its
adverse impact on performance, unless there are a large number of changes.
.RE

.sp
.ne 2
.mk
.na
.B -t
.I table
.ad
.RS 15n
.rt
Specify that
.I table
should be the NIS+ table for this operation. This
should be a relative name as compared to your default domain or the
.B domainname
if it has been specified.
.RE

.sp
.ne 2
.mk
.na
.B -v
.ad
.RS 15n
.rt
Verbose.
.RE

.sp
.ne 2
.mk
.na
.B -y
.I ypdomain
.ad
.RS 15n
.rt
Use the
.B dbm
files for the appropriate NIS map, from the NIS domain
.IR ypdomain ,
as the source of input. The files are expected to be on the
local machine in the \fB/var/yp/\fIypdomain\fR directory. If the machine
is not an NIS server, use \fBypxfr\fR(1M) to get a copy of the \fBdbm\fR
files for the appropriate map.
.RE

.sp
.ne 2
.mk
.na
.B -Y
.I map
.ad
.RS 15n
.rt
Use the
.B dbm
files for
.I map
as the source of input.
.RE

.SH EXAMPLES
.LP
.B Example 1
Using
.BR nisaddent
.sp
.LP
This example adds the contents of
.B /etc/passwd
to the
.B passwd.org_dir
table:

.sp
.in +2
.nf
example% \fBcat /etc/passwd | nisaddent passwd\fR
.fi
.in -2
.sp

.sp
.LP
The next example adds the shadow information. Note that the table type here
is "shadow", not "passwd", even though the actual information is stored in
the
.B passwd
table:

.sp
.in +2
.nf
example% \fBcat /etc/shadow | nisaddent shadow\fR
.fi
.in -2
.sp

.sp
.LP
This example replaces the
.B hosts.org_dir
table with the contents of
.B /etc/hosts
(in verbose mode):

.sp
.in +2
.nf
example% \fBnisaddent -rv -f /etc/hosts hosts\fR
.fi
.in -2
.sp

.sp
.LP
This example merges the
.B passwd
map from
.B yypdomain
with the
.B passwd.org_dir.nisdomain
table (in verbose mode). The example assumes
that the
.B /var/yp/myypdomain
directory contains the
.BR yppasswd
map.

.sp
.in +2
.nf
example% \fBnisaddent -mv -y myypdomain passwd nisdomain\fR
.fi
.in -2
.sp

.sp
.LP
This example merges the
.B auto.master
map from
.B myypdomain
with
the
.B auto_master.org_dir
table:

.sp
.in +2
.nf
example% \fBnisaddent -m -y myypdomain -Y auto.master \e
     -t auto_master.org_dir key-value\fR
.fi
.in -2
.sp

.sp
.LP
This example dumps the
.B hosts.org_dir
table:

.sp
.in +2
.nf
example% \fBnisaddent -d hosts\fR
.fi
.in -2
.sp

.sp
.LP
This example dumps the
.B ipnodes.org_dir
table:

.sp
.in +2
.nf
example% \fBnisaddent -d ipnodes\fR
.fi
.in -2
.sp

.SH ENVIRONMENT VARIABLES
.sp
.ne 2
.mk
.na
.B NIS_DEFAULTS
.ad
.RS 16n
.rt
This variable contains a default string that will override the NIS+
standard defaults. If the
.B -D
switch is used, those values will then
override both the
.B NIS_DEFAULTS
variable and the standard defaults. To
.RB "avoid security accidents, the access rights in the" " NIS_DEFAULTS"
variable are ignored for the
.B passwd
table (but access rights specified
with
.B -D
are used).
.RE

.sp
.ne 2
.mk
.na
.B NIS_PATH
.ad
.RS 16n
.rt
If this variable is set, and neither the
.I nisdomain
nor the
.I table
are fully qualified, each directory specified in \fBNIS_PATH\fR
will be searched until the table is found (see
.BR nisdefaults (1)).
.RE

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 5n
.rt
Successful operation.
.RE

.sp
.ne 2
.mk
.na
.B 1
.ad
.RS 5n
.rt
Failure caused by an error other than parsing.
.RE

.sp
.ne 2
.mk
.na
.B 2
.ad
.RS 5n
.rt
A parsing error occurred on an entry. A parsing error does not cause
termination; the invalid entries are simply skipped.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWnisu
.TE

.SH SEE ALSO
.sp
.LP
.BR niscat (1),
.BR nischmod (1),
.BR nischttl (1),
.BR nisdefaults (1),
.BR nistbladm (1),
.BR nisauthconf (1M),
.BR nispopulate (1M),
.BR nisserver (1M),
.BR nissetup (1M),
.BR ypxfr (1M),
.BR hosts (4),
.BR passwd (4),
.BR shadow (4),
.BR attributes (5)
.SH NOTES
.sp
.LP
NIS+ might not be supported in future releases of the Solaris operating
system. Tools to aid the migration from NIS+ to LDAP are available in the
current Solaris release. For more information, visit
http://www.sun.com/directory/nisplus/transition.html.
