usr/src/man/man1m/nisaddent.1m
'\" te
.\" Copyright (C) 2005, Sun Microsystems, Inc. All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH nisaddent 1M "17 Aug 2006" "SunOS 5.11" "System Administration Commands"
.SH NAME
nisaddent \- create NIS+ tables from corresponding /etc files or NIS maps
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/nis/nisaddent\fR [\fB-D\fR \fIdefaults\fR] [\fB-Paorv\fR] [\fB-t\fR \fItable\fR] \fItype\fR
     [\fInisdomain\fR]
.fi

.LP
.nf
\fB/usr/lib/nis/nisaddent\fR [\fB-D\fR \fIdefaults\fR] [\fB-Paprmov\fR] \fB-f\fR \fIfile\fR
     [\fB-t\fR \fItable\fR] \fItype\fR [\fInisdomain\fR]
.fi

.LP
.nf
\fB/usr/lib/nis/nisaddent\fR [\fB-D\fR \fIdefaults\fR] [\fB-Parmv\fR] [\fB-t\fR \fItable\fR] \fB-y\fR \fIypdomain\fR
     [\fB-Y\fR \fImap\fR] \fItype\fR [\fInisdomain\fR]
.fi

.LP
.nf
\fB/usr/lib/nis/nisaddent\fR \fB-d\fR [\fB-AMoq\fR] [\fB-t\fR \fItable\fR] \fItype\fR
     [\fInisdomain\fR]
.fi

.SH DESCRIPTION
.sp
.LP
\fBnisaddent\fR creates entries in NIS+ tables from their corresponding
\fB/etc\fR files and NIS maps. This operation is customized for each of the
standard tables that are used in the administration of Solaris systems. The
\fBtype\fR argument specifies the type of the data being processed. Legal
values for this type are one of \fBaliases\fR, \fBbootparams\fR,
\fBethers\fR, \fBgroup\fR, \fBhosts\fR, \fBipnodes\fR, \fBnetid\fR,
\fBnetmasks\fR, \fBnetworks\fR, \fBpasswd\fR, \fBprotocols\fR,
\fBpublickey\fR, \fBrpc\fR, \fBservices\fR, \fBshadow\fR, or \fBtimezone\fR
for the standard tables, or \fBkey-value\fR for a generic two-column (key,
value) table. For a site specific table, which is not of \fBkey-value\fR
type, one can use \fBnistbladm\fR(1) to administer it.
.sp
.LP
The NIS+ tables should have already been created by \fBnistbladm\fR(1),
\fBnissetup\fR(1M), or \fBnisserver\fR(1M).
.sp
.LP
It is easier to use \fBnispopulate\fR(1M) instead of \fBnisaddent\fR to
populate the system tables.
.sp
.LP
By default, \fBnisaddent\fR reads from the standard input and adds this
data to the NIS+ table associated with the \fBtype\fR specified on the
command line. An alternate NIS+ table may be specified with the \fB-t\fR
option. For type \fBkey-value\fR, a table specification is required.
.sp
.LP
Note that the \fIdata\fR type can be different than the table name
(\fB-t\fR). For example, the automounter tables have \fBkey-value\fR as the
table type.
.sp
.LP
Although, there is a \fIshadow\fR data type, there is no corresponding
\fIshadow\fR table. Both the shadow and the passwd data is stored in the
\fBpasswd\fR table itself.
.sp
.LP
Files may be processed using the \fB-f\fR option, and NIS version 2 (
\fBYP\fR) maps may be processed using the \fB-y\fR option. The merge option
is not available when reading data from standard input.
.sp
.LP
When a \fIypdomain\fR is specified, the \fBnisaddent\fR command takes its
input from the \fBdbm\fR files for the appropriate NIS map
(\fBmail.aliases\fR, \fBbootparams\fR, \fBethers.byaddr\fR,
\fBgroup.byname\fR, \fBhosts.byaddr\fR, \fBhosts.byname\fR,
\fBipnodes.byaddr\fR,\fBipnodes.byname\fR, \fBnetid.byname\fR,
\fBnetmasks.byaddr\fR, \fBnetworks.byname\fR, \fBpasswd.byname\fR,
\fBprotocols.byname\fR, \fBpublickey.byname\fR, \fBrpc.bynumber\fR,
\fBservices.byname\fR, or \fBtimezone.byname\fR). An alternate NIS map may
be specified with the \fB-Y\fR option. For type \fBkey-value\fR, a map
specification is required. The map must be in the
\fB/var/yp/\fIypdomain\fR directory on the local machine. Note that
\fIypdomain\fR is case sensitive. \fBypxfr\fR(1M) can be used to get the NIS
maps.
.sp
.LP
If a \fInisdomain\fR is specified, \fBnisaddent\fR operates on the NIS+
table in that NIS+ domain, otherwise the default domain is used.
.sp
.LP
In terms of performance, loading up the tables is fastest when done through
the dbm files (\fB-y\fR).
.sp
.LP
To accommodate other credential entries used by other authentication
mechanisms stored in the \fBcred.org_dir\fR table, the \fBpublickey\fR dump
output has been modified to include a special algorithm \fBtype\fR field.
This format is incompatible with older versions of \fBnisaddent\fR. To
produce dumps that can be read by older versions of \fBnisaddent,\fR or to
load dumps created by such older versions, use the \fB-o\fR option.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB-a\fR
.ad
.RS 15n
.rt
Add the file or map to the NIS+ table without deleting any existing
entries. This option is the default. Note that this mode only propagates
additions and modifications, not deletions.
.RE

.sp
.ne 2
.mk
.na
\fB-A\fR
.ad
.RS 15n
.rt
All data. This option specifies that the data within the table and all of
the data in tables in the initial table's concatenation path be returned.
.RE

.sp
.ne 2
.mk
.na
\fB-d\fR
.ad
.RS 15n
.rt
Dump the NIS+ table to the standard output in the appropriate format for
the given \fBtype\fR. For tables of type \fBkey-value\fR, use
\fBniscat\fR(1) instead. To dump the \fBcred\fR table, dump the
\fBpublickey\fR and the \fBnetid\fR types.
.RE

.sp
.ne 2
.mk
.na
\fB-D\fR \fIdefaults\fR
.ad
.RS 15n
.rt
This option specifies a different set of defaults to be used during this
operation. The \fIdefaults\fR string is a series of tokens separated by
colons. These tokens represent the default values to be used for the generic
object properties. All of the legal tokens are described below.
.sp
.ne 2
.mk
.na
\fBttl=\fBtime\fR
.ad
.RS 19n
.rt
This token sets the default time to live for objects that are created by
this command. The value \fBtime\fR is specified in the format as defined by
the \fBnischttl\fR(1) command. The default is 12 hours.
.RE

.sp
.ne 2
.mk
.na
\fBowner=\fIownername\fR
.ad
.RS 19n
.rt
This token specifies that the \fBNIS+\fR principal \fIownername\fR should
own the created object. The default for this value is the principal who is
executing the command.
.RE

.sp
.ne 2
.mk
.na
\fBgroup=\fIgroupname\fR
.ad
.RS 19n
.rt
This token specifies that the group \fIgroupname\fR should be the group
owner for the object that is created. The default is \fINULL\fR.
.RE

.sp
.ne 2
.mk
.na
\fBaccess=\fIrights\fR
.ad
.RS 19n
.rt
This token specifies the set of access rights that are to be granted for
the given object. The value \fIrights\fR is specified in the format as
defined by the \fBnischmod\fR(1) command. The default is
.sp
.in +2
.nf
\(mi\|\(mi\|\(mi\|\(mirmcdr\|\(mi\|\(mi\|\(mir\|\(mi\|\(mi\|\(mi
.fi
.in -2
.sp

.RE

.RE

.sp
.ne 2
.mk
.na
\fB-f\fR \fIfile\fR
.ad
.RS 15n
.rt
Specify that \fBfile\fR should be used as the source of input (instead of
the standard input).
.RE

.sp
.ne 2
.mk
.na
\fB-m\fR
.ad
.RS 15n
.rt
Merge the file or map with the NIS+ table. This is the most efficient way
to bring an NIS+ table up to date with a file or NIS map when there are only
a small number of changes. This option adds entries that are not already in
the database, modifies entries that already exist (if changed), and deletes
any entries that are not in the source. Use the \fB-m\fR option whenever the
database is large and replicated, and the map being loaded differs only in a
few entries. This option reduces the number of update messages that have to
be sent to the replicas. Also see the \fB-r\fR option.
.RE

.sp
.ne 2
.mk
.na
\fB-M\fR
.ad
.RS 15n
.rt
Master server only. This option specifies that lookups should be sent to
the master server. This guarantees that the most up-to-date information is
seen at the possible expense that the master server may be busy, or that it
may be made busy by this operation.
.RE

.sp
.ne 2
.mk
.na
\fB-o\fR
.ad
.RS 15n
.rt
Use strictly conforming \fBpublickey\fR files. Dumps will not add the
algorithm \fBtype\fR field used by additional authentication mechanisms that
might be configured using \fBnisauthconf\fR(1M). 192-bit keys that are
dumped using this option can be read by previous versions of
\fBnisaddent\fR. However, the algorithm field will be lost and assumed to be
"0" when read. Use the \fB-o\fR option when reading \fBpublickey\fR files
from previous versions of \fBnisaddent\fR to avoid warnings about the
missing algorithm field.
.RE

.sp
.ne 2
.mk
.na
\fB-p\fR
.ad
.RS 15n
.rt
Process the password field when loading password information from a file.
By default, the password field is ignored because it is usually not valid
(the actual password appears in a shadow file).
.RE

.sp
.ne 2
.mk
.na
\fB-P\fR
.ad
.RS 15n
.rt
Follow concatenation path. This option specifies that lookups should follow
the concatenation path of a table if the initial search is unsuccessful.
.RE

.sp
.ne 2
.mk
.na
\fB-q\fR
.ad
.RS 15n
.rt
Dump tables in "quick" mode. The default method for dumping tables
processes each entry individually. For some tables, for example, hosts,
multiple entries must be combined into a single line, so extra requests to
the server must be made. In "quick" mode, all of the entries for a table are
retrieved in one call to the server, so the table can be dumped more
quickly. However, for large tables, there is a chance that the process will
run out of virtual memory and the table will not be dumped.
.RE

.sp
.ne 2
.mk
.na
\fB-r\fR
.ad
.RS 15n
.rt
Replace the file or map in the existing NIS+ table by first deleting any
existing entries, and then add the entries from the source (\fB/etc\fR
files, or NIS+ maps). This option has the same effect as the \fB-m\fR
option. The use of this option is \fIstrongly\fR discouraged due to its
adverse impact on performance, unless there are a large number of changes.
.RE

.sp
.ne 2
.mk
.na
\fB-t\fR \fItable\fR
.ad
.RS 15n
.rt
Specify that \fItable\fR should be the NIS+ table for this operation. This
should be a relative name as compared to your default domain or the
\fBdomainname\fR if it has been specified.
.RE

.sp
.ne 2
.mk
.na
\fB-v\fR
.ad
.RS 15n
.rt
Verbose.
.RE

.sp
.ne 2
.mk
.na
\fB-y\fR \fIypdomain\fR
.ad
.RS 15n
.rt
Use the \fBdbm\fR files for the appropriate NIS map, from the NIS domain
\fIypdomain\fR, as the source of input. The files are expected to be on the
local machine in the \fB/var/yp/\fIypdomain\fR directory. If the machine
is not an NIS server, use \fBypxfr\fR(1M) to get a copy of the \fBdbm\fR
files for the appropriate map.
.RE

.sp
.ne 2
.mk
.na
\fB-Y\fR \fImap\fR
.ad
.RS 15n
.rt
Use the \fBdbm\fR files for \fImap\fR as the source of input.
.RE

.SH EXAMPLES
.LP
\fBExample 1 \fRUsing \fBnisaddent\fR
.sp
.LP
This example adds the contents of \fB/etc/passwd\fR to the
\fBpasswd.org_dir\fR table:

.sp
.in +2
.nf
example% \fBcat /etc/passwd | nisaddent passwd\fR
.fi
.in -2
.sp

.sp
.LP
The next example adds the shadow information. Note that the table type here
is "shadow", not "passwd", even though the actual information is stored in
the \fBpasswd\fR table:

.sp
.in +2
.nf
example% \fBcat /etc/shadow | nisaddent shadow\fR
.fi
.in -2
.sp

.sp
.LP
This example replaces the \fBhosts.org_dir\fR table with the contents of
\fB/etc/hosts\fR (in verbose mode):

.sp
.in +2
.nf
example% \fBnisaddent -rv -f /etc/hosts hosts\fR
.fi
.in -2
.sp

.sp
.LP
This example merges the \fBpasswd\fR map from \fByypdomain\fR with the
\fBpasswd.org_dir.nisdomain\fR table (in verbose mode). The example assumes
that the \fB/var/yp/myypdomain\fR directory contains the \fByppasswd\fR
map.

.sp
.in +2
.nf
example% \fBnisaddent -mv -y myypdomain passwd nisdomain\fR
.fi
.in -2
.sp

.sp
.LP
This example merges the \fBauto.master\fR map from \fBmyypdomain\fR with
the \fBauto_master.org_dir\fR table:

.sp
.in +2
.nf
example% \fBnisaddent -m -y myypdomain -Y auto.master \e
     -t auto_master.org_dir key-value\fR
.fi
.in -2
.sp

.sp
.LP
This example dumps the \fBhosts.org_dir\fR table:

.sp
.in +2
.nf
example% \fBnisaddent -d hosts\fR
.fi
.in -2
.sp

.sp
.LP
This example dumps the \fBipnodes.org_dir\fR table:

.sp
.in +2
.nf
example% \fBnisaddent -d ipnodes\fR
.fi
.in -2
.sp

.SH ENVIRONMENT VARIABLES
.sp
.ne 2
.mk
.na
\fBNIS_DEFAULTS\fR
.ad
.RS 16n
.rt
This variable contains a default string that will override the NIS+
standard defaults. If the \fB-D\fR switch is used, those values will then
override both the \fBNIS_DEFAULTS\fR variable and the standard defaults. To
avoid security accidents, the access rights in the \fBNIS_DEFAULTS\fR
variable are ignored for the \fBpasswd\fR table (but access rights specified
with \fB-D\fR are used).
.RE

.sp
.ne 2
.mk
.na
\fBNIS_PATH\fR
.ad
.RS 16n
.rt
If this variable is set, and neither the \fInisdomain\fR nor the
\fItable\fR are fully qualified, each directory specified in \fBNIS_PATH\fR
will be searched until the table is found (see \fBnisdefaults\fR(1)).
.RE

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
\fB0\fR
.ad
.RS 5n
.rt
Successful operation.
.RE

.sp
.ne 2
.mk
.na
\fB1\fR
.ad
.RS 5n
.rt
Failure caused by an error other than parsing.
.RE

.sp
.ne 2
.mk
.na
\fB2\fR
.ad
.RS 5n
.rt
A parsing error occurred on an entry. A parsing error does not cause
termination; the invalid entries are simply skipped.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWnisu
.TE

.SH SEE ALSO
.sp
.LP
\fBniscat\fR(1), \fBnischmod\fR(1), \fBnischttl\fR(1),
\fBnisdefaults\fR(1), \fBnistbladm\fR(1), \fBnisauthconf\fR(1M),
\fBnispopulate\fR(1M), \fBnisserver\fR(1M), \fBnissetup\fR(1M),
\fBypxfr\fR(1M), \fBhosts\fR(4), \fBpasswd\fR(4), \fBshadow\fR(4),
\fBattributes\fR(5)
.SH NOTES
.sp
.LP
NIS+ might not be supported in future releases of the Solaris operating
system. Tools to aid the migration from NIS+ to LDAP are available in the
current Solaris release. For more information, visit
http://www.sun.com/directory/nisplus/transition.html.
