usr/src/man/man1m/nisclient.1m
'\" te
.\" Copyright 1989 AT&T
.\" Copyright (C) 2005, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH nisclient 1M "12 Dec 2001" "SunOS 5.11" "System Administration Commands"
.SH NAME
nisclient \- initialize NIS+ credentials for NIS+ principals
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/nis/nisclient\fR \fB-c\fR [\fB-x\fR] [\fB-o\fR] [\fB-v\fR]
     [\fB-l\fR \fI<network_password>\fR] [\fB-d\fR \fI<NIS+_domain>\fR] \fIclient_name\fR...
.fi

.LP
.nf
\fB/usr/lib/nis/nisclient\fR \fB-i\fR [\fB-x\fR] [\fB-v\fR] \fB-h\fR \fI<NIS+_server_host>\fR
     [\fB-a\fR \fI<NIS+_server_addr>\fR]
     [\fB-k\fR \fI<key_domain>\fR] [\fB-d\fR \fI<NIS+_domain>\fR] [\fB-S\fR \fI0\fR | \fI2\fR]
.fi

.LP
.nf
\fB/usr/lib/nis/nisclient\fR \fB-u\fR [\fB-x\fR] [\fB-v\fR]
.fi

.LP
.nf
\fB/usr/lib/nis/nisclient\fR \fB-r\fR [\fB-x\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The nisclient shell script can be used to:
.RS +4
.TP
.ie t \(bu
.el o
create NIS+ credentials for hosts and users
.RE
.RS +4
.TP
.ie t \(bu
.el o
initialize NIS+ hosts and users
.RE
.RS +4
.TP
.ie t \(bu
.el o
restore the network service environment
.RE
.sp
.LP
NIS+ credentials are used to provide authentication information of NIS+
clients to NIS+ service.
.sp
.LP
Use the first synopsis (\fB-c\fR option) to create individual NIS+
credentials for hosts or users. You must be logged in as a NIS+ principal in
the domain for which you are creating the new credentials. You must also
have write permission to the local "cred" table. The \fIclient_name\fR
argument accepts any valid host or user name in the NIS+ domain (for
example, the
.I client_name
must exist in the hosts or passwd table).
.B nisclient
verifies each
.I client_name
against both the
.BR host
and
.B passwd
tables, then adds the proper NIS+ credentials for hosts or
users. Note that if you are creating NIS+ credentials outside of your local
domain, the host or user must exist in the
.B host
or
.B passwd
tables
in both the local and remote domains.
.sp
.LP
By default,
.B nisclient
will not overwrite existing entries in the
credential table for the hosts and users specified. To overwrite, use the
.B -o
option. After the credentials have been created,
.B nisclient
will print the command that must be executed on the client machine to
initialize the host or the user. The
.B -c
option requires a network
password for the client which is used to encrypt the secret key for the
client. You can either specify it on the command line with the
.B -l
option or the script will prompt you for it. You can change this network
password later with
.BR passwd (1)
or
.BR chkey (1).
.sp
.LP
.B nisclient -c
is not intended to be used to create NIS+
credentials for all users and hosts which are defined in the passwd and
hosts tables. To define credentials for all users and hosts, use
.BR nispopulate (1M).
.sp
.LP
Use the second synopsis (\fB-i\fR option) to initialize a NIS+ client
machine. The
.B -i
option can be used to convert machines to use NIS+ or
to change the machine's domainname. You must be logged in as super-user on
the machine that is to become a NIS+ client. Your administrator must have
already created the NIS+ credential for this host by using
.B nisclient
.B -c
or
.BR "nispopulate -C" .
You will need the network password
your administrator created.
.B nisclient
will prompt you for the network
password to decrypt your secret key and then for this machine's root login
password to generate a new set of secret/public keys. If the NIS+ credential
was created by your administrator using
.BR "nisclient -c" ,
then you
can simply use the initialization command that was printed by the
.B nisclient
script to initialize this host instead of typing it
manually.
.sp
.LP
.RB "To initialize an unauthenticated NIS+ client machine, use the" " -i"
option with
.BR -S
.IR 0 .
.RB "With these options, the" " nisclient"
.B -i
option will not ask for any passwords.
.sp
.LP
During the client initialization process, files that are being modified are
backed up as \fIfiles\fB\&.no_nisplus\fR. The files that are usually
modified during a client initialization are:
.BR /etc/defaultdomain ,
.BR /etc/nsswitch.conf ,
.BR /etc/inet/hosts ,
and, if it exists,
.BR /var/nis/NIS_COLD_START .
Notice that a file will not be saved if a
backup file already exists.
.sp
.LP
The
.B -i
option does not set up a NIS+ client to resolve hostnames
using
.BR DNS .
Please refer to the
.B DNS
documentation for information
on setting up
.BR DNS .
(See
.BR resolv.conf (4)).
.sp
.LP
It is not necessary to initialize either NIS+ root master servers or
machines that were installed as NIS+ clients using
.BR suninstall (1M).
.sp
.LP
Use the third synopsis (\fB-u\fR option) to initialize a NIS+ user. You
must be logged in as the user on a NIS+ client machine in the domain where
your NIS+ credentials have been created. Your administrator should have
already created the NIS+ credential for your username using
.B nisclient
.B -c
or
.BR nispopulate "(1M). You will need the network password your"
administrator used to create the NIS+ credential for your username.
.B nisclient
will prompt you for this network password to decrypt your
secret key and then for your login password to generate a new set of
secret/public keys.
.sp
.LP
Use the fourth synopsis (\fB-r\fR option) to restore the network service
environment to whatever you were using before
.B "nisclient -i"
was
executed. You must be logged in as super-user on the machine that is to be
restored. The restore will only work if the machine was initialized with
.B nisclient -i
because it uses the backup files created by the
.B -i
option.
.sp
.LP
Reboot the machine after initializing a machine or restoring the network
service.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB-a\fR <\fINIS+_server_addr\fR>\fR
.ad
.RS 25n
.rt
Specifies the
.B IP
address for the NIS+ server. This option is used
.I only
with the
.B -i
option.
.RE

.sp
.ne 2
.mk
.na
.B -c
.ad
.RS 25n
.rt
Adds
.B DES
credentials for NIS+ principals.
.RE

.sp
.ne 2
.mk
.na
\fB-d\fR <\fINIS+_domain\fR>\fR
.ad
.RS 25n
.rt
Specifies the NIS+ domain where the credential should be created when used
in conjunction with the
.B -c
option. It specifies the name for the new
NIS+ domain when used in conjunction with the
.B -i
option. The default
is your current domainname.
.RE

.sp
.ne 2
.mk
.na
\fB-h\fR <\fINIS+_server_host\fR>\fR
.ad
.RS 25n
.rt
Specifies the NIS+ server's hostname. This option is used
.I only
with
the
.B -i
option.
.RE

.sp
.ne 2
.mk
.na
.B -i
.ad
.RS 25n
.rt
Initializes a NIS+ client machine.
.RE

.sp
.ne 2
.mk
.na
\fB-l\fR <\fInetwork_password\fR>\fR
.ad
.RS 25n
.rt
Specifies the network password for the clients. This option is used
.I only
with the
.B -c
option. If this option is not specified, the
script will prompt you for the network password.
.RE

.sp
.ne 2
.mk
.na
.B -k
.I <key_domain>
.ad
.RS 25n
.rt
This option specifies the domain where root's credentials are stored. If a
domain is not specified, then the system default domain is assumed.
.RE

.sp
.ne 2
.mk
.na
.B -o
.ad
.RS 25n
.rt
Overwrites existing credential entries. The default is not to overwrite.
This is used
.I only
with the
.B -c
option.
.RE

.sp
.ne 2
.mk
.na
.B -r
.ad
.RS 25n
.rt
Restores the network service environment.
.RE

.sp
.ne 2
.mk
.na
.B -S
.I 0|2
.ad
.RS 25n
.rt
Specifies the authentication level for the NIS+ client. Level
.B 0
is
for unauthenticated clients and level
.B 2
is for authenticated
.RB ( DES ") clients. The default is to set up with level " 2 
authentication. This is used
.I only
with the
.B -i
option.
.B nisclient
always uses level
.B 2
authentication
.RB ( DES )
for
both
.B -c
and
.B -u
.RB "options. There is no need to run" " nisclient"
with
.B -u
and
.B -c
for level
.B 0
authentication. To configure
authentication mechanisms other than
.B DES
at security level 2, use
.BR nisauthconf (1M)
before running
.BR nisclient .
.RE

.sp
.ne 2
.mk
.na
.B -u
.ad
.RS 25n
.rt
Initializes a NIS+ user.
.RE

.sp
.ne 2
.mk
.na
.B -v
.ad
.RS 25n
.rt
Runs the script in verbose mode.
.RE

.sp
.ne 2
.mk
.na
.B -x
.ad
.RS 25n
.rt
Turns the "echo" mode on. The script just prints the commands that it would
have executed. Notice that the commands are not actually executed. The
default is off.
.RE

.SH EXAMPLES
.LP
.B Example 1
Adding the DES Credential in the Local Domain
.sp
.LP
To add the
.B DES
credential for host
.B sunws
and user
.B fred
in
the local domain:

.sp
.in +2
.nf
example% \fB/usr/lib/nis/nisclient -c sunws fred\fR
.fi
.in -2
.sp

.LP
.B Example 2
Adding the DES Credential in a Specified Domain
.sp
.LP
To add the
.B DES
credential for host
.B sunws
and user
.B fred
in
domain
.BR xyz.example.com. :

.sp
.in +2
.nf
example% \fB/usr/lib/nis/nisclient -c -d xyz.example.com. sunws fred\fR
.fi
.in -2
.sp

.LP
.B Example 3
Initializing the Host in a Specific Domain
.sp
.LP
To initialize host
.B sunws
as a NIS+ client in domain
.B xyz.example.com.
where
.B nisplus_server
is a server for the domain
.BR xyz.example.com. :

.sp
.in +2
.nf
example# \fB/usr/lib/nis/nisclient -i -h nisplus_server -d xyz.example.com\fR
.fi
.in -2
.sp

.sp
.LP
The script will prompt you for the
.B IP
address of
.BR nisplus_server
if the server is not found in the
.B /etc/hosts
file. The
.B -d
option
is needed only if your current domain name is different from the new domain
name.

.LP
.B Example 4
Initializing the Host as an Unauthenticated Client in a
Specific Domain
.sp
.LP
To initialize host
.B sunws
as an unauthenticated NIS+ client in domain
.B xyz.example.com.
where
.B nisplus_server
is a server for the domain
.BR xyz.example.com :

.sp
.in +2
.nf
example# \fB/usr/lib/nis/nisclient -i -S 0 \e
   -h nisplus_server -d xyz.example.com. -a 172.16.44.1\fR
.fi
.in -2
.sp

.LP
.B Example 5
Initializing the User as a NIS+ principal
.sp
.LP
To initialize user
.B fred
as a NIS+ principal, log in as user
.B fred
on a NIS+ client machine.

.sp
.in +2
.nf
example% \fB/usr/lib/nis/nisclient -u\fR
.fi
.in -2
.sp

.SH FILES
.sp
.ne 2
.mk
.na
.B /var/nis/NIS_COLD_START
.ad
.RS 27n
.rt
This file contains a list of servers, their transport addresses, and their
Secure RPC public keys that serve the machines default domain.
.RE

.sp
.ne 2
.mk
.na
.B /etc/defaultdomain
.ad
.RS 27n
.rt
The system default domainname.
.RE

.sp
.ne 2
.mk
.na
.B /etc/nsswitch.conf
.ad
.RS 27n
.rt
Configuration file for the name-service switch.
.RE

.sp
.ne 2
.mk
.na
.B /etc/inet/hosts
.ad
.RS 27n
.rt
Local host name database.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWnisu
.TE

.SH SEE ALSO
.sp
.LP
.BR chkey (1),
.BR keylogin (1),
.BR NIS+ (1),
.BR passwd (1),
.BR keyserv (1M),
.BR nisaddcred (1M),
.BR nisauthconf (1M),
.BR nisinit (1M),
.BR nispopulate (1M),
.BR suninstall (1M),
.BR nsswitch.conf (4),
.BR resolv.conf (4),
.BR attributes (5)
.SH NOTES
.sp
.LP
NIS+ might not be supported in future releases of the Solaris operating
system. Tools to aid the migration from NIS+ to LDAP are available in the
current Solaris release. For more information, visit
http://www.sun.com/directory/nisplus/transition.html.
