usr/src/man/man1m/nisinit.1m
'\" te
.\" Copyright (C) 2005, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH nisinit 1M "12 Dec 2001" "SunOS 5.11" "System Administration Commands"
.SH NAME
nisinit \- NIS+ client and server initialization utility
.SH SYNOPSIS
.LP
.nf
\fBnisinit\fR \fB-r\fR
.fi

.LP
.nf
\fBnisinit\fR \fB-p\fR Y | D | N \fIparent_domain\fR \fIhost\fR...
.fi

.LP
.nf
\fBnisinit\fR \fB-c\fR [\fB-k\fR \fI<key_domain>\fR] \fB-H\fR \fIhost\fR | \fB-B\fR | \fB-C\fR \fIcoldstart\fR
.fi

.SH DESCRIPTION
.sp
.LP
.B nisinit
initializes a machine to be a NIS+ client or an NIS+ root
master server. It may be easier to use
.BR nisclient (1M)
or
.BR nisserver (1M)
to accomplish this same task.
.SH OPTIONS
.sp
.ne 2
.mk
.na
.B -r
.ad
.sp .6
.RS 4n
Initialize the machine to be a NIS+ root server. This option creates the
file
.B /var/nis/data/root.object
and initialize it to contain
information about this machine. It uses the
.BR sysinfo (2)
system call to
retrieve the name of the default domain.
.sp
To initialize the machine as an NIS+ root server, it is advisable to use
the "\fB-r\fR" option of \fBnisserver\fR(1M), instead of using "\fBnisinit
-r\fR".
.RE

.sp
.ne 2
.mk
.na
\fB-p Y \|| D \|| N\fR \fIparent_domain host .\|.\|.\fR
.ad
.sp .6
.RS 4n
This option is used on a root server to initialize a
.B /var/nis/data/parent.object
to make this domain a part of the
namespace above it. Only root servers can have parent objects. A parent
object describes the namespace ``above'' the NIS+ root. If this is an
isolated domain, this option should not be used. The argument to this option
tells the command what type of name server is serving the domain above the
NIS+ domain. When clients attempt to resolve a name that is outside of the
.RB "NIS+ namespace, this object is returned with the error" " NIS_FOREIGNNS"
indicating that a name space boundary has been reached. It is up to the
client to continue the name resolution process.
.sp
The parameter
.I parent_domain
is the name of the parent domain in a
syntax that is native to that type of domain. The list of host names that
follow the domain parameter are the names of hosts that serve the parent
domain. If there is more than one server for a parent domain, the first host
specified should be the master server for that domain.
.sp
.ne 2
.mk
.na
.B Y
.ad
.RS 5n
.rt
Specifies that the parent directory is a NIS version 2 domain.
.RE

.sp
.ne 2
.mk
.na
.B D
.ad
.RS 5n
.rt
Specifies that the parent directory is a DNS domain.
.RE

.sp
.ne 2
.mk
.na
.B N
.ad
.RS 5n
.rt
Specifies that the parent directory is another NIS+ domain. This option is
useful for connecting a pre-existing NIS+ subtree into the global
namespace.
.RE

Note that in the current implementation, the NIS+ clients do not take
advantage of the
.B -p
feature. Also, since the parent object is
currently not replicated on root replica servers, it is recommended that
this option not be used.
.RE

.sp
.ne 2
.mk
.na
.B -c
.ad
.sp .6
.RS 4n
Initializes the machine to be a NIS+ client. There are three initialization
options available: initialize by coldstart, initialize by hostname, and
initialize by broadcast. The most secure mechanism is to initialize from a
trusted coldstart file. The second option is to initialize using a hostname
that you specify as a trusted host. The third method is to initialize by
broadcast and it is the least secure method.
.sp
.ne 2
.mk
.na
.B -C
.I coldstart
.ad
.RS 16n
.rt
Causes the file
.I coldstart
to be used as a prototype coldstart file
when initializing a NIS+ client. This coldstart file can be copied from a
machine that is already a client of the NIS+ namespace. For maximum
security, an administrator can encrypt and encode (with
.BR uuencode (1C))
the coldstart file and mail it to an administrator bringing up a new
machine. The new administrator would then decode  (with
.BR uudecode ),
decrypt, and then use this file with the
.B nisinit
command to initialize
the machine as an NIS+ client. If the coldstart file is from another client
in the same domain, the
.B nisinit
command may be safely skipped and the
file copied into the
.B /var/nis
directory as
.BR /var/nis/NIS_COLD_START .
.RE

.sp
.ne 2
.mk
.na
.B -H
.I hostname
.ad
.RS 16n
.rt
Specifies that the host
.B hostname
should be contacted as a trusted
NIS+ server. The
.B nisinit
command will iterate over each transport in
the
.B NETPATH
environment variable and attempt to contact
.BR rpcbind (1M)
on that machine. This hostname
.I must
be reachable
from the client without the name service running. For
.B IP
networks this
means that there must be an entry in
.B /etc/hosts
for this host when
.B nisinit
is invoked.
.RE

.sp
.ne 2
.mk
.na
.B -B
.ad
.RS 16n
.rt
Specifies that the
.B nisinit
command should use an IP broadcast to
locate a NIS+ server on the local subnet. Any machine that is running the
NIS+ service may answer. No guarantees are made that the server that answers
is a server of the organization's namespace. If this option is used, it is
advisable to check with your system administrator that the server and domain
served are valid. The binding information can be dumped to the standard
output using the
.BR nisshowcache "(1M) command."
.RE

Note that
.B "nisinit -c"
will just enable navigation of the NIS+
name space from this client. To make NIS+ your name service, modify the file
.B /etc/nsswitch.conf
to reflect that. See
.BR nsswitch.conf (4)
for
more details.
.RE

.sp
.ne 2
.mk
.na
\fB-k\fR <\fIkey_domain\fR>\fR
.ad
.sp .6
.RS 4n
This option specifies the domain where root's credentials are stored. If it
is not specified, then the system default domain is assumed. This domain
name is used to create the
.B /var/nis/NIS_COLD_START
file.
.RE

.SH RETURN VALUES
.sp
.LP
.B nisinit
returns
.B 0
on success and
.B 1
on failure.
.SH EXAMPLES
.LP
.B Example 1
Initializing the Machine as an NIS+ Client using the Host
.I freddy
as a Trusted Server
.sp
.LP
This example initializes the machine as an NIS+ client using the host
.I freddy
as a trusted server.

.sp
.in +2
.nf
example# \fBnisinit -cH freddy\fR
.fi
.in -2
.sp

.LP
.B Example 2
Setting up a Client using a Trusted Coldstart File
.sp
.LP
This example sets up a client using a trusted coldstart file.

.sp
.in +2
.nf
example# \fBnisinit -cC /tmp/colddata\fR
.fi
.in -2
.sp

.LP
.B Example 3
Setting up a Client Using an IP Broadcast
.sp
.LP
This example sets up a client using an IP broadcast.

.sp
.in +2
.nf
example# \fBnisinit -cB\fR
.fi
.in -2
.sp

.LP
.B Example 4
Setting up a Root Server
.sp
.LP
This example sets up a root server.

.sp
.in +2
.nf
example# \fBnisinit -r\fR
.fi
.in -2
.sp

.SH ENVIRONMENT VARIABLES
.sp
.ne 2
.mk
.na
.B NETPATH
.ad
.RS 11n
.rt
This environment variable may be set to the transports to try when
contacting the
.B NIS+
server (see
.BR netconfig (4)).
The client
library will only attempt to contact the server using connection oriented
transports.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B /var/nis/NIS_COLD_START
.ad
.sp .6
.RS 4n
This file contains a list of servers, their transport addresses, and their
Secure RPC public keys that serve the machine's default domain.
.RE

.sp
.ne 2
.mk
.na
.B /var/nis/data/root.object
.ad
.sp .6
.RS 4n
This file describes the root object of the NIS+ namespace. It is a standard
XDR-encoded NIS+ directory object that can be modified by authorized clients
using the
.B nis_modify()
interface.
.RE

.sp
.ne 2
.mk
.na
.B /var/nis/data/parent.object
.ad
.sp .6
.RS 4n
This file describes the namespace that is logically above the NIS+
namespace. The most common type of parent object is a DNS object. This
object contains contact information for a server of that domain.
.RE

.sp
.ne 2
.mk
.na
.B /etc/hosts
.ad
.sp .6
.RS 4n
Internet host table.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWnisu
.TE

.SH SEE ALSO
.sp
.LP
.BR NIS+ (1),
.BR uuencode (1C),
.BR nisclient (1M),
.BR nisserver (1M),
.BR nisshowcache (1M),
.B sysinfo
(2),
.BR hosts (4),
.BR netconfig (4),
.BR nisfiles (4),
.BR attributes (5)
.SH NOTES
.sp
.LP
NIS+ might not be supported in future releases of the Solaris operating
system. Tools to aid the migration from NIS+ to LDAP are available in the
current Solaris release. For more information, visit
http://www.sun.com/directory/nisplus/transition.html.
