usr/src/man/man1m/nislog.1m
'\" te
.\" Copyright (C) 2005, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH nislog 1M "12 Dec 2001" "SunOS 5.11" "System Administration Commands"
.SH NAME
nislog \- display the contents of the NIS+ transaction log
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/nislog\fR [\fB-h\fR \fInum\fR | \fB-t\fR \fInum\fR] [\fB-v\fR] [\fIdirectory\fR]...
.fi

.SH DESCRIPTION
.sp
.LP
.B nislog
displays the contents of the NIS+ server transaction log on
the standard output. This command can be used to track changes in the
namespace. The
.B /var/nis/trans.log
file contains the transaction log
maintained by the NIS+ server. When updates occur, they are logged to this
file and then propagated to replicas as log transactions. When the log is
checkpointed, updates that have been propagated to the replicas are
removed.
.sp
.LP
The
.B nislog
command can only be run on an NIS+ server by superuser. It
displays the log entries for that server only.
.sp
.LP
If
.I directory
is not specified, the entire log is searched. Otherwise,
only those logs entries that correspond to the specified directories are
displayed.
.SH OPTIONS
.sp
.ne 2
.mk
.na
.B -h
.I num
.ad
.RS 10n
.rt
Display
.I num
transactions from the ``head'' of the log. If the numeric
parameter is
.BR 0 ,
only the log header is displayed.
.RE

.sp
.ne 2
.mk
.na
.B -t
.I num
.ad
.RS 10n
.rt
Display
.I num
transactions from the ``tail'' of the log. If the numeric
parameter is
.BR 0 ,
only the log header is displayed.
.RE

.sp
.ne 2
.mk
.na
.B -v
.ad
.RS 10n
.rt
Verbose mode.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B /var/nis/trans.log
.ad
.RS 22n
.rt
transaction log
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWnisu
.TE

.SH SEE ALSO
.sp
.LP
.BR NIS+ (1),
.BR rpc.nisd (1M),
.BR nisfiles (4),
.BR attributes (5)
.SH NOTES
.sp
.LP
NIS+ might not be supported in future releases of the Solaris operating
system. Tools to aid the migration from NIS+ to LDAP are available in the
current Solaris release. For more information, visit
http://www.sun.com/directory/nisplus/transition.html.
