usr/src/man/man1m/nispopulate.1m
'\" te
.\" Copyright (C) 2005, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" Copyright 1989 AT&T
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH nispopulate 1M "17 Aug 2006" "SunOS 5.11" "System Administration Commands"
.SH NAME
nispopulate \- populate the NIS+ tables in a NIS+ domain
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/nis/nispopulate\fR \fB-Y\fR [\fB-x\fR] [\fB-f\fR] [\fB-n\fR] [\fB-u\fR] [\fB-v\fR]
     [\fB-S\fR \fI0\fR | \fI2\fR] [\fB-l\fR <\fInetwork_passwd\fR>]
     [\fB-d\fR <\fINIS+_domain\fR>] \fB-h\fR <\fINIS_server_host\fR>
     [\fB-a\fR <\fINIS_server_addr\fR>] \fB-y\fR <\fINIS_domain\fR>
     [\fItable\fR] ...
.fi

.LP
.nf
\fB/usr/lib/nis/nispopulate\fR \fB-F\fR [\fB-x\fR] [\fB-f\fR] [\fB-u\fR] [\fB-v\fR] [\fB-S\fR 0 | 2]
     [\fB-d\fR <\fINIS+_domain\fR>] [\fB-l\fR <\fInetwork_passwd\fR>]
     [\fB-p\fR <\fIdirectory_path\fR>] [\fItable\fR] ...
.fi

.LP
.nf
\fB/usr/lib/nis/nispopulate\fR \fB-C\fR [\fB-x\fR] [\fB-f\fR] [\fB-v\fR]
     [\fB-d\fR <\fINIS+_domain\fR>] [\fB-l\fR <\fInetwork_passwd\fR>]
     [\fIhosts\fR | \fIpasswd\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The
.B nispopulate
shell script can be used to populate NIS+ tables in a
specified domain from their corresponding files or NIS maps.
.B nispopulate
assumes that the tables have been created either through
.BR nisserver (1M)
or
.BR nissetup (1M).
.sp
.LP
The table argument accepts standard names that are used in the
administration of Solaris systems and non-standard
.I key-value
type
tables. See
.BR nisaddent (1M)
for more information on
.I key-value
type
tables. If the table argument is not specified,
.B nispopulate
will
automatically populate each of the standard tables. These standard (default)
tables are:
.BR auto_master ,
.BR auto_home ,
.BR ethers ,
.BR group ,
.BR hosts ,
.BR ipnodes ,
.BR networks ,
.BR passwd ,
.BR protocols ,
.BR services ,
.BR rpc ,
.BR netmasks ,
.BR bootparams ,
.BR netgroup ,
.B aliases
and
.BR shadow .
Note that the
.B shadow
table is only
used when populating from files. The non-standard tables that
.B nispopulate
accepts are those of
.I key-value
type. These tables
must first be created manually with the
.BR nistbladm (1)
command.
.sp
.LP
Use the first synopsis
.RB ( -Y )
to populate NIS+ tables from NIS maps.
.B nispopulate
uses
.BR ypxfr (1M)
to transfer the NIS maps from the NIS
.RB "servers to the " /var/yp/ <\c
.IR NIS_domain >
directory on the local
machine. Then, it uses these files as the input source. Note that
.RI < NIS_domain >
is case sensitive. Make sure there is enough disk space
for that directory.
.sp
.LP
.RB "Use the second synopsis (" -F ") to populate " NIS+ " tables from local"
files.
.B nispopulate
will use those files that match the table name as
input sources in the current working directory or in the specified
directory.
.sp
.LP
Note that when populating the
.BR hosts ,
.BR ipnodes ,
and
.BR passwd
tables,
.B nispopulate
will automatically create the NIS+ credentials for
all users and
.B hosts
.RB ( ipnodes )
that are defined in the
.BR hosts ,
.BR ipnodes ,
and
.B passwd
tables, respectively. A network
passwd is required to create these credentials. This network password is
used to encrypt the secret key for the new users and hosts. This password
can be specified using the
.B -l
option or it will use the default
password,
.BR nisplus .
.B nispopulate
will not overwrite any existing
credential entries in the credential table. Use
.BR nisclient (1M)
to
overwrite the entries in the
.B cred
table. It creates both LOCAL and
.B DES
credentials for users, and only
.B DES
credentials for hosts.
To disable automatic credential creation, specify the "\fB-S\fR \fI0\fR"
option.
.sp
.LP
The third synopsis
.RB ( -C )
is used to populate
.B NIS+
credential
table with level 2 authentication
.RB ( DES )
from the
.BR hosts ,
.B ipnodes
and
.B passwd
tables of the specified domain. The valid
table arguments for this operation are
.BR hosts ,
.B ipnodes
and
.BR passwd .
If this argument is not specified then it will use
.BR hosts ,
.B ipnodes
and
.B passwd
as the input source. If other
authentication mechanisms are configured using
.BR nisauthconf (1M),
the
NIS+ credential table will be loaded with credentials for those
mechanisms.
.sp
.LP
If
.B
nispopulate
was earlier used with "\fB-S\fR \fI0\fR" option, then
no credentials were added for the hosts or the users. If later the site
decides to add credentials for all users and hosts, then this
.RB ( -C )
option can be used to add credentials.
.SH OPTIONS
.sp
.ne 2
.mk
.na
\fB-a\fR <\fINIS_server_addr\fR>\fR
.ad
.RS 24n
.rt
Specifies the
.B IP
address for the NIS server. This option is only used
with the
.B -Y
option.
.RE

.sp
.ne 2
.mk
.na
.B -C
.ad
.RS 24n
.rt
Populate the NIS+ credential table from
.BR hosts ,
.BR ipnodes ,
and
.B passwd
tables using
.B DES
authentication (security level 2). If
other authentication mechanisms are configured using
.BR nisauthconf (1M),
the NIS+ credential table will be populated with credentials for those
mechanisms.
.RE

.sp
.ne 2
.mk
.na
\fB-d\fR <\fINIS+_domain.\fR>\fR
.ad
.RS 24n
.rt
Specifies the NIS+ domain. The default is the local domain.
.RE

.sp
.ne 2
.mk
.na
.B -F
.ad
.RS 24n
.rt
Populates NIS+ tables from files.
.RE

.sp
.ne 2
.mk
.na
.B -f
.ad
.RS 24n
.rt
Forces the script to populate the NIS+ tables without prompting for
confirmation.
.RE

.sp
.ne 2
.mk
.na
\fB-h\fR <\fINIS_server_host\fR>\fR
.ad
.RS 24n
.rt
Specifies the NIS server hostname from where the NIS maps are copied from.
This is only used with the
.B -Y
option. This hostname must be present in
the NIS+
.B hosts
or
.B ipnodes
.RB "table, or in the" " /etc/hosts"
file. If the hostname is not defined, the script will prompt you for its
.B IP
address, or you can use the
.B -a
option to specify the address
manually.
.RE

.sp
.ne 2
.mk
.na
\fB-l\fR <\fInetwork_passwd\fR>\fR
.ad
.RS 24n
.rt
Specifies the network password for populating the NIS+ credential table.
This is only used when you are populating the
.BR hosts ,
.BR ipnodes ,
and \fBpasswd\fR tables. The default passwd is "nisplus".
.RE

.sp
.ne 2
.mk
.na
.B -n
.ad
.RS 24n
.rt
Does not overwrite local NIS maps in
.BR /var/yp/ <\fINISdomain\fR>
directory if they already exist. The default is to overwrite the existing
\fBNIS\fR maps in the local \fB/var/yp/\fR<\fINISdomain\fR> directory. This
is only used with the
.B -Y
option.
.RE

.sp
.ne 2
.mk
.na
\fB-p\fR <\fIdirectory_path\fR>\fR
.ad
.RS 24n
.rt
Specifies the directory where the files are stored. This is only used with
the
.B -F
option. The default is the current working directory.
.RE

.sp
.ne 2
.mk
.na
.B -S
.I 0|2
.ad
.RS 24n
.rt
Specifies the authentication level for the NIS+ clients. Level 0 is for
unauthenticated clients and no credentials will be created for users and
hosts in the specified domain. Level 2 is for authenticated
.RB ( DES )
clients and
.B DES
credentials will be created for users and hosts in the
specified domain. The default is to set up with level 2 authentication
(\fBDES\fR). There is no need to run \fBnispopulate\fR with
.B -C
for
level 0 authentication. Also, if other authentication mechanisms are
configured with
.BR nisauthconf (1M),
credentials for those mechanisms will
also be populated for the NIS+ clients.
.RE

.sp
.ne 2
.mk
.na
.B -u
.ad
.RS 24n
.rt
Updates the NIS+ tables (ie., adds, deletes, modifies) from either files or
NIS maps. This option should be used to bring an NIS+ table up to date when
there are only a small number of changes. The default is to add to the NIS+
tables without deleting any existing entries. Also, see the
.B -n
option
for updating NIS+ tables from existing maps in the
.B /var/yp
directory.
.RE

.sp
.ne 2
.mk
.na
.B -v
.ad
.RS 24n
.rt
Runs the script in verbose mode.
.RE

.sp
.ne 2
.mk
.na
.B -x
.ad
.RS 24n
.rt
Turns the "echo" mode on. The script just prints the commands that it would
have executed. Note that the commands are not actually executed. The default
is off.
.RE

.sp
.ne 2
.mk
.na
.B -Y
.ad
.RS 24n
.rt
Populate the NIS+ tables from NIS maps.
.RE

.sp
.ne 2
.mk
.na
\fB-y\fR <\fINIS_domain\fR>\fR
.ad
.RS 24n
.rt
Specifies the NIS domain to copy the NIS maps from. This is only used with
the
.B -Y
option. The default domainname is the same as the local
domainname.
.RE

.SH EXAMPLES
.LP
.B Example 1
Using
.BR nispopulate
.sp
.LP
.RI "To populate all the NIS+ standard tables in the domain" " xyz.sun.com."
from NIS maps of the
.I yp.sun.COM
domain as input source where host
.I yp_host
is a
.B YP
server of
.IR yp.sun.COM :

.sp
.in +2
.nf
nis_server# \fB/usr/lib/nis/nispopulate -Y -y yp.sun.COM \e
-h yp_host -d xyz.sun.com.\fR
.fi
.in -2
.sp

.sp
.LP
To update all of the NIS+ standard tables from the same NIS domain and
hosts shown above:

.sp
.in +2
.nf
nis_server# \fB/usr/lib/nis/nispopulate -Y -u -y yp.sun.COM -h yp_host \e
-d xyz.sun.com.\fR
.fi
.in -2
.sp

.sp
.LP
To populate the
.B hosts
table in domain
.I xyz.sun.com.
from the
.B hosts
file in the
.B /var/nis/files
directory and using
.B somepasswd
as the network password for key encryption:

.sp
.in +2
.nf
nis_server# \fB/usr/lib/nis/nispopulate -F -p \e
 /var/nis/files -l somepasswd hosts\fR
.fi
.in -2
.sp

.sp
.LP
To populate the
.B passwd
table in domain
.I xyz.sun.com.
from the
.B passwd
file in the
.B /var/nis/files
directory without
automatically creating the NIS+ credentials:

.sp
.in +2
.nf
nis_server# \fB/usr/lib/nis/nispopulate -F -p /var/nis/files \e
 -d xys.sun.com. -S 0 passwd\fR
.fi
.in -2
.sp

.sp
.LP
To populate the credential table in
.I "domain xyz.sun.com."
for all users
defined in the passwd table.

.sp
.in +2
.nf
nis_server# \fB/usr/lib/nis/nispopulate -C -d xys.sun.com. passwd\fR
.fi
.in -2
.sp

.sp
.LP
To create and populate a non-standard key-value type NIS+ table,
.BR private ,
from the file
.BR /var/nis/files/private :
(nispopulate assumes that the private.org_dirkey-value type table has
already been created).

.sp
.in +2
.nf
nis_server# \fB/usr/bin/nistbladm -D access=og=rmcd,nw=r \e
-c private key=S,nogw= value=,nogw= private.org.dir\fR
nis_server# \fB/usr/lib/nis/nispopulate -F -p /var/nis/files private\fR
.fi
.in -2
.sp

.SH ENVIRONMENT VARIABLES
.sp
.LP
.B nispopulate
normally creates temporary files in the directory
.BR /tmp .
You may specify another directory by setting the environment
variable
.B TMPDIR
to your chosen directory. If
.B TMPDIR
is not a
valid directory, then
.B nispopulate
will use
.BR /tmp ).
.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/inet/hosts
.ad
.RS 19n
.rt
local database associating names of nodes with IP addresses
.RE

.sp
.ne 2
.mk
.na
.B /var/yp
.ad
.RS 19n
.rt
NIS
.RB ( YP )
domain directory
.RE

.sp
.ne 2
.mk
.na
.B /var/nis
.ad
.RS 19n
.rt
NIS+ domain directory
.RE

.sp
.ne 2
.mk
.na
.B /tmp
.ad
.RS 19n
.rt

.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWnisu
.TE

.SH SEE ALSO
.sp
.LP
.BR NIS+ (1),
.BR nistbladm (1),
.BR nisaddcred (1M),
.BR nisaddent (1M),
.BR nisauthconf (1M),
.BR nisclient (
1M),
.BR nisserver (1M),
.BR nissetup (1M),
.BR rpc.nisd (1M),
.BR ypxfr (1M),
.BR attributes (5)
.SH NOTES
.sp
.LP
NIS+ might not be supported in future releases of the Solaris operating
system. Tools to aid the migration from NIS+ to LDAP are available in the
current Solaris release. For more information, visit
http://www.sun.com/directory/nisplus/transition.html.
