usr/src/man/man1m/nisrestore.1m
'\" te
.\" Copyright (C) 2004, Sun Microsystems, Inc. All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH nisrestore 1M "13 Aug 2004" "SunOS 5.11" "System Administration Commands"
.SH NAME
nisrestore \- restore NIS+ directory backup
.SH SYNOPSIS
.LP
.nf
\fBnisrestore\fR [\fB-fv\fR] \fIbackup-dir\fR \fIdirectory\fR...
.fi

.LP
.nf
\fBnisrestore\fR [\fB-fv\fR] \fB-a\fR \fIbackup-dir\fR
.fi

.LP
.nf
\fBnisrestore\fR \fB-t\fR \fIbackup-dir\fR
.fi

.SH DESCRIPTION
.sp
.LP
.B nisrestore
restores an existing backup of a NIS+ directory object
that was created using
.BR nisbackup "(1M). The"
.I backup-dir
is the UNIX
directory that contains the NIS+ backup on the server being restored. The
.B nisrestore
command can be used to restore a NIS+ directory object or a
complete NIS+ database. It also can be used as an "out of band" fast
replication for a new replica server being initialized. The
.BR rpc.nisd (1M)
daemon must be stopped before running
.BR nisrestore .
.sp
.LP
The first synopsis is used to restore a single directory object or a
specified list of directory objects. The directory can be partially
qualified or fully qualified. The server being restored will be verified
against the list of servers serving the directory. If this server is not
configured to serve this object,
.B nisrestore
will exit with an error.
The
.B -f
option will override this check and force the operation.
.sp
.LP
The second synopsis will restore all of the directory objects contained in
the
.IR backup-dir .
Again, the server will be validated against the
serving list for each of the directory objects in the
.IR backup-dir .
If
one of the objects in the
.I backup-dir
are not served by this server,
.B nisrestore
will exit with an error. The
.B -f
option will override
this check and force the operation.
.sp
.LP
The
.B -a
option will attempt to restore all NIS+ objects contained in
the
.IR backup-dir .
If any of these objects are not served by the server,
.B nisrestore
will exit with an error. If the
.I backup-dir
contains
objects that are not served by the server,
.B nisrestore
must be executed
without the
.B -a
option and the specific directory objects listed.
.sp
.LP
The
.B -f
option will disable verification of the server being
configured to serve the objects being restored. This option should be used
with care, as data could be inadvertently restored to a server that doesn't
serve the restored data. This option is required in the case of restoring a
single server domain (master server only) or if the other NIS+ servers are
unavailable for NIS+ lookups.
.sp
.LP
The combination of options
.B -f
and
.B -a
should be used with
caution, as no validation of the server serving the restored objects will be
done.
.sp
.LP
New replicas can be quickly added to a namespace with the
.BR nisrestore
command. The steps are as follows.
.sp
.LP
Configure the new replica on the master server (see
.BR nisserver (1M)):
.sp
.in +2
.nf
master# \fBnisserver -R -h replica\fR
.fi
.in -2
.sp

.sp
.LP
Temporarily stop the
.B rpc.nisd
server process on the new replica
server:
.sp
.in +2
.nf
replica# \fBsvcadm disable -t network/rpc/nisplus:default\fR
.fi
.in -2
.sp

.sp
.LP
Create a backup of the NIS+ database on the master, which will include the
new replica information. See
.BR nisbackup (1M).
The
.B /backup
will
need to be exported to the new replica. See \fBshare_nfs\fR(1M).
.sp
.in +2
.nf
master# \fBnisbackup -a /backup\fR
.fi
.in -2
.sp

.sp
.LP
Restore the backup of the NIS+ database on the new replica. Use the
.B -f
option if
.B nisrestore
is unable to lookup the NIS+ objects
being restored. The backup should be available through nfs or similar means.
See
.BR share_nfs (1M).
.sp
.in +2
.nf
replica# nisrestore -f -a //nfs-mnt/backup
.fi
.in -2
.sp

.sp
.LP
Restart the
.BR rpc.nisd "(1M) process on the new replica, and the server"
will immediately be available for service:
.sp
.in +2
.nf
replica# svcadm enable network/rpc/nisplus:default
.fi
.in -2
.sp

.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -a
.ad
.RS 6n
.rt
Restores all directory objects included in the
.IR backup-dir
partition.
.RE

.sp
.ne 2
.mk
.na
.B -f
.ad
.RS 6n
.rt
Forces the restoration of a directory without the validation of the server
in the directory object's serving list.
.RE

.sp
.ne 2
.mk
.na
.B -t
.ad
.RS 6n
.rt
Lists all directory objects contained in
.IR backup-dir .
.RE

.sp
.ne 2
.mk
.na
.B -v
.ad
.RS 6n
.rt
Verbose option. Additional output will be produced upon execution of the
command.
.RE

.SH OPERANDS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.I backup-dir
.ad
.RS 14n
.rt
The UNIX directory that contains the data files for the NIS+ directory
objects to be restored.
.RE

.sp
.ne 2
.mk
.na
.I directory
.ad
.RS 14n
.rt
The NIS+ directory object(s) to be restored. This can be a fully or
partially qualified name.
.RE

.SH EXAMPLES
.LP
.B Example 1
Restoring the Directory Object on a Replica Server from a
Local UFS Partition
.sp
.LP
To restore the
.B org_dir
directory object of the domain \fBfoo.com\fR
on a replica server from a local ufs partition named
.BR /var/backup :

.sp
.in +2
.nf
replica_server# \fBnisrestore /var/backup org_dir.foo.com.\fR
.fi
.in -2
.sp

.LP
.B Example 2
Forcing the Restore of a Backed up NIS+ Namespace to a
Replica Server From the Backup Partition
.sp
.LP
To force the restore of an entire backed up NIS+ namespace to a replica
server from the backup partition named
.BR /var/backup :

.sp
.in +2
.nf
replica_server# \fBnisrestore -f -a /var/backup\fR
.fi
.in -2
.sp

.LP
.B Example 3
Restoring the Subdomain on a Master Server From a Backup
that Includes Other Directory Objects
.sp
.LP
To restore the subdomain
.B sub.foo.com
on a master server, from a
backup that includes other directory objects:

.sp
.in +2
.nf
master_server# \fBnisrestore /var/backup sub.foo.com. \e
 org_dir.sub.foo.com. groups_dir.sub.foo.com.\fR
.fi
.in -2
.sp

.SH EXIT STATUS
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 5n
.rt
Successful completion.
.RE

.sp
.ne 2
.mk
.na
.B 1
.ad
.RS 5n
.rt
An error occurred.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
\fI/backup-dir/\fBbackup_list\fR
.ad
.sp .6
.RS 4n
This ASCII file contains a list of all the objects contained in this
.I backup-dir
directory. This information can be displayed with the
.B -t
option.
.RE

.sp
.ne 2
.mk
.na
.I /backup-dir/directory-object
.ad
.sp .6
.RS 4n
A subdirectory that is created in the
.I backup-dir
which contains the
directory-object backup.
.RE

.sp
.ne 2
.mk
.na
\fI/backup-dir/directory-object/\fBdata\fR
.ad
.sp .6
.RS 4n
A subdirectory that contains the data files that are part of the
directory-object backup.
.RE

.sp
.ne 2
.mk
.na
\fI/backup-dir/directory-object/\fBlast.upd\fR
.ad
.sp .6
.RS 4n
This data file contains timestamp information about the directory-object.
.RE

.sp
.ne 2
.mk
.na
\fI/backup-dir/directory-object/\fBdata.dict\fR
.ad
.sp .6
.RS 4n
A NIS+ data dictionary for all of the objects contained in this
directory-object backup.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWnisu
.TE

.SH SEE ALSO
.sp
.LP
.BR svcs (1),
.BR NIS+ (1),
.BR nisdefaults (1),
.BR nisbackup (1M),
.BR nisserver (1M),
.BR rpc.nisd (1M),
.BR share_nfs (
1M),
.BR svcadm (1M),
.BR nisfiles (4),
.BR attributes (5),
.BR smf (5)
.SH NOTES
.sp
.LP
NIS+ might not be supported in future releases of the Solaris Operating
system. Tools to aid the migration from NIS+ to LDAP are available in the
current Solaris release. For more information, visit
http://www.sun.com/directory/nisplus/transition.html.
.sp
.LP
The NIS+ service is managed by the service management facility,
.BR smf (5),
under the service identifier:
.sp
.in +2
.nf
svc:/network/rpc/nisplus:default
.fi
.in -2
.sp

.sp
.LP
Administrative actions on this service, such as enabling, disabling, or
requesting restart, can be performed using
.BR svcadm (1M).
The service's
status can be queried using the
.BR svcs (1)
command.
