usr/src/man/man1m/nisstat.1m
'\" te
.\" Copyright (C) 2001, Sun Microsystems, Inc. All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH nisstat 1M "12 Dec 2001" "SunOS 5.11" "System Administration Commands"
.SH NAME
nisstat \- report NIS+ server statistics
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/nis/nisstat\fR [\fB-H\fR \fIhost\fR] [\fIdirectory\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The \fBnisstat\fR command queries a NIS+ server for various statistics
about its operations. These statistics may vary between implementations and
from release to release. Not all statistics are available from all servers.
If you request a statistic from a server that does not support that
statistic, it is never a fatal error. The message "unknown statistic" is
returned.
.sp
.LP
By default, statistics are fetched from the server(s) of the NIS+ directory
for the default domain. If \fIdirectory\fR is specified, servers for that
directory are queried.
.sp
.LP
Supported statistics for this release are as follows:
.sp
.ne 2
.mk
.na
\fIroot server\fR
.ad
.RS 30n
.rt
This reports whether the server is a root server.
.RE

.sp
.ne 2
.mk
.na
\fINIS compat mode\fR
.ad
.RS 30n
.rt
This reports whether the server is running in NIS compat mode.
.RE

.sp
.ne 2
.mk
.na
\fIDNS forwarding in NIS mode\fR
.ad
.RS 30n
.rt
This reports whether the server in NIS compat mode will forward host lookup
calls to DNS.
.RE

.sp
.ne 2
.mk
.na
\fIsecurity level\fR
.ad
.RS 30n
.rt
This reports the security level of this server.
.RE

.sp
.ne 2
.mk
.na
\fIserves directories\fR
.ad
.RS 30n
.rt
This lists the directories served by this server.
.RE

.sp
.ne 2
.mk
.na
\fIOperations\fR
.ad
.RS 30n
.rt
This statistic returns results in the form:
\fBOP=\fIopname\fB:C=\fIcalls\fB:E=\fIerrors\fB:T=\fImicros\fR
Where \fIopname\fR is replaced by the RPC procedure name or operation,
\fIcalls\fR is the number of calls to this procedure that have been made
since the server started running. \fIerrors\fR is the number of errors that
have occurred while processing a call, and \fImicros\fR is the average time
in microseconds to complete the last 16 calls.
.RE

.sp
.ne 2
.mk
.na
\fIDirectory Cache\fR
.ad
.RS 30n
.rt
This statistic reports the number of calls to the internal directory object
cache, the number of hits on that cache, the number of misses, and the hit
rate percentage.
.RE

.sp
.ne 2
.mk
.na
\fIGroup Cache\fR
.ad
.RS 30n
.rt
This statistic reports the number of calls to the internal NIS+ group
object cache, the number of hits on that cache, the number of misses, and
the hit rate percentage.
.RE

.sp
.ne 2
.mk
.na
\fIStatic Storage\fR
.ad
.RS 30n
.rt
This statistic reports the number of bytes the server has allocated for its
static storage buffers.
.RE

.sp
.ne 2
.mk
.na
\fIDynamic Storage\fR
.ad
.RS 30n
.rt
This statistic reports the amount of heap the server process is currently
using.
.RE

.sp
.ne 2
.mk
.na
\fIUptime\fR
.ad
.RS 30n
.rt
This statistic reports the time since the service has been running.
.RE

.sp
.LP
Per-server and per-directory access restrictions may apply. See
\fBnisopaccess\fR(1). \fBnisstat\fR uses \fBNIS_STATUS\fR.
.SH OPTIONS
.sp
.ne 2
.mk
.na
\fB-H\fR \fIhost\fR
.ad
.RS 11n
.rt
Normally all servers for the directory are queried. With this option, only
the machine named \fIhost\fR is queried. If the named machine does not serve
the directory, no statistics are returned.
.RE

.SH ENVIRONMENT VARIABLES
.sp
.ne 2
.mk
.na
\fBNIS_PATH\fR
.ad
.RS 12n
.rt
If this variable is set, and the NIS+ directory name is not fully
qualified, each directory specified will be searched until the directory is
found. See \fBnisdefaults\fR(1).
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWnisu
.TE

.SH SEE ALSO
.sp
.LP
\fBnisdefaults\fR(1), \fBnisopaccess\fR(1), \fBattributes\fR(5)
.SH NOTES
.sp
.LP
NIS+ might not be supported in future releases of the Solaris Operating
system. Tools to aid the migration from NIS+ to LDAP are available in the
current Solaris release. For more information, visit
http://www.sun.com/directory/nisplus/transition.html.
