usr/src/man/man1m/nisserver.1m
'\" te
.\" Copyright 1989 AT&T
.\" Copyright (C) 2001, Sun Microsystems, Inc. All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH nisserver 1M "13 Dec 2001" "SunOS 5.11" "System Administration Commands"
.SH NAME
nisserver \- set up NIS+ servers
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/nis/nisserver\fR \fB-r\fR [\fB-x\fR] [\fB-f\fR] [\fB-v\fR] [\fB-Y\fR]
     [\fB-d\fR \fINIS+_domain\fR] [\fB-g\fR \fINIS+_groupname\fR]
     [\fB-l\fR \fInetwork_passwd\fR]
.fi

.LP
.nf
\fB/usr/lib/nis/nisserver\fR \fB-M\fR [\fB-x\fR] [\fB-f\fR] [\fB-v\fR] [\fB-Y\fR] \fB-d\fR \fINIS+_domain\fR
     [\fB-g\fR \fINIS+_groupname\fR]
     [\fB-h\fR \fINIS+_server_host\fR]
.fi

.LP
.nf
\fB/usr/lib/nis/nisserver\fR \fB-R\fR [\fB-x\fR] [\fB-f\fR] [\fB-v\fR] [\fB-Y\fR]
     [\fB-d\fR \fINIS+_domain\fR] [\fB-h\fR \fINIS+_server_host\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The
.B nisserver
shell script can be used to set up a root master,
non-root master, and replica NIS+ server with level 2 security (DES). If
other authentication mechanisms are configured with \fBnisauthconf\fR(1M),
.B nisserver
will set up a
.B NIS+
server using those mechanisms.
.BR nisauthconf (1M)
should be used before
.BR nisserver .
.sp
.LP
When setting up a new domain, this script creates the NIS+ directories
(including
.B groups_dir
and
.BR org_dir )
and system table objects for
the domain specified. It does not populate the tables.
.BR nispopulate (1M)
must be used to populate the tables.
.SH OPTIONS
.sp
.ne 2
.mk
.na
.B -d
.I NIS+_domain
.ad
.RS 23n
.rt
Specifies the name for the NIS+ domain. The default is your local domain.
.RE

.sp
.ne 2
.mk
.na
.B -f
.ad
.RS 23n
.rt
Forces the NIS+ server setup without prompting for confirmation.
.RE

.sp
.ne 2
.mk
.na
.B -g
.I NIS+_groupname
.ad
.RS 23n
.rt
Specifies the NIS+ group name for the new domain. This option is not valid
with
.B -R
option. The default group is admin.<domain>.
.RE

.sp
.ne 2
.mk
.na
.B -h
.I NIS+_server_host
.ad
.RS 23n
.rt
Specifies the hostname for the NIS+ server. It must be a valid host in the
local domain. Use a fully qualified hostname (for example,
.IR hostx.xyz.sun.com. )
to specify a host outside of your local domain.
This option is
.I only
used for setting up non-root master or replica
servers. The default for non-root master server setup is to use the same
list of servers as the parent domain. The default for replica server setup
is the local hostname.
.RE

.sp
.ne 2
.mk
.na
.B -l
.I network_password
.ad
.RS 23n
.rt
Specifies the network password with which to create the credentials for the
root master server. This option is
.I only
used for master root server
setup (\fB-r\fR option). If this option is not specified, the script prompts
you for the login password.
.RE

.sp
.ne 2
.mk
.na
.B -M
.ad
.RS 23n
.rt
Sets up the specified host as a master server. Make sure that
.BR rpc.nisd (1M)
is running on the new master server before this command
is executed.
.RE

.sp
.ne 2
.mk
.na
.B -R
.ad
.RS 23n
.rt
Sets up the specified host as a replica server. Make sure that
.B rpc.nisd
is running on the new replica server.
.RE

.sp
.ne 2
.mk
.na
.B -r
.ad
.RS 23n
.rt
Sets up the server as a root master server. Use the
.B -R
option to set
up a root replica server.
.RE

.sp
.ne 2
.mk
.na
.B -v
.ad
.RS 23n
.rt
Runs the script in verbose mode.
.RE

.sp
.ne 2
.mk
.na
.B -x
.ad
.RS 23n
.rt
Turns the echo mode on. The script just prints the commands that it would
have executed. Note that the commands are not actually executed. The default
is off.
.RE

.sp
.ne 2
.mk
.na
.B -Y
.ad
.RS 23n
.rt
Sets up a NIS+ server with NIS-compatibility mode. The default is to set up
the server without NIS-compatibility mode.
.RE

.SH USAGE
.sp
.LP
Use the first synopsis of the command (\fB-r\fR) to set up a root master
server. To run the command, you must be logged in as super-user on the
server machine.
.sp
.LP
Use the second synopsis of the command (\fB-M\fR) to set up a non-root
master server for the specified domain. To run the command, you must be
logged in as a NIS+ principal on a NIS+ machine and have write permission to
the parent directory of the domain that you are setting up. The new non-root
master server machine must already be an NIS+ client (see
.BR nisclient (1M))
and have the
.BR rpc.nisd "(1M) daemon running."
.sp
.LP
Use the third synopsis of the command (\fB-R\fR) to set up a replica server
for both root and non-root domains. To run the command, you must be logged
in as a NIS+ principal on a NIS+ machine and have write permission to the
parent directory of the domain that you are replicating. The new non-root
replica server machine must already be an NIS+ client and have the
.B rpc.nisd
daemon running.
.SH EXAMPLES
.LP
.B Example 1
Setting up Servers
.sp
.LP
To set up a root master server for domain
.BR sun.com. :

.sp
.in +2
.nf
root_server# \fB/usr/lib/nis/nisserver -r -d sun.com.\fR
.fi
.in -2
.sp

.sp
.LP
For the following examples make sure that the new servers are NIS+ clients
and that
.B rpc.nisd
is running on these hosts before executing
.BR nisserver .
To set up a replica server for the
.B sun.com.
domain on
host
.IR sunreplica :

.sp
.in +2
.nf
root_server# \fB/usr/lib/nis/nisserver -R -d sun.com. -h sunrep\fR
.fi
.in -2
.sp

.sp
.LP
To set up a non-root master server for domain
.I xyz.sun.com.
on host
.I sunxyz
with the NIS+ groupname as
.IR admin-mgr.xyz.sun.com. :

.sp
.in +2
.nf
root_server# \fB/usr/lib/nis/nisserver -M -d xyz.sun.com. -h sunxyz \e
-g admin-mgr.xyz.sun.com.\fR
.fi
.in -2
.sp

.sp
.LP
To set up a non-root replica server for domain
.I xyz.sun.com.
on host
.IR sunabc :

.sp
.in +2
.nf
sunxyz# \fB/usr/lib/nis/nisserver -R -d xyz.sun.com. -h sunabc\fR
.fi
.in -2
.sp

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.sp
.LP
.BR NIS+ (1),
.BR nisgrpadm (1),
.BR nismkdir (1),
.BR nisaddcred (1M),
.BR nisauthconf (1M),
.BR nisclient (1M),
.BR nisinit (1M),
.BR nispopulate (1M),
.BR nisprefadm (1M),
.BR nissetup (1M),
.BR rpc.nisd (1M),
.BR " attributes" (5)
.SH NOTES
.sp
.LP
NIS+ might not be supported in future releases of the Solaris Operating
system. Tools to aid the migration from NIS+ to LDAP are available in the
current Solaris release. For more information, visit
http://www.sun.com/directory/nisplus/transition.html.
