usr/src/man/man1m/nisstat.1m
'\" te
.\" Copyright (C) 2001, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH nisstat 1M "12 Dec 2001" "SunOS 5.11" "System Administration Commands"
.SH NAME
nisstat \- report NIS+ server statistics
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/nis/nisstat\fR [\fB-H\fR \fIhost\fR] [\fIdirectory\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The
.B nisstat
command queries a NIS+ server for various statistics
about its operations. These statistics may vary between implementations and
from release to release. Not all statistics are available from all servers.
If you request a statistic from a server that does not support that
statistic, it is never a fatal error. The message "unknown statistic" is
returned.
.sp
.LP
By default, statistics are fetched from the server(s) of the NIS+ directory
for the default domain. If
.I directory
is specified, servers for that
directory are queried.
.sp
.LP
Supported statistics for this release are as follows:
.sp
.ne 2
.mk
.na
.I root server
.ad
.RS 30n
.rt
This reports whether the server is a root server.
.RE

.sp
.ne 2
.mk
.na
.I NIS compat mode
.ad
.RS 30n
.rt
This reports whether the server is running in NIS compat mode.
.RE

.sp
.ne 2
.mk
.na
.I DNS forwarding in NIS mode
.ad
.RS 30n
.rt
This reports whether the server in NIS compat mode will forward host lookup
calls to DNS.
.RE

.sp
.ne 2
.mk
.na
.I security level
.ad
.RS 30n
.rt
This reports the security level of this server.
.RE

.sp
.ne 2
.mk
.na
.I serves directories
.ad
.RS 30n
.rt
This lists the directories served by this server.
.RE

.sp
.ne 2
.mk
.na
.I Operations
.ad
.RS 30n
.rt
This statistic returns results in the form:
\fBOP=\fIopname\fB:C=\fIcalls\fB:E=\fIerrors\fB:T=\fImicros\fR
Where
.I opname
is replaced by the RPC procedure name or operation,
.I calls
is the number of calls to this procedure that have been made
since the server started running.
.I errors
is the number of errors that
have occurred while processing a call, and
.I micros
is the average time
in microseconds to complete the last 16 calls.
.RE

.sp
.ne 2
.mk
.na
.I Directory Cache
.ad
.RS 30n
.rt
This statistic reports the number of calls to the internal directory object
cache, the number of hits on that cache, the number of misses, and the hit
rate percentage.
.RE

.sp
.ne 2
.mk
.na
.I Group Cache
.ad
.RS 30n
.rt
This statistic reports the number of calls to the internal NIS+ group
object cache, the number of hits on that cache, the number of misses, and
the hit rate percentage.
.RE

.sp
.ne 2
.mk
.na
.I Static Storage
.ad
.RS 30n
.rt
This statistic reports the number of bytes the server has allocated for its
static storage buffers.
.RE

.sp
.ne 2
.mk
.na
.I Dynamic Storage
.ad
.RS 30n
.rt
This statistic reports the amount of heap the server process is currently
using.
.RE

.sp
.ne 2
.mk
.na
.I Uptime
.ad
.RS 30n
.rt
This statistic reports the time since the service has been running.
.RE

.sp
.LP
Per-server and per-directory access restrictions may apply. See
.BR nisopaccess (1).
.B nisstat
uses
.BR NIS_STATUS .
.SH OPTIONS
.sp
.ne 2
.mk
.na
.B -H
.I host
.ad
.RS 11n
.rt
Normally all servers for the directory are queried. With this option, only
the machine named
.I host
is queried. If the named machine does not serve
the directory, no statistics are returned.
.RE

.SH ENVIRONMENT VARIABLES
.sp
.ne 2
.mk
.na
.B NIS_PATH
.ad
.RS 12n
.rt
If this variable is set, and the NIS+ directory name is not fully
qualified, each directory specified will be searched until the directory is
found. See
.BR nisdefaults (1).
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWnisu
.TE

.SH SEE ALSO
.sp
.LP
.BR nisdefaults (1),
.BR nisopaccess (1),
.BR attributes (5)
.SH NOTES
.sp
.LP
NIS+ might not be supported in future releases of the Solaris Operating
system. Tools to aid the migration from NIS+ to LDAP are available in the
current Solaris release. For more information, visit
http://www.sun.com/directory/nisplus/transition.html.
