usr/src/man/man1m/nisupdkeys.1m
'\" te
.\" Copyright (C) 2001, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH nisupdkeys 1M "13 Dec 2001" "SunOS 5.11" "System Administration Commands"
.SH NAME
nisupdkeys \- update the public keys in a NIS+ directory object
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/nis/nisupdkeys\fR [\fB-a\fR | \fB-C\fR] [\fB-H\fR \fIhost\fR] [\fIdirectory\fR]
.fi

.LP
.nf
\fB/usr/lib/nis/nisupdkeys\fR \fB-s\fR [\fB-a\fR | \fB-C\fR] \fB-H\fR \fIhost\fR
.fi

.SH DESCRIPTION
.sp
.LP
This command updates the public keys in an NIS+ directory object. When the
public key(s) for a NIS+ server are changed,
.B nisupdkeys
reads a
directory object and attempts to get the public key data for each server of
that directory. These keys are placed in the directory object and the object
is then modified to reflect the new keys. If
.I directory
is present, the
directory object for that directory is updated. Otherwise the directory
object for the default domain is updated. The new key must be propagated to
all directory objects that reference that server.
.sp
.LP
On the other hand,
.B "nisupdkeys -s"
gets a list of all the
directories served by
.I host
and updates those directory objects. This
assumes that the caller has adequate permission to change all the associated
directory objects. The list of directories being served by a given server
can also be obtained by
.BR nisstat (1M).
Before you do this operation,
make sure that the new address/public key has been propagated to all
replicas. If multiple authentication mechanisms are configured using
.BR nisauthconf (1M),
then the keys for those mechanisms will also be
updated or cleared.
.sp
.LP
The user executing this command must have modify access to the directory
object for it to succeed. The existing directory object can be displayed
with the
.BR niscat (1)
command using the
.B -o
option.
.sp
.LP
This command does not update the directory objects stored in the
.B NIS_COLD_START
file on the NIS+ clients.
.sp
.LP
If a server is also the root master server, then
.B "nisupdkeys -s"
cannot be used to update the root directory.
.SH OPTIONS
.sp
.ne 2
.mk
.na
.B -a
.ad
.RS 11n
.rt
Update the universal addresses of the NIS+ servers in the directory object.
Currently, this only works for the
.B TCP/IP
family of transports. This
option should be used when the
.B IP
address of the server is changed.
The server's new address is resolved using
.BR getipnodebyname (3SOCKET)
on
this machine. The
.B /etc/nsswitch.conf
file must point to the correct
source for
.I ipnodes
and
.I hosts
for this resolution to work.
.RE

.sp
.ne 2
.mk
.na
.B -C
.ad
.RS 11n
.rt
Specify to clear rather than set the public key(s). Communication with a
server that has no public key(s) does not require the use of secure RPC.
.RE

.sp
.ne 2
.mk
.na
.B -H
.I host
.ad
.RS 11n
.rt
Limit key changes only to the server named
.IR host .
If the hostname is
not a fully qualified NIS+ name, then it is assumed to be a host in the
default domain. If the named host does not serve the directory, no action is
taken.
.RE

.sp
.ne 2
.mk
.na
.B -s
.ad
.RS 11n
.rt
Update all the NIS+ directory objects served by the specified server. This
assumes that the caller has adequate access rights to change all the
associated directory objects. If the NIS+ principal making this call does
not have adequate permissions to update the directory objects, those
particular updates will fail and the caller will be notified. If the
.B rpc.nisd
on
.I host
cannot return the list of servers it serves,
the command will print an error message. The caller would then have to
invoke
.B nisupdkeys
multiple times (as in the first synopsis), once per
NIS+ directory that it serves.
.RE

.SH EXAMPLES
.LP
.B Example 1
Using
.BR nisupdkeys
.sp
.LP
The following example updates the keys for servers of the
.I foo.bar.
domain.

.sp
.in +2
.nf
example% \fBnisupdkeys foo.bar.\fR
.fi
.in -2
.sp

.sp
.LP
This example updates the key(s) for host
.I fred
that serves the
.I foo.bar.
domain.

.sp
.in +2
.nf
example% \fBnisupdkeys -H fred foo.bar.\fR
.fi
.in -2
.sp

.sp
.LP
This example clears the public key(s) for host
.I wilma
in the
.I foo.bar.
directory.

.sp
.in +2
.nf
example% \fBnisupdkeys -CH wilma foo.bar.\fR
.fi
.in -2
.sp

.sp
.LP
This example updates the public key(s) in all directory objects that are
served by the host
.IR wilma .

.sp
.in +2
.nf
example% \fBnisupdkeys -s -H wilma\fR
.fi
.in -2
.sp

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWnisu
.TE

.SH SEE ALSO
.sp
.LP
.BR chkey (1),
.BR niscat (1),
.BR nisaddcred (1M),
.BR nisauthconf (1M),
.BR nisstat (1M),
.BR getipnodebyname (3SOCKET),
.BR nis_objects (3NSL),
.BR attributes (5)
.SH NOTES
.sp
.LP
NIS+ might not be supported in future releases of the Solaris Operating
system. Tools to aid the migration from NIS+ to LDAP are available in the
current Solaris release. For more information, visit
http://www.sun.com/directory/nisplus/transition.html.
