usr/src/man/man1m/nlsadmin.1m
'\" te
.\" Copyright 1989 AT&T  Copyright (c) 1997 Sun Microsystems, Inc.  All Rights Reserved.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH nlsadmin 1M "3 Apr 1997" "SunOS 5.11" "System Administration Commands"
.SH NAME
nlsadmin \- network listener service administration
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/nlsadmin\fR \fB-x\fR
.fi

.LP
.nf
\fB/usr/sbin/nlsadmin\fR [\fIoptions\fR] \fInet_spec\fR
.fi

.LP
.nf
\fB/usr/sbin/nlsadmin\fR [\fIoptions\fR] \fB-N\fR \fIport_monitor_tag\fR
.fi

.LP
.nf
\fB/usr/sbin/nlsadmin\fR \fB-V\fR
.fi

.LP
.nf
\fB/usr/sbin/nlsadmin\fR \fB-c\fR \fIcmd\fR | \fB-o\fR \fIstreamname\fR [\fB-p\fR \fImodules\fR]
     [\fB-A\fR \fIaddress\fR | \fB-D\fR] [\fB-R\fR \fIprognum\fR : \fIversnum\fR]
.fi

.SH DESCRIPTION
.sp
.LP
.B nlsadmin
is the administrative command for the network listener
process(es) on a machine. Each network has at least one instance of the network
listener process associated with it; each instance (and thus, each network) is
configured separately. The listener process ``listens'' to the network for
service requests, accepts requests when they arrive, and invokes servers in
response to those service requests. The network listener process may be used with
any network (more precisely, with any connection-oriented transport provider)
that conforms to the transport provider specification.
.sp
.LP
.B nlsadmin
can establish a listener process for a given network, configure
the specific attributes of that listener, and start and kill the listener process
for that network.
.B nlsadmin
can also report on the listener processes on a
machine, either individually (per network) or collectively.
.sp
.LP
.I net_spec
represents a particular listener process. Specifically,
.I net_spec
is the relative path name of the entry under
.B /dev
for a
given network (that is, a transport provider).
.I address
is a transport
address on which to listen and is interpreted using a syntax that allows for a
variety of address formats. By default,
.I address
is interpreted as the
symbolic ASCII representation of the transport address. An
.I address
preceded
by \fB\ex\fR will let you enter an address in hexadecimal notation. Note that
.I address
must appear as a single word to the shell, thus it must be quoted
if it contains any blanks.
.sp
.LP
Changes to the list of services provided by the listener or the addresses of
those services are put into effect immediately.
.SH OPTIONS
.sp
.LP
.B nlsadmin
may be used with the following combinations of options and
arguments:
.sp
.ne 2
.mk
.na
.B -x
.ad
.sp .6
.RS 4n
Report the status of all of the listener processes installed on this machine.
.RE

.sp
.ne 2
.mk
.na
.I net_spec
.ad
.sp .6
.RS 4n
Print the status of the listener process for
.I net_spec
\fI\&.\fR
.RE

.sp
.ne 2
.mk
.na
.B -q
.I net_spec
.ad
.sp .6
.RS 4n
Query the status of the listener process for the specified network, and reflects
the result of that query in its exit code. If a listener process is active,
.B nlsadmin
will exit with a status of
.BR 0 ;
if no process is active, the
exit code will be
.BR 1 ;
the exit code will be greater than
.B 1
in case of
error.
.RE

.sp
.ne 2
.mk
.na
.B -v
.I net_spec
.ad
.sp .6
.RS 4n
Print a verbose report on the servers associated with
.I net_spec,
giving the
service code, status, command, and comment for each. It also specifies the
.B uid
the server will run as and the list of modules to be pushed, if any,
before the server is started.
.RE

.sp
.ne 2
.mk
.na
.B -z
.I service_code net_spec
.ad
.sp .6
.RS 4n
Print a report on the server associated with
.I net_spec
that has service
code
.I service_code,
giving the same information as in the
.B -v
option.
.RE

.sp
.ne 2
.mk
.na
.B -q -z
.I service_code net_spec
.ad
.sp .6
.RS 4n
Query the status of the service with service code
.I service_code
on network
.I net_spec,
and exits with a status of
.B 0
if that service is enabled,
.B 1
if that service is disabled, and greater than
.B 1
in case of error.
.RE

.sp
.ne 2
.mk
.na
.B -l
.I address net_spec
.ad
.sp .6
.RS 4n
Change or set the transport address on which the listener listens (the general
listener service). This address can be used by remote processes to access the
servers available through this listener (see the
.B -a
option, below).
.sp
If \fIaddress\fR is just a dash (" \(mi "), \fBnlsadmin\fR reports the address
currently configured, instead of changing it.
.sp
A change of address takes effect immediately.
.RE

.sp
.ne 2
.mk
.na
.B -t
.I address net_spec
.ad
.sp .6
.RS 4n
Change or set the address on which the listener listens for requests for
terminal service but is otherwise similar to the
.B -l
option above. A
terminal service address should not be defined unless the appropriate remote
login software is available; if such software is available, it must be configured
as service code 1 (see the
.B -a
option, below).
.RE

.sp
.ne 2
.mk
.na
.B -i
.I net_spec
.ad
.sp .6
.RS 4n
Initialize an instance of the listener for the network specified by
.I net_spec;
that is, create and initialize the files required by the listener
as well as starting that instance of the listener. Note that a particular
instance of the listener should be initialized only once. The listener must be
initialized before assigning addresses or services.
.RE

.sp
.ne 2
.mk
.na
.B -a
.I service_code
.ad
.sp .6
.RS 4n
[ \fB-p\fR \fImodules\fR ] [  \fB-w\fR \fIname\fR ] \fB-c\fR \fIcmd\fR \fB-y\fR
.I comment net_spec
.sp
Add a new service to the list of services available through the indicated
listener.
.I service_code
is the code for the service,
.I cmd
is the
command to be invoked in response to that service code, comprised of the full
path name of the server and its arguments, and
.I comment
is a brief
(free-form) description of the service for use in various reports. Note that
.I cmd
must appear as a single word to the shell; if arguments are required,
the
.I cmd
and its arguments must be enclosed in quotation marks. The
.I comment
must also appear as a single word to the shell. When a service is
added, it is initially enabled (see the
.B -e
and
.B -d
options, below).
.sp
Service codes are alphanumeric strings, and are administered by AT&T. The
numeric service codes 0 through 100 are reserved for internal use by the
listener. Service code 0 is assigned to the nlps server, which is the service
invoked on the general listening address. In particular, code 1 is assigned to
the remote login service, which is the service automatically invoked for
connections to the terminal login address.
.sp
If the
.B -p
option is specified, then
.I modules
will be interpreted as a
list of
.B STREAMS
modules for the listener to push before starting the
service being added. The modules are pushed in the order they are specified.
.I modules
should be a comma-separated list of modules, with no white space
included.
.sp
If the
.B -w
option is specified, then
.I name
is interpreted as the user
name from
.B /etc/passwd
that the listener should look up. From the user name,
the listener obtains the user ID, the group ID(s), and the home directory for use
by the server. If
.B -w
is not specified, the default is to use the user name
.B listen.
.sp
A service must explicitly be added to the listener for each network on which
that service is to be available. This operation will normally be performed only
when the service is installed on a machine, or when populating the list of
services for a new network.
.RE

.sp
.ne 2
.mk
.na
.B -r
.I service_code net_spec
.ad
.sp .6
.RS 4n
Remove the entry for the
.I service_code
from that listener's list of
services. This is normally done only in conjunction with the de-installation of a
service from a machine.
.RE

.sp
.ne 2
.mk
.na
.B -e
.I service_code net_spec
.ad
.br
.na
.B -d
.I service_code net_spec
.ad
.sp .6
.RS 4n
Enable or disable (respectively) the service indicated by
.I service_code
for
the specified network. The service must previously have been added to the
listener for that network (see the
.B -a
option, above). Disabling a service
will cause subsequent service requests for that service to be denied, but the
processes from any prior service requests that are still running will continue
unaffected.
.RE

.sp
.ne 2
.mk
.na
.B -s
.I net_spec
.ad
.br
.na
.B -k
.I net_spec
.ad
.sp .6
.RS 4n
Start and kill (respectively) the listener process for the indicated network.
These operations are normally performed as part of the system startup and
shutdown procedures. Before a listener can be started for a particular network,
it must first have been initialized (see the
.B -i
option, above). When a
listener is killed, processes that are still running as a result of prior service
requests will continue unaffected.
.RE

.sp
.LP
Under the Service Access Facility, it is possible to have multiple instances of
the listener on a single
.IR net_spec .
In any of the above commands, the option
.B -N
.I port_monitor_tag
may be used in place of the
.IR net_spec
argument. This argument specifies the tag by which  an instance of the listener
is identified by the Service Access Facility. If the
.B -N
option is not
specified (that is, the
.I net_spec
is specified in the invocation), then it
will be assumed that the last component of the
.I net_spec
represents the tag
of the listener for which the operation is destined. In other words, it is
assumed that there is at least one listener on a designated
.IR net_spec ,
and
that its tag is identical to the last component of the
.IR net_spec .
This
listener may be thought of as the primary, or default, listener for a particular
.IR net_spec .
.sp
.LP
.B nlsadmin
is also used in conjunction with the Service Access Facility
commands. In that capacity, the following combinations of options can be used:
.sp
.ne 2
.mk
.na
.B -V
.ad
.sp .6
.RS 4n
Write the current version number of the listener's administrative file to the
standard output. It is used as part of the
.B sacadm
command line when
.B sacadm
adds a  port monitor to the system.
.RE

.sp
.ne 2
.mk
.na
.B -c
.I cmd
| \fB-o\fR \fIstreamname\fR [ \fB-p\fR \fImodules\fR ] [
.B -A
.I address
| \fB-D\fR ] [ \fB-R\fR \fIprognum\fR : \fIversnum\fR
]\fR
.ad
.sp .6
.RS 4n
Format the port monitor-specific information to be used as an argument to
.BR pmadm (1M)
.sp
The
.B -c
option specifies the full path name of the server and its
arguments.
.I cmd
must appear as a single word to the shell, and its arguments
must therefore be surrounded by quotes.
.sp
The
.B -o
option specifies the full path name of a
.B FIFO
or named stream
through which a standing server is actually receiving the connection.
.sp
If the
.B -p
option is specified, then
.I modules
will be interpreted as a
list of
.B STREAMS
modules for the listener to push before starting the
service being added. The modules are pushed in the order in which they are
specified.
.I modules
must be a comma-separated list, with no white space
included.
.sp
If the
.B -A
option is specified, then
.I address
will be interpreted as
the server's private address. The listener will monitor this address on behalf of
the service and will dispatch all calls arriving on this address directly to the
.RB "designated service. This option may not be used in conjunction with the" " -D"
option.
.sp
If the
.B -D
option is specified, then the service is assigned a private
address dynamically, that is, the listener will have the transport provider
select the address each time the listener begins listening on behalf of this
service. For RPC services, this option will be often be used in conjunction with
the
.B -R
option to register the dynamically assigned address with the
rpcbinder. This option may not be used in conjunction with the
.B -A
option.
.sp
When the
.B -R
option is specified, the service is an RPC service whose
address, program number, and version number should be registered with the
rpcbinder for this transport provider. This registration is performed each time
the listener begins listening on behalf of the service.
.I prognum
and
.I versnum
are the program number and version number, respectively, of the RPC
service.
.RE

.sp
.LP
.B nlsadmin
may be invoked by any user to generate reports; all operations
that affect a listener's status or configuration may only be run by a
super-user.
.sp
.LP
The options specific to the Service Access Facility may not be used together
with any other options.
.SH ERRORS
.sp
.LP
If successful,
.B nlsadmin
exits with a status of 0.  If  \fBnlsadmin\fR
fails for any reason, it exits with a status greater than or equal to 2.  See
.B -q
option for a return status of 1.
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.sp
.LP
.BR listen (1M),
.BR pmadm (1M),
.BR rpcbind (1M),
.BR sacadm (1M),
.BR attributes (5)
.sp
.LP
\fR
.SH NOTES
.sp
.LP
Dynamically assigned addresses are not displayed in  reports as statically
assigned addresses are.
