usr/src/man/man1m/ntfsls.1m
'\" te
.\" Portions Copyright (c) 2009, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2002-2006 Szabolcs Szakacsits
.\" Copyright (c) 2002-2005 Anton Altaparmakov
.\" Copyright (c) 2002-2003 Richard Russon
.\" Copyright (c) 2007 Yura Pakhuchiy
.\" This program is free software; you can redistribute it and/or modify
.\" it under the terms of the GNU General Public License as published by
.\" the Free Software Foundation ; either version 2 of the License, or (at your option)
.\" any later version.
.\"
.\" This program is distributed in the hope that it will be useful,
.\" but WITHOUT ANY WARRANTY; without even the implied warranty of
.\" MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the
.\" GNU General Public License for more details.
.\"
.\" You should have received a copy of the GNU General Public License along with this
.\" program (in the main directory of the Linux-NTFS distribution in the file COPYING);
.\" if not, write to the Free Software Foundation, Inc.,
.\" 59 Temple Place, Suite 330, Boston, MA 11-1307 USA
.TH ntfsls 1M "28 May 2009" "SunOS 5.11" "System Administration Commands"
.SH NAME
ntfsls \- list directory contents on an NTFS file system
.SH SYNOPSIS
.LP
.nf
\fBntfsls\fR [\fIoptions\fR] \fIdevice\fR
.fi

.SH DESCRIPTION
.sp
.LP
The \fBntfsls\fR utility lists information about the files specified by the
\fBPATH\fR option (the root directory by default). \fIdevice\fR (see
Synopsis) is the special file corresponding to the device (for example,
\fB/dev/dsk/c0d0p0\fInum\fR) or an NTFS image file.
.SH OPTIONS
.sp
.LP
Supported options are listed below. Most options have both single-letter
and full-name forms. Multiple single-letter options that do not take an
argument can be combined. For example, \fB-fv\fR is the equivalent of
\fB-f -v\fR. A full-name option can be abbreviated to a unique prefix
of its name.
.sp
.ne 2
.mk
.na
.BR -a ,
.B --all
.ad
.sp .6
.RS 4n
Display all files. If this option is not specified file names in the POSIX
namespace are not displayed.
.RE

.sp
.ne 2
.mk
.na
.BR -F ,
\fB--classify\fR
.ad
.sp .6
.RS 4n
Append one of the indicators shown below to entries.
.sp
.in +2
.nf
* / = @ |
.fi
.in -2
.sp

.RE

.sp
.ne 2
.mk
.na
\fB-f\fR, \fB--force\fR
.ad
.sp .6
.RS 4n
Force execution. For example, this option is necessary to run on an NTFS
partition stored in a normal file.
.RE

.sp
.ne 2
.mk
.na
.BR -h ,
.B --help
.ad
.sp .6
.RS 4n
Display usage information and exit.
.RE

.sp
.ne 2
.mk
.na
.BR -i ,
.B --inode
.ad
.sp .6
.RS 4n
Display the inode number of each file. This is the MFT reference number, in
NTFS terminology.
.RE

.sp
.ne 2
.mk
.na
.BR -l ,
.B --long
.ad
.sp .6
.RS 4n
Use a long listing format.
.RE

.sp
.ne 2
.mk
.na
.BR -p ,
\fB--path\fR \fIpath\fR
.ad
.sp .6
.RS 4n
The directory whose contents to list or the file (including the path) about
which to display information.
.RE

.sp
.ne 2
.mk
.na
.BR -q ,
.B --quiet
.ad
.sp .6
.RS 4n
Suppress some debug, warning, and error messages.
.RE

.sp
.ne 2
.mk
.na
.BR -R ,
.B --recursive
.ad
.sp .6
.RS 4n
Show the contents of all directories beneath the specified directory.
.RE

.sp
.ne 2
.mk
.na
.BR -s ,
.B --system
.ad
.sp .6
.RS 4n
Unless this options is specified, all files beginning with a dollar sign
character will not be listed, as these files are usually system files.
.RE

.sp
.ne 2
.mk
.na
.BR -v ,
.B --verbose
.ad
.sp .6
.RS 4n
Display more debug, warning, and error messages.
.RE

.sp
.ne 2
.mk
.na
.BR -V ,
.B --version
.ad
.sp .6
.RS 4n
Display the \fBntfsls\fR version number and exit.
.RE

.sp
.ne 2
.mk
.na
.BR -x ,
.B --dos
.ad
.sp .6
.RS 4n
Display short file names, that is, files in the DOS namespace, instead of
long file names, that is, files in the WIN32 namespace.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWntfsprogs
_
Interface StabilityUncommitted
.TE

.SH SEE ALSO
.sp
.LP
, \fBntfsprogs\fR(1M), \fBparted\fR(1M), \fBattributes\fR(5)
.sp
.LP
http://wiki.linux-ntfs.org
.SH AUTHORS
.sp
.LP
This version of \fBntfsls\fR was written by Lode Leroy, Anton
Altaparmakov, Richard Russon, Carmelo Kintana and Giang Nguyen.
