usr/src/man/man1m/ntfsfix.1m
'\" te
.\" Portions Copyright (c) 2009, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" Copyright (c) 2002-2006 Szabolcs Szakacsits
.\" Copyright (c) 2002-2005 Anton Altaparmakov
.\" Copyright (c) 2002-2003 Richard Russon
.\" Copyright (c) 2007 Yura Pakhuchiy
.\" This program is free software; you can redistribute it and/or modify
.\" it under the terms of the GNU General Public License as published by
.\" the Free Software Foundation ; either version 2 of the License, or (at your option)
.\" any later version.
.\"
.\" This program is distributed in the hope that it will be useful,
.\" but WITHOUT ANY WARRANTY; without even the implied warranty of
.\" MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the
.\" GNU General Public License for more details.
.\"
.\" You should have received a copy of the GNU General Public License along with this
.\" program (in the main directory of the Linux-NTFS distribution in the file COPYING);
.\" if not, write to the Free Software Foundation, Inc.,
.\" 59 Temple Place, Suite 330, Boston, MA 11-1307 USA
.TH ntfsfix 1M "28 May 2009" "SunOS 5.11" "System Administration Commands"
.SH NAME
ntfsfix \- fix common errors and force operating system to check NTFS
.SH SYNOPSIS
.LP
.nf
\fBntfsfix\fR [\fIoptions\fR] \fIdevice\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B ntfsfix
utility fixes some common NTFS problems. Note that it is
not a version of
.BR chkdsk .
It repairs some fundamental NTFS
inconsistencies, resets the NTFS  journal file, and schedules an NTFS
consistency check for the next reboot of the operating system.
.sp
.LP
Run
.B ntfsfix
on an NTFS volume if you think it was damaged by the
operating system or in some other way and it cannot be mounted.
.SH OPTIONS
.sp
.LP
Supported options are listed below.
.sp
.ne 2
.mk
.na
.BR -h ,
.B --help
.ad
.sp .6
.RS 4n
Show a list of options with a brief description of each.
.RE

.sp
.ne 2
.mk
.na
.BR -V ,
.B --version
.ad
.sp .6
.RS 4n
Show the version number, copyright, and license information.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWntfsprogs
_
Interface StabilityUncommitted
.TE

.SH SEE ALSO
.sp
.LP
.BR mkntfs (1M),
.BR ntfsprogs (1M),
.BR parted (1M),
.BR attributes (5)
.sp
.LP
http://wiki.linux-ntfs.org
.SH AUTHORS
.sp
.LP
.B ntfsfix
was written by Anton Altaparmakov, with contributions from
Szabolcs Szakacsits.
