usr/src/man/man1m/ntfslabel.1m
'\" te
.\" Portions Copyright (c) 2009, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2002-2006 Szabolcs Szakacsits
.\" Copyright (c) 2002-2005 Anton Altaparmakov
.\" Copyright (c) 2002-2003 Richard Russon
.\" Copyright (c) 2007 Yura Pakhuchiy
.\" This program is free software; you can redistribute it and/or modify
.\" it under the terms of the GNU General Public License as published by
.\" the Free Software Foundation ; either version 2 of the License, or (at your option)
.\" any later version.
.\"
.\" This program is distributed in the hope that it will be useful,
.\" but WITHOUT ANY WARRANTY; without even the implied warranty of
.\" MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the
.\" GNU General Public License for more details.
.\"
.\" You should have received a copy of the GNU General Public License along with this
.\" program (in the main directory of the Linux-NTFS distribution in the file COPYING);
.\" if not, write to the Free Software Foundation, Inc.,
.\" 59 Temple Place, Suite 330, Boston, MA 11-1307 USA
.TH ntfslabel 1M "28 May 2009" "SunOS 5.11" "System Administration Commands"
.SH NAME
ntfslabel \- display or change the label on an NTFS file system
.SH SYNOPSIS
.LP
.nf
\fBntfslabel\fR [\fIoptions\fR] \fIdevice\fR [\fInew_label\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The \fBntfslabel\fR utility displays or changes the file system label on
the NTFS file system located on \fIdevice\fR (see Synopsis).
.sp
.LP
If the optional argument \fInew_label\fR is not present, \fBntfslabel\fR
displays the current file system label.
.sp
.LP
If the optional argument \fInew_label\fR is present, \fBntfslabel\fR sets
the file system label to be \fInew_label\fR. NTFS file system labels can be
at most 128 Unicode characters long; if \fInew_label\fR is longer than 128
Unicode characters, \fBntfslabel\fR truncates it and displays a warning
message.
.sp
.LP
It is also possible to set the file system label using the \fB-L\fR option
of \fBmkntfs\fR(1M) during creation of the file system.
.SH OPTIONS
.sp
.LP
Supported options are listed below. Most options have both single-letter
and full-name forms. Multiple single-letter options that do not take an
argument can be combined. For example, \fB-fv\fR is the equivalent of
\fB-f\fR \fB-v\fR. A full-name option can be abbreviated to a unique prefix
of its name.
.sp
.ne 2
.mk
.na
\fB-f\fR, \fB--force\fR
.ad
.sp .6
.RS 4n
Overrides some sensible defaults, such as not working with a mounted
volume. Use this option with caution.
.RE

.sp
.ne 2
.mk
.na
\fB-h\fR, \fB--help\fR
.ad
.sp .6
.RS 4n
Show a list of options with a brief description of each.
.RE

.sp
.ne 2
.mk
.na
\fB-n\fR, \fB--no-action\fR
.ad
.sp .6
.RS 4n
Do not actually write a new label to disk.
.RE

.sp
.ne 2
.mk
.na
\fB-q\fR, \fB--quiet\fR
.ad
.sp .6
.RS 4n
Suppress some debug, warning, and error messages.
.RE

.sp
.ne 2
.mk
.na
\fB-V\fR, \fB--version\fR
.ad
.sp .6
.RS 4n
Show the version number, copyright, and license information.
.RE

.sp
.ne 2
.mk
.na
\fB-v\fR, \fB--verbose\fR
.ad
.sp .6
.RS 4n
Display more debug, warning, and error messages.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWntfsprogs
_
Interface StabilityUncommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBmkntfs\fR(1M), \fBntfsprogs\fR(1M), \fBparted\fR(1M),
\fBattributes\fR(5)
.sp
.LP
http://wiki.linux-ntfs.org
.SH AUTHORS
.sp
.LP
\fBntfslabel\fR was written by Matthew J. Fanto, with  contributions from
Anton Altaparmakov and Richard Russon.
