usr/src/man/man1m/ntfsprogs.1m
'\" te
.\" Portions Copyright (c) 2009, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2002-2006 Szabolcs Szakacsits
.\" Copyright (c) 2002-2005 Anton Altaparmakov
.\" Copyright (c) 2002-2003 Richard Russon
.\" Copyright (c) 2007 Yura Pakhuchiy
.\" This program is free software; you can redistribute it and/or modify
.\" it under the terms of the GNU General Public License as published by
.\" the Free Software Foundation ; either version 2 of the License, or (at your option)
.\" any later version.
.\"
.\" This program is distributed in the hope that it will be useful,
.\" but WITHOUT ANY WARRANTY; without even the implied warranty of
.\" MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the
.\" GNU General Public License for more details.
.\"
.\" You should have received a copy of the GNU General Public License along with this
.\" program (in the main directory of the Linux-NTFS distribution in the file COPYING);
.\" if not, write to the Free Software Foundation, Inc.,
.\" 59 Temple Place, Suite 330, Boston, MA 11-1307 USA
.TH ntfsprogs 1M "28 May 2009" "SunOS 5.11" "System Administration Commands"
.SH NAME
ntfsprogs \- list of NTFS tools
.SH SYNOPSIS
.LP
.nf
\fBntfsprogs\fR
.fi

.SH DESCRIPTION
.sp
.LP
\fBntfsprogs\fR is the name of a suite of NTFS utilities based around a shared
library. The tools are available for free and come with full source code. The
tools are listed below.
.sp
.ne 2
.mk
.na
\fBmkntfs\fR(1M)\fR
.ad
.sp .6
.RS 4n
Create an NTFS filesystem.
.RE

.sp
.ne 2
.mk
.na
\fBntfscat\fR(1M)\fR
.ad
.sp .6
.RS 4n
Dump a file's content to the standard output.
.RE

.sp
.ne 2
.mk
.na
\fBntfsclone\fR(1M)\fR
.ad
.sp .6
.RS 4n
Efficiently clone, backup, restore, or rescue NTFS.
.RE

.sp
.ne 2
.mk
.na
\fBntfscluster\fR(1M)\fR
.ad
.sp .6
.RS 4n
Locate the files that use the specified  sectors or clusters.
.RE

.sp
.ne 2
.mk
.na
\fBntfscmp\fR(1M)\fR
.ad
.sp .6
.RS 4n
Compare two NTFS file systems and report the differences.
.RE

.sp
.ne 2
.mk
.na
\fBntfscp\fR(1M)\fR
.ad
.sp .6
.RS 4n
Copy a file to an NTFS volume.
.RE

.sp
.ne 2
.mk
.na
\fBntfsfix\fR(1M)\fR
.ad
.sp .6
.RS 4n
Check and fix some common errors, clear the log file, and make the operating
system perform a thorough check next time it boots.
.RE

.sp
.ne 2
.mk
.na
\fBntfsinfo\fR(1M)\fR
.ad
.sp .6
.RS 4n
Show information about NTFS or one of the files or directories within it.
.RE

.sp
.ne 2
.mk
.na
\fBntfslabel\fR(1M)\fR
.ad
.sp .6
.RS 4n
Show, or set, an NTFS filesystem's volume label.
.RE

.sp
.ne 2
.mk
.na
\fBntfsls\fR(1M)\fR
.ad
.sp .6
.RS 4n
List information about files in a directory residing on an NTFS.
.RE

.sp
.ne 2
.mk
.na
\fBntfsmount(1M)\fR (not a SunOS man page)\fR
.ad
.sp .6
.RS 4n
Read-write NTFS user space driver.
.RE

.sp
.ne 2
.mk
.na
\fBntfsresize\fR(1M)\fR
.ad
.sp .6
.RS 4n
Resize NTFS without losing data.
.RE

.sp
.ne 2
.mk
.na
\fBntfsundelete\fR(1M)\fR
.ad
.sp .6
.RS 4n
Recover deleted files from NTFS.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWntfsprogs
_
Interface StabilityUncommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBparted\fR(1M), \fBattributes\fR(5)
.sp
.LP
http://wiki.linux-ntfs.org
.SH AUTHORS
.sp
.LP
The tools were written by Anton Altaparmakov, Carmelo Kintana,  Cristian
Klein, Erik Sornes, Giang Nguyen, Holger Ohmacht, Lode Leroy, Matthew J. Fanto,
Per Olofsson, Richard Russon, Szabolcs Szakacsits, Yura Pakhuchiy, and Yuval
Fledel.
