usr/src/man/man1m/obpsym.1m
'\" te
.\" Copyright 2001 Sun Microsystems, Inc.  All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH obpsym 1M "13 Dec 2001" "SunOS 5.11" "System Administration Commands"
.SH NAME
obpsym \- Kernel Symbolic Debugging for OpenBoot Firmware
.SH SYNOPSIS
.LP
.nf
\fBmodload\fR \fB-p\fR misc/obpsym
.fi

.SH DESCRIPTION
.sp
.LP
.B obpsym
is a kernel module that installs OpenBoot callback handlers that
provide kernel symbol information to OpenBoot. OpenBoot firmware user
interface commands use the callbacks to convert numeric
.I addresses
to
kernel symbol names for display purposes, and to convert kernel symbol names
to numeric
.I literals
allowing symbolic names to be used as input
arguments to user interface commands.
.sp
.LP
Once
.B obpsym
is installed, kernel symbolic names may be used anywhere at
the OpenBoot firmware's user interface command prompt in place of a literal
(numeric) string. For example, if
.B obpsym
is installed, the OpenBoot
firmware commands
.B ctrace
and
.B dis
typically display symbolic names
and offsets in the form
.I "modname:symbolname + offset."
User interface
Commands such as
.B dis
can be given a kernel symbolic name such as
.B ufs:ufs_mount
instead of a numeric address.
.sp
.LP
Placing the command
.sp
.LP
.B forceload: misc/obpsym
.sp
.LP
into the
.BR system (4)
file forces the kernel module
.B misc/obpsym
to
be loaded and activates the kernel callbacks during the kernel startup
sequence.
.sp
.LP
.B obpsym
may be useful as a kernel debugger in situations where other
kernel debuggers are not useful. For example, on SPARC machines, if
.B obpsym
is loaded, you may be able to use the OpenBoot firmware's
.B ctrace
command to display symbolic names in the stack backtrace after a
watchdog reset.
.SS "Kernel Symbolic Name Syntax"
.sp
.LP
The syntax for a kernel symbolic name is:
.sp
.LP
\fR [ \fImodule-name\fR \fB:\fR ] \fIsymbol-name\fR
.sp
.LP
Where
.I module-name
is the name of the kernel module that the symbol
\fIsymbol-name\fR appears in. A \fINULL\fR module name is taken as "all
modules, in no particular order" by \fBobpsym\fR. The module name \fBunix\fR
is equivalent to a
.I NULL
module name, so that conflicts with words
defined in the firmware's vocabulary can be avoided.
.sp
.LP
Typically, OpenBoot firmware reads a word from the input stream and looks the
word up in its internal
.I vocabulary
before checking if the word is a
.IR literal .
Thus, kernel symbols, such as
.B reset
may be given as
.B unix:reset
to avoid the unexpected side effect of the firmware finding
and executing a matching word in its vocabulary.
.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/system
.ad
.sp .6
.RS 4n
system configuration information file
.RE

.sp
.ne 2
.mk
.na
\fB/platform/\fIplatform-name\fB/kernel/misc/obpsym\fR
.ad
.sp .6
.RS 4n

.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcar
.TE

.SH SEE ALSO
.sp
.LP
.BR kadb (1M),
.BR kernel (1M),
.BR modload (1M),
.BR modunload (1M),
.BR uname (1),
.BR system (4),
.BR attributes (5)
.sp
.LP
\fR
.SH WARNINGS
.sp
.LP
Some OpenBoot firmware user interface commands may use system resources
incompatibly with the way they are used by the Unix kernel. These commands and
the use of this feature as a kernel debugger may cause interactions that the
Unix kernel is not prepared to deal with. If this occurs, the Unix kernel
and/or the OpenBoot firmware user interface commands may react unpredictably
and may panic the system, or may hang or may cause other unpredictable
results. For these reasons, the use of this feature is only minimally
supported and recommended to be used only as a kernel debugger of "last
resort".
.sp
.LP
If a breakpoint or watchpoint is triggered while the console frame buffer is
powered off, the system can crash and be left in a state from which it is
difficult to recover. If one of these is triggered while the monitor is
powered off, you will not be able to see the debugger output.
.SH NOTES
.sp
.LP
.I platform-name
can be found using the
.B -i
option of
.BR uname (1)
.sp
.LP
.B obpsym
is supported only on architectures that support OpenBoot
firmware.
.sp
.LP
.RB "On some systems, OpenBoot must be completely RAM resident so the" " obpsym"
symbol callback support can be added to the firmware, if the firmware doesn't
include support for the symbol callbacks. On these systems,
.B obpsym
may
complain that it requires that "you must use ramforth to use this module".
.sp
.LP
See the  for details on how to use the
.I ramforth
command, how to place
the command into
.IR nvramrc ,
and how to set
.I use-nvramrc?
to
.BR true .
On systems with version 1.x OpenBoot firmware, \fInvramrc\fR
doesn't exist, and the
.I ramforth
command must be typed manually after
each reset, in order to use this module.
.sp
.LP
Once installed, the symbol table callbacks can be disabled by using the
following OpenBoot firmware command:
.sp
.LP
.B 0 0 set-symbol-lookup
