usr/src/man/man1m/oplhpd.1m
'\" te
.\" Copyright (c) 2005, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH oplhpd 1M "23 May 2006" "SunOS 5.11" "System Administration Commands"
.SH NAME
oplhpd \- Hot plug daemon for SPARC Enterprise Server line
.SH SYNOPSIS
.LP
.nf
\fB/usr/platform/SUNW,SPARC-Enterprise/lib/sparcv9/lib/oplhpd\fR
.fi

.SH DESCRIPTION
.sp
.LP
The hot plug daemon for
.B SPARC
Enterprise Servers is a daemon process
.RB "that runs on the " SUNW , SPARC -Enterprise
family of servers. The
daemon is started by the service management facility (see
.BR smf (5))
and
communicates with the service processor when hot plug
.B PCI
cassettes
change their dynamic reconfiguration state.
.sp
.LP
The service
.B FMRI
for
.B oplhpd
is:
.sp
.in +2
.nf
svc:/platform/sun4u/oplhpd:default
.fi
.in -2
.sp

.sp
.LP
A domain supports only one running
.B oplhpd
process at a time.
.SH ERRORS
.sp
.LP
.B OPLHPD
uses
.BR syslog "(3C) to report status and error messages. All"
of the messages are logged with the
.B LOG_DAEMON
facility.
.sp
.LP
Error messages are logged with the
.B LOG_ERR
and
.BR LOG_NOTICE
priorities, and informational messages are logged with the
.B LOG_DEBUG
priority. The default entries in the
.B /etc/syslog.conf
file log all of
the
.B OPLHPD
error messages to the
.BR "/var/adm/messages log" .
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWdcsu, SUNWdcsr
_
Interface StabilityEvolving
.TE

.SH SEE ALSO
.sp
.LP
.BR svcs (1),
.BR inetadm (1M),
.BR svcadm (1M),
.BR syslog (3C),
.BR syslog.conf (4),
.BR attributes (5),
.BR smf (5)
