usr/src/man/man1m/parted.1m
'\" te
.\" Portions Copyright (c) 2009, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (C) 1999, 2000, 2007 Free Software Foundation, Inc.
.\"
.\" This program is free software; you can redistribute it and/or modify
.\" it under the terms of the GNU General Public License as published by
.\" the Free Software Foundation; either version 3 of the License, or
.\" (at your option) any later version.
.\"
.\" This program is distributed in the hope that it will be useful,
.\" but WITHOUT ANY WARRANTY; without even the implied warranty of
.\" MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the
.\" GNU General Public License for more details.
.\"
.\" You should have received a copy of the GNU General Public License
.\" along with this program. If not, see: http://www.gnu.org/copyleft/gpl.html
.\"
.TH parted 1M "27 May 2009" "SunOS 5.11" "System Administration Commands"
.SH NAME
parted \- partition manipulation program
.SH SYNOPSIS
.LP
.nf
\fBparted\fR [\fIoptions\fR] [\fIdevice\fR [\fIoptions\fR...]...]]
.fi

.SH DESCRIPTION
.sp
.LP
\fBparted\fR is a disk partitioning and partition resizing  program. It
allows you to create, destroy, resize, move, and copy \fBext2\fR,
\fBext3\fR, \fBlinux-swap\fR, \fBFAT\fR, \fBFAT32\fR, and \fBreiserfs\fR
partitions. It can create, resize, and move Macintosh HFS  partitions, as
well as detect \fBjfs\fR, \fBntfs\fR, \fBufs\fR, and \fBxfs\fR partitions.
It is useful for creating space for new operating systems, reorganizing disk
usage, and copying data to new hard disks.
.sp
.LP
This manual page documents \fBparted\fR briefly. Complete  \fBparted\fR
documentation is distributed with the package in "GNU Info"  format.
.sp
.LP
\fBparted\fR is implemented with a set of top-level options and a set of
subcommands, most of which have their own options and operands. These
subcommands are described below. \fBparted\fR has an optional operand:
.sp
.ne 2
.mk
.na
\fIdevice\fR
.ad
.RS 10n
.rt
The block device to be used. When none is given, \fBparted\fR uses the
first block device it finds.
.RE

.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB-h\fR, \fB--help\fR
.ad
.sp .6
.RS 4n
Displays a help message.
.RE

.sp
.ne 2
.mk
.na
\fB-i\fR, \fB--interactive\fR
.ad
.sp .6
.RS 4n
Prompts for user intervention.
.RE

.sp
.ne 2
.mk
.na
\fB-l\fR, \fB--list\fR
.ad
.sp .6
.RS 4n
Lists partition layout on all block devices.
.RE

.sp
.ne 2
.mk
.na
\fB-m\fR, \fB--machine\fR
.ad
.sp .6
.RS 4n
Displays machine-parseable output.
.RE

.sp
.ne 2
.mk
.na
\fB-s\fR, \fB--script\fR
.ad
.sp .6
.RS 4n
Never prompts for user intervention.
.RE

.sp
.ne 2
.mk
.na
\fB-v\fR, \fB--version\fR
.ad
.sp .6
.RS 4n
Displays the version number.
.RE

.SH SUB-COMMANDS
.sp
.LP
If you omit a subcommand in a \fBparted\fR command line, the utility issues
a command prompt.
.sp
.ne 2
.mk
.na
\fBcheck\fR \fIpartition\fR
.ad
.sp .6
.RS 4n
Do a simple check on \fIpartition\fR.
.RE

.sp
.ne 2
.mk
.na
\fBcp\fR [\fIsource-device\fR] \fIsource\fR \fIdest\fR
.ad
.sp .6
.RS 4n
Copy the source partition's filesystem on \fIsource-device\fR (or the
current device if no other device was specified) to the \fIdest\fR partition
on the current device.
.RE

.sp
.ne 2
.mk
.na
\fBhelp\fR \fIcommand\fR
.ad
.sp .6
.RS 4n
Display general help, or help on a command, if specified.
.RE

.sp
.ne 2
.mk
.na
\fBmkfs\fR \fIpartition\fR \fIfs-type\fR
.ad
.sp .6
.RS 4n
Make a filesystem \fIfs-type\fR on partition. \fIfs-type\fR can be one of
\fBfat16\fR, \fBfat32\fR, \fBext2\fR, \fBlinux-wap\fR, or \fBreiserfs\fR.
.RE

.sp
.ne 2
.mk
.na
\fBmklabel\fR \fIlabel-type\fR
.ad
.sp .6
.RS 4n
Create a new disk label (partition table) of \fIlabel-type\fR.
\fIlabel-type\fR should be one of \fBbsd\fR, \fBdvh\fR, \fBgpt\fR,
\fBloop\fR, \fBmac\fR, \fBmsdos\fR, \fBpc98\fR, or \fBsun\fR.
.RE

.sp
.ne 2
.mk
.na
\fBmkpart\fR \fIpart-type\fR [\fIfs-type\fR] \fIstart\fR \fIend\fR
.ad
.sp .6
.RS 4n
Make a \fIpart-type\fR partition with file system \fIfs-type\fR (if
specified), beginning at \fIstart\fR and ending at \fIend\fR (by default, in
megabytes). \fIfs-type\fR can be one of \fBfat16\fR, \fBfat32\fR,
\fBext2\fR, \fBHFS\fR, \fBlinux-swap\fR, \fBNTFS\fR, \fBreiserfs\fR, or
\fBufs\fR. \fIpart-type\fR should be one of \fBprimary\fR, \fBlogical\fR, or
\fBextended\fR.
.RE

.sp
.ne 2
.mk
.na
\fBmkpartfs\fR \fIpart-type\fR \fIfs-type\fR \fIstart\fR \fIend\fR
.ad
.sp .6
.RS 4n
Make a \fIpart-type\fR partition with file system \fIfs-type\fR, beginning
at \fIstart\fR and ending at \fIend\fR (by default, in megabytes).
.RE

.sp
.ne 2
.mk
.na
\fBmove\fR \fIpartition\fR \fIstart\fR \fIend\fR
.ad
.sp .6
.RS 4n
Move partition so that it begins at \fIstart\fR and ends at \fIend\fR. Note
that \fBmove\fR never changes the minor number.
.RE

.sp
.ne 2
.mk
.na
\fBname\fR \fIpartition\fR \fIname\fR
.ad
.sp .6
.RS 4n
Set the name of partition to \fIname\fR. This option works only on Mac,
PC98, and GPT disk labels. The name can be placed in quotes, if necessary.
.RE

.sp
.ne 2
.mk
.na
\fBprint\fR
.ad
.sp .6
.RS 4n
Display the partition table.
.RE

.sp
.ne 2
.mk
.na
\fBquit\fR
.ad
.sp .6
.RS 4n
Exit from \fBparted\fR.
.RE

.sp
.ne 2
.mk
.na
\fBrescue\fR \fIstart\fR \fIend\fR
.ad
.sp .6
.RS 4n
Rescue a lost partition that was located somewhere between \fIstart\fR and
\fIend\fR. If a partition is found, \fBparted\fR will ask if you want to
create an entry for it in the partition table.
.RE

.sp
.ne 2
.mk
.na
\fBresize\fR \fIpartition\fR \fIstart\fR \fIend\fR
.ad
.sp .6
.RS 4n
Resize the file system on \fIpartition\fR so that it begins at \fIstart\fR
and ends at \fIend\fR (by default, in megabytes).
.RE

.sp
.ne 2
.mk
.na
\fBrm\fR \fIpartition\fR
.ad
.sp .6
.RS 4n
Delete \fIpartition\fR.
.RE

.sp
.ne 2
.mk
.na
\fBselect\fR \fIdevice\fR
.ad
.sp .6
.RS 4n
Choose \fIdevice\fR as the current device to edit.  \fIdevice\fR should
usually be a Solaris or Linux hard disk device, but it can be a partition,
software raid device, or an SVM or LVM logical volume if necessary.
.RE

.sp
.ne 2
.mk
.na
\fBset\fR \fIpartition\fR \fIflag\fR \fIstate\fR
.ad
.sp .6
.RS 4n
Change the state of the \fIflag\fR on \fIpartition\fR to \fIstate\fR.
Supported flags are: \fBboot\fR, \fBroot\fR, \fBswap\fR, \fBhidden\fR,
\fBraid\fR, \fBlvm\fR, \fBlba\fR, and \fBpalo\fR. \fIstate\fR should be
either \fBon\fR or \fBoff\fR.
.RE

.sp
.ne 2
.mk
.na
\fBunit\fR \fIunit\fR
.ad
.sp .6
.RS 4n
Set \fIunit\fR as the unit to use when displaying locations and sizes, and
for interpreting those given by the user when not suffixed with an explicit
unit. \fIunit\fR can be one of \fBs\fR (sectors), \fBB\fR (bytes), \fBkB\fR,
\fBMB\fR, \fBGB\fR, \fBTB\fR, \fB%\fR (percentage of device size), \fBcyl\fR
(cylinders), \fBchs\fR (cylinders, heads, sectors), or \fBcompact\fR
(megabytes for input, and a human-friendly form for output).
.RE

.sp
.ne 2
.mk
.na
\fBversion\fR
.ad
.sp .6
.RS 4n
Display version information and a copyright message.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWparted
_
Interface StabilityUncommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBfdisk\fR(1M), \fBmkfs\fR(1M), \fBattributes\fR(5)
.sp
.LP
The \fBparted\fR program is fully documented in the \fBinfo(1)\fR format
GNU partitioning software manual.
.SH AUTHOR
.sp
.LP
This manual page was written by Timshel Knoll for the Debian GNU/Linux
system. It is here adapted for the Solaris operating system.
