usr/src/man/man1m/passmgmt.1m
'\" te
.\" Copyright 1989 AT&T Copyright (c) 2007 Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH passmgmt 1M "27 Aug 2007" "SunOS 5.11" "System Administration Commands"
.SH NAME
passmgmt \- password files management
.SH SYNOPSIS
.LP
.nf
\fBpassmgmt\fR \fB-a\fR \fIoptions\fR \fIname\fR
.fi

.LP
.nf
\fBpassmgmt\fR \fB-m\fR \fIoptions\fR \fIname\fR
.fi

.LP
.nf
\fBpassmgmt\fR \fB-d\fR \fIname\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B passmgmt
command updates information in the password files. This
command works with both
.B /etc/passwd
and
.BR /etc/shadow .
.sp
.LP
.B passmgmt -a
adds an entry for user
.I name
to the password
files. This command does not create any directory for the new user and the
new login remains locked (with the string
.B *LK*
in the password field)
until the
.BR passwd (1)
command is executed to set the password.
.sp
.LP
.B passmgmt -m
modifies the entry for user
.I name
in the
password files. The name field in the
.B /etc/shadow
entry and all the
fields (except the password field) in the
.B /etc/passwd
entry can be
modified by this command. Only fields entered on the command line will be
modified.
.sp
.LP
.B passmgmt -d
deletes the entry for user
.I name
from the
password files. It will not remove any files that the user owns on the
system; they must be removed manually.
.sp
.LP
.B passmgmt
can be used only by the super-user.
.SH OPTIONS
.sp
.ne 2
.mk
.na
.B -c
.I comment
.ad
.RS 16n
.rt
A short description of the login, enclosed in quotes. It is limited to a
maximum of 128 characters and defaults to an empty field.
.RE

.sp
.ne 2
.mk
.na
.B -e
.I expire
.ad
.RS 16n
.rt
Specify the expiration date for a login. After this date, no user will be
able to access this login. The expire option argument is a date entered
using one of the date formats included in the template file
.BR /etc/datemsk .
See
.BR getdate (3C).
.RE

.sp
.ne 2
.mk
.na
.B -f
.I inactive
.ad
.RS 16n
.rt
The maximum number of days allowed between uses of a login ID before that
.B ID
is declared invalid. Normal values are positive integers. A value
of
.B 0
defeats the status.
.sp
Changing the password reactivates an account for the inactivity period.
.RE

.sp
.ne 2
.mk
.na
.B -g
.I gid
.ad
.RS 16n
.rt
.B GID
of
.IR name .
This number must range from 0 to the maximum
non-negative value for the system. The default is 1.
.RE

.sp
.ne 2
.mk
.na
.B -h
.I homedir
.ad
.RS 16n
.rt
Home directory of
.IR name .
It is limited to a maximum of 256 characters
and defaults to \fB/usr/\fIname\fR.
.RE

.sp
.ne 2
.mk
.na
.B -K
.I key=value
.ad
.RS 16n
.rt
Set a
.I key=value
pair. See
.BR user_attr (4),
.BR auth_attr (4),
and
.BR prof_attr (4).
The valid
.I key=value
pairs are defined in
\fBuser_attr\fR(4), but the "type" key is subject to the \fBusermod\fR(1M)
and
.BR rolemod "(1M) restrictions. Multiple"
.I key=value
pairs may be
added with multiple
.B -K
options.
.RE

.sp
.ne 2
.mk
.na
.B -k
.I skel_dir
.ad
.RS 16n
.rt
A directory that contains skeleton information (such as
.BR \&.profile )
that can be copied into a new user's home directory. This directory must
already exist. The system provides the
.B /etc/skel
directory that can be
used for this purpose.
.RE

.sp
.ne 2
.mk
.na
.B -l
.I logname
.ad
.RS 16n
.rt
This option changes the
.I name
to
.IR logname .
It is used only with
the
.B -m
option. The total size of each login entry is limited to a
maximum of 511 bytes in each of the password files.
.RE

.sp
.ne 2
.mk
.na
.B -o
.ad
.RS 16n
.rt
This option allows a
.B UID
to be non-unique. It is used only with the
.B -u
option.
.RE

.sp
.ne 2
.mk
.na
.B -s
.I shell
.ad
.RS 16n
.rt
Login shell for
.IR name .
It should be the full pathname of the program
that will be executed when the user logs in. The maximum size of \fIshell\fR
is 256 characters. The default is for this field to be empty and to be
interpreted as
.BR /usr/bin/sh .
.RE

.sp
.ne 2
.mk
.na
.B -u
.I uid
.ad
.RS 16n
.rt
.B UID
of the
.IR name .
This number must range from 0 to the maximum
non-negative value for the system. It defaults to the next available
.B UID
greater than 99. Without the
.B -o
option, it enforces the
uniqueness of a
.BR UID.
.RE

.SH FILES
.sp
.in +2
.nf
\fB/etc/passwd\fR
\fB/etc/shadow\fR
\fB/etc/opasswd\fR
\fB/etc/oshadow\fR		
.fi
.in -2
.sp

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
_
Interface StabilityEvolving
.TE

.SH SEE ALSO
.sp
.LP
.BR passwd (1),
.BR rolemod (1M),
.BR useradd (1M),
.BR userdel (1M),
.BR usermod (1M),
.BR auth_attr (4),
.BR passwd (4),
.BR prof_attr (4),
.BR shadow (4),
.BR user_attr (4),
.BR attributes (5)
.SH EXIT STATUS
.sp
.LP
The
.B passmgmt
command exits with one of the following values:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 5n
.rt
Success.
.RE

.sp
.ne 2
.mk
.na
.B 1
.ad
.RS 5n
.rt
Permission denied.
.RE

.sp
.ne 2
.mk
.na
.B 2
.ad
.RS 5n
.rt
Invalid command syntax. Usage message of the
.B passmgmt
command is
displayed.
.RE

.sp
.ne 2
.mk
.na
.B 3
.ad
.RS 5n
.rt
Invalid argument provided to option.
.RE

.sp
.ne 2
.mk
.na
.B 4
.ad
.RS 5n
.rt
UID in use.
.RE

.sp
.ne 2
.mk
.na
.B 5
.ad
.RS 5n
.rt
Inconsistent password files (for example,
.I name
is in the
.B /etc/passwd
file and not in the
.B /etc/shadow
file, or vice
versa).
.RE

.sp
.ne 2
.mk
.na
.B 6
.ad
.RS 5n
.rt
Unexpected failure. Password files unchanged.
.RE

.sp
.ne 2
.mk
.na
.B 7
.ad
.RS 5n
.rt
Unexpected failure. Password file(s) missing.
.RE

.sp
.ne 2
.mk
.na
.B 8
.ad
.RS 5n
.rt
Password file(s) busy. Try again later.
.RE

.sp
.ne 2
.mk
.na
.B 9
.ad
.RS 5n
.rt
.I name
does not exist (if
.B -m
or
.B -d
is specified), already
exists (if
.B -a
is specified), or
.B logname
already exists (if
.B -m -l
is specified).
.RE

.SH NOTES
.sp
.LP
Do not use a colon (\fB:\fR) or \fBRETURN\fR as part of an argument. It is
interpreted as a field separator in the password file. The \fBpassmgmt\fR
command will be removed in a future release. Its functionality has been
replaced and enhanced by
.BR useradd ,
.BR userdel ,
and
.BR usermod .
These commands are currently available.
.sp
.LP
This command only modifies password definitions in the local
.B /etc/passwd
and
.B /etc/shadow
files. If a network nameservice such
as
.B NIS
or
.B NIS+
is being used to supplement the local files with
additional entries,
.B passmgmt
cannot change information supplied by the
network nameservice.
