usr/src/man/man1m/ping.1m
'\" te
.\" Copyright (C) 2012, J. Schilling. All Rights Reserved
.\" Copyright (C) 2006, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright 1989 AT&T
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ping 1M "13 Aug 2012" "SunOS 5.11" "System Administration Commands"
.SH NAME
ping \- send ICMP (ICMP6) ECHO_REQUEST packets to network hosts
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/ping\fR \fIhost\fR [\fItimeout\fR]
.fi

.LP
.nf
\fB/usr/sbin/ping\fR \fB\-s\fR [\fB\-l\fR | \fB\-U\fR] [\fB\-abdlLnrRv\fR] [\fB\-A\fR \fIaddr_family\fR]
     [\fB\-c\fR \fItraffic_class\fR] [\fB\-g\fR \fIgateway\fR [\fB\-g\fR \fIgateway\fR...]]
     [\fB\-N\fR \fInext_hop_router\fR] [\fB\-F\fR \fIflow_label\fR] [\fB\-I\fR \fIinterval\fR]
     [\fB\-i\fR \fIinterface\fR] [\fB\-P\fR \fItos\fR] [\fB\-p\fR \fIport\fR] [\fB\-t\fR \fIttl\fR] \fIhost\fR
     [\fIdata_size\fR] [\fInpackets\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The utility
.B ping
utilizes the
.B ICMP
.RB ( ICMP6
in IPv6) protocol's
.B ECHO_REQUEST
datagram to elicit an
.B ICMP
.RB ( ICMP6 )
.B ECHO_RESPONSE
from the specified
.I host
or network
.IR gateway .
If
.I host
responds,
.B ping
will print:
.sp
.in +2
.I host
is alive
.in -2

.LP
on the standard output and exit. Otherwise, after
.I timeout
seconds, it will write:
.sp
.in +2
no answer from
.I host
.in -2

.LP
The default value of
.I timeout
is
.B 20
seconds.

.LP
When you specify the s flag, sends one datagram per second (adjust with
.BR \-I )
and prints one line of output for every
.B ECHO_RESPONSE
that it receives.
.B ping
produces no output if there is no response. In this second form,
.B ping
computes round trip times and packet loss statistics;
it displays a summary of this information upon termination or timeout. The
default
.I data_size
is
.B 56
bytes, or you can specify a size with the
.I data_size
command-line argument. If you specify the optional
.IR npackets ,
.B ping
sends
.B ping
requests until it either sends
.I npackets
requests or receives
.I npackets
replies.

.LP
When using
.B ping
for fault isolation, first
.B ping
the local host to verify that the local network interface is running.
.br
.ne 6
.SH OPTIONS
.LP
The following options are supported:
.br
.ne 3
.TP 20
.BI  \-A " addr_family
Specify the address family of the target host.
.I addr_family
can be either
.B inet
or
.BR inet6 .
Address family determines which protocol to use. For an argument of
.BR inet ,
IPv4 is used. For
.BR inet6 ,
IPv6 is used.
.sp
By default, if the name of a host is provided, not the literal
.B IP
address, and a valid IPv6 address exists in the name service database,
.B ping
will use this address. Otherwise, if the name service database
contains an IPv4 address, it will try the IPv4 address.
.sp
Specify the address family
.B inet
or
.B inet6
to override the default
behavior. If the argument specified is
.BR inet ,
.B ping
will use the
IPv4 address associated with the host name. If none exists,
.B ping
will
state that the host is unknown and exit. It does not try to determine if an
IPv6 address exists in the name service database.
.sp
If the specified argument is
.BR inet6 ,
.B ping
uses the IPv6 address
that is associated with the host name. If none exists,
.B ping
states that the host is unknown and exits.
.br
.ne 3
.TP
.BI \-F " flow_label
Specify the flow label of probe packets. The value must be an integer in the
range from 0 to 1048575. This option is valid only on IPv6.
.br
.ne 3
.TP
.BI \-I " interval
Turn on the statistics mode and specify the interval between successive
transmissions. The default is one second.
.I Interval
may be a floating point number, intervals less than a second are possible.
An
.I interval
of 0 is prevented by a denial of service attack limit in the code.
See the discussion of the
.B \-s
option.
.br
.ne 3
.TP
.B \-L
Turn off loopback of multicast packets. Normally, members are in the host
group on the outgoing interface, a copy of the multicast packets will be
delivered to the local machine.
.br
.ne 3
.TP
.BI \-N " next_hop_router
Specify a next-hop router so that the probe packet goes through the specified
router along its path to the target host. This option essentially bypasses the
system routing table and leaves the probe packet header unmodified. Only one
next-hop router can be specified.
.br
.ne 3
.TP
.BI \-P " tos
Set the type of service
.RI ( tos )
in probe packets to the specified value.
The default is zero. The value must be an integer in the range from 0 to 255.
Gateways also in the path can route the probe packet differently, depending
upon the value of
.I tos
that is set in the probe packet. This option is valid only on IPv4.
.br
.ne 3
.TP
.B \-R
Record route. Sets the IPv4 record route option, which stores the route of
the packet inside the IPv4 header. The contents of the record route are only
printed if the
.B \-v
and
.B \-s
options are given. They are only set on
return packets if the target host preserves the record route option across
echos, or the
.B \-l
option is given. This option is valid only on IPv4.
.br
.ne 3
.TP
.B \-U
Send
.B UDP
packets instead of
.B ICMP
.RB ( ICMP6 )
packets.
.B ping
sends
.B UDP
packets to consecutive ports expecting to receive back
.B ICMP
.RB ( ICMP6 )
.B PORT_UNREACHABLE
from the target host.
.br
.ne 3
.TP
.B \-a
.B ping
all addresses, both IPv4 and IPv6, of the multihomed destination.
The output appears as if
.B ping
has been run once for each
.B IP
address of the destination. If this option is used together with
.BR \-A ,
.B ping
probes only the addresses that are of the specified address family.
When used with the
.B \-s
option and
.I npackets
is not specified,
.B ping
continuously probes the destination addresses in a round robin
fashion. If
.I npackets
is specified,
.B ping
sends
.I npackets
number of probes to each
.B IP
address of the destination and then exits.
.br
.ne 3
.TP
.B  \-b
Bypass the global IPsec policy and send and receive packets in the clear for
this connection only. This option can be used to troubleshoot network
connectivity independent of IPsec. Because this option bypasses system-wide
policy for this connection, it can only be used by superuser or a user granted
the sys_net_config privilege.
.br
.ne 3
.TP
.BI \-c " traffic_class
Specify the traffic class of probe packets. The value must be an integer in
the range from 0 to 255. Gateways along the path can route the probe packet
differently, depending upon the value of
.I traffic_class
set in the probe packet. This option is valid only on IPv6.
.br
.ne 3
.TP
.B \-d
Set the
.B SO_DEBUG
socket option.
.br
.ne 3
.TP
.BI \-g " gateway
Specify a loose source route gateway so that the probe packet goes through
the specified host along the path to the target host. The maximum number of
gateways is 8 for IPv4 and 127 for IPv6. Note that some factors such as the
link
.B MTU
can further limit the number of gateways for IPv6.
.br
.ne 3
.TP
.BI \-i " interface_address
Specify the outgoing interface address to use for multicast packets for IPv4
and both multicast and unicast packets for IPv6. The default interface address
for multicast packets is determined from the (unicast) routing tables.
.I interface_address
can be a literal
.B IP
address, for example,
.BR 10.123.100.99 ,
or an interface name, for example,
.BR eri0 ,
or an interface index, for example
.BR 2 .
.br
.ne 3
.TP
.B \-l
Use to send the probe packet to the given host and back again using loose
source routing. Usually specified with the
.B \-R
option. If any gateways are specified using
.BR \-g ,
they are visited twice, both to and from the
destination. This option is ignored if the
.B \-U
option is used.
.br
.ne 3
.TP
.B \-n
Show network addresses as numbers.
.B ping
normally does a reverse name
lookup on the IP addresses it extracts from the packets received. The
.B \-n
option blocks the reverse lookup, so
.B ping
prints IP addresses instead of host names.
.br
.ne 3
.TP
.BI \-p " port
Set the base
.B UDP
.I port
number used in probes. This option is used
with the
.B \-U
option. The default base
.I Iport
number is 33434. The
.B ping
utility starts setting the destination port number of
.B UDP
packets to this base and increments it by one at each probe.
.br
.ne 3
.TP
.B \-r
Bypass the normal routing tables and send directly to a host on an attached
network. If the host is not on a directly attached network, an error is
returned. This option can be used to
.B ping
a local host through an interface that has been dropped by the router daemon.
See
.BR in.routed (1M).
.br
.ne 3
.TP
.B \-s
Send one datagram per second and collect statistics.
.br
.ne 3
.TP
.BI \-t " ttl
Specify the IPv4 time to live, or IPv6 hop limit, for unicast and multicast
packets. The default time to live (hop limit) for unicast packets can be set
with the
.B ndd
module,
.BR /dev/icmp ,
using the
.B cmp_ipv4_ttl
variable for IPv4 and the
.B icmp_ipv6_hoplimit
variable for IPv6. The
default time to live (hop limit) for multicast is one hop. See
.BR EXAMPLES .
For further information, see
.BR ndd (1M).
.br
.ne 3
.TP
.B \-v
Verbose output. List any
.B ICMP
.RB ( ICMP6 )
packets, other than replies from the target host.

.SH OPERANDS
.LP
.br
.ne 3
.TP 20
.I host
The network host

.SH EXAMPLES
.LP
.B Example 1
Using
.B ping
with IPv6

.LP
This example shows
.B ping
sending probe packets to all the IPv6 addresses
of the host
.BR xyz ,
one at a time. It sends an
.B ICMP6
.B ECHO_REQUEST
every second until the user interrupts it.

.sp
.in +2
.nf
istanbul% \fBping -s -A inet6 -a xyz\fR
PING xyz: 56 data bytes
64 bytes from xyz (4::114:a00:20ff:ab3d:83ed): icmp_seq=0. time=0.479 ms
64 bytes from xyz (fec0::114:a00:20ff:ab3d:83ed): icmp_seq=1. time=0.843 ms
64 bytes from xyz (4::114:a00:20ff:ab3d:83ed): icmp_seq=2. time=0.516 ms
64 bytes from xyz (fec0::114:a00:20ff:ab3d:83ed): icmp_seq=3. time=4.943 ms
64 bytes from xyz (4::114:a00:20ff:ab3d:83ed): icmp_seq=4. time=0.485 ms
64 bytes from xyz (fec0::114:a00:20ff:ab3d:83ed): icmp_seq=5. time=2.201 ms
^C
----xyz PING Statistics----
6 packets transmitted, 6 packets received, 0% packet loss
round-trip (ms)  min/avg/stddev = 0.479/1.583/4.943/1.823
.fi
.in -2
.sp

.LP
.B Example 2
Using
.B ndd
to set the
.B icmp_ipv6_hoplimit

.LP
This example shows the
.B ndd
module,
.BR /dev/icmp ,
used to set the
.BR icmp_ipv6_hoplimit .

.in +2
.nf
# ndd -set /dev/icmp icmp_ipv6_hoplimit 100
.fi
.in -2

.SH EXIT STATUS
.LP
The following exit values are returned:
.br
.ne 3
.TP 15
.B 0
Successful operation; the machine is alive.
.br
.ne 3
.TP
.B non-zero
An error has occurred. Either a malformed argument has been specified, or the
machine was not alive.

.SH ATTRIBUTES
.LP
See
.BR attributes (5)
for descriptions of the following attributes:

.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWbip
.TE

.SH SEE ALSO
.LP
.BR ifconfig (1M),
.BR in.routed (1M),
.BR ndd (1M),
.BR netstat (1M),
.BR rpcinfo (1M),
.BR traceroute (1M),
.BR attributes (5),
.BR icmp (7P),
.BR icmp6 (7P).
