usr/src/man/man1m/pkgchk.1m
'\" te
.\" Copyright 1989 AT&T Copyright (c) 2007, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH pkgchk 1M "30 Oct 2007" "SunOS 5.11" "System Administration Commands"
.SH NAME
pkgchk \- check package installation accuracy
.SH SYNOPSIS
.LP
.nf
\fBpkgchk\fR [\fB-l\fR | \fB-acfnqvx\fR] [\fB-i\fR \fIfile\fR | -]
     [\fB-p\fR \fIpath\fR.\|.\|. | \fB-P\fR \fIpartial-path\fR.\|.\|.] [\fB-R\fR \fIroot_path\fR]
     [ [\fB-m\fR \fIpkgmap\fR [\fB-e\fR \fIenvfile\fR]] | pkginst.\|.\|. | \fB-Y\fR \fIcategory\fR,\fIcategory\fR\&.\|.\|.]
.fi

.LP
.nf
\fBpkgchk\fR \fB-d\fR \fIdevice\fR [\fB-l\fR | \fB-fv\fR] [\fB-i\fR \fIfile\fR | -] [\fB-M\fR] [\fB-p\fR \fIpath\fR].\|.\|.
     [\fB-V\fR \fIfs_file\fR]
     [pkginst.\|.\|. | \fB-Y\fR \fIcategory\fR[,\fIcategory\fR\&.\|.\|.]]
.fi

.SH DESCRIPTION
.sp
.LP
.B pkgchk
checks the accuracy of installed files or, by using the
.B -l
option, displays information about package files.
.B pkgchk
checks the integrity of directory structures and files. Discrepancies are
written to standard error along with a detailed explanation of the
problem.
.sp
.LP
The first synopsis defined above is used to list or check the contents
and/or attributes of objects that are currently installed on the system, or
in the indicated
.BR pkgmap .
Package names may be listed on the command
line, or by default, the entire contents of a machine will be checked.
.sp
.LP
The second synopsis is used to list or check the contents of a package
which has been spooled on the specified device, but not installed. Note that
attributes cannot be checked for spooled packages.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -a
.ad
.sp .6
.RS 4n
Audit the file attributes only and do not check file contents. Default is
to check both.
.RE

.sp
.ne 2
.mk
.na
.B -c
.ad
.sp .6
.RS 4n
Audit the file contents only and do not check file attributes. Default is
to check both.
.RE

.sp
.ne 2
.mk
.na
.B -d
.I device
.ad
.sp .6
.RS 4n
Specify the device on which a spooled package resides.
.I device
can be
a directory path name or the identifiers for tape, floppy disk, or removable
disk (for example,
.B /var/tmp
or
.BR /dev/diskette ).
.RE

.sp
.ne 2
.mk
.na
.B -e
.I envfile
.ad
.sp .6
.RS 4n
Request that the package information file named as
.I envfile
be used to
resolve parameters noted in the specified
.B pkgmap
file.
.RE

.sp
.ne 2
.mk
.na
.B -f
.ad
.sp .6
.RS 4n
Correct file attributes if possible. If used with the
.B -x
option, this
option removes hidden files. When
.B pkgchk
is invoked with this option,
it creates directories, named pipes, links, and special devices if they do
not already exist. If the
.B -d
option calls out an uninstalled package,
the
.B -f
option will only take effect if the package is in directory
(not stream) format. All file attributes will be set to agree with the
entries in the
.B pkgmap
file except that setuid, setgid, and sticky bits
will not be set in the mode.
.RE

.sp
.ne 2
.mk
.na
.B -i
.I file
|
.B -
.ad
.sp .6
.RS 4n
Read a list of path names from
.I file
or from stdin (\fB-\fR) and
compare this list against the installation software database or the
indicated
.B pkgmap
file. Path names that are not contained in
.I file
or stdin are not checked.
.RE

.sp
.ne 2
.mk
.na
.B -l
.ad
.sp .6
.RS 4n
List information on the selected files that make up a package. This option
is not compatible with the
.BR -a ,
.BR -c ,
.BR -f ,
.BR -g ,
and
.B -v
options.
.RE

.sp
.ne 2
.mk
.na
.B -m pkgmap
.ad
.sp .6
.RS 4n
Check the package against the package map file,
.BR pkgmap .
.RE

.sp
.ne 2
.mk
.na
.B -M
.ad
.sp .6
.RS 4n
Instruct
.B pkgchk
not to use the
\fB$\fIroot_path\fB/etc/vfstab\fR file for determining the client's
mount points. This option assumes the mount points are correct on the server
and it behaves consistently with Solaris 2.5 and earlier releases.
.RE

.sp
.ne 2
.mk
.na
.B -n
.ad
.sp .6
.RS 4n
Do not check volatile or editable files' contents. This should be used for
most post-installation checking.
.RE

.sp
.ne 2
.mk
.na
.B -p
.I path
.ad
.sp .6
.RS 4n
Check the accuracy only of the path name or path names listed.
.I path
can be one or more path names separated by commas (or by whitespace, if the
list is quoted).
.sp
To specify a
.I path
.RB "that includes a comma, you must use the" " -i"
option, described above. See EXAMPLES.
.RE

.sp
.ne 2
.mk
.na
.B -P
.I partial-path
.ad
.sp .6
.RS 4n
Check the accuracy of only the partial path name or path names listed.
.I partial-path
can be one or more partial path names separated by commas
(or by whitespace, if the list is quoted). This option can be used instead
of
.B -p
and is not compatible with the other option. This option matches
any path name that contains the string contained in the partial path. See
the note about paths that contain commas in the description of
.BR -p .
.RE

.sp
.ne 2
.mk
.na
.B -q
.ad
.sp .6
.RS 4n
Quiet mode. Do not give messages about missing files.
.RE

.sp
.ne 2
.mk
.na
.B -R
.I root_path
.ad
.sp .6
.RS 4n
Define the full name of a directory to use as the
.IR root_path .
All
files, including package system information files, are relocated to a
directory tree starting in the specified
.IR root_path .
The
.I root_path
may be specified when installing to a client from a server
(for example,
.BR /export/root/client1 ).
.LP
Note -
.sp
.RS 2
The root file system of any non-global zones must not be referenced with
the
.B -R
option. Doing so might damage the global zone's file system,
might compromise the security of the global zone, and might damage the
non-global zone's file system. See
.BR zones (5).
.RE
.RE

.sp
.ne 2
.mk
.na
.B -v
.ad
.sp .6
.RS 4n
Verbose mode. Files are listed as processed.
.RE

.sp
.ne 2
.mk
.na
.B -V
.I fs_file
.ad
.sp .6
.RS 4n
Specify an alternative
.I fs_file
to map the client's file systems. For
example, used in situations where the
\fB$\fIroot_path\fB/etc/vfstab\fR file is non-existent or
unreliable.
.RE

.sp
.ne 2
.mk
.na
.B -x
.ad
.sp .6
.RS 4n
Search exclusive directories, looking for files which exist that are not in
the installation software database or the indicated
.B pkgmap
file.
.RE

.sp
.ne 2
.mk
.na
.B -Y
.I category
.ad
.sp .6
.RS 4n
Check packages based on the value of the
.B CATEGORY
parameter stored in
the installed or spooled package's
.BR pkginfo (4)
file.
.RE

.SH OPERANDS
.sp
.ne 2
.mk
.na
.I pkginst
.ad
.sp .6
.RS 4n
The package instance or instances to be checked. The format
\fIpkginst\fB\&.*\fR can be used to check all instances of a package. The
default is to display all information about all installed packages.
.sp
The asterisk character
.RB ( * )
is a special character to some shells and
may need to be escaped. In the C-Shell, an asterisk must be surrounded by
single quotes (\fB\&'\fR) or preceded by a backslash (\e);
.RE

.sp
.ne 2
.mk
.na
.I partial-path
.ad
.sp .6
.RS 4n
A portion of a path, such as a file or directory name.
.RE

.SH EXAMPLES
.LP
.B Example 1
Using
.B pkgchk
for Displaying Package Installation
Information
.sp
.LP
The following example displays package installation information for
.BR /usr/bin/ls :

.sp
.in +2
.nf
example% \fBpkgchk -l -p /usr/bin/ls\fR
.fi
.in -2
.sp

.LP
.B Example 2
Checking on Java Font Properties
.sp
.LP
The following example displays package installation information for all
Java font properties installed on the system.

.sp
.in +2
.nf
example% \fBpkgchk -l -P font.properties\fR
.fi
.in -2
.sp

.LP
.B Example 3
Specifying a Path That Contains a Comma
.sp
.LP
Assume you want to specify the path:

.sp
.in +2
.nf
/platform/SUNW,Netra-T12/lib
.fi
.in -2
.sp

.sp
.LP
List this path in a file. Here is one way in which you can do that:

.sp
.in +2
.nf
example% \fBecho "/platform/SUNW,Netra-T12/lib" > /tmp/p\fR
.fi
.in -2
.sp

.sp
.LP
You can then enter:

.sp
.in +2
.nf
example% \fBpkgchk -i /tmp/p -l\fR
Pathname: /platform/SUNW,Netra-T12/lib
Type: directory
Expected mode: 0755
Expected owner: root
Expected group: bin
Referenced by the following packages:
        SUNWcar
Current status: installed
.fi
.in -2
.sp

.SH EXIT STATUS
.sp
.ne 2
.mk
.na
.B 0
.ad
.sp .6
.RS 4n
Successful completion.
.RE

.sp
.ne 2
.mk
.na
.B >0
.ad
.sp .6
.RS 4n
An error occurred.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.sp
.LP
.BR pkginfo (1),
.BR pkgtrans (1),
.BR pkgadd (1M),
.BR pkgask (1M),
.BR pkgrm (1M),
.BR pkginfo (4),
.BR attributes (5),
.BR largefile (5)
.sp
.LP
\fR
.SH NOTES
.sp
.LP
Package commands are
.BR largefile (5)-aware.
They handle files larger
than 2 GB in the same way they handle smaller files. In their current
implementations,
.BR pkgadd (1M),
.BR pkgtrans (1)
and other package
commands can process a datastream of  up to 4 GB.
