usr/src/man/man1m/plockstat.1m
'\" te
.\" Copyright (c) 2009, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH plockstat 1M "26 Jan 2009" "SunOS 5.11" "System Administration Commands"
.SH NAME
plockstat \- report user-level lock statistics
.SH SYNOPSIS
.LP
.nf
\fBplockstat\fR [\fB-vACHV\fR] [\fB-n\fR \fIcount\fR] [\fB-s\fR \fIdepth\fR] [\fB-e\fR \fIsecs\fR]
     [\fB-x\fR \fIarg\fR [=val]] \fIcommand\fR [\fIarg\fR]...
.fi

.LP
.nf
\fBplockstat\fR [\fB-vACHV\fR] [\fB-n\fR \fIcount\fR] [\fB-s\fR \fIdepth\fR] [\fB-e\fR \fIsecs\fR]
     [\fB-x\fR \fIarg\fR [=val]] \fB-p\fR \fIpid\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B plockstat
utility gathers and displays user-level locking
statistics. By default,
.B plockstat
monitors all lock contention events,
gathers frequency and timing data about those events, and displays the data
in decreasing frequency order, so that the most common events appear
first.
.sp
.LP
.B plockstat
gathers data until the specified command completes or the
process specified with the
.B -p
option completes.
.sp
.LP
.B plockstat
relies on DTrace to instrument a running process or a
command it invokes to trace events of interest. This imposes a small but
measurable performance overhead on the processes being observed. Users must
have the
.B dtrace_proc
privilege and have permission to observe a
particular process with
.BR plockstat .
Refer to the\fR  for more
information about DTrace security features.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -A
.ad
.RS 16n
.rt
Watch all lock events. This option is equivalent to
.BR -CH .
.RE

.sp
.ne 2
.mk
.na
.B -C
.ad
.RS 16n
.rt
Watch contention events.
.RE

.sp
.ne 2
.mk
.na
.B -H
.ad
.RS 16n
.rt
Watch hold events.
.RE

.sp
.ne 2
.mk
.na
.B -e
.I secs
.ad
.RS 16n
.rt
Exit after the number of seconds specified have elapsed.
.RE

.sp
.ne 2
.mk
.na
.B -n
.I count
.ad
.RS 16n
.rt
Display only the specified number of entries for each output category.
.RE

.sp
.ne 2
.mk
.na
.B -s
.I depth
.ad
.RS 16n
.rt
Record a stack trace rather than just the calling function.
.RE

.sp
.ne 2
.mk
.na
.B -p
.I pid
.ad
.RS 16n
.rt
Specify a process ID from which
.B plockstat
is to gather data.
.RE

.sp
.ne 2
.mk
.na
.B -v
.ad
.RS 16n
.rt
Print out a message to indicate that tracing has started.
.RE

.sp
.ne 2
.mk
.na
\fB-x\fR \fIarg\fR[=\fIval\fR]\fR
.ad
.RS 16n
.rt
Enable or modify a DTrace runtime option or D compiler option. The list of
options is found in the
.IR "Solaris Dynamic Tracing Guide" .
Boolean options
are enabled by specifying their name. Options with values are set by
separating the option name and value with an equals sign
.RB ( = ).
.RE

.sp
.ne 2
.mk
.na
.B -V
.ad
.RS 16n
.rt
Print the Dtrace commands used to gather the data. The output can then be
used directly with the
.BR dtrace "(1M) command."
.RE

.SH OPERANDS
.sp
.LP
The following operands are supported:
.sp
.ne 2
.mk
.na
.I arg
.ad
.RS 11n
.rt
A string to be passed as an argument to
.IR command .
.RE

.sp
.ne 2
.mk
.na
.I command
.ad
.RS 11n
.rt
The name of a utility to be invoked.
.RE

.sp
.ne 2
.mk
.na
.I count
.ad
.RS 11n
.rt
A positive integer value.
.RE

.sp
.ne 2
.mk
.na
.I pid
.ad
.RS 11n
.rt
A process identifier for a process to be monitored.
.RE

.sp
.ne 2
.mk
.na
.I secs
.ad
.RS 11n
.rt
Duration specified as a positive integer number of seconds.
.RE

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 6n
.rt
Successful completion.
.RE

.sp
.ne 2
.mk
.na
.B >0
.ad
.RS 6n
.rt
An error occurred.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWdtrc
_
Interface StabilitySee below.
.TE

.sp
.LP
The command-line syntax is Evolving. The human-readable output is
Unstable.
.SH SEE ALSO
.sp
.LP
.BR dtrace (1M),
.BR lockstat (1M),
.BR mutex_init (3C),
.BR pthread_mutex_lock (3C),
.BR pthread_rwlock_rdlock (3C),
.BR pthread_rwlock_wrlock (3C),
.BR pthread_rwlock_unlock (3C),
.BR rwlock (3C),
.BR attributes (5),
.BR fasttrap (7D)
.sp
.LP
\fR
