usr/src/man/man1m/pmadm.1m
'\" te
.\" Copyright 1989 AT&T Copyright (c) 1998, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH pmadm 1M "10 Nov 1998" "SunOS 5.11" "System Administration Commands"
.SH NAME
pmadm \- port monitor administration
.SH SYNOPSIS
.LP
.nf
\fBpmadm\fR \fB-a\fR [\fB-p\fR \fIpmtag\fR | \fB-t\fR \fItype\fR] \fB-s\fR \fIsvctag\fR \fB-i\fR \fIid\fR \fB-m\fR \fIpmspecific\fR \fB-v\fR \fIver\fR
     [\fB-f\fR xu]
     [\fB-y\fR \fIcomment\fR] [\fB-z\fR \fI script\fR]
.fi

.LP
.nf
\fBpmadm\fR \fB-r\fR \fB-p\fR \fIpmtag\fR \fB-s\fR \fIsvctag\fR
.fi

.LP
.nf
\fBpmadm\fR \fB-e\fR \fB-p\fR \fIpmtag\fR \fB-s\fR \fIsvctag\fR
.fi

.LP
.nf
\fBpmadm\fR \fB-d\fR \fB-p\fR \fIpmtag\fR \fB-s\fR \fIsvctag\fR
.fi

.LP
.nf
\fBpmadm\fR \fB-l\fR [\fB-t\fR \fItype\fR | \fB-p\fR \fIpmtag\fR] [\fB-s\fR \fIsvctag\fR]
.fi

.LP
.nf
\fBpmadm\fR \fB-L\fR [\fB-t\fR \fItype\fR | \fB-p\fR \fIpmtag\fR] [\fB-s\fR \fIsvctag\fR]
.fi

.LP
.nf
\fBpmadm\fR \fB-g\fR \fB-p\fR \fIpmtag\fR \fB-s\fR \fIsvctag\fR [\fB-z\fR \fIscript\fR]
.fi

.LP
.nf
\fBpmadm\fR \fB-g\fR \fB-s\fR \fIsvctag\fR \fB-t\fR \fItype\fR \fB-z\fR \fIscript\fR
.fi

.SH DESCRIPTION
.sp
.LP
.B pmadm
is the administrative command for the lower level of the
Service Access Facility hierarchy, that is, for service administration. A
port may have only one service associated with it although the same service
may be available through more than one port. In order to uniquely identify
an instance of a service, the
.B pmadm
command must identify both the
port monitor or port monitors through which the service is available
(\fB-p\fR or
.BR -t )
and the service
.RB ( -s ).
See .
.sp
.LP
.B pmadm
performs the following functions:
.RS +4
.TP
.ie t \(bu
.el o
adds or removes a service
.RE
.RS +4
.TP
.ie t \(bu
.el o
enables or disables a service
.RE
.RS +4
.TP
.ie t \(bu
.el o
installs or replaces a per-service configuration script
.RE
.RS +4
.TP
.ie t \(bu
.el o
prints requested service information
.RE
.sp
.LP
Any user on the system may invoke
.B pmadm
to request service status
(\fB-l\fR or
.BR -L )
or to print per-service configuration scripts
(\fB-g\fR without the \fB-z\fR option). \fBpmadm\fR with other options may
be executed only by a privileged user.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -a
.ad
.RS 17n
.rt
Add a service.
.B pmadm
adds an entry for the new service to the port
monitor's administrative file. Because of the complexity of the options and
arguments that follow the
.B -a
option, it may be convenient to use a
command script or the menu system to add services.
.RE

.sp
.ne 2
.mk
.na
.B -d
.ad
.RS 17n
.rt
Disable a service. Add
.B x
to the flag field in the entry for the
service
.I svctag
in the port monitor's administrative file. This is the
entry used by port monitor
.IR pmtag .
See the
.B -f
option, below, for
a description of the flags available.
.RE

.sp
.ne 2
.mk
.na
.B -e
.ad
.RS 17n
.rt
Enable a service. Remove
.B x
from the flag field in the entry for the
service
.I svctag
in the port monitor administrative file. This is the
entry used by port monitor
.IR pmtag .
See the
.B -f
option, below, for
a description of the flags available.
.RE

.sp
.ne 2
.mk
.na
.B -f xu
.ad
.RS 17n
.rt
The
.B -f
option specifies one or both of the following two flags which
are then included in the flag field of the entry for the new service in the
port monitor's administrative file. If the
.B -f
option is not included,
no flags are set and the default conditions prevail. By default, a new
service is enabled and no
.B utmpx
entry is created for it. An \fB-f\fR
option without a following argument is illegal.
.sp
.ne 2
.mk
.na
.B x
.ad
.RS 5n
.rt
Do not enable the service
.I svctag
available through port monitor
.IR pmtag .
.RE

.sp
.ne 2
.mk
.na
.B u
.ad
.RS 5n
.rt
Create a
.B utmpx
entry for service
.I svctag
available through port
monitor
.IR pmtag .
.RE

.RE

.sp
.ne 2
.mk
.na
.B -g
.ad
.RS 17n
.rt
Print, install, or replace a per-service configuration script. The \fB-g\fR
option with a
.B -p
option and a
.B -s
option prints the per-service
configuration script for service
.I svctag
available through port monitor
.IR pmtag .
The
.B -g
option with a
.B -p
option, a
.B -s
option,
and a
.B -z
option installs the per-service configuration script
contained in the file
.B script
as the per-service configuration script
for service
.I svctag
available through port monitor
.IR pmtag .
The
.B -g
option with a
.B "- s"
option, a
.B -t
option, and a
.B -z
option installs the file
.B script
as the per-service configuration
script for service
.I svctag
available through any port monitor of type
.BR type .
Other combinations of options with
.B -g
are invalid.
.RE

.sp
.ne 2
.mk
.na
.BI -i " id"
.ad
.RS 17n
.rt
.B id
is the identity that is to be assigned to service
.IR svctag
when it is started.
.B id
must be an entry in
.BR /etc/passwd .
.RE

.sp
.ne 2
.mk
.na
.B -l
.ad
.RS 17n
.rt
The
.B -l
option requests service information. Used by itself and with
the options described below, it provides a filter for extracting information
in several different groupings.
.sp
.ne 2
.mk
.na
.B -l
.ad
.RS 23n
.rt
By itself, the
.B -l
option lists all services on the system.
.RE

.sp
.ne 2
.mk
.na
.BI "-l -p " pmtag
.ad
.RS 23n
.rt
Lists all services available through port monitor
.IR pmtag .
.RE

.sp
.ne 2
.mk
.na
.BI "-l -s " svctag
.ad
.RS 23n
.rt
Lists all services with tag
.IR svctag .
.RE

.sp
.ne 2
.mk
.na
\fB-l -p \fIpmtag\fB-s\fIsvctag\fR
.ad
.RS 23n
.rt
Lists service
.IR svctag .
.RE

.sp
.ne 2
.mk
.na
.BI "-l -t " type
.ad
.RS 23n
.rt
Lists all services available through port monitors of type
.BR type .
.RE

.sp
.ne 2
.mk
.na
\fB-l -t \fItype\fB-s\fIsvctag\fR
.ad
.RS 23n
.rt
Lists all services with tag
.I svctag
available through a port monitor
of type
.BR type .
.RE

Other combinations of options with
.B -l
are invalid.
.RE

.sp
.ne 2
.mk
.na
.B -L
.ad
.RS 17n
.rt
The
.B -L
option is identical to the
.B -l
option except that output
is printed in a condensed format.
.RE

.sp
.ne 2
.mk
.na
\fB-m\fI pmspecific\fR
.ad
.RS 17n
.rt
.I pmspecific
is the port monitor-specific portion of the port monitor
administrative file entry for the service.
.RE

.sp
.ne 2
.mk
.na
.BI -p " pmtag"
.ad
.RS 17n
.rt
Specifies the tag associated with the port monitor through which a service
(specified as \fB-s
.IR svctag )
is available.
.RE

.sp
.ne 2
.mk
.na
.B -r
.ad
.RS 17n
.rt
Remove a service. When
.B pmadm
removes a service, the entry for the
service is removed from the port monitor's administrative file.
.RE

.sp
.ne 2
.mk
.na
.BI -s " svctag"
.ad
.RS 17n
.rt
Specifies the service tag associated with a given service. The service tag
is assigned by the system administrator and is part of the entry for the
service in the port monitor's administrative file.
.RE

.sp
.ne 2
.mk
.na
.BI -t " type"
.ad
.RS 17n
.rt
Specifies the port monitor type.
.RE

.sp
.ne 2
.mk
.na
.BI -v " ver"
.ad
.RS 17n
.rt
Specifies the version number of the port monitor administrative file. The
version number may be given as
.sp
.in +2
.nf
\fB-v\fR \fB\&'\fIpmspec\fR \fB-V\fR
.fi
.in -2
.sp

where
.I pmspec
is the special administrative command for port monitor
.IR pmtag .
This special command is
.B ttyadm
for
.B ttymon
and
.B nlsadmin
for
.BR listen .
The version stamp of the port monitor is
known by the command and is returned when
.I pmspec
is invoked with a
.B -V
option.
.RE

.sp
.ne 2
.mk
.na
.BI -y " comment"
.ad
.RS 17n
.rt
Associate
.I comment
with the service entry in the port monitor
administrative file.
.RE

.sp
.ne 2
.mk
.na
.BI -z " script"
.ad
.RS 17n
.rt
Used with the
.B -g
option to specify the name of the file that contains
the per-service configuration script. Modifying a configuration script is a
three-step procedure. First a copy of the existing script is made (\fB-g\fR
alone). Then the copy is edited. Finally, the copy is put in place over the
existing script (\fB-g\fR with
.BR -z ).
.RE

.sp
.LP
Options that request information write the requested information to the
standard output. A request for information using the
.B -l
option prints
column headers and aligns the information under the appropriate headings. In
this format, a missing field is indicated by a hyphen. A request for
information in the condensed format using the
.B -L
option prints the
information in colon-separated fields; missing fields are indicated by two
successive colons.
.B #
is the comment character.
.SH EXAMPLES
.LP
.B Example 1
Adding a Service to a Port Monitor with the Tag
.B pmtag
.sp
.LP
The following command adds a service to a port monitor with tag
.BR pmtag
and gives the service the tag
.BR svctag .
The port monitor-specific
information is generated by
.BR specpm .
The service defined by
.B svctag
will be invoked with identity
.BR root .

.sp
.in +2
.nf
pmadm -a -p pmtag -s svctag -i root -m `specpm -a arg1 -b arg2`-v `specpm -V`
.fi
.in -2
.sp

.LP
.B Example 2
Adding a Service with Service Tab
.BR svctag
.sp
.LP
The following command adds a service with service tag
.BR svctag ,
identity
.BR guest ,
and port monitor-specific information generated by
.B specpm
to all port monitors of type
.BR type :

.sp
.in +2
.nf
pmadm -a -s svctag -i guest -t type -m `specpm -a arg1 -b arg2`-v `specpm -V`
.fi
.in -2
.sp

.LP
.B Example 3
Removing a Service
.sp
.LP
The following command removes the service
.B svctag
from port monitor
.BR pmtag :

.sp
.in +2
.nf
pmadm -r -p pmtag -s svctag
.fi
.in -2
.sp

.LP
.B Example 4
Enabling a Service
.sp
.LP
The following command enables the service
.B svctag
available through
port monitor
.BR pmtag :

.sp
.in +2
.nf
pmadm -e -p pmtag -s svctag
.fi
.in -2
.sp

.LP
.B Example 5
Disabling a Service
.sp
.LP
The following command disables the service
.B svctag
available through
port monitor
.BR pmtag :

.sp
.in +2
.nf
pmadm -d -p pmtag -s svctag
.fi
.in -2
.sp

.LP
.B Example 6
Listing Status Information
.sp
.LP
The following command lists status information for all services:

.sp
.in +2
.nf
pmadm -l
.fi
.in -2
.sp

.LP
.B Example 7
Listing Status Information
.sp
.LP
The following command lists status information for all services available
through the port monitor with tag
.BR ports :

.sp
.in +2
.nf
pmadm -l -p ports
.fi
.in -2
.sp

.LP
.B Example 8
Listing Status Information in Condensed Format
.sp
.LP
The following command lists the status information for all services
available through the port monitor with tag
.B ports
in condensed
format:

.sp
.in +2
.nf
pmadm -L -p ports
.fi
.in -2
.sp

.LP
.B Example 9
Listing Status Information for All Services
.sp
.LP
List status information for all services available through port monitors of
type
.BR listen :

.sp
.in +2
.nf
pmadm -l -t listen
.fi
.in -2
.sp

.LP
.B Example 10
Printing the per-service Configuration
.sp
.LP
The following command prints the per-service configuration script
associated with the service
.B svctag
available through port monitor
.BR pmtag :

.sp
.in +2
.nf
pmadm -g -p pmtag -s svctag
.fi
.in -2
.sp

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 6n
.rt
Successful operation.
.RE

.sp
.ne 2
.mk
.na
.B >0
.ad
.RS 6n
.rt
Operation failed.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
\fB/etc/saf/\fIpmtag\fB/_config\fR
.ad
.RS 26n
.rt

.RE

.sp
.ne 2
.mk
.na
\fB/etc/saf/\fIpmtag\fB/\fIsvctag\fR
.ad
.RS 26n
.rt

.RE

.sp
.ne 2
.mk
.na
\fB/var/saf/\fIpmtag\fB/*\fR
.ad
.RS 26n
.rt

.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.sp
.LP
.BR sac (1M),
.BR sacadm (1M),
.BR doconfig (3NSL),
.BR attributes (5)
