usr/src/man/man1m/pntadm.1m
'\" te
.\" Copyright (c) 2003 by Sun Microsystems, Inc. All Rights Reserved.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH pntadm 1M "9 Jan 2004" "SunOS 5.11" "System Administration Commands"
.SH NAME
pntadm \- DHCP network table management utility
.SH SYNOPSIS
.LP
.nf
\fBpntadm\fR \fB-C\fR [\fB-r\fR \fIresource\fR] [\fB-p\fR \fIpath\fR] [\fB-u\fR \fIuninterpreted\fR] \fInetwork\fR
.fi

.LP
.nf
\fBpntadm\fR \fB-A\fR \fIname_IP_address\fR [\fB-c\fR \fIcomment\fR] [\fB-e\fR \fImm/dd/yyyy\fR]
     [\fB-f\fR \fInum\fR | \fIkeywords\fR] [\fB-h\fR \fIclient_hostname\fR]
     [\fB-i\fR [\fB-a\fR] \fIclient_ID\fR] [\fB-m\fR [\fB-y\fR] \fImacro\fR] [\fB-s\fR \fIserver\fR]
     [\fB-r\fR \fIresource\fR] [\fB-p\fR \fIpath\fR] [\fB-u\fR \fIuninterpreted\fR] \fInetwork\fR
.fi

.LP
.nf
\fBpntadm\fR \fB-M\fR \fIname_IP_address\fR [\fB-c\fR \fIcomment\fR] [\fB-e\fR \fImm/dd/yyyy\fR]
     [\fB-f\fR \fInum\fR | \fIkeywords\fR] [\fB-h\fR \fIclient_hostname\fR]
     [\fB-i\fR [\fB-a\fR] \fIclient\fR \fI ID\fR] [\fB-m\fR [\fB-y\fR] \fImacro\fR]
     [\fB-n\fR \fInew_client_IP_address\fR] [\fB-s\fR \fIserver\fR] [\fB-r\fR \fIresource\fR]
     [\fB-p\fR \fIpath\fR] [\fB-u\fR uninterpreted] \fInetwork\fR
.fi

.LP
.nf
\fBpntadm\fR \fB-D\fR \fIname_IP_address\fR [\fB-y\fR] [\fB-r\fR \fIresource\fR] [\fB-p\fR \fIpath\fR]
     [\fB-u\fR uninterpreted] \fInetwork\fR
.fi

.LP
.nf
\fBpntadm\fR \fB-P\fR [\fB-v\fR] [\fB-x\fR] [\fB-r\fR \fIresource\fR] [\fB-p\fR \fIpath\fR]
     [\fB-u\fR uninterpreted] \fInetwork\fR
.fi

.LP
.nf
\fBpntadm\fR \fB-R\fR [\fB-r\fR \fIresource\fR] [\fB-p\fR \fIpath\fR] [\fB-u\fR uninterpreted] \fInetwork\fR
.fi

.LP
.nf
\fBpntadm\fR \fB-L\fR [\fB-r\fR \fIresource\fR] [\fB-p\fR \fIpath\fR] [\fB-u\fR uninterpreted]
.fi

.LP
.nf
\fBpntadm\fR \fB-B\fR [\fB-v\fR] [\fIbatchfile\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The
.B pntadm
command is used to manage the Dynamic Host Configuration
Protocol (\fBDHCP\fR) network tables. It is used to add and remove networks
under
.B DHCP
management, and add, delete, or modify IP address records
within network tables, or to view tables. For a description of the format of
.B DHCP
network tables, see
.BR dhcp_network (4).
.sp
.LP
.B pntadm
can be run as root or by other users assigned to the
.BR DHCP
Management profile. See
.BR rbac (5)
and
.BR user_attr (4).
.sp
.LP
If the networks you want to add are subnetted, you need to update the
.BR netmasks (4)
table.
.sp
.LP
One of the following options (function flags) must be specified with the
.B pntadm
command:
.BR -A ,
.BR -B ,
.BR -C ,
.BR -D ,
.BR -L ,
.BR -M ,
.BR -P ,
or\fB-R\fR.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.BI -A " name_IP_address"
.ad
.RS 26n
.rt
Add a client entry with hostname or client IP address,
.IR name_IP_address ,
to the named
.B DHCP
network table.
.sp
The following sub-options are optional:
.sp
.ne 2
.mk
.na
.B -c
.I comment
.ad
.RS 22n
.rt
Comment text. The default is
.IR NULL .
.RE

.sp
.ne 2
.mk
.na
.B -e
.I mm/dd/yyyy
.ad
.RS 22n
.rt
Absolute lease. The default is
.BR 0 .
.RE

.sp
.ne 2
.mk
.na
.B -f
.I num
|
.I keywords
.ad
.RS 22n
.rt
Flag value. The default is
.BR 00 .
.sp
The flag (\fB-f\fR) option can be specified either as a single number denoting
the intended flag value, or as a series of the following keywords, combined
using the plus (\fB+\fR) symbol:
.sp
.ne 2
.mk
.na
.B DYNAMIC
or
.BR 00
.ad
.RS 19n
.rt
Server manager's assignment.
.RE

.sp
.ne 2
.mk
.na
.B PERMANENT
or
.BR 01
.ad
.RS 19n
.rt
Lease on entry is permanent.
.RE

.sp
.ne 2
.mk
.na
.B MANUAL
or
.BR 02
.ad
.RS 19n
.rt
Administrator managed assignment.
.RE

.sp
.ne 2
.mk
.na
.B UNUSABLE
or
.BR 04
.ad
.RS 19n
.rt
Entry is not valid.
.RE

.sp
.ne 2
.mk
.na
.B BOOTP
or
.BR 08
.ad
.RS 19n
.rt
Entry reserved for
.B BOOTP
clients.
.RE

For a more detailed description of the flag values, see
.BR dhcp_network (4).
.RE

.sp
.ne 2
.mk
.na
.B -h
.I client_hostname
.ad
.RS 22n
.rt
Client hostname. The default is NULL.
.sp
When the
.B -h
option is used in this mode, the
.I client_hostname
is
added to the hosts table within the resource used for storing host names (files,
NIS+ or DNS). The command will fail if this
.I client_hostname
is already
present in the hosts table.
.RE

.sp
.ne 2
.mk
.na
\fB-i\fR \fIclient_ID\fR [\fB-a\fR]\fR
.ad
.RS 22n
.rt
Client identifier [\fB-a\fR]. The default is
.BR 00 .
.sp
The
.B -i
option modified with
.B -a
specifies that the client identifier
is in
.B ASCII
format, and thus needs to be converted to hexadecimal format
before insertion into the table.
.RE

.sp
.ne 2
.mk
.na
\fB-m\fR \fImacro\fR [\fB-y\fR]\fR
.ad
.RS 22n
.rt
Macro name. Default is UNKNOWN.
.sp
The
.B -m
option modified with
.B -y
verifies the existence of the named
macro in the
.B dhcptab
table before adding the entry.
.RE

.sp
.ne 2
.mk
.na
.B -s
.I server
.ad
.RS 22n
.rt
Server IP or name. Default is system name
.RB ( "uname -n" ).
.RE

.RE

.sp
.ne 2
.mk
.na
.B -B
.ad
.RS 26n
.rt
Activate batch mode.
.B pntadm
will read from the specified file or from
standard input a series of
.B pntadm
commands and execute them within the
same process. Processing many
.B pntadm
commands using this method is much
faster than running an executable batchfile itself. Batch mode is recommended
for using
.B pntadm
in scripts.
.sp
The following sub-option is optional:
.sp
.ne 2
.mk
.na
.B -v
.ad
.RS 6n
.rt
Display commands to standard output as they are processed.
.RE

.RE

.sp
.ne 2
.mk
.na
.B -C
.ad
.RS 26n
.rt
Create the
.B DHCP
network table for the network specified by
.IR network .
See . For details, see
.BR dhcp_network (4)
and
.BR networks (4).
.RE

.sp
.ne 2
.mk
.na
.B -D
.I  name_IP_address
.ad
.RS 26n
.rt
Delete the specified client entry with hostname or client IP address,
.IR name_IP_address ,
in the named
.B DHCP
network table. (See
.BR dhcp_network (4).)
.sp
The following sub-option is optional:
.sp
.ne 2
.mk
.na
.B -y
.ad
.RS 6n
.rt
Remove associated host table entry. The
.B -y
option requests that all
hostnames associated with the
.B IP
address in the hosts table in the
resource be removed.
.RE

.RE

.sp
.ne 2
.mk
.na
.B -L
.ad
.RS 26n
.rt
List the
.B DHCP
network tables presently configured, one per line, on
standard output. If none are found, no output is printed and an exit status of
.B 0
is returned.
.RE

.sp
.ne 2
.mk
.na
.B -M
.I  name_IP_address
.ad
.RS 26n
.rt
Modify the specified client entry with hostname or client IP address,
.IR name_IP_address ,
in the named
.B DHCP
network table. See
.BR dhcp_network (4).
The default for the sub-options is what they currently
are set to.
.sp
The following sub-options are optional.
.sp
.ne 2
.mk
.na
.B -c
.I comment
.ad
.RS 29n
.rt
New comment text.
.RE

.sp
.ne 2
.mk
.na
.B -e
.I mm/dd/yy
.ad
.RS 29n
.rt
New absolute lease expiration date. Time defaults to 12:00 AM of the day
specified.
.RE

.sp
.ne 2
.mk
.na
.B -f
.I num
|
.I keyboard
.ad
.RS 29n
.rt
New flag value, see explanation following the description of the \fB-A\fR
option.
.RE

.sp
.ne 2
.mk
.na
.B -h
.I host_name
.ad
.RS 29n
.rt
New client hostname.
.sp
The
.B -h
option allows you to change the current
.I hostname
associated
with the
.B IP
address or to add a new
.I hostname
to the hosts table if
an entry associated with this
.B IP
address does not exist.
.RE

.sp
.ne 2
.mk
.na
.B -i
.I client_ID
.ad
.RS 29n
.rt
New client identifier [\fB-a\fR].
.RE

.sp
.ne 2
.mk
.na
\fB-m\fR \fImacro\fR [\fB-y\fR]\fR
.ad
.RS 29n
.rt
Macro name defined in
.BR dhcptab .
.RE

.sp
.ne 2
.mk
.na
.B -n
.I new_client_IP_address
.ad
.RS 29n
.rt
New
.B IP
address.
.RE

.sp
.ne 2
.mk
.na
.B -s
.I server
.ad
.RS 29n
.rt
New server
.B IP
or name.
.RE

 For more detailed description of the sub-options and flag values, see
.BR dhcp_network (4).
.RE

.sp
.ne 2
.mk
.na
.B -P
.ad
.RS 26n
.rt
Display the named
.B DHCP
network table.
.sp
The following sub-options are optional:
.sp
.ne 2
.mk
.na
.B -v
.ad
.RS 6n
.rt
Display lease time in full verbose format and resolve IP addresses for the
clients and server to hostnames.
.RE

.sp
.ne 2
.mk
.na
.B -x
.ad
.RS 6n
.rt
Display lease time in raw format.
.RE

These flag codes are used with the
.B -P
sub-options:
.sp

.sp
.TS
tab();
lw(1.83i) lw(1.83i) lw(1.83i)
lw(1.83i) lw(1.83i) lw(1.83i)
.
\fB-v\fR\fB-x\fRDescription
D00DYNAMIC
P01PERMANENT
M02MANUAL
U04UNUSABLE
B08BOOTP
.TE

See
.BR dhcp_network (4)
for information on these sub-options and associated
flag codes.
.RE

.sp
.ne 2
.mk
.na
.BI -p " path"
.ad
.RS 26n
.rt
Override the
.BR dhcpsvc.conf (4)
configuration value for data store resource
path,
.I path
See
.BR dhcpsvc.conf (4)
.RE

.sp
.ne 2
.mk
.na
.B -R
.ad
.RS 26n
.rt
Remove the named DHCP network table. See
.BR dhcp_network (4).
.RE

.sp
.ne 2
.mk
.na
.B -r
.I data_store_resource
.ad
.RS 26n
.rt
Override the
.B /etc/inet/dhcpsvc.conf
configuration value for
.B RESOURCE=
with the
.I data_store_resource
specified. See the
.BR dhcpsvc.conf (4)
man page for more details on resource type, and the\fR
for more information about adding support for other data stores.
.RE

.sp
.ne 2
.mk
.na
.BR -u " uninterpreted"
.ad
.RS 26n
.rt
Data which will be ignored by
.BR pntadm ,
but passed to the currently
configured public module to be interpreted by the data store. This might be used
for a database account name or other authentication or authorization parameters
required by a particular data store.
.RE

.SH OPERANDS
.sp
.LP
The following operand is supported:
.sp
.ne 2
.mk
.na
.I network
.ad
.RS 11n
.rt
The network address or network name which corresponds to the
.BR "dhcp network"
table. See
.BR dhcp_network (4).
.RE

.SH EXAMPLES
.LP
.B Example 1
Creating a Table for the
.B 10.0.0.0
DHCP Network
.sp
.LP
The following command creates a table for the
.B 10.0.0.0
(subnetted to
class C)
.B DHCP
network table. Note that if you have an alias for this
network in your
.BR networks (4)
table, you can use that value rather than the
dotted Internet Address notation.

.sp
.in +2
.nf
example# \fBpntadm -C 10.0.0.0\fR
.fi
.in -2
.sp

.LP
.B Example 2
Adding an Entry to the
.B 10.0.0.0
Table
.sp
.LP
The following command adds an entry to the
.B 10.0.0.0
table in the
.B files
resource in the
.B /var/mydhcp
directory:

.sp
.in +2
.nf
example# \fBpntadm -r SUNWfiles -p /var/mydhcp -A 10.0.0.1 10.0.0.0\fR
.fi
.in -2
.sp

.LP
.B Example 3
Modifying the
.B 10.0.0.1
Entry of the
.BR 10.0.0.0
Table
.sp
.LP
The following command modifies the
.B 10.0.0.1
entry of the
.BR 10.0.0.0
table, changing the macro name to
.BR Green ,
setting the flags field to
.B MANUAL
and
.BR PERMANENT:

.sp
.in +2
.nf
example# \fBpntadm -M 10.0.0.1 -m Green -f 'PERMANENT+MANUAL' 10.0.0.0\fR
.fi
.in -2
.sp

.LP
.B Example 4
Changing the
.B 10.0.0.1
Entry to
.BR 10.0.0.2
.sp
.LP
The following command changes the
.B 10.0.0.1
entry to
.BR 10.0.0.2 ,
making an entry in the
.BR hosts (4)
table called
.BR myclient :

.sp
.in +2
.nf
example# \fBpntadm -M 10.0.0.1 -n 10.0.0.2 -h myclient 10.0.0.0\fR
.fi
.in -2
.sp

.LP
.B Example 5
Setting the Client
.B ID
as
.BR ASCII
.sp
.LP
The following command sets the client
.B ID
as
.BR ASCII
.B aruba.foo.com
for the
.B myclient
entry:

.sp
.in +2
.nf
example# \fBpntadm -M myclient -i 'aruba.foo.com' -a 10.0.0.0\fR
.fi
.in -2
.sp

.LP
.B Example 6
Deleting the \fBmyclient\fREntry from the \fB10.0.0.0\fR
Table
.sp
.LP
The following command deletes the
.B myclient
(\fB10.0.0.2\fR) entry from
the
.B 10.0.0.0
table:

.sp
.in +2
.nf
example# \fBpntadm -D myclient 10.0.0.0\fR
.fi
.in -2
.sp

.LP
.B Example 7
Removing the Named DHCP Network Table
.sp
.LP
The following command removes the named
.B DHCP
network table in the NIS+
directory specified:

.sp
.in +2
.nf
example# \fBpntadm -r SUNWnisplus -p Test.Nis.Plus. -R 10.0.0.0\fR
.fi
.in -2
.sp

.LP
.B Example 8
Listing the Configured DHCP Network Tables
.sp
.LP
The following command lists the configured DHCP network tables:

.sp
.in +2
.nf
example# \fBpntadm -L\fR
192.168.0.0
10.0.0.0
.fi
.in -2
.sp

.LP
.B Example 9
Executing
.B pntadm
Commands in Batch Mode
.sp
.LP
The following command runs a series of
.B pntadm
commands contained in a
batch file:

.sp
.in +2
.nf
example# \fBpntadm -B addclients\fR
.fi
.in -2
.sp

.SH EXIT STATUS
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 5n
.rt
Successful completion.
.RE

.sp
.ne 2
.mk
.na
.B 1
.ad
.RS 5n
.rt
Object already exists.
.RE

.sp
.ne 2
.mk
.na
.B 2
.ad
.RS 5n
.rt
Object does not exist.
.RE

.sp
.ne 2
.mk
.na
.B 3
.ad
.RS 5n
.rt
Non-critical error.
.RE

.sp
.ne 2
.mk
.na
.B 4
.ad
.RS 5n
.rt
Critical error.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/inet/dhcpsvc.conf
.ad
.RS 26n
.rt

.RE

.sp
.ne 2
.mk
.na
.B /etc/inet/hosts
.ad
.RS 26n
.rt

.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWdhcsu
_
Interface StabilityEvolving
.TE

.SH SEE ALSO
.sp
.LP
.BR dhcpconfig (1M),
.BR dhcpmgr (1M),
.BR dhcp_network (4),
,
.BR dhcpsvc.conf (4),
.BR dhcptab (4),
.BR hosts (4),
.BR netmasks (4),
.BR networks (4),
.BR user_attr (4),
.BR attributes (5),
.BR dhcp (5),
.BR dhcp_modules (5),
.BR rbac (5)
.sp
.LP
\fR
.sp
.LP
\fR
.sp
.LP
Alexander, S., and R. Droms,
.IR "DHCP Options and BOOTP Vendor Extensions" ,
RFC 1533, Lachman Technology, Inc., Bucknell University, October 1993.
.sp
.LP
Droms, R.,
.IR "Interoperation Between DHCP and BOOTP" ,
RFC 1534, Bucknell
University, October 1993.
.sp
.LP
Droms, R.,
.IR "Dynamic Host Configuration Protocol" ,
RFC 1541, Bucknell
University, October 1993.
.sp
.LP
Wimer, W.,
.IR "Clarifications and Extensions for the Bootstrap Protocol" ,
RFC
1542, Carnegie Mellon University, October 1993.
