usr/src/man/man1m/polkit-is-privileged.1m
'\" te
.\" Copyright (c) 2006, Sun Microsystems, Inc. All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH polkit-is-privileged 1M "22 Aug 2006" "SunOS 5.11" "System Administration Commands"
.SH NAME
polkit-is-privileged \- check PolicyKit privileges
.SH SYNOPSIS
.LP
.nf
\fBpolkit-is-privileged\fR  [\fB-hvV\fR] \fB-u\fR \fIuser\fR \fB-p\fR \fIprivilege\fR [\fB-r\fR \fIresource\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The
.B polkit-is-privileged
command queries system policy to determine
whether a user is allowed for a given privilege and resource. The resource
name can be omitted. On the Solaris operating system, RBAC authorizations
names should be used as privilege names.
.sp
.LP
Currently, the only consumer of PolicyKit is
.BR hald (1M).
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.BR -h ,
.B --help
.ad
.sp .6
.RS 4n
Display list of options and exit.
.RE

.sp
.ne 2
.mk
.na
.B -p
.IR privilege ,
.B --privilege
.I privilege
.ad
.sp .6
.RS 4n
Name of privilege associated with user. Command tests for this privilege.
.RE

.sp
.ne 2
.mk
.na
.B -r
.IR resource ,
.B --resource
.I resource
.ad
.sp .6
.RS 4n
Name of resource associated with user and privilege. Command tests for this
resource.
.RE

.sp
.ne 2
.mk
.na
.B -u
.IR user ,
.B --user
.I user
.ad
.sp .6
.RS 4n
User name or user id that is tested for.
.RE

.sp
.ne 2
.mk
.na
.BR -v ,
.B --verbose
.ad
.sp .6
.RS 4n
Verbose mode.
.RE

.sp
.ne 2
.mk
.na
.BR -V ,
.B --version
.ad
.sp .6
.RS 4n
Displays version number.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWhalr
_
Interface StabilityVolatile
.TE

.SH SEE ALSO
.sp
.LP
.BR auths (1),
.BR profiles (1),
.BR hald (1M),
.BR getauthattr (3SECDB),
.BR auth_attr (4),
.BR policy.conf (4),
.BR prof_attr (4),
.BR user_attr (4),
.BR attributes (5)
