usr/src/man/man1m/poold.1m
'\" te
.\" Copyright (c) 2005, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH poold 1M "1 Dec 2005" "SunOS 5.11" "System Administration Commands"
.SH NAME
poold \- automated resource pools partitioning daemon
.SH SYNOPSIS
.LP
.nf
\fBpoold\fR [\fB-l\fR \fIlevel\fR]
.fi

.SH DESCRIPTION
.sp
.LP
.B poold
provides automated resource partitioning facilities.
.B poold
can be enabled or disabled using the Solaris Service Management
Facility,
.BR smf (5).
.B poold
requires the Resource Pools facility to
be active in order to operate.
.sp
.LP
The dynamic resource pools service's fault management resource identifier
(FMRI) is:
.sp
.in +2
.nf
svc:/system/pools/dynamic
.fi
.in -2

.sp
.LP
The resource pools service's FMRI is:
.sp
.in +2
.nf
svc:/system/pools
.fi
.in -2

.sp
.LP
.BR poold 's
configuration details are held in a
.BR libpool (3LIB)
configuration and you can access all customizable behavior from this
configuration.
.sp
.LP
.B poold
periodically examines the load on the system and decides
whether intervention is required to maintain optimal system performance with
respect to resource consumption.
.B poold
also responds to externally
initiated
.RB "(with respect to " poold )
changes of either resource
configuration or objectives.
.sp
.LP
If intervention is required,
.B poold
attempts to reallocate the
available resources to ensure that performance objectives are satisfied. If
it is not possible for
.B poold
to meet performance objectives with the
.RB "available resources, then a message is written to the log." " poold"
allocates scarce resources according to the objectives configured by the
administrator. The system administrator must determine which resource pools
are most deserving of scarce resource and indicate this through the
importance of resource pools and objectives.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -l
.I level
.ad
.RS 12n
.rt
Specify the vebosity level for logging information.
.sp
Specify
.I level
as
.BR ALERT ,
.BR CRIT ,
.BR ERR ,
.BR WARNING ,
.BR NOTICE ,
.BR INFO ,
and
.BR DEBUG .
If
.I level
is not supplied,
then the default logging level is
.BR INFO .
.sp
.ne 2
.mk
.na
.B ALERT
.ad
.RS 11n
.rt
 A condition that should be corrected immediately, such as a corrupted system
database.
.RE

.sp
.ne 2
.mk
.na
.B CRIT
.ad
.RS 11n
.rt
Critical conditions, such as hard device errors.
.RE

.sp
.ne 2
.mk
.na
.B ERR
.ad
.RS 11n
.rt
Errors.
.RE

.sp
.ne 2
.mk
.na
.B WARNING
.ad
.RS 11n
.rt
Warning messages.
.RE

.sp
.ne 2
.mk
.na
.B NOTICE
.ad
.RS 11n
.rt
 Conditions that are not error conditions, but that may require special
handling.
.RE

.sp
.ne 2
.mk
.na
.B INFO
.ad
.RS 11n
.rt
Informational messages.
.RE

.sp
.ne 2
.mk
.na
.B DEBUG
.ad
.RS 11n
.rt
Messages that contain information normally of use only when debugging a
program.
.RE

.RE

.sp
.LP
When invoked manually, with the
.B -l
option, all log output is directed
to standard error.
.SH EXAMPLES
.LP
.B Example 1
Modifying the Default Logging Level
.sp
.LP
The following command modifies the default logging level to
.BR ERR :

.sp
.in +2
.nf
# /usr/lib/pool/poold -l ERR
.fi
.in -2
.sp

.LP
.B Example 2
Enabling Dynamic Resource Pools
.sp
.LP
The following command enables dynamic resource pools:

.sp
.in +2
.nf
# /usr/sbin/svcadm enable svc:/system/pools/dynamic
.fi
.in -2
.sp

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWpool
_
Interface StabilitySee below.
.TE

.sp
.LP
The invocation is Evolving. The output is Unstable.
.SH SEE ALSO
.sp
.LP
.BR pooladm (1M),
.BR poolbind (1M),
.BR poolcfg (1M),
.BR poolstat (1M),
.BR svcadm (1M),
.BR pool_set_status (3POOL),
.BR libpool (3LIB),
.BR attributes (5),
.BR smf (5)
.sp
.LP
\fR
