usr/src/man/man1m/poolbind.1m
'\" te
.\" Copyright (c) 2003, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH poolbind 1M "9 Feb 2005" "SunOS 5.11" "System Administration Commands"
.SH NAME
poolbind \- bind processes, tasks, or projects or query binding of
processes to resource pools
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/poolbind\fR \fB-p\fR \fIpoolname\fR \fB-e\fR \fIcommand\fR [\fIarguments\fR].\|.\|.
.fi

.LP
.nf
\fB/usr/sbin/poolbind\fR \fB-p\fR \fIpoolname\fR [\fB-i\fR \fIidtype\fR] \fIid\fR.\|.\|.
.fi

.LP
.nf
\fB/usr/sbin/poolbind\fR \fB-q\fR \fIpid\fR.\|.\|.
.fi

.LP
.nf
\fB/usr/sbin/poolbind\fR \fB-Q\fR \fIpid\fR.\|.\|.
.fi

.SH DESCRIPTION
.sp
.LP
The
.B poolbind
command allows an authorized user to bind zones,
projects, tasks, and processes to pools. With the
.B -e
option (see
below), it can execute a command you specify, placing the executed command
in a specified pool. It can also enable you to query a process to determine
which pool a process is bound to.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB-e\fR \fIcommand\fR [\fIarguments\fR.\|.\|.]\fR
.ad
.RS 29n
.rt
Executes
.IR command ,
bound to the pool you specify with
.BR -p .
.RE

.sp
.ne 2
.mk
.na
.B -i
.I idtype
.ad
.RS 29n
.rt
This option, together with the
.I idlist
arguments, specifies one or
more processes to which the poolbind command is to apply. The interpretation
of
.I idlist
depends on the value of
.IR idtype .
The valid
.IR idtype
arguments and corresponding interpretations of
.I idlist
are as follows:

.sp
.ne 2
.mk
.na
.I pid
.ad
.RS 10n
.rt
.I idlist
is a list of process \fBID\fRs. Binds the specified processes
to the specified pool. This is the default behavior if no idtype is
specified.
.RE

.sp
.ne 2
.mk
.na
.I taskid
.ad
.RS 10n
.rt
.I idlist
is a list of task IDs. Bind all processes within the list of
task IDs to the specified pool.
.RE

.sp
.ne 2
.mk
.na
.I projid
.ad
.RS 10n
.rt
.I idlist
is a list of project
.BR ID "s. Bind all processes within the"
list of projects to the specified pool. Each project
.B ID
can be
specified as either a project name or a numerical project
.BR ID .
See
.BR project (4).
.RE

.sp
.ne 2
.mk
.na
.I zoneid
.ad
.RS 10n
.rt
.I idlist
is a list of zone
.BR ID "s. Bind all processes within the"
list of zones to the specified pool. Each zone
.B ID
can be specified as
either a zone name or a numerical zone
.BR ID .
See
.BR zones (5).
.RE

.RE

.sp
.ne 2
.mk
.na
.B -p
.I poolname
.ad
.RS 29n
.rt
Specifies the name of a pool to which the specified zone, project, tasks,
or processes are to be bound.
.RE

.sp
.ne 2
.mk
.na
.B -q
.I pid
\&.\|.\|.\fR
.ad
.RS 29n
.rt
Queries the pool bindings for a given list of process \fBID\fRs. If the
collection of resources associated with the process does not correspond to
any currently existing pool, or if there are multiple pools with the set of
resources that the process is bound to, the query fails for that particular
process
.BR ID .
.RE

.sp
.ne 2
.mk
.na
.B -Q
.I pid
\&.\|.\|.\fR
.ad
.RS 29n
.rt
 Queries the resource bindings for a given list of process IDs. The resource bindings are each reported on a separate line.
.RE

.SH EXAMPLES
.LP
.B Example 1
Binding All Processes
.sp
.LP
The following command binds all processes in projects
.B 5
and
.BR 7
to the pool
.BR web_app :

.sp
.in +2
.nf
example# /usr/sbin/poolbind \fB-p\fR web_app \fB-i\fR projid 5 7
.fi
.in -2
.sp

.LP
.B Example 2
Binding the Running Shell
.sp
.LP
The following command binds the running shell to the pool
.BR web_app :

.sp
.in +2
.nf
 example# /usr/sbin/poolbind \fB-p\fR web_app $$
.fi
.in -2
.sp

.LP
.B Example 3
Querying the Pool Bindings
.sp
.LP
The following command queries the bindings to verify that the shell is
bound to the given pool:

.sp
.in +2
.nf
example# /usr/sbin/poolbind \fB-q\fR $$
.fi
.in -2
.sp

.LP
.B Example 4
Querying the Resource Bindings
.sp
.LP
The following command queries the bindings to verify that the shell is
bound to the given resources:

.sp
.in +2
.nf
example# /usr/sbin/poolbind \fB-Q\fR $$
.fi
.in -2
.sp

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 5n
.rt
Successful completion.
.RE

.sp
.ne 2
.mk
.na
.B 1
.ad
.RS 5n
.rt
Requested operation could not be completed.
.RE

.sp
.ne 2
.mk
.na
.B 2
.ad
.RS 5n
.rt
Invalid command line options were specified.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWpool
_
Interface Stability See below.
.TE

.sp
.LP
The invocation is Evolving. The output is Unstable.
.SH SEE ALSO
.sp
.LP
.BR pooladm (1M),
.BR poolcfg (1M),
.BR libpool (3LIB),
.BR project (4),
.BR attributes (5),
.BR zones (5)
.sp
.LP
\fR
