usr/src/man/man1m/poolstat.1m
'\" te
.\" Copyright (c) 2003, Sun Microsystems, Inc. All Rights Reserved.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH poolstat 1M "16 Jun 2009" "SunOS 5.11" "System Administration Commands"
.SH NAME
poolstat \- report active pool statistics
.SH SYNOPSIS
.LP
.nf
\fBpoolstat\fR [\fB-p\fR \fIpool-list\fR] [\fB-r\fR \fIrset-list\fR] [\fB-T\fR u | d ] [\fIinterval\fR [\fIcount\fR]]
.fi

.LP
.nf
\fBpoolstat\fR [\fB-p\fR \fIpool-list\fR] [\fB-o\fR \fIformat\fR \fB-r\fR \fIrset-list\fR]
     [\fB-T\fR u | d ] [\fIinterval\fR [\fIcount\fR]]
.fi

.SH DESCRIPTION
.sp
.LP
The
.B poolstat
utility iteratively examines all active pools on the
system. It reports statistics based on the selected output mode.
.B poolstat
provides options to examine only specified pools and report
resource set-specific statistics.
.sp
.LP
Without options,
.B poolstat
examines all pools, reports basic statistics
for their resource sets, and exits.
.SS "DISPLAY FORMATS"
.sp
.LP
In default output format,
.B poolstat
outputs a header line and a line
for each pool. The line begins with the pool ID and its name, followed by a
column of statistical data for the processor set attached to the pool.
.sp
.LP
The columns are defined as follows:
.sp
.ne 2
.mk
.na
.B id
.ad
.RS 8n
.rt
Pool ID.
.RE

.sp
.ne 2
.mk
.na
.B pool
.ad
.RS 8n
.rt
Pool name.
.RE

.sp
.ne 2
.mk
.na
.B rid
.ad
.RS 8n
.rt
Resource set id.
.RE

.sp
.ne 2
.mk
.na
.B rset
.ad
.RS 8n
.rt
Resource set name.
.RE

.sp
.ne 2
.mk
.na
.B type
.ad
.RS 8n
.rt
Resource set type.
.RE

.sp
.ne 2
.mk
.na
.B min
.ad
.RS 8n
.rt
Minimum resource set size.
.RE

.sp
.ne 2
.mk
.na
.B max
.ad
.RS 8n
.rt
Maximum resource set size.
.RE

.sp
.ne 2
.mk
.na
.B size
.ad
.RS 8n
.rt
Current resource set size.
.RE

.sp
.ne 2
.mk
.na
.B used
.ad
.RS 8n
.rt
The measure of how much of the resource set is currently is use. This is
calculated as the percentage utilization of the resource set multiplied by
its size. If resource set has been reconfigured during last sampling
interval, this value might be not reported
.RB ( - ).
.RE

.sp
.ne 2
.mk
.na
.B load
.ad
.RS 8n
.rt
The absolute representation of the load that is put on the resource set. For
the definition of this property see
.BR libpool (3LIB).
.RE

.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -o
.I format
.ad
.RS 16n
.rt
Report statistics according to the format specification given in format. See
.BR "DISPLAY FORMATS" .
.sp
The
.B -o
option accepts lists as arguments. Items in a list can be
either separated by commas or enclosed in quotes and separated by commas or
spaces.
.sp
You can specify multiple
.B -o
options. The format specification is
interpreted as the whitespace separated concatenation of all the format
option arguments.
.sp
The
.B -o
option must be used in conjunction with the
.B -r
option.
.RE

.sp
.ne 2
.mk
.na
.B -p
.I pool-list
.ad
.RS 16n
.rt
Report only pools whose names are in the given list. If the -r option is
also used, this option selects only resource sets which belong to pools in
the given list. Statistics for pools or resource sets are reported in the
same order in which pool names are listed on the pool-list. Pool can be
specified by name or by ID.
.sp
The
.B -p
.RI "option accepts lists as arguments. Items in a" " pool-list"
can only be separated by spaces.
.RE

.sp
.ne 2
.mk
.na
.B -r
.I rset-list
.ad
.RS 16n
.rt
Report resource set statistics. If the
.I rset-list
argument is
"\fBall\fR", then all possible resource set types are selected.
.sp
The
.B -r
option accepts lists as arguments. Items in a list can be
either separated by commas or enclosed in quotes and separated by commas or
spaces.
.sp
The following resource set types are supported:
.sp
.ne 2
.mk
.na
.B all
.ad
.RS 8n
.rt
All resource set types
.RE

.sp
.ne 2
.mk
.na
.B pset
.ad
.RS 8n
.rt
Processor set
.RE

.RE

.sp
.ne 2
.mk
.na
.B -T u
|
.B d
.ad
.RS 16n
.rt
Display a time stamp.
.sp
Specify
.B u
for a printed representation of the internal representation
of time. See
.BR time (2).
Specify
.B d
for standard date format. See
.BR date (1).
.RE

.SH OPERANDS
.sp
.LP
The following operands are supported:
.sp
.ne 2
.mk
.na
.I count
.ad
.RS 12n
.rt
The number of times that the statistics are repeated. By default, poolstat
reports statistics only once.
.sp
If neither interval nor count are specified, statistics are reported once.
If interval is specified and count is not, statistics are reported
indefinitely.
.RE

.sp
.ne 2
.mk
.na
.I interval
.ad
.RS 12n
.rt
The sampling interval in seconds.
.sp
If neither interval nor count are specified, statistics are reported once.
If interval is specified and count is not, statistics are reported
indefinitely.
.RE

.SH EXAMPLES
.LP
.B Example 1
Using
.BR poolstat
.sp
.LP
The following example shows the default output from the
.BR poolstat
utility:

.sp
.in +2
.nf
% poolstat
                         pset
  id pool           size used load
   0 pool_default      4  3.6  6.2
   1 pool_admin        4  3.3  8.4
.fi
.in -2
.sp

.LP
.B Example 2
Reporting Resource Set Statistics
.sp
.LP
The following example reports resource set statistics.

.sp
.in +2
.nf

% poolstat -r pset
  id pool           type rid rset          min  max size used load
  0 pool_default    pset  -1 pset_default    1  65K    2  1.2  8.3
  1 pool_admin      pset   1 pset_admin      1    1    1  0.4  5.2
  2 pool_other      pset  -1 pset_default    1  65K    2  1.2  8.3
.fi
.in -2
.sp

.sp
.LP
Resource sets attached to multiple pools, as
.B pset_default
in the
example above, are listed multiple times, once for each pool.

.LP
.B Example 3
Restricting the Output to the List of Pools
.sp
.LP
The following example restricts the output to the list of pools

.sp
.in +2
.nf
% poolstat -p pool_default
                     pset
 id pool         size used load
 0 pool_default    8  5.3 10.3

% poolstat -p 'pool_admin pool_default'
                       pset
  id pool         size used load
  1 pool_admin      6  4.3  5.3
  0 pool_default    2  1.9  2.0

% poolstat -r all -p 'pool_admin pool_default'
  id pool            type rid rset          min  max size used load
  1 pool_admin      pset   1 pset_admin      1    1    1  0.9  2.3
  2 pool_default    pset  -1 pset_default    1  65K    2  2.0  2.0
.fi
.in -2
.sp

.LP
.B Example 4
Customizing Output
.sp
.LP
The following example customizes output:

.sp
.in +2
.nf
% poolstat -r -o pool,rset,size,load
  pool            rset          size load
  pool_default    pset_default     4  4.5
  pool_admin      pset_admin       4  2.1
.fi
.in -2
.sp

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 5n
.rt
Successful completion.
.RE

.sp
.ne 2
.mk
.na
.B 1
.ad
.RS 5n
.rt
An error occurred.
.RE

.sp
.ne 2
.mk
.na
.B 2
.ad
.RS 5n
.rt
Invalid command line options were specified.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWpool
_
StabilityEvolving
.TE

.SH SEE ALSO
.sp
.LP
.BR libpool (3LIB),
.BR attributes (5)
.sp
.LP
\fR
.SH NOTES
.sp
.LP
The system ids associated with resources can change after the system reboots
or the resource configuration is altered.
