usr/src/man/man1m/ports.1m
'\" te
.\" Copyright (c) 2002 Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" Copyright 1989 AT&T
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ports 1M "8 Nov 2002" "SunOS 5.11" "System Administration Commands"
.SH NAME
ports \- creates /dev entries and inittab entries for serial lines
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/ports\fR [\fB-r\fR \fIrootdir\fR]
.fi

.SH DESCRIPTION
.sp
.LP
.BR devfsadm (1M)
is now the preferred command for
.B /dev
and
.B /devices
and should be used instead of
.BR ports .
.sp
.LP
The
.B ports
command creates symbolic links in the
.B /dev/term
and
.B /dev/cua
directories to the serial-port character device files in
.B /devices
and adds new entries in
.B /etc/inittab
for non-system
ports found. System-board ports are given single lower-case letters for
names (such as
.B a
and
.BR b )
while other ports are named
numerically.
.sp
.LP
.B ports
searches the kernel device tree to find the serial devices
attached to the system. It also checks
.B /dev/term
and
.B /dev/cua
to
see what symbolic links to serial devices already exist.
.B ports
then
performs the following:
.RS +4
.TP
1.
Assigns new numbers (or letters for system-board ports) to ports that are
attached to the system but do not have
.B /dev/term
and
.BR /dev/cua
entries. The numbers or letters assigned are the lowest-unused numbers or
letters.
.RE
.RS +4
.TP
2.
Removes dangling links: links from
.B /dev/term
and
.BR /dev/cua
pointing to no-longer-existing ports.
.RE
.RS +4
.TP
3.
Creates new
.B /dev/term
and
.B /dev/cua
links for new serial
devices.
.RE
.RS +4
.TP
4.
Invokes
.BR sacadm (1M)
to make new port monitor entries for the new
devices. This is not done automatically for on-board ports; on workstations
these ports are often not used for dial-in sessions, so a port-monitor for
one of these ports must be created explicitly.
.RE
.sp
.LP
If the configuration has not changed, ports exits without doing anything.
.SS "Notice to Driver Writers"
.sp
.LP
.B ports
considers devices with a node type of
.BR DDI_NT_SERIAL,
.B DDI_NT_SERIAL_MB, DDI_NT_SERIAL_DO,
or
.BR DDI_NT_SERIAL_MB_DO
to be serial port devices. Devices with one of these node types must create
minor device names that obey the following conventions when calling
.BR ddi_create_minor_node (9F).
.RS +4
.TP
.ie t \(bu
.el o
The minor name for non-system port devices
.RB ( DDI_NT_SERIAL )
consists
of an
.B ASCII
numeric string, where the first port on the device is
named
.BR 0 ,
the second named
.BR 1 ,
the third named
.BR 2 ,
up to the
number of ports provided by the device.
.RE
.RS +4
.TP
.ie t \(bu
.el o
The minor name for non-system dialout devices
.RB ( DDI_NT_SERIAL_DO )
is
the
.B ASCII
numeric port name, concatenated with
.BR ,cu .
For example,
the minor name for the first dialout port on the serial board is
.BR 0,cu .
.RE
.RS +4
.TP
.ie t \(bu
.el o
The minor name for system-board port devices
.RB ( DDI_NT_SERIAL_MB )
consists of a string containing a single
.B ASCII
lowercase character,
where the first port on the device is named
.BR a ,
the second is named
.BR b ,
the third is named
.BR c ,
for all ports on the device (or up
through port
.BR z ).
.RE
.RS +4
.TP
.ie t \(bu
.el o
The minor name for system-board dialout devices
.RB ( DDI_NT_SERIAL_MB_DO )
consists of the lowercase character port name, concatenated with
.BR ,cu .
For example, the minor name for the first dialout port on the on-board
serial device is
.BR a,cu .
.RE
.sp
.LP
To prevent
.B disks
from attempting to automatically generate links for
a device, drivers must specify a private node type and refrain from using
one of the above node types when calling
.BR ddi_create_minor_node (9F).
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.BI -r " rootdir"
.ad
.RS 14n
.rt
Causes
.B ports
to presume that the
.BR /dev/term ,
.BR /dev/cua ,
and
.B /devices
directories are found under
.IR rootdir ,
not directly under
.BR / .
If this argument is specified,
.BR sacadm (1M)
is not invoked,
since it would update terminal administration files under
.B /etc
without
regard to the
.IR rootdir .
.RE

.SH EXAMPLES
.LP
.B Example 1
Creating the Serial and Dialout Minor Device Nodes
.sp
.LP
The following example creates the serial and dialout minor device nodes
from the
.B xkserial
driver's
.BR attach (9E)
function:

.sp
.in +2
.nf
/*
* Create the minor number by combining the instance number
* with the port number.
*/ #define XKNUMPORTS           8
#define XKMINORNUM(i, p)     ((i) << 4 | (p))
#define XKMINORNUM_DO(i, p)  ((i) << 4 | (p) | 0x80)
int
xkserialattach(dev_info_t *dip, ddi_attach_cmd_t cmd)
{
   int instance, portnum;
   char name[8];
       /* other stuff in attach.\|.\|. */
   instance = ddi_get_instance(dip);
   for (portnum = 0; portnum < XKNUMPORTS; portnum++) {
       /*
        * create the serial port device
        */
        sprintf(name, "%d", portnum);
        ddi_create_minor_node(dip, name, S_IFCHR,
           XKMINORNUM(instance, portnum), DDI_NT_SERIAL, 0);

        /*
         * create the dialout device
         */
         sprintf(name,"%d,cu", portnum);
         ddi_create_minor_node(dip, name, S_IFCHR,
             XKMINORNUM_DO(instance, portnum), DDI_NT_SERIAL_DO, 0);
     }
}
.fi
.in -2
.sp

.LP
.B Example 2
Installing the
.B xkserial
Port Driver on a Sun Fire
4800
.sp
.LP
The following example installs the
.B xkserial
port driver on a Sun Fire
4800 (with the driver controlling the fictional XKSerial 8 port serial
board), with these special files in
.BR /devices :

.sp
.in +2
.nf
# ls -l /devices/ssm@0,0/pci@18,700000/pci@1/xkserial@f,800000/
crw-r-----   1 root sys   32,  16 Aug 29 00:02 xkserial@2000:0
crw-r-----   1 root sys   32, 144 Aug 29 00:02 xkserial@2000:0,cu
crw-r-----   1 root sys   32,  17 Aug 29 00:02 xkserial@2000:1
crw-r-----   1 root sys   32, 145 Aug 29 00:02 xkserial@2000:1,cu
crw-r-----   1 root sys   32,  18 Aug 29 00:02 xkserial@2000:2
crw-r-----   1 root sys   32, 146 Aug 29 00:02 xkserial@2000:2,cu
crw-r-----   1 root sys   32,  19 Aug 29 00:02 xkserial@2000:3
crw-r-----   1 root sys   32, 147 Aug 29 00:02 xkserial@2000:3,cu
crw-r-----   1 root sys   32,  20 Aug 29 00:02 xkserial@2000:4
crw-r-----   1 root sys   32, 148 Aug 29 00:02 xkserial@2000:4,cu
crw-r-----   1 root sys   32,  21 Aug 29 00:02 xkserial@2000:5
crw-r-----   1 root sys   32, 149 Aug 29 00:02 xkserial@2000:5,cu
crw-r-----   1 root sys   32,  22 Aug 29 00:02 xkserial@2000:6
crw-r-----   1 root sys   32, 150 Aug 29 00:02 xkserial@2000:6,cu
crw-r-----   1 root sys   32,  23 Aug 29 00:02 xkserial@2000:7
crw-r-----   1 root sys   32, 151 Aug 29 00:02 xkserial@2000:7,cu
.fi
.in -2
.sp

.sp
.LP
.B /dev/term
contain symbolic links to the serial port device nodes in
.B /devices

.sp
.in +2
.nf
# ls -l /dev/term
/dev/term/0 -> ../../devices/[....]/xkserial@2000:0
/dev/term/1 -> ../../devices/[....]/xkserial@2000:1
/dev/term/2 -> ../../devices/[....]/xkserial@2000:2
/dev/term/3 -> ../../devices/[....]/xkserial@2000:3
/dev/term/4 -> ../../devices/[....]/xkserial@2000:4
/dev/term/5 -> ../../devices/[....]/xkserial@2000:5
/dev/term/6 -> ../../devices/[....]/xkserial@2000:6
/dev/term/7 -> ../../devices/[....]/xkserial@2000:7
.fi
.in -2
.sp

.sp
.LP
and
.B /dev/cua
contain symbolic links to the dialout port device nodes
in
.BR /devices

.sp
.in +2
.nf
# ls -l /dev/cua

/dev/cua/0 -> ../../devices/[....]/xkserial@2000:0,cu
/dev/cua/1 -> ../../devices/[....]/xkserial@2000:1,cu
/dev/cua/2 -> ../../devices/[....]/xkserial@2000:2,cu
/dev/cua/3 -> ../../devices/[....]/xkserial@2000:3,cu
/dev/cua/4 -> ../../devices/[....]/xkserial@2000:4,cu
/dev/cua/5 -> ../../devices/[....]/xkserial@2000:5,cu
/dev/cua/6 -> ../../devices/[....]/xkserial@2000:6,cu
/dev/cua/7 -> ../../devices/[....]/xkserial@2000:7,cu
.fi
.in -2
.sp

.SH FILES
.sp
.ne 2
.mk
.na
.BI /dev/term/ n
.ad
.RS 16n
.rt
Logical serial port devices
.RE

.sp
.ne 2
.mk
.na
.BI /dev/cua/ n
.ad
.RS 16n
.rt
Logical dialout port devices
.RE

.sp
.ne 2
.mk
.na
.B /etc/inittab
.ad
.RS 16n
.rt

.RE

.sp
.ne 2
.mk
.na
.B /etc/saf/*
.ad
.RS 16n
.rt

.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availability SUNWcsu
.TE

.SH SEE ALSO
.sp
.LP
.BR add_drv (1M),
.BR devfsadm (1M),
.BR drvconfig (1M),
.BR pmadm (1M),
.BR sacadm (1M),
.BR attributes (5),
.BR devfs (7FS),
.BR attach (9E),
.BR ddi_create_minor_node (9F)
.sp
.LP
\fR
