usr/src/man/man1m/powerd.1m
'\" te
.\" Copyright (c) 1999, Sun Microsystems, Inc.  All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH powerd 1M "15 Oct 1999" "SunOS 5.11" "System Administration Commands"
.SH NAME
powerd \- power manager daemon
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/power/powerd\fR [\fB-n\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The \fBpowerd\fR daemon is started by \fBpmconfig\fR(1M) to monitor system
activity and perform an automatic shutdown using the suspend-resume feature.
When the system is suspended, complete current state is saved on the disk
before power is removed. On reboot, the system automatically starts a resume
operation and the system is restored to the same state it was in immediately
prior to suspend.
.sp
.LP
Immediately prior to system shutdown, the daemon notifies \fBsyslogd\fR(1M)
of the shutdown, which broadcasts a notification.
.SH OPTIONS
.sp
.LP
The following option is supported:
.sp
.ne 2
.mk
.na
\fB-n\fR
.ad
.RS 6n
.rt
No broadcast mode. The daemon silently shuts down the system without
notifying \fBsyslogd\fR(1M).
.RE

.SH FILES
.sp
.ne 2
.mk
.na
\fB/etc/power.conf\fR
.ad
.RS 19n
.rt
Power Management configuration information file
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWpmu
_
Interface Stability Unstable
.TE

.SH SEE ALSO
.sp
.LP
\fBpmconfig\fR(1M), \fBdtpower\fR(1M), \fBsyslogd\fR(1M),
\fBpower.conf\fR(4), \fBattributes\fR(5), \fBcpr\fR(7), \fBpm\fR(7D)
.sp
.LP
\fIUsing Power Management\fR
