usr/src/man/man1m/powerd.1m
'\" te
.\" Copyright (c) 1999, Sun Microsystems, Inc.  All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH powerd 1M "15 Oct 1999" "SunOS 5.11" "System Administration Commands"
.SH NAME
powerd \- power manager daemon
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/power/powerd\fR [\fB-n\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The
.B powerd
daemon is started by \fBpmconfig\fR(1M) to monitor system
activity and perform an automatic shutdown using the suspend-resume feature.
When the system is suspended, complete current state is saved on the disk
before power is removed. On reboot, the system automatically starts a resume
operation and the system is restored to the same state it was in immediately
prior to suspend.
.sp
.LP
Immediately prior to system shutdown, the daemon notifies
.BR syslogd (1M)
of the shutdown, which broadcasts a notification.
.SH OPTIONS
.sp
.LP
The following option is supported:
.sp
.ne 2
.mk
.na
.B -n
.ad
.RS 6n
.rt
No broadcast mode. The daemon silently shuts down the system without
notifying
.BR syslogd (1M).
.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/power.conf
.ad
.RS 19n
.rt
Power Management configuration information file
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWpmu
_
Interface Stability Unstable
.TE

.SH SEE ALSO
.sp
.LP
.BR pmconfig (1M),
.BR dtpower (1M),
.BR syslogd (1M),
.BR power.conf (4),
.BR attributes (5),
.BR cpr (7),
.BR pm (7D)
.sp
.LP
.I Using Power Management
