usr/src/man/man1m/ppdmgr.1m
'\" te
.\" Copyright (c) 2007 by Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ppdmgr 1M "9 Mar 2007" "SunOS 5.11" "System Administration Commands"
.SH NAME
ppdmgr \- utility for managing PPD files
.SH SYNOPSIS
.LP
.nf
\fBppdmgr\fR \fB-a\fR \fIppd_filename_path\fR [\fB-L\fR \fIlabel\fR] [\fB-R\fR \fIppd_repository_name\fR] [\fB-w\fR]
.fi

.LP
.nf
\fBppdmgr\fR \fB-r\fR [\fB-L\fR \fIlabel\fR] [\fB-R\fR \fIppd_repository_name\fR]
.fi

.LP
.nf
\fBppdmgr\fR \fB-u\fR [\fB-L\fR \fIlabel\fR] [\fB-R\fR \fIppd_repository_name\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The PPD File Manager adds PPD files to the print system's PPD file
repositories. When changes in the PPD file repositories are made by the
utility, they are reflected in the Solaris Print Manager (see
.BR printmgr (1M))
GUI printer driver field when adding or modifying local
attached or network attached printers.
.sp
.LP
Multiple PPD file repositories may be available. PPD files that are
supplied with the system are available in the "\fBsystem\fR" repository. PPD
files that are supplied by third party vendors may be available in the
"\fBvendor\fR" repository. PPD files that are supplied by system
administrators may be available in the "\fBadmin\fR" repository, and PPD
files that are added using this utility are available in the "user"
repository. When this utility is used to update or rebuild printer
information reflected in the
.BR printmgr "(1M), the special reserved"
repository name "\fBall\fR" can be used to specify all of the available PPD
file repositories.
.sp
.LP
PPD files are grouped under a user-provided "label" within the print
system's PPD file repository to allow easier selection of a printer driver
through the \fBprintmgr\fR GUI. The special reserved label name "\fBall\fR"
can be used to specify all of the available labels in a PPD file repository.
The results are undefined if a label name contains characters that are not
in the portable filename character set or if a label name starts with a
hyphen (-). A label name may not contain a semi-colon (:).
.SH OPTIONS
.sp
.LP
The following subcommand are supported:
.sp
.ne 2
.mk
.na
.B -a
.I ppd_file_path
.ad
.sp .6
.RS 4n
Adds a copy of
.I ppd_file_path
to the system under the specified label
in the specified repository, where
.I ppd_file_path
is the full path and
file name to the PPD file. The utility accepts a valid PPD file with either
a \fB\&.ppd\fR or \fB\&.ppd.gz\fR (gzipped) extension.
.RE

.sp
.ne 2
.mk
.na
.B -L
.I label
.ad
.sp .6
.RS 4n
Specifies a label to group PPD files under. When specified with the
\fB-a\fR option, the default label is "\fBuser\fR". When specified with the
\fB-r\fR or \fB-u\fR option, the default label is "\fBall\fR". The following
are reserved labels:
.sp
.ne 2
.mk
.na
.B caches
.ad
.RS 16n
.rt
may never be specified
.RE

.sp
.ne 2
.mk
.na
.B ppdcache
.ad
.RS 16n
.rt
may never be specified
.RE

.sp
.ne 2
.mk
.na
.B manufaliases
.ad
.RS 16n
.rt
may never be specified
.RE

.sp
.ne 2
.mk
.na
.B all
.ad
.RS 16n
.rt
applies the specified action to all labels in a repository, and may only be
specified with the
.B -r
or
.B -u
option.
.RE

.sp
.ne 2
.mk
.na
.B SUNW*
.ad
.RS 16n
.rt
anything starting with
.B SUNW
is reserved and should not be specified
with the
.B -a
option.
.RE

.RE

.sp
.ne 2
.mk
.na
.B -R
.I repository_name
.ad
.sp .6
.RS 4n
Specifies the name of a PPD file repository representing one of the PPD
file installation locations. Possible repository names include:
"\fBuser\fR", "\fBadmin\fR", "\fBvendor\fR", "\fBsystem\fR", and
"\fBall\fR".
.sp
The repository name "\fBall\fR" signifies all of the possible repository
names. The default repository name is "\fBuser\fR". Only the "\fBuser\fR" or
"\fBadmin\fR" repository may be specified with the \fB-a\fR option.
.RE

.sp
.ne 2
.mk
.na
.B -r
.ad
.sp .6
.RS 4n
Rebuilds the cache information for the specified label in the specified
repository.
.RE

.sp
.ne 2
.mk
.na
.B -u
.ad
.sp .6
.RS 4n
Updates the cache information for the specified label in the specified
repository.
.RE

.sp
.ne 2
.mk
.na
.B -w
.ad
.sp .6
.RS 4n
Write the full path of the added PPD file. This option is only valid with
the
.B -a
option. Otherwise, this option is ignored.
.RE

.SH EXAMPLES
.LP
.B Example 1
Adding a copy of a PPD file to the repository
.sp
.LP
The following commands add a copy of a PPD file to the "\fBuser\fR"
repository under the "\fBuser\fR" label:

.sp
.in +2
.nf
# ppdmgr -a /net/somesystem/ppdfiles/ppdfile.ppd
.fi
.in -2
.sp

.sp
.LP
or

.sp
.in +2
.nf
# ppdmgr -a /net/somesystem/ppdfiles/ppdfile.ppd -L user
.fi
.in -2
.sp

.sp
.LP
The following command adds a copy of a PPD file to the "\fBuser\fR"
repository under the "\fBPhoto\fR" label and write the full path of the
added copy to standard output:

.sp
.in +2
.nf
# ppdmgr -a /net/somesystem/ppdfiles/ppdfile.ppd -L "Photo" -w
.fi
.in -2
.sp

.LP
.B Example 2
Updating the cache for the PPD files
.sp
.LP
The following commands update the cache for the PPD files under the
"\fBall\fR" labels in the "\fBuser\fR" repository:

.sp
.in +2
.nf
 # ppdmgr -u
.fi
.in -2
.sp

.sp
.LP
or

.sp
.in +2
.nf
 # ppdmgr -u -R user -L all
.fi
.in -2
.sp

.sp
.LP
The following command updates the cache for the PPD files under the "photo"
label in the "\fBuser\fR" repository:

.sp
.in +2
.nf
 # ppdmgr -u -R user -L Photo
.fi
.in -2
.sp

.LP
.B Example 3
Rebuilding the cache for the PPD files
.sp
.LP
The following command rebuilds the cache for the PPD files under the
"Photo" label in the "\fBuser\fR" repository:

.sp
.in +2
.nf
# ppdmgr -r -R user -L Photo
.fi
.in -2
.sp

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 6n
.rt
Successful completion.
.RE

.sp
.ne 2
.mk
.na
.B >0
.ad
.RS 6n
.rt
An error occurred.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWpsr
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
.BR printmgr (1M),
.BR attributes (5)
