usr/src/man/man1m/pppoec.1m
'\" te
.\" Copyright (c) 2002, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH pppoec 1M "9 Jan 2002" "SunOS 5.11" "System Administration Commands"
.SH NAME
pppoec \- PPPoE chat utility
.SH SYNOPSIS
.LP
.nf
\fBpppoec\fR [\fB-o\fImillisecs\fR] [\fB-s\fImillisecs\fR] [\fB-v\fR] \fIdevice\fR
     [\fIservice\fR [ [except]\fIserver\fR.\|.\|. [only]]]
.fi

.LP
.nf
\fBpppoec\fR [\fB-o\fImillisecs\fR] [\fB-v\fR] \fB-i\fR [\fIdevice\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The
.B pppoec
utility implements the client-side negotiation of PPPoE.
It is intended to be used with the
.BR pppd (1M)
.B connect
option, in
the same manner as the
.BR chat (1M)
utility is used for asynchronous
dial-up PPP.
.sp
.LP
When given with the
.B -i
flag,
.B pppoec
sends out a broadcast query
on the given interface named by the
.I device
parameter. You can specify
no other arguments in this mode. All responding PPPoE servers and the
offered services are displayed on standard output.
.sp
.LP
Otherwise, when given without the
.B -i
flag,
.B pppoec
does the full
PPPoE client-side negotiation. The
.I device
parameter is the intended
Ethernet interface, and must already be plumbed with
.BR sppptun (1M).
The
optional
.I service
parameter specifies a particular service desired;
other offered services will be ignored. The optional
.I server
parameter
specifies a specific server desired. You can specify
.I server
as an
Ethernet address in the usual x:x:x:x:x:x format (with "\fB*\fR" in any of
the six byte positions interpreted to mean "any"), or as a symbolic name
resolved through
.B /etc/ethers
(or NIS), or as a PPPoE access
concentrator name. The sense of the match (true or false) can be inverted by
specifying the keyword
.B except
before this string. This parameter can
be specified more than once, and the first match is taken.
.sp
.LP
If you specify the
.I server
parameter, then the selected servers become
"preferred." If no preferred server responds, then the first responding
server is used instead. To exclude non-matching servers entirely, append the
keyword
.BR only .
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -i
.ad
.RS 6n
.rt
Sends out broadcast query over interface specified by
.IR device .
.RE

.sp
.ne 2
.mk
.na
.B -o
.ad
.RS 6n
.rt
Sets the initial wait time in milliseconds for PADO from the server before
PADI is retried. The default is 500 milliseconds for normal operation, or
3000 milliseconds (3 seconds) for inquiry
.RB ( -i )
mode.
.RE

.sp
.ne 2
.mk
.na
.B -s
.ad
.RS 6n
.rt
Sets the initial wait time in milliseconds for PADS from the server before
PADR is retried. The default is 2000 milliseconds (2 seconds).
.RE

.sp
.ne 2
.mk
.na
.B -v
.ad
.RS 6n
.rt
Displays verbose progress messages, including all PPPoE messages sent, and
all state machine transitions.
.RE

.sp
.LP
You normally do not need to adjust the parameters set with
.B -o
and
.BR -s .
They are provided for coping with unusually slow servers.
.SH OPERANDS
.sp
.LP
The following operands are supported:
.sp
.ne 2
.mk
.na
.I device
.ad
.RS 11n
.rt
plumbed Ethernet interface
.RE

.sp
.ne 2
.mk
.na
.I server
.ad
.RS 11n
.rt
preferred server or, if you specify
.BR only ,
the specified server
.RE

.sp
.ne 2
.mk
.na
.I service
.ad
.RS 11n
.rt
desired service; other available services are ignored
.RE

.SH EXAMPLES
.LP
.B Example 1
Connecting to Any Service on
.BR hme0
.sp
.LP
The following command enables you to connect to any PPPoE service on
.BR hme0 :

.sp
.in +2
.nf
# /usr/bin/pppd sppptun plugin pppoe.so \
connect "/usr/lib/inet/pppoec hme0" debug
.fi
.in -2
.sp

.sp
.LP
Often, a command such as the preceding is specified in an
.B /etc/ppp/peers
file instead. For example, enter the following in
.BR /etc/ppp/peers/myisp :

.sp
.in +2
.nf
sppptun
plugin pppoe.so
connect "/usr/lib/inet/pppoec hme0"
debug
.fi
.in -2
.sp

.sp
.LP
To invoke the PPP connection described in the file, enter:

.sp
.in +2
.nf
% /usr/bin/pppd call myisp
.fi
.in -2
.sp

.sp
.LP
Note that, because the
.B /etc/ppp/peers
files are considered privileged
by
.BR pppd ,
you need not be root to invoke the preceding command.

.LP
.B Example 2
Connecting to a Particular Service
.sp
.LP
A more complex example: on
.BR hme0 ,
connect to only the
.BR internet
service offered by PPPoE servers with access concentrator name
.BR isp ,
but not to any Ethernet addresses starting with
.BR 40:0:1a .

.sp
.in +2
.nf
# \fB/usr/lib/inet/pppoec hme0 internet except 40:0:1a:*:*:* isp only\fR
.fi
.in -2
.sp

.sp
.LP
Note that the
.B "except 40:0:1a:*:*:*"
filter must come before
.BR isp ,
because the filters are first-match.

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 6n
.rt
Successful completion.
.RE

.sp
.ne 2
.mk
.na
.B >0
.ad
.RS 6n
.rt
An error occurred.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B /usr/lib/inet/pppoec
.ad
.RS 27n
.rt
executable command
.RE

.sp
.ne 2
.mk
.na
.B /dev/sppptun
.ad
.RS 27n
.rt
Solaris PPP tunneling device driver.
.RE

.sp
.ne 2
.mk
.na
.B /etc/ppp/connect-errors
.ad
.RS 27n
.rt
usual location of error output (see DIAGNOSTICS, below)
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWpppdt
.TE

.SH SEE ALSO
.sp
.LP
.BR pppd (1M),
.BR sppptun (1M),
.BR pppoed (1M),
.BR sppptun (7M)
.sp
.LP
.IR "RFC 2516, Method for Transmitting PPP Over Ethernet (PPPoE)" ,
Mamakos
et al, February 1999
.SH DIAGNOSTICS
.sp
.LP
Error messages are written to standard error, which is normally redirected
by
.B pppd
to
.BR /etc/ppp/connect-errors .
The errors can also be
redirected to
.BR pppd 's
standard output by using the \fBupdetach\fR
option.
.sp
.LP
If you specify the
.BR -v ,
verbose progress messages are displayed,
including all PPPoE messages sent, and all state machine transitions.
Specifying the
.B updetach
or
.B "nodetach pppd"
option is helpful
when using verbose mode.
