usr/src/man/man1m/pppstats.1m
'\" te
.\" Copyright (c) 1989 Regents of the University of California. All rights reserved.
.\"
.\" Redistribution and use in source and binary forms are permitted
.\" provided that the above copyright notice and this paragraph are
.\" duplicated in all such forms and that any documentation,
.\" advertising materials, and other materials related to such
.\" distribution and use acknowledge that the software was developed
.\" by the University of California, Berkeley.
.\"
.\" The name of the University may not be used to endorse or promote products
.\" derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED ``AS IS'' AND WITHOUT ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED
.\" WARRANTIES OF MERCHANTIBILITY AND FITNESS FOR A PARTICULAR PURPOSE.
.\"
.\" Portions Copyright (c) 2008, Sun Microsystems, Inc. All Rights Reserved.
.TH pppstats 1M "4 May 2001" "SunOS 5.11" "System Administration Commands"
.SH NAME
pppstats \- print PPP statistics
.SH SYNOPSIS
.LP
.nf
\fBpppstats\fR [\fB-a\fR] [\fB-v\fR] [\fB-r\fR] [\fB-z\fR] [\fB-c\fR \fI<count>\fR] [\fB-w\fR \fI<secs>\fR]
     [\fIinterface\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The \fBpppstats\fR utility reports PPP-related statistics at regular
intervals for the specified PPP interface. If the interface is unspecified,
\fBpppstats\fR defaults to \fBsppp0\fR. The display is split horizontally
into input and output sections containing columns of statistics describing
the properties and volume of packets received and transmitted by the
interface.
.SH OPTIONS
.sp
.LP
The \fBpppstats\fR options are:
.sp
.ne 2
.mk
.na
\fB-a\fR \fR
.ad
.RS 13n
.rt
Display absolute values rather than deltas. With this option, all reports
show statistics for the time elapsed since the link was initiated. Without
this option, the second and subsequent reports show statistics for the time
since the last report.
.RE

.sp
.ne 2
.mk
.na
\fB-c\fR \fIcount\fR \fR
.ad
.RS 13n
.rt
Repeat the display \fIcount\fR times. If this option is not specified, the
default repeat count is 1 if the \fB-w\fR option is not specified, otherwise
infinity.
.RE

.sp
.ne 2
.mk
.na
\fB-r\fR \fR
.ad
.RS 13n
.rt
Display additional statistics summarizing the compression ratio achieved by
the packet compression algorithm in use.
.RE

.sp
.ne 2
.mk
.na
\fB-v\fR \fR
.ad
.RS 13n
.rt
Display additional statistics relating to the performance of the Van
Jacobson TCP header compression algorithm.
.RE

.sp
.ne 2
.mk
.na
\fB-w\fR \fIwait\fR \fR
.ad
.RS 13n
.rt
Pause  \fIwait\fR seconds between each display. If this option is not
specified, the default interval is five seconds.
.RE

.sp
.ne 2
.mk
.na
\fB-z\fR \fR
.ad
.RS 13n
.rt
Instead of the standard display, show statistics indicating the performance
of the packet compression algorithm in use.
.RE

.SH EXTENDED DESCRIPTION
.sp
.LP
The following fields are printed on the input side when the \fB-z\fR option
is not used:
.sp
.ne 2
.mk
.na
\fBIN\fR \fR
.ad
.RS 11n
.rt
Total number of bytes received by this interface.
.RE

.sp
.ne 2
.mk
.na
\fBPACK\fR \fR
.ad
.RS 11n
.rt
Total number of packets received by this interface.
.RE

.sp
.ne 2
.mk
.na
\fBVJCOMP\fR \fR
.ad
.RS 11n
.rt
Number of header-compressed TCP packets received by this interface.
.RE

.sp
.ne 2
.mk
.na
\fBVJUNC\fR \fR
.ad
.RS 11n
.rt
Number of header-uncompressed TCP packets received by this interface. Not
reported when the \fB-r\fR option is specified.
.RE

.sp
.ne 2
.mk
.na
\fBVJERR\fR \fR
.ad
.RS 11n
.rt
Number of corrupted or bogus header-compressed TCP packets received by this
interface. Not reported when the \fB-r\fR option is specified.
.RE

.sp
.ne 2
.mk
.na
\fBVJTOSS\fR \fR
.ad
.RS 11n
.rt
Number of VJ header-compressed TCP packets dropped on reception by this
interface because of preceding errors. Only reported when the \fB-v\fR
option is specified.
.RE

.sp
.ne 2
.mk
.na
\fBNON-VJ\fR \fR
.ad
.RS 11n
.rt
Total number of non-TCP packets received by this interface. Only reported
when the \fB-v\fR option is specified.
.RE

.sp
.ne 2
.mk
.na
\fBRATIO\fR \fR
.ad
.RS 11n
.rt
Compression ratio achieved for received packets by the packet compression
scheme in use, defined as the uncompressed size divided by the compressed
size. Only reported when the \fB-r\fR option is specified.
.RE

.sp
.ne 2
.mk
.na
\fBUBYTE\fR \fR
.ad
.RS 11n
.rt
Total number of bytes received, after decompression of compressed packets.
Only reported when the \fB-r\fR option is specified.
.RE

.sp
.LP
The following fields are printed on the output side:
.sp
.ne 2
.mk
.na
\fBOUT\fR
.ad
.RS 10n
.rt
Total number of bytes transmitted from this interface.
.RE

.sp
.ne 2
.mk
.na
\fBPACK\fR
.ad
.RS 10n
.rt
Total number of packets transmitted from this interface.
.RE

.sp
.ne 2
.mk
.na
\fBVJCOMP\fR
.ad
.RS 10n
.rt
Number of TCP packets transmitted from this interface with VJ-compressed
TCP headers.
.RE

.sp
.ne 2
.mk
.na
\fBVJUNC\fR
.ad
.RS 10n
.rt
Number of TCP packets transmitted from this interface with VJ-uncompressed
TCP headers. Not reported when the \fB-r\fR option is specified.
.RE

.sp
.ne 2
.mk
.na
\fBNON-VJ\fR
.ad
.RS 10n
.rt
Total number of non-TCP packets transmitted from this interface. Not
reported when the \fB-r\fR option is specified.
.RE

.sp
.ne 2
.mk
.na
\fBVJSRCH\fR
.ad
.RS 10n
.rt
Number of searches for the cached header entry for a VJ header compressed
TCP packet. Only reported when the \fB-v\fR option is specified.
.RE

.sp
.ne 2
.mk
.na
\fBVJMISS\fR
.ad
.RS 10n
.rt
Number of failed searches for the cached header entry for a VJ header
compressed TCP packet. Only reported when the \fB-v\fR option is
specified.
.RE

.sp
.ne 2
.mk
.na
\fBRATIO\fR
.ad
.RS 10n
.rt
Compression ratio achieved for transmitted packets by the packet
compression scheme in use, defined as the size before compression divided by
the compressed size. Only reported when the \fB-r\fR option is specified.
.RE

.sp
.ne 2
.mk
.na
\fBUBYTE\fR
.ad
.RS 10n
.rt
Total number of bytes to be transmitted before packet compression is
applied. Only reported when the \fB-r\fR option is specified.
.RE

.sp
.LP
When the \fB-z\fR option is specified, \fBpppstats\fR displays the
following fields relating to the packet compression algorithm currently in
use. If packet compression is not in use, these fields display zeroes. The
fields displayed on the input side are:
.sp
.ne 2
.mk
.na
\fBCOMPRESSED BYTE\fR
.ad
.RS 23n
.rt
Number of bytes of compressed packets received.
.RE

.sp
.ne 2
.mk
.na
\fBCOMPRESSED PACK\fR
.ad
.RS 23n
.rt
Number of compressed packets received.
.RE

.sp
.ne 2
.mk
.na
\fBINCOMPRESSIBLE BYTE\fR
.ad
.RS 23n
.rt
Number of bytes of incompressible packets (that is, those which were
transmitted in uncompressed form) received.
.RE

.sp
.ne 2
.mk
.na
\fBINCOMPRESSIBLE PACK\fR
.ad
.RS 23n
.rt
Number of incompressible packets received.
.RE

.sp
.ne 2
.mk
.na
\fBCOMP RATIO\fR
.ad
.RS 23n
.rt
Recent compression ratio for incoming packets, defined as the uncompressed
size divided by the compressed size (including both compressible and
incompressible packets).
.RE

.sp
.LP
The fields displayed on the output side are:
.sp
.ne 2
.mk
.na
\fBCOMPRESSED BYTE\fR
.ad
.RS 23n
.rt
Number of bytes of compressed packets transmitted.
.RE

.sp
.ne 2
.mk
.na
\fBCOMPRESSED PACK\fR
.ad
.RS 23n
.rt
Number of compressed packets transmitted.
.RE

.sp
.ne 2
.mk
.na
\fBINCOMPRESSIBLE BYTE\fR
.ad
.RS 23n
.rt
Number of bytes of incompressible packets received; that is, those that
were transmitted by the peer in uncompressed form.
.RE

.sp
.ne 2
.mk
.na
\fBINCOMPRESSIBLE PACK\fR
.ad
.RS 23n
.rt
Number of incompressible packets transmitted.
.RE

.sp
.ne 2
.mk
.na
\fBCOMP RATIO\fR
.ad
.RS 23n
.rt
Recent compression ratio for outgoing packets.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5)  for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWpppdu
_
Interface StabilityEvolving
.TE

.SH SEE ALSO
.sp
.LP
\fBpppd\fR(1M), \fBattributes\fR(5)
