usr/src/man/man1m/pprosetup.1m
'\" te
.\" Copyright (c) 2004, Sun Microsystems, Inc. All Rights Reserved.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH pprosetup 1M "6 Apr 2005" "SunOS 5.11" "System Administration Commands"
.SH NAME
pprosetup \- setup program for Patch Manager
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/pprosetup\fR [\fB-a\fR \fIadmin-email-addr\fR] [\fB-b\fR \fIbackout-dir\fR]
     [\fB-c\fR \fIconfig-name\fR] [\fB-C\fR] [\fB-d\fR \fIpatch-dir\fR]
     [ [\fB-D\fR | \fB-M\fR \fIday-of-month\fR | \fB-W\fR \fIday-of-week\fR] [\fB-s\fR \fIhh\fR:\fImm\fR]]
     [\fB-h\fR] [\fB-H\fR] [\fB-i\fR [none | \fIpatch-property-list\fR]] [\fB-L\fR]
     [\fB-p\fR [none | standard]] [\fB-P\fR \fIpatch-source-url\fR]
     [\fB-q\fR \fIsequester-dir\fR] [\fB-u\fR \fIuser-name\fR]
     [\fB-U\fR \fIproxy-user-name\fR] [\fB-x\fR [\fIhost\fR:\fIport\fR]]
.fi

.SH DESCRIPTION
.LP
Note -
.sp
.RS 2
This command is deprecated. Use the \fBsmpatch set\fR, \fBsmpatch unset\fR,
and \fBsmpatch get\fR commands instead. See the \fBsmpatch\fR(1M) man page.
.RE
.sp
.LP
Use the \fBpprosetup\fR command, as superuser, to configure your patch
management environment by doing the following:
.RS +4
.TP
.ie t \(bu
.el o
Scheduling the patch operations
.RE
.RS +4
.TP
.ie t \(bu
.el o
Setting a patch policy
.RE
.RS +4
.TP
.ie t \(bu
.el o
Specifying patch directories
.RE
.RS +4
.TP
.ie t \(bu
.el o
Specifying the hardware on the system
.RE
.RS +4
.TP
.ie t \(bu
.el o
Specifying alternate configurations
.RE
.SS "Scheduling the Patch Operations"
.sp
.LP
Schedule the automatic synchronization of patches with Sun's patch base. This
scheduling makes the \fBpprosvc\fR command run in \fBautomatic mode\fR. This
mode is set up by using the \fBcron\fR interface. Use the \fB-C\fR, \fB-D\fR,
\fB-M\fR, \fB-s\fR, and \fB-W\fR options to perform the scheduling tasks.
.sp
.LP
If you do not want to schedule patch operations, you can run the
\fBpprosvc\fR and \fBsmpatch\fR commands in \fBmanual mode\fR, which means
running the tool from the command line.
.sp
.LP
Note that midnight is represented as 00:00.
.LP
Note -
.sp
.RS 2
The \fBsmpatch\fR command does not directly support this mechanism for
scheduling patch operations. You can set up a schedule by using \fBcron\fR to
run \fBsmpatch\fR in local mode. See the \fBsmpatch\fR(1M) man page.
.RE
.SS "Setting a Patch Policy"
.sp
.LP
Patches are classified as being standard or nonstandard. A \fBstandard
patch\fR can be applied by \fBpprosvc\fR in automatic mode. Such a patch is
associated with the \fBstandard\fR patch property. A \fBnonstandard patch\fR
is one that has one of the following characteristics:
.RS +4
.TP
.ie t \(bu
.el o
A patch that is associated with the \fBrebootafter\fR, \fBrebootimmediate\fR,
\fBreconfigafter\fR, \fBreconfigimmediate\fR, or \fBsingleuser\fR properties.
This nonstandard patch can be applied by running the \fBpprosvc\fR command or
the \fBsmpatch\fR command in manual mode.
.RE
.RS +4
.TP
.ie t \(bu
.el o
A patch that is associated with the \fBinteractive\fR property. Such a patch
cannot be applied by using the \fBsmpatch\fR command.
.RE
.sp
.LP
Use \fBpprosetup\fR to schedule patch operations to run in \fBautomatic
mode\fR. Patches are applied based on the policy, which you can set by running
\fBpprosetup\fR.
.sp
.LP
Use \fBpprosetup -p\fR to specify the types of patches to apply in automatic
mode. You can set a policy to apply no patches (\fBnone\fR) or standard
patches (\fBstandard\fR).
.sp
.LP
Use \fBpprosetup -i\fR to specify the types of patches to apply in
\fBmanual\fR mode. Such patches might include those that require a reboot and
those that must be applied while the system is in single-user mode. Specify
the types of patches that can be applied by using the following command:
.sp
.in +2
.nf
# \fBpprosetup -i\fR \fIpatch-property-list\fR
.fi
.in -2
.sp

.sp
.LP
\fIpatch-property-list\fR is a colon-separated list of one or more of the
following patch properties:
.sp
.ne 2
.mk
.na
\fBinteractive\fR
.ad
.RS 21n
.rt
A patch that cannot be applied by running the usual patch management tools
(\fBpprosvc\fR, \fBsmpatch\fR, or \fBpatchadd\fR). Before this patch is
applied, the user must perform special actions. Such actions might include
checking the serial number of a disk drive, stopping a critical daemon, or
reading the patch's README file.
.RE

.sp
.ne 2
.mk
.na
\fBrebootafter\fR
.ad
.RS 21n
.rt
The effects of this patch are not visible until after the system is
rebooted.
.RE

.sp
.ne 2
.mk
.na
\fBrebootimmediate\fR
.ad
.RS 21n
.rt
When this patch is applied, the system becomes unstable until the system is
rebooted. An unstable system is one in which the behavior is unpredictable and
data might be lost.
.RE

.sp
.ne 2
.mk
.na
\fBreconfigafter\fR
.ad
.RS 21n
.rt
The effects of this patch are not visible until after a reconfiguration
reboot (\fBboot -r\fR). See the \fBboot\fR(1M) man page.
.RE

.sp
.ne 2
.mk
.na
\fBreconfigimmediate\fR
.ad
.RS 21n
.rt
When this patch is applied, the system becomes unstable until the system gets
a reconfiguration reboot (\fBboot -r\fR). An unstable system is one in which
the behavior is unpredictable and data might be lost.
.RE

.sp
.ne 2
.mk
.na
\fBsingleuser\fR
.ad
.RS 21n
.rt
Do not apply this patch while the system is in multiuser mode. You must apply
this patch on a quiet system with no network traffic and with extremely
restricted I/O activity.
.RE

.sp
.ne 2
.mk
.na
\fBstandard\fR
.ad
.RS 21n
.rt
This patch can be applied while the system is in multiuser mode. The effects
of the patch are visible as soon as it is applied unless the application being
patched is running while the patch is applied. In this case, the effects of
the patch are visible after the affected application is restarted.
.RE

.LP
Note -
.sp
.RS 2
The \fBsmpatch\fR command only supports the patch policy for manual mode.
.RE
.SS "Specifying Patch Directories"
.sp
.LP
Use the following options to specify the directories in which to store
patch-related data:
.RS +4
.TP
.ie t \(bu
.el o
Use the \fB-b\fR option to specify the directory in which to store backout
data. During a patch backout operation, the data is retrieved from this
directory to restore the system to its state prior to applying the patch.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Use the \fB-d\fR option to specify the download directory in which to store
patches that are downloaded from the Sun patch server. This directory is also
the location from which patches are applied.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Use the \fB-q\fR option to specify the directory in which to store patches
that cannot be applied automatically. Such patches are called \fBsequestered
patches\fR.
.LP
Note -
.sp
.RS 2
The sequester directory is not used by the \fBsmpatch\fR command.
.RE
.RE
.SS "Specifying the Hardware on the System"
.sp
.LP
Use the \fB-H\fR option to run a program that helps you determine the
hardware that is attached to the host system, such as firmware, disk array
systems, and tape storage systems.
.sp
.LP
Use this option to select the hardware that applies to this system. Select
the sequence number of the specific hardware. A confirmation page lists the
selections.
.sp
.LP
Save the specified hardware configuration information to a file. Then, the
system responds by performing the appropriate actions.
.LP
Note -
.sp
.RS 2
The \fBsmpatch\fR command does not support this feature for specifying
hardware on your system.
.RE
.SS "Specifying Alternate Configurations"
.sp
.LP
The \fBpprosetup\fR command uses a configuration file to specify the
collection of patches with which to perform patch operations. By default, all
of the patches from the Sun patch server are available for patch operations.
.sp
.LP
The \fB-c\fR option enables you to specify an alternate configuration.
.sp
.LP
Sun currently provides one alternate configuration, which is called the
\fBrecommended\fR configuration. This configuration includes only those
patches that have been declared significant. Such patches include security
patches and patches that address known performance and availability
problems.
.sp
.LP
You can use the \fB-c recommended\fR option when you schedule patch
operations. For example, the following command schedules monthly patch
operations that use the \fBrecommended\fR configuration:
.sp
.in +2
.nf
# \fBpprosetup -c recommended -M 15 -s 23:30\fR
.fi
.in -2
.sp

.sp
.LP
To cancel a schedule that uses the \fBrecommended\fR configuration, type:
.sp
.in +2
.nf
# \fBpprosetup -c recommended -C\fR
.fi
.in -2
.sp

.sp
.LP
You are permitted to modify the \fBrecommended\fR configuration by using the
\fB-c\fR option. See EXAMPLES.
.LP
Note -
.sp
.RS 2
The \fBsmpatch\fR command does not support this feature for specifying
alternate configurations.
.RE
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB-a\fR \fIadmin-email-addr\fR
.ad
.sp .6
.RS 4n
Is the email address of the patch administrator. Email notification is sent
to describe the patches downloaded, the patches applied, and any error events
that occurred when running the \fBpprosvc -i -n\fR command.
.LP
Note -
.sp
.RS 2
This option does not affect the \fBsmpatch\fR command.
.RE
.RE

.sp
.ne 2
.mk
.na
\fB-b\fR \fIbackout-dir\fR
.ad
.sp .6
.RS 4n
Stores backout data in the specified directory.
.sp
The backout data is used whenever you use the \fBpatchrm\fR command to remove
a patch that has already been applied to your system. The data is used to
restore a system to the state it was in before you applied a particular patch.
Since backout data might be quite large, store the data in a large partition
that holds large transitory data. Such a partition might be \fB/var\fR.
.sp
If you do not specify the \fB-b\fR option, the backout data is stored in the
default locations used by \fBpatchadd\fR. These locations are the \fBsave\fR
directories of the packages that were modified by the patch. For example, if a
patch modifies the \fBSUNWcsr\fR package, the backout data for that package is
stored in the \fB/var/sadm/pkg/SUNWcsr/save\fR directory.
.sp
To specify the backout directory, use the \fBsmpatch set\fR command to set
the \fBpatchpro.backout.directory\fR parameter.
.LP
Note -
.sp
.RS 2
The root file system of any non-global zones must not be referenced with the
\fB-b\fR option. Doing so might damage the global zone's file system, might
compromise the security of the global zone, and might damage the non-global
zone's file system. See \fBzones\fR(5).
.RE
.RE

.sp
.ne 2
.mk
.na
\fB-C\fR
.ad
.sp .6
.RS 4n
Clears the existing patch service schedule.
.LP
Note -
.sp
.RS 2
This feature is not supported by the \fBsmpatch\fR command.
.RE
.RE

.sp
.ne 2
.mk
.na
\fB-c\fR \fIconfig-name\fR
.ad
.sp .6
.RS 4n
Uses the \fIconfig-name\fR configuration for patch operations. When this
option is included in any \fBpprosetup\fR command, the entire command applies
to the specified configuration.
.LP
Note -
.sp
.RS 2
This feature is not supported by the \fBsmpatch\fR command.
.RE
.RE

.sp
.ne 2
.mk
.na
\fB-d\fR \fIpatch-dir\fR
.ad
.sp .6
.RS 4n
Is the directory in which to download the patches that are appropriate for
this host system. This directory is also the location from which patches are
applied. By default, the download directory is \fB/var/sadm/spool\fR.
.LP
Note -
.sp
.RS 2
To specify the download directory, use the \fBsmpatch set\fR command to set
the \fBpatchpro.download.directory\fR parameter.
.RE
.RE

.sp
.ne 2
.mk
.na
\fB-D\fR
.ad
.sp .6
.RS 4n
Schedules the automatic analysis, download, and optional application of
patches on a daily basis. This option is equivalent to executing the
\fBpprosvc -i -n\fR command on a daily basis. See the \fBcrontab\fR(1) man
page.
.sp
The policy defined by the \fB-p\fR option determines whether no patches
(\fBpprosetup -p none\fR) are applied or whether standard patches
(\fBpprosetup -p standard\fR) are applied. By default, no patches are
applied.
.sp
This option is mutually exclusive with the \fB-M\fR option and the \fB-W\fR
option.
.LP
Note -
.sp
.RS 2
This feature is not supported by the \fBsmpatch\fR command.
.RE
.RE

.sp
.ne 2
.mk
.na
\fB-h\fR
.ad
.sp .6
.RS 4n
Displays information about command-line options.
.RE

.sp
.ne 2
.mk
.na
\fB-H\fR
.ad
.sp .6
.RS 4n
Establishes a dialog with the user to determine what hardware is attached to
the host system.
.LP
Note -
.sp
.RS 2
This feature is not supported by the \fBsmpatch\fR command.
.RE
.RE

.sp
.ne 2
.mk
.na
\fB-i\fR [\fBnone\fR | \fIpatch-property-list\fR]\fR
.ad
.sp .6
.RS 4n
Specifies the policy for applying patches in manual mode.
.sp
No patches are applied when \fBnone\fR is specified.
\fIpatch-property-list\fR is a colon-separated list of one or more of the
following patch properties: \fBinteractive\fR, \fBrebootafter\fR,
\fBrebootimmediate\fR, \fBreconfigafter\fR, \fBreconfigimmediate\fR,
\fBsingleuser\fR, and \fBstandard\fR. See Setting a Patch Policy.
.LP
Note -
.sp
.RS 2
To specify the patch policy, use the \fBsmpatch set\fR command to set the
\fBpatchpro.install.types\fR parameter.
.RE
.RE

.sp
.ne 2
.mk
.na
\fB-L\fR
.ad
.sp .6
.RS 4n
Displays the configuration parameter settings of your patch management
environment.
.sp
This option is mutually exclusive with the other options.
.LP
Note -
.sp
.RS 2
To view the configuration parameter settings, use the \fBsmpatch get\fR
command.
.RE
.RE

.sp
.ne 2
.mk
.na
\fB-M\fR \fIday-of-month\fR
.ad
.sp .6
.RS 4n
Schedules the automatic analysis, download, and optional application of
patches on a monthly basis.
.sp
The policy defined by the \fB-p\fR option determines whether no patches
(\fBpprosetup -p none\fR) are applied or whether standard patches
(\fBpprosetup -p standard\fR) are applied. By default, no patches are
applied.
.sp
\fIday-of-month\fR is a numerical value from 1-28, which represents the day
of the month. Note that the values 29, 30, and 31 are invalid. See the
\fBcrontab\fR(1) man page.
.sp
This option is mutually exclusive with the \fB-D\fR option and the \fB-W\fR
option.
.LP
Note -
.sp
.RS 2
This feature is not supported by the \fBsmpatch\fR command.
.RE
.RE

.sp
.ne 2
.mk
.na
\fB-p\fR [\fBnone\fR | \fBstandard\fR]\fR
.ad
.sp .6
.RS 4n
Specifies the policy for applying patches in automatic mode.
.sp
No patches are applied when \fBnone\fR, the default, is specified.
.sp
When \fBstandard\fR is specified, only standard patches are applied.
.LP
Note -
.sp
.RS 2
This feature is not supported by the \fBsmpatch\fR command.
.RE
.RE

.sp
.ne 2
.mk
.na
\fB-P\fR \fIpatch-source-url\fR
.ad
.sp .6
.RS 4n
Is the URL that points to the collection of patches. The default is the Sun
patch server, which has the following URL:
.sp
.in +2
.nf
https://updateserver.sun.com/solaris/
.fi
.in -2
.sp

.LP
Note -
.sp
.RS 2
To specify the URL that points to the collection of patches, use the
\fBsmpatch set\fR command to set the \fBpatchpro.patch.source\fR parameter.
.RE
.RE

.sp
.ne 2
.mk
.na
\fB-q\fR \fIsequester-dir\fR
.ad
.sp .6
.RS 4n
Is the directory in which patches are moved if they cannot be automatically
applied. By default, the sequester directory is
\fB/var/sadm/spool/patchproSequester\fR.
.LP
Note -
.sp
.RS 2
The sequester directory is not used by the \fBsmpatch\fR command.
.RE
.RE

.sp
.ne 2
.mk
.na
\fB-s\fR \fIhh\fB:\fImm\fR
.ad
.sp .6
.RS 4n
Optionally sets the time of day to perform patch operations, which by
default, is midnight local time.
.sp
\fIhh\fR is a value from 00-23, which specifies the hour. \fImm\fR is a value
from 00-59, which specifies the minute.
.sp
Use this option with the \fB-D\fR, \fB-M\fR, and \fB-W\fR options.
.LP
Note -
.sp
.RS 2
This feature is not supported by the \fBsmpatch\fR command.
.RE
.RE

.sp
.ne 2
.mk
.na
\fB-u\fR \fIuser-name\fR
.ad
.sp .6
.RS 4n
Is the user name with which to obtain contract patches from Sun.
.sp
Store the corresponding SunSpectrum user's password in the
\fBlib/.sunsolvepw\fR file. If PatchPro is installed in the default location,
this file is in the \fB/opt/SUNWppro\fR directory.
.sp
Keep the password safe by setting the owner, group, and permissions to
\fBroot\fR, \fBsys\fR, and \fB0600\fR, respectively.
.LP
Note -
.sp
.RS 2
This file method of supplying passwords is no longer supported.
.RE
.LP
Note -
.sp
.RS 2
To specify this user, use the \fBsmpatch set\fR command to set the
\fBpatchpro.sun.user\fR parameter. Also, specify this user's password by
setting the \fBpatchpro.sun.passwd\fR parameter.
.RE
.RE

.sp
.ne 2
.mk
.na
\fB-U\fR \fIproxy-user-name\fR
.ad
.sp .6
.RS 4n
Is the user name required for authentication of the web proxy, if
applicable.
.sp
Store the corresponding user's password in the \fBlib/.proxypw\fR file. If
PatchPro is installed in the default location, this file is in the
\fB/opt/SUNWppro\fR directory.
.sp
Keep the password safe by setting the owner, group, and permissions to
\fBroot\fR, \fBsys\fR, and \fB0600\fR, respectively.
.LP
Note -
.sp
.RS 2
This file method of supplying passwords is no longer supported.
.RE
.LP
Note -
.sp
.RS 2
To specify this user, use the \fBsmpatch set\fR command to set the
\fBpatchpro.proxy.user\fR parameter. Also, specify this user's password by
setting the \fBpatchpro.proxy.passwd\fR parameter.
.RE
.RE

.sp
.ne 2
.mk
.na
\fB-W\fR \fIday-of-week\fR
.ad
.sp .6
.RS 4n
Schedules the automatic analysis, download, and optional application of
patches on a weekly basis.
.sp
\fIday-of-week\fR is a numerical value from 0-6, which represents the day of
the week. 0 represents Sunday. See the \fBcrontab\fR(1) man page.
.sp
The policy defined by the \fB-p\fR option determines whether no patches
(\fBpprosetup -p none\fR) are applied or whether standard patches
(\fBpprosetup -p standard\fR) are applied. By default, no patches are
applied.
.sp
This option is mutually exclusive with the \fB-D\fR option and the \fB-M\fR
option.
.LP
Note -
.sp
.RS 2
This feature is not supported by the \fBsmpatch\fR command.
.RE
.RE

.sp
.ne 2
.mk
.na
\fB-x\fR [\fIhost\fB:\fIport\fR]\fR
.ad
.sp .6
.RS 4n
Specifies the web proxy. If your system is behind a firewall, use this option
to specify your web proxy. Get the name of the web proxy and its port from
your system administrator or network administrator.
.LP
Note -
.sp
.RS 2
To specify the web proxy host name and port, use the \fBsmpatch set\fR
command to set the \fBpatchpro.proxy.host\fR and \fBpatchpro.proxy.port\fR
parameters, respectively.
.RE
.RE

.SH EXAMPLES
.LP
\fBExample 1 \fRScheduling Daily Patch Operations in Automatic Mode
.sp
.in +2
.nf
# \fBpprosetup -D\fR
.fi
.in -2
.sp

.sp
.LP
Schedules \fBsmpatch update\fR to run in automatic mode daily at midnight
local time.

.LP
\fBExample 2 \fRScheduling Weekly Patch Operations in Automatic Mode
.sp
.in +2
.nf
# \fBpprosetup -W 0 -s 00:45\fR
.fi
.in -2
.sp

.sp
.LP
Schedules \fBsmpatch update\fR to run in automatic mode every Sunday at 12:45
a.m. local time.

.LP
\fBExample 3 \fRScheduling Monthly Patch Operations in Automatic Mode
.sp
.in +2
.nf
# \fBpprosetup -M 15 -s 02:30\fR
.fi
.in -2
.sp

.sp
.LP
Schedules \fBsmpatch update\fR to run in automatic mode on the 15th day of
every month at 2:30 a.m. local time.

.LP
\fBExample 4 \fRCanceling Scheduled Jobs
.sp
.in +2
.nf
# \fBpprosetup -C\fR
.fi
.in -2
.sp

.sp
.LP
Cancels the scheduled jobs that use the default configuration.

.LP
\fBExample 5 \fRSpecifying the Patch Policy for Manual Mode
.sp
.in +2
.nf
# \fBpprosetup -i standard:singleuser:reconfigafter:rebootafter\fR
.fi
.in -2
.sp

.sp
.LP
Specifies the policy for applying patches in manual mode. This policy permits
you to apply the following types of patches to your system in manual mode:

.RS +4
.TP
.ie t \(bu
.el o
Standard patches
.RE
.RS +4
.TP
.ie t \(bu
.el o
Patches that must be applied in single-user mode
.RE
.RS +4
.TP
.ie t \(bu
.el o
Patches that require that the system undergo a reconfiguration reboot after
they have been applied
.RE
.RS +4
.TP
.ie t \(bu
.el o
Patches that require that the system undergo a reboot after they have been
applied
.RE
.LP
\fBExample 6 \fRSpecifying the Patch Policy for Automatic Mode
.sp
.in +2
.nf
# \fBpprosetup -p none\fR
.fi
.in -2
.sp

.sp
.LP
Specifies that no patches are automatically applied.

.sp
.in +2
.nf
# \fBpprosetup -p standard\fR
.fi
.in -2
.sp

.sp
.LP
Specifies that \fBonly\fR standard patches can be downloaded and applied.

.LP
\fBExample 7 \fRSpecifying an Alternate Download Directory
.sp
.in +2
.nf
# \fBpprosetup -d /export/home/patches\fR
.fi
.in -2
.sp

.sp
.LP
Specifies that patches are downloaded to the \fB/export/home/patches\fR
directory.

.LP
\fBExample 8 \fRSpecifying an Alternate Sequester Directory
.sp
.in +2
.nf
# \fBpprosetup -q /export/home/patches/sequester\fR
.fi
.in -2
.sp

.sp
.LP
Specifies that sequestered patches are stored in the
\fB/export/home/patches/sequester\fR directory.

.LP
\fBExample 9 \fRIdentifying the Hardware on Your System
.sp
.in +2
.nf
# \fBpprosetup -H\fR
.fi
.in -2
.sp

.sp
.LP
Enables a patch analysis to determine whether your system needs specific
patches based on your hardware configuration. This command only helps you
identify hardware products from Sun Network Storage.

.LP
\fBExample 10 \fRConfiguring Your System to Obtain Contract Patches
.sp
.in +2
.nf
# \fBpprosetup -u myuser\fR
# \fBecho mypasswd > /opt/SUNWppro/lib/.sunsolvepw\fR
.fi
.in -2
.sp

.sp
.LP
Enables your contract user, \fBmyuser\fR, to obtain the contract patches.

.sp
.LP
Ensure that the contract user's password is safe by setting the owner, group,
and permissions of the \fB\&.sunsolvepw\fR file to \fBroot\fR, \fBsys\fR, and
\fB0600\fR, respectively.

.LP
\fBExample 11 \fRSpecifying a Web Proxy
.sp
.in +2
.nf
# \fBpprosetup -x webaccess.corp.net.com:8080\fR
.fi
.in -2
.sp

.sp
.LP
Specifies the host name, \fBwebaccess.corp.net.com\fR, and port, \fB8080\fR,
of the web proxy to use.

.LP
\fBExample 12 \fRScheduling Daily Patch Operations to Use the
\fBrecommended\fR Configuration
.sp
.in +2
.nf
# \fBpprosetup -c recommended -D -s 23:00\fR
.fi
.in -2
.sp

.sp
.LP
Schedules a daily patch analysis that uses the \fBrecommended\fR
configuration. You can use the alternate configuration in conjunction with or
in place of a full analysis.

.sp
.in +2
.nf
# \fBpprosetup -c recommended -C\fR
.fi
.in -2
.sp

.sp
.LP
Cancels this job that uses the \fBrecommended\fR configuration.

.LP
\fBExample 13 \fRModifying the \fBrecommended\fR Configuration
.sp
.in +2
.nf
# \fBpprosetup -c recommended -a recommended@local\fR
.fi
.in -2
.sp

.sp
.LP
Modifies the \fBrecommended\fR configuration to send email notifications to
the \fBrecommended@local\fR email alias about each scheduled analysis that
uses the \fBrecommended\fR cluster. Any scheduled operation that uses the
\fBrecommended\fR configuration will send notification to the alias you
specify.

.LP
\fBExample 14 \fRCreating a New Configuration
.sp
.in +2
.nf
# \fBpprosetup -c export -d /export/patches\fR
.fi
.in -2
.sp

.sp
.LP
Creates a new configuration named \fBexport\fR that downloads patches to the
\fB/export/patches\fR directory. After executing this command, you can
schedule patch operations or manually run patch operations that use the
\fBexport\fR configuration by running the \fBpprosetup\fR or \fBpprosvc\fR
commands, respectively.

.sp
.in +2
.nf
# \fBpprosvc -c export -d\fR
.fi
.in -2
.sp

.sp
.LP
Downloads patches to the download directory specified by the \fBexport\fR
configuration.

.SH ATTRIBUTES
.sp
.LP
See the \fBattributes\fR(5) man page for descriptions of the following
attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWpprou
_
Interface StabilityObsolete
.TE

.SH SEE ALSO
.sp
.LP
\fBcrontab\fR(1), \fBboot\fR(1M), \fBpatchadd\fR(1M), \fBpatchrm\fR(1M),
\fBpprosvc\fR(1M), \fBsmpatch\fR(1M), \fBattributes\fR(5)
