usr/src/man/man1m/praudit.1m
'\" te
.\" Copyright (c) 2003, Sun Microsystems, Inc.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH praudit 1M "26 Jul 2009" "SunOS 5.11" "System Administration Commands"
.SH NAME
praudit \- print contents of an audit trail file
.SH SYNOPSIS
.LP
.nf
\fBpraudit\fR [\fB-lrsx\fR] [\fB-d\fIdel\fR] [\fIfilename\fR]...
.fi

.SH DESCRIPTION
.sp
.LP
.B praudit
reads the listed \fIfilename\fRs (or standard input, if no
.I filename
is specified) and interprets the data as audit trail records
as defined in
.BR audit.log (4).
By default, times, user and group
.B IDs
(UIDs and
.B GIDs,
respectively) are converted to their
.B ASCII
representation. Record type and event fields are converted to
their
.B ASCII
representation. A maximum of 100 audit files can be
specified on the command line.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB-d\fIdel\fR
.ad
.sp .6
.RS 4n
Use
.I del
as the field delimiter instead of the default delimiter,
which is the comma. If
.I del
has special meaning for the shell, it must
be quoted. The maximum size of a delimiter is three characters. The
delimiter is not meaningful and is not used when the
.B -x
option is
specified.
.RE

.sp
.ne 2
.mk
.na
.B -l
.ad
.sp .6
.RS 4n
Print one line per record.
.RE

.sp
.ne 2
.mk
.na
.B -r
.ad
.sp .6
.RS 4n
Print records in their raw form. Times,
.B "UIDs, GIDs,"
record
types, and events are displayed as integers. This option is useful when
naming services are offline. The
.B -r
option and the
.B -s
option are
exclusive. If both are used, a format usage error message is output.
.RE

.sp
.ne 2
.mk
.na
.B -s
.ad
.sp .6
.RS 4n
Display records in their short form. Numeric fields' ASCII equivalents are
looked up by means of the sources specified in the \fB/etc/nsswitch.conf\fR
file (see
.BR nsswitch.conf (4)).
All numeric fields are converted to ASCII
and then displayed. The short
.B ASCII
representations for the record
type and event fields are used. This option and the
.B -r
option are
exclusive. If both are used, a format usage error message is output.
.RE

.sp
.ne 2
.mk
.na
.B -x
.ad
.sp .6
.RS 4n
Print records in XML form. Tags are included in the output to identify
tokens and fields within tokens. Output begins with a valid XML prolog,
which includes identification of the DTD which can be used to parse the
XML.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/security/audit_event
.ad
.sp .6
.RS 4n
Audit event definition and class mappings.
.RE

.sp
.ne 2
.mk
.na
.B /etc/security/audit_class
.ad
.sp .6
.RS 4n
Audit class definitions.
.RE

.sp
.ne 2
.mk
.na
.B /usr/share/lib/xml/dtd
.ad
.sp .6
.RS 4n
Directory containing the verisioned DTD file referenced in XML output, for
example,
.BR adt_record.dtd.1 .
.RE

.sp
.ne 2
.mk
.na
.B /usr/share/lib/xml/style
.ad
.sp .6
.RS 4n
Directory containing the versioned XSL file referenced in XML output, for
example,
.BR adt_record.xsl.1 .
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
_
Interface StabilitySee below
.TE

.sp
.LP
The command stability is evolving. The output format is unstable.
.SH SEE ALSO
.sp
.LP
.BR bsmconv (1M),
.BR getent (1M),
.BR audit (2),
.BR getauditflags (3BSM),
.BR getpwuid (3C),
.BR gethostbyaddr (3NSL),
.BR ethers (3SOCKET),
.BR getipnodebyaddr (3SOCKET),
.BR audit.log (4),
.BR audit_class (4),
.BR audit_event (4),
.BR group (4),
.BR nsswitch.conf (4),
.BR passwd (4),
.BR attributes (5)
.sp
.LP
See the section on Solaris Auditing in \fISystem Administration Guide:
Security Services\fR.
.SH NOTES
.sp
.LP
This functionality is available only if the Solaris Auditing feature has
been enabled. See \fBbsmconv\fR(1M) for more information.
