usr/src/man/man1m/printmgr.1m
'\" te
.\" Copyright (C) 2003, Sun Microsystems, Inc. All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH printmgr 1M "23 May 2003" "SunOS 5.11" "System Administration Commands"
.SH NAME
printmgr \- Solaris Print Manager is a graphical user interface for
managing printers in a network
.SH SYNOPSIS
.LP
.nf
\fB/usr/sadm/admin/bin/printmgr\fR
.fi

.SH DESCRIPTION
.sp
.LP
Solaris Print Manager is a Java-based graphical user interface that enables
you to manage local and remote printer access. This tool can be used in the
following name service environments: LDAP, NIS, NIS+, and files. You must be
logged in as superuser to use this tool.
.sp
.LP
Using Solaris Printer Manager is the preferred method for managing printer
access because Solaris Print Manager centralizes printer information when it
is used in a name service environment.
.sp
.LP
Adding printer information to a name service makes access to printers
available to all systems on the network and generally makes printer
administration easier because all the information about printers is
centralized.
.sp
.LP
Solaris Print Manager may be run on a remote system with the display sent
to the local system. See the \fISystem Administration Guide: Solaris
Printing\fR for instructions on setting the
.B DISPLAY
environment
variable.
.sp
.LP
Using Solaris Print Manager to perform printer-related tasks automatically
updates the appropriate printer databases. Solaris Print Manager also
includes a command-line console that displays the
.B lp
command line for
the add, modify, and delete printer operations. Errors and warnings may also
be displayed when Printer Manager operations are performed.
.sp
.LP
Help is available by clicking the Help button.
.SH USAGE
.sp
.LP
Solaris Print Manager enables you to do the following tasks:
.sp
.ne 2
.mk
.na
.B Select a Name Service
.ad
.RS 29n
.rt
Select a name service for retrieving or changing printer information.
.RE

.sp
.ne 2
.mk
.na
.B Add Access to a Printer
.ad
.RS 29n
.rt
Add printer access on a printer client using Solaris Print Manager.
.RE

.sp
.ne 2
.mk
.na
.B Add an Attached Printer
.ad
.RS 29n
.rt
After physically attaching the printer to a system, use Solaris Print
Manager to install a local printer and make it available for printing.
.RE

.sp
.ne 2
.mk
.na
.B Add a Network Printer
.ad
.RS 29n
.rt
After physically attaching the printer to a system, use Solaris Print
Manager to install a local printer and make it available for printing.
.RE

.sp
.ne 2
.mk
.na
\fBModify Printer Properties\fR
.ad
.RS 29n
.rt
After adding access to a printer or adding an attached or network printer,
you can modify certain printer attributes.
.RE

.sp
.ne 2
.mk
.na
.B Delete a Printer
.ad
.RS 29n
.rt
Delete access to a printer from the print client or delete a printer from
the print server or from the name service environment.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWppm
.TE

.SH SEE ALSO
.sp
.LP
.BR ldap (1),
.BR lpget (1M),
.BR lpset (1M),
.BR attributes (5)
.sp
.LP
\fISystem Administration Guide: Solaris Printing\fR for information on LDAP
server replication.
.sp
.LP
Although users can use the LDAP command line utilities
.BR ldapadd (1)
and
\fBldapmodify\fR(1)to update printer entries in the directory, the preferred
method is to use
.BR lpset .
Otherwise, if the
.B lpadd
and
\fBlpmodify\fR utilities are used, the administrator must ensure that the
\fBprinter-name\fR attribute value is unique within the \fBou=printers\fR
container on the LDAP server. If the value is not unique, the result of
modifications done using
.B lpset
or the Solaris Print Manager,
\fBprintmgr\fR may be unpredictable.
