usr/src/man/man1m/projdel.1m
'\" te
.\" Copyright (c) 2001, Sun Microsystems, Inc.
.\" All Rights Reserved.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH projdel 1M "4 May 2004" "SunOS 5.11" "System Administration Commands"
.SH NAME
projdel \- delete a project from the system
.SH SYNOPSIS
.LP
.nf
\fBprojdel\fR [\fB-f\fR \fIfilename\fR] \fIproject\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B projdel
utility deletes a project from the system and makes the
appropriate changes to the system file.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB-f\fR \fIfilename\fR
.ad
.RS 15n
.rt
Specify the project file to modify. If no \fIfilename\fR is specified, the
system project file,
.BR /etc/project ,
is modified.
.RE

.SH OPERANDS
.sp
.LP
The following operands are supported:
.sp
.ne 2
.mk
.na
.I project
.ad
.RS 11n
.rt
The name of the project to be deleted.
.RE

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 6n
.rt
Successful completion.
.RE

.sp
.ne 2
.mk
.na
.B 2
.ad
.RS 6n
.rt
The command syntax was invalid. A usage message for
.B projdel
is
displayed.
.RE

.sp
.ne 2
.mk
.na
.B 3
.ad
.RS 6n
.rt
An invalid argument was provided to an option.
.RE

.sp
.ne 2
.mk
.na
.B 4
.ad
.RS 6n
.rt
The
.I projid
given with the
.B -p
option is already in use.
.RE

.sp
.ne 2
.mk
.na
.B 5
.ad
.RS 6n
.rt
The project files contain an error. See
.BR project (4).
.RE

.sp
.ne 2
.mk
.na
.B 6
.ad
.RS 6n
.rt
The project to be modified, group, user, or resource does not exist.
.RE

.sp
.ne 2
.mk
.na
.B 9
.ad
.RS 6n
.rt
The project is already in use.
.RE

.sp
.ne 2
.mk
.na
.B 10
.ad
.RS 6n
.rt
Cannot update the
.B /etc/project
file.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/project
.ad
.RS 16n
.rt
System project file
.RE

.sp
.ne 2
.mk
.na
\fR
.ad
.RS 16n
.rt

.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWesu
_
Interface stabilty		See below.
.TE

.sp
.LP
Invocation is evolving. Human readable output is unstable.
.SH SEE ALSO
.sp
.LP
.BR projects (1),
.BR groupadd (1M),
.BR groupdel (1M),
.BR groupmod (1M),
.BR grpck (1M),
.BR logins (1M),
.BR projadd (1M),
.BR projmod (1M),
.BR useradd (1M),
.BR userdel (1M),
.BR usermod (1M),
.BR project (4),
.BR attributes (5)
.SH DIAGNOSTICS
.sp
.LP
In case of an error,
.B projdel
prints an error message and exits with a
non-zero status.
.SH NOTES
.sp
.LP
\fBprojdel\fR deletes a project definition only on the local system. If a
network name service such as
.B NIS
or
.B LDAP
is being used to
supplement the local
.B /etc/project
file with additional entries,
\fBprojdel\fR cannot change information supplied by the network name
service.
