usr/src/man/man1m/projadd.1m
'\" te
.\" Copyright (c) 2001, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH projadd 1M "30 Sep 2004" "SunOS 5.11" "System Administration Commands"
.SH NAME
projadd \- administer a new project on the system
.SH SYNOPSIS
.LP
.nf
\fBprojadd\fR [\fB-n\fR] [\fB-f\fR \fIfilename\fR] [\fB-p\fR \fIprojid\fR [\fB-o\fR]] [\fB-c\fR \fIcomment\fR]
     [\fB-U\fR \fIuser\fR [,\fIuser\fR].\|.\|. ] [\fB-G\fR \fIgroup\fR [,\fIgroup\fR].\|.\|. ]
     [ [\fB-K\fR \fIname\fR [=\fIvalue\fR [,\fIvalue\fR].\|.\|.].\|.\|.]] \fIproject\fR
.fi

.SH DESCRIPTION
.sp
.LP
.B projadd
adds a new project entry to the
.B /etc/project
file. If
the files backend is being used for the project database, the new project is
available for use immediately upon the completion of the
.BR projadd
command.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -c
.I comment
.ad
.RS 29n
.rt
Add a project comment. Comments are stored in the project's entry in the
.B /etc/project
file. Generally, comments contain a short description of
the project and are used as the field for the project's full name.
.sp
Specify
.I comment
as a text string.
.I comment
cannot contain a
colon
.RB ( : )
or NEWLINE.
.RE

.sp
.ne 2
.mk
.na
.B -f
.I filename
.ad
.RS 29n
.rt
Specify the project file to modify. If no
.I filename
is specified, the
system project file,
.BR /etc/project ,
is modified.
.RE

.sp
.ne 2
.mk
.na
\fB-G\fR \fIgroup\fR[,group.\|.\|.]\fR
.ad
.RS 29n
.rt
Specify a group list for the project.
.RE

.sp
.ne 2
.mk
.na
\fB-K\fR \fIname\fR[=\fIvalue\fR[,\fIvalue\fR.\|.\|.]\fR
.ad
.RS 29n
.rt
Specify an attribute list for the project. Multiple
.B -K
options can be
specified to set values on multiple keys, such as:
.sp
.in +2
.nf
-K \fIkey1\fR=\fIvalue1\fR -K "\fIkey2\fR=(\fIvalue2a\fR),(\fIvalue2b\fR)"
.fi
.in -2

Resource control attributes use parentheses to specify values for a key.
Because many user shells interpret parentheses as special characters, it is
best to enclose an argument to
.B -K
that contains parentheses with
double quotes, as shown above and in EXAMPLES, below. See
.BR resource_controls (5)
for a description of the resource controls you
can specify for a project.
.RE

.sp
.ne 2
.mk
.na
.B -n
.ad
.RS 29n
.rt
Syntax check. Check the format of the existing system project file and
modifications only. The contents of the existing project file, such as user
names, group names, and resources that are specified in the project
attributes are not checked.
.RE

.sp
.ne 2
.mk
.na
.B -o
.ad
.RS 29n
.rt
This option allows the project ID specified by the
.B -p
option to be
non-unique within the project file.
.RE

.sp
.ne 2
.mk
.na
.B -p
.I projid
.ad
.RS 29n
.rt
Set the project
.B ID
of the new project.
.sp
Specify
.I projid
.RB "as a non-negative decimal integer below" " UID_MAX"
as defined in
.BR limits.h .
.I projid
defaults to the next available
unique number above the highest number currently assigned. For example, if
.IR projid s
.BR 100 ,
.BR 105 ,
and
.B 200
are assigned, the next
default \fIprojid\fR is
.BR 201 .
\fIprojid\fRs between \fB0\fR-\fB99\fR
are reserved by SunOS.
.RE

.sp
.ne 2
.mk
.na
\fB-U\fR \fIuser\fR[,user.\|.\|.]\fR
.ad
.RS 29n
.rt
Specify a user list for the project.
.RE

.SH OPERANDS
.sp
.LP
The following operands are supported:
.sp
.ne 2
.mk
.na
.I project
.ad
.RS 11n
.rt
The name of the project to create. The
.I project
operand is a string
consisting of characters from the set of alphabetic characters, numeric
characters, underline (_), and hyphen (-). The period ('.') is reserved for
projects with special meaning to the operating system. The first character
of the project name must be a letter. An error message is displayed if these
restrictions are not met.
.RE

.SH EXAMPLES
.LP
.B Example 1
Adding a Project
.sp
.LP
The following command creates the project
.B salesaudit
and sets the
resource controls specified as arguments to the
.B -K
option.

.sp
.in +2
.nf
projadd -p 111 -G sales,finance -c "Auditing Project" \e
   -K "rcap.max-rss=10GB" \e
   -K "process.max-file-size=(priv,50MB,deny)" \e
   -K "task.max-lwps=(priv,100,deny)" salesaudit
.fi
.in -2

.sp
.LP
This command would produce the following entry in
.BR /etc/project :

.sp
.in +2
.nf
salesaudit:111:Auditing Project::sales,finance: \e
process.max-file-size=(priv,52428800,deny); \e
rcap.max-rss=10737418240;task.max-lwps=(priv,100,deny)
.fi
.in -2

.sp
.LP
Note that the preceding would appear as one line in
.BR /etc/project .

.sp
.LP
Comparing the
.B projadd
command and resulting output in
.BR /etc/project ,
note the effect of the scaling factor in the resource
cap
.RB ( rcap.max-rss=10GB )
and the resource control
.RB ( process.max-file-size=(priv,50MB,deny) ).
Modifiers, such as B, KB,
and MB, and scaling factors are specified in
.BR resource_controls (5).

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 6n
.rt
Successful completion.
.RE

.sp
.ne 2
.mk
.na
.B 2
.ad
.RS 6n
.rt
The command syntax was invalid. A usage message for
.B projadd
is
displayed.
.RE

.sp
.ne 2
.mk
.na
.B 3
.ad
.RS 6n
.rt
An invalid argument was provided to an option.
.RE

.sp
.ne 2
.mk
.na
.B 4
.ad
.RS 6n
.rt
The
.I projid
given with the
.B -p
option is already in use.
.RE

.sp
.ne 2
.mk
.na
.B 5
.ad
.RS 6n
.rt
The project files contain an error. See
.BR project (4).
.RE

.sp
.ne 2
.mk
.na
.B 6
.ad
.RS 6n
.rt
The project to be added, group, user, or resource does not exist.
.RE

.sp
.ne 2
.mk
.na
.B 9
.ad
.RS 6n
.rt
The project is already in use.
.RE

.sp
.ne 2
.mk
.na
.B 10
.ad
.RS 6n
.rt
Cannot update the
.B /etc/project
file.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/project
.ad
.RS 16n
.rt
System project file
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(5.5i) |cw(0i)
lw(5.5i) |lw(0i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWesu
_
Interface StabilitySee below.
.TE

.sp
.LP
Invocation is evolving. Human readable output is unstable.
.SH SEE ALSO
.sp
.LP
.BR projects (1),
.BR groupadd (1M),
.BR groupdel (1M),
.BR groupmod (1M),
.BR grpck (1M),
.BR projdel (1M),
.BR projmod (1M),
.BR useradd (1M),
.BR userdel (1M),
.BR usermod (1M),
.BR project (4),
.BR attributes (5),
.BR resource_controls (5)
.SH NOTES
.sp
.LP
In case of an error,
.B projadd
prints an error message and exits with a
non-zero status.
.sp
.LP
.B projadd
adds a project definition only on the local system. If a
network name service such as NIS or LDAP is being used to supplement the
local
.B /etc/project
file with additional entries,
.B projadd
cannot
change information supplied by the network name service.
