usr/src/man/man1m/prstat.1m
'\" te
.\" Copyright (c) 2006, 2009 Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH prstat 1M "25 Jun 2009" "SunOS 5.11" "System Administration Commands"
.SH NAME
prstat \- report active process statistics
.SH SYNOPSIS
.LP
.nf
\fBprstat\fR [\fB-acHJLmRrtTv\fR] [\fB-d\fR u | d] [\fB-C\fR \fIpsrsetlist\fR] [\fB-h\fR \fIlgrplist\fR]
     [\fB-j\fR \fIprojlist\fR] [\fB-k\fR \fItasklist\fR] [\fB-n\fR \fIntop\fR[,\fInbottom\fR]]
     [\fB-p\fR \fIpidlist\fR] [\fB-P\fR \fIcpulist\fR] [\fB-s\fR \fIkey\fR | \fB-S\fR \fIkey\fR ]
     [\fB-u\fR \fIeuidlist\fR] [\fB-U\fR \fIuidlist\fR] [\fB-z\fR \fIzoneidlist\fR] [\fB-Z\fR]
     [\fIinterval\fR [\fIcount\fR]]
.fi

.SH DESCRIPTION
.sp
.LP
The
.B prstat
utility iteratively examines all active processes on the
system and reports statistics based on the selected output mode and sort
order.
.B prstat
provides options to examine only processes matching
specified
.BR PID s,
.BR UID s,
zone
.BR ID s,
.BR "CPU ID" s,
and
processor set
.BR ID s.
.sp
.LP
The
.BR -j ,
.BR -k ,
.BR -C ,
.BR -p ,
.BR -P ,
.BR -u ,
.BR -U ,
and
.B -z
options accept lists as arguments. Items in a list can be
either separated by commas or enclosed in quotes and separated by commas or
spaces.
.sp
.LP
If you do not specify an option,
.B prstat
examines all processes and
reports statistics sorted by
.B CPU
usage.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -a
.ad
.sp .6
.RS 4n
Report information about processes and users. In this mode
.B prstat
displays separate reports about processes and users at the same time.
.RE

.sp
.ne 2
.mk
.na
.B -c
.ad
.sp .6
.RS 4n
Print new reports below previous reports instead of overprinting them.
.RE

.sp
.ne 2
.mk
.na
.B -C
.I psrsetlist
.ad
.sp .6
.RS 4n
Report only processes or lwps that are bound to processor sets in the given
list. Each processor set is identified by an integer as reported by
.BR psrset (1M).
The load averages displayed are the sum of the load
averages of the specified processor sets (see
.BR pset_getloadavg (3C)).
Processes with one or more LWPs bound to processor sets in the given list
are reported even when the
.B -L
option is not used.
.RE

.sp
.ne 2
.mk
.na
.B -d u | d
.ad
.sp .6
.RS 4n
Specify
.B u
for a printed representation of the internal representation
of time. See
.BR time (2).
Specify
.B d
for standard date format. See
.BR date (1).
.RE

.sp
.ne 2
.mk
.na
.B -h
.I lgrplist
.ad
.sp .6
.RS 4n
Report only processes or lwps whose home
.I lgroup
is in the given list
of
.IR lgroups .
No processes or lwps will be listed for invalid
.IR lgroups .
.RE

.sp
.ne 2
.mk
.na
.B -H
.ad
.sp .6
.RS 4n
Report information about home
.IR lgroup .
In this mode,
.B prstat
adds
an extra column showing process or lwps home
.I lgroup
with the header
LGRP.
.RE

.sp
.ne 2
.mk
.na
.B -j
.I projlist
.ad
.sp .6
.RS 4n
Report only processes or lwps whose project
.B ID
is in the given list.
Each project
.B ID
can be specified as either a project name or a
numerical project
.BR ID .
See
.BR project (4).
.RE

.sp
.ne 2
.mk
.na
.B -J
.ad
.sp .6
.RS 4n
Report information about processes and projects. In this mode
.B prstat
displays separate reports about processes and projects at the same time.
.RE

.sp
.ne 2
.mk
.na
.B -k
.I tasklist
.ad
.sp .6
.RS 4n
Report only processes or lwps whose task
.B ID
is in
.IR tasklist .
.RE

.sp
.ne 2
.mk
.na
.B -L
.ad
.sp .6
.RS 4n
Report statistics for each light-weight process
.RB ( LWP ).
By default,
.B prstat
reports only the number of
.BR LWP s
for each process.
.RE

.sp
.ne 2
.mk
.na
.B -m
.ad
.sp .6
.RS 4n
Report microstate process accounting information. In addition to all fields
listed in
.B -v
mode, this mode also includes the percentage of time the
process has spent processing system traps, text page faults, data page
faults, waiting for user locks and waiting for
.B CPU
(latency time).
.RE

.sp
.ne 2
.mk
.na
\fB-n\fR \fIntop\fR[\fI,nbottom\fR]\fR
.ad
.sp .6
.RS 4n
Restrict number of output lines. The
.I ntop
argument determines how
many lines of process or
.B lwp
statistics are reported, and the
.I nbottom
argument determines how many lines of user, task, or projects
statistics are reported if the
.BR -a ,
.BR -t ,
.BR -T ,
or
.BR -J
options are specified. By default,
.B prstat
displays as many lines of
output that fit in a window or terminal. When you specify the
.B -c
option or direct the output to a file, the default values for
.B ntop
and
.B nbottom
are
.B 15
and
.BR 5 .
.RE

.sp
.ne 2
.mk
.na
.B -p
.I pidlist
.ad
.sp .6
.RS 4n
Report only processes whose process
.B ID
is in the given list.
.RE

.sp
.ne 2
.mk
.na
.B -P
.I cpulist
.ad
.sp .6
.RS 4n
Report only processes or
.BR lwp "s which have most recently executed on a"
.B CPU
in the given list. Each
.B CPU
is identified by an integer as
reported by
.BR psrinfo (1M).
.RE

.sp
.ne 2
.mk
.na
.B -R
.ad
.sp .6
.RS 4n
Put
.B prstat
in the real time scheduling class. When this option is
used,
.B prstat
is given priority over time-sharing and interactive
processes. This option is available only for superuser.
.RE

.sp
.ne 2
.mk
.na
.B -r
.ad
.sp .6
.RS 4n
Disable lookups for user names and project names. (Note that this does not
apply to lookups for the
.BR -j ,
.BR -u ,
or
.B -U
options.)
.RE

.sp
.ne 2
.mk
.na
.B -s
.I key
.ad
.sp .6
.RS 4n
Sort output lines (that is, processes,
.BR lwp s,
or users) by \fIkey\fR
in descending order. Only one
.I key
can be used as an argument.
.sp
There are five possible key values:
.sp
.ne 2
.mk
.na
.B cpu
.ad
.sp .6
.RS 4n
Sort by process
.B CPU
usage. This is the default.
.RE

.sp
.ne 2
.mk
.na
.B pri
.ad
.sp .6
.RS 4n
Sort by process priority.
.RE

.sp
.ne 2
.mk
.na
.B rss
.ad
.sp .6
.RS 4n
Sort by resident set size.
.RE

.sp
.ne 2
.mk
.na
.B size
.ad
.sp .6
.RS 4n
Sort by size of process image.
.RE

.sp
.ne 2
.mk
.na
.B time
.ad
.sp .6
.RS 4n
Sort by process execution time.
.RE

.RE

.sp
.ne 2
.mk
.na
.B -S
.I key
.ad
.sp .6
.RS 4n
Sort output lines by
.I key
.RI "in ascending order. Possible" " key"
values are the same as for the
.B -s
option. See
.BR -s .
.RE

.sp
.ne 2
.mk
.na
.B -t
.ad
.sp .6
.RS 4n
Report total usage summary for each user. The summary includes the total
number of processes or
.BR LWP s
owned by the user, total size of process
images, total resident set size, total cpu time, and percentages of recent
cpu time and system memory.
.RE

.sp
.ne 2
.mk
.na
.B -T
.ad
.sp .6
.RS 4n
Report information about processes and tasks. In this mode
.B prstat
displays separate reports about processes and tasks at the same time.
.RE

.sp
.ne 2
.mk
.na
.B -u
.I euidlist
.ad
.sp .6
.RS 4n
Report only processes whose effective user
.B ID
is in the given list.
Each user
.B ID
may be specified as either a login name or a numerical
user
.BR ID .
.RE

.sp
.ne 2
.mk
.na
\fB-U\fR \fIuidlis\fRt\fR
.ad
.sp .6
.RS 4n
Report only processes whose real user
.B ID
is in the given list. Each
user
.B ID
may be specified as either a login name or a numerical user
.BR ID .
.RE

.sp
.ne 2
.mk
.na
.B -v
.ad
.sp .6
.RS 4n
Report verbose process usage. This output format includes the percentage of
time the process has spent in user mode, in system mode, and sleeping. It
also includes the number of voluntary and involuntary context switches,
system calls and the number of signals received. Statistics that are not
reported are marked with the
.B -
sign.
.RE

.sp
.ne 2
.mk
.na
.B -z
.I zoneidlist
.ad
.sp .6
.RS 4n
Report only processes or LWPs whose zone ID is in the given list. Each zone
ID can be specified as either a zone name or a numerical zone ID. See
.BR zones (5).
.RE

.sp
.ne 2
.mk
.na
.B -Z
.ad
.sp .6
.RS 4n
Report information about processes and zones. In this mode,
.B prstat
displays separate reports about processes and zones at the same time.
.RE

.SH OUTPUT
.sp
.LP
The following list defines the column headings and the meanings of a
.B prstat
report:
.sp
.ne 2
.mk
.na
.B PID
.ad
.sp .6
.RS 4n
The process
.B ID
of the process.
.RE

.sp
.ne 2
.mk
.na
.B USERNAME
.ad
.sp .6
.RS 4n
The real user (login) name or real user
.BR ID .
.RE

.sp
.ne 2
.mk
.na
.B SWAP
.ad
.sp .6
.RS 4n
The total virtual memory size of the process, including all mapped files
and devices, in kilobytes
.RB ( K ),
megabytes
.RB ( M ),
or gigabytes
.RB ( G ).
.RE

.sp
.ne 2
.mk
.na
.B RSS
.ad
.sp .6
.RS 4n
The resident set size of the process
.RB ( RSS ),
in kilobytes
.RB ( K ),
megabytes
.RB ( M ),
or gigabytes
.RB ( G ).
The RSS value is an estimate
provided by
.BR proc (4)
that might underestimate the actual resident set
size. Users who want to get more accurate usage information for capacity
planning should use the
.B -x
option to
.BR pmap (1)
instead.
.RE

.sp
.ne 2
.mk
.na
.B STATE
.ad
.sp .6
.RS 4n
The state of the process:
.sp
.ne 2
.mk
.na
.BI cpu N
.ad
.sp .6
.RS 4n
Process is running on
.B CPU
.IR N .
.RE

.sp
.ne 2
.mk
.na
.B sleep
.ad
.sp .6
.RS 4n
Sleeping: process is waiting for an event to complete.
.RE

.sp
.ne 2
.mk
.na
.B wait
.ad
.sp .6
.RS 4n
Waiting: process is waiting for CPU usage to drop to the CPU-caps enforced
limits. See the description of
.B CPU-caps
in
.BR resource_controls (5).
.RE

.sp
.ne 2
.mk
.na
.B run
.ad
.sp .6
.RS 4n
Runnable: process in on run queue.
.RE

.sp
.ne 2
.mk
.na
.B zombie
.ad
.sp .6
.RS 4n
Zombie state: process terminated and parent not waiting.
.RE

.sp
.ne 2
.mk
.na
.B stop
.ad
.sp .6
.RS 4n
Process is stopped.
.RE

.RE

.sp
.ne 2
.mk
.na
.B PRI
.ad
.sp .6
.RS 4n
The priority of the process. Larger numbers mean higher priority.
.RE

.sp
.ne 2
.mk
.na
.B NICE
.ad
.sp .6
.RS 4n
Nice value used in priority computation. Only processes in certain
scheduling classes have a nice value.
.RE

.sp
.ne 2
.mk
.na
.B TIME
.ad
.sp .6
.RS 4n
The cumulative execution time for the process.
.RE

.sp
.ne 2
.mk
.na
.B CPU
.ad
.sp .6
.RS 4n
The percentage of recent
.B CPU
time used by the process. If executing
in a non-global
.B zone
and the pools facility is active, the percentage
will be that of the processors in the processor set in use by the pool to
which the
.B zone
is bound.
.RE

.sp
.ne 2
.mk
.na
.B PROCESS
.ad
.sp .6
.RS 4n
The name of the process (name of executed file).
.RE

.sp
.ne 2
.mk
.na
.B LWPID
.ad
.sp .6
.RS 4n
The
.B "lwp ID"
of the
.B lwp
being reported.
.RE

.sp
.ne 2
.mk
.na
.B NLWP
.ad
.sp .6
.RS 4n
The number of
.BR lwp "s in the process."
.RE

.sp
.LP
With the some options, in addition to a number of the column headings shown
above, there are:
.sp
.ne 2
.mk
.na
.B NPROC
.ad
.sp .6
.RS 4n
Number of processes in a specified collection.
.RE

.sp
.ne 2
.mk
.na
.B MEMORY
.ad
.sp .6
.RS 4n
Percentage of memory used by a specified collection of processes.
.RE

.sp
.LP
The following columns are displayed when the
.B -v
or
.B -m
option is
specified
.sp
.ne 2
.mk
.na
.B USR
.ad
.sp .6
.RS 4n
The percentage of time the process has spent in user mode.
.RE

.sp
.ne 2
.mk
.na
.B SYS
.ad
.sp .6
.RS 4n
The percentage of time the process has spent in system mode.
.RE

.sp
.ne 2
.mk
.na
.B TRP
.ad
.sp .6
.RS 4n
The percentage of time the process has spent in processing system traps.
.RE

.sp
.ne 2
.mk
.na
.B TFL
.ad
.sp .6
.RS 4n
The percentage of time the process has spent processing text page faults.
.RE

.sp
.ne 2
.mk
.na
.B DFL
.ad
.sp .6
.RS 4n
The percentage of time the process has spent processing data page faults.
.RE

.sp
.ne 2
.mk
.na
.B LCK
.ad
.sp .6
.RS 4n
The percentage of time the process has spent waiting for user locks.
.RE

.sp
.ne 2
.mk
.na
.B SLP
.ad
.sp .6
.RS 4n
The percentage of time the process has spent sleeping.
.RE

.sp
.ne 2
.mk
.na
.B LAT
.ad
.sp .6
.RS 4n
The percentage of time the process has spent waiting for CPU.
.RE

.sp
.ne 2
.mk
.na
.B VCX
.ad
.sp .6
.RS 4n
The number of voluntary context switches.
.RE

.sp
.ne 2
.mk
.na
.B ICX
.ad
.sp .6
.RS 4n
The number of involuntary context switches.
.RE

.sp
.ne 2
.mk
.na
.B SCL
.ad
.sp .6
.RS 4n
The number of system calls.
.RE

.sp
.ne 2
.mk
.na
.B SIG
.ad
.sp .6
.RS 4n
The number of signals received.
.RE

.sp
.LP
Under the
.B -L
option, one line is printed for each
.B lwp
in the
process and some reporting fields show the values for the
.BR lwp ,
not the
process.
.sp
.LP
The following column is displayed when the
.B -H
option is specified:
.sp
.ne 2
.mk
.na
.B LGRP
.ad
.sp .6
.RS 4n
The home
.I lgroup
of the process or lwp.
.RE

.SH OPERANDS
.sp
.LP
The following operands are supported:
.sp
.ne 2
.mk
.na
.I count
.ad
.sp .6
.RS 4n
Specifies the number of times that the statistics are repeated. By default,
.B prstat
reports statistics until a termination signal is received.
.RE

.sp
.ne 2
.mk
.na
.I interval
.ad
.sp .6
.RS 4n
Specifies the sampling interval in seconds; the default interval is
.B 5
seconds.
.RE

.SH EXAMPLES
.LP
.B Example 1
Reporting the Five Most Active Super-User Processes
.sp
.LP
The following command reports the five most active super-user processes
running on
.B CPU1
and
.BR CPU2 :

.sp
.in +2
.nf
example% prstat -u root -n 5 -P 1,2 1 1

PID   USERNAME  SWAP   RSS STATE  PRI  NICE      TIME  CPU PROCESS/LWP
 306   root     3024K 1448K sleep   58    0   0:00.00 0.3% sendmail/1
 102   root     1600K  592K sleep   59    0   0:00.00 0.1% in.rdisc/1
 250   root     1000K  552K sleep   58    0   0:00.00 0.0% utmpd/1
 288   root     1720K 1032K sleep   58    0   0:00.00 0.0% sac/1
   1   root      744K  168K sleep   58    0   0:00.00 0.0% init/1
TOTAL:       25, load averages:  0.05, 0.08, 0.12
.fi
.in -2
.sp

.LP
.B Example 2
Displaying Verbose Process Usage Information
.sp
.LP
The following command displays verbose process usage information about
processes with lowest resident set sizes owned by users
.B root
and
.BR john .

.sp
.in +2
.nf
example% prstat -S rss -n 5 -vc -u root,john

 PID USERNAME USR SYS TRP TFL DFL LCK SLP LAT VCX ICX SCL SIG PROCESS/LWP
   1 root     0.0 0.0  -   -   -   -  100  -    0   0   0   0 init/1
 102 root     0.0 0.0  -   -   -   -  100  -    0   0   3   0 in.rdisc/1
 250 root     0.0 0.0  -   -   -   -  100  -    0   0   0   0 utmpd/1
1185 john    0.0 0.0  -   -   -   -  100  -    0   0   0   0 csh/1
 240 root     0.0 0.0  -   -   -   -  100  -    0   0   0   0 powerd/4
 TOTAL:       71, load averages:  0.02, 0.04, 0.08

.fi
.in -2
.sp

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.sp .6
.RS 4n
Successful completion.
.RE

.sp
.ne 2
.mk
.na
.B 1
.ad
.sp .6
.RS 4n
An error occurred.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.sp
.LP
.BR date (1),
.BR lgrpinfo (1),
.BR plgrp (1),
.BR proc (1),
.BR ps (1),
.BR time (2),
.BR psrinfo (1M),
.BR psrset (1M),
.BR sar (1M),
.BR pset_getloadavg (3C),
.BR proc (4),
.BR project (4),
.BR attributes (5),
.BR resource_controls (5),
.BR zones (5)
.SH NOTES
.sp
.LP
The snapshot of system usage displayed by
.B prstat
is true only for a
split-second, and it may not be accurate by the time it is displayed. When
the
.B -m
option is specified,
.B prstat
tries to turn on microstate
accounting for each process; the original state is restored when
.B prstat
exits. See
.BR proc (4)
for additional information about the
microstate accounting facility.
.sp
.LP
The total memory size reported in the SWAP and RSS columns for groups of
processes can sometimes overestimate the actual amount of memory used by
processes with shared memory segments.
