usr/src/man/man1m/psrinfo.1m
'\" te
.\" Copyright (c) 2004 Sun Microsystems, Inc. All Rights Reserved.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH psrinfo 1M "21 Feb 2004" "SunOS 5.11" "System Administration Commands"
.SH NAME
psrinfo \- displays information about processors
.SH SYNOPSIS
.LP
.nf
\fBpsrinfo\fR [\fB-p\fR] [\fB-v\fR] [\fIprocessor_id\fR]...
.fi

.LP
.nf
\fBpsrinfo\fR [\fB-p\fR] \fB-s\fR \fIprocessor_id\fR
.fi

.SH DESCRIPTION
.sp
.LP
.B psrinfo
displays information about processors. Each physical
processor may support multiple virtual processors. Each virtual processor is
an entity with its own interrupt
.BR ID ,
capable of executing independent
threads.
.sp
.LP
Without the
.I processor_id
operand,
.B psrinfo
displays one line for
each configured processor, displaying whether it is on-line,
non-interruptible (designated by no-intr), spare, off-line, faulted or
powered off, and when that status last changed. Use the processor_id operand
to display information about a specific processor. See
.BR OPERANDS .
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.BI -s " processor_id"
.ad
.RS 19n
.rt
Silent mode. Displays
.B 1
if the specified processor is fully on-line.
Displays
.B 0
if the specified processor is non-interruptible, spare,
off-line, faulted or powered off.
.sp
Use silent mode when using
.B psrinfo
in shell scripts.
.RE

.sp
.ne 2
.mk
.na
.B -p
.ad
.RS 19n
.rt
Display the number of physical processors in a system.
.sp
When combined with the
.B -v
option, reports additional information
about each physical processor.
.RE

.sp
.ne 2
.mk
.na
.B -v
.ad
.RS 19n
.rt
Verbose mode. Displays additional information about the specified
processors, including: processor type, floating point unit type and clock
speed. If any of this information cannot be determined, \fBpsrinfo\fR
displays
.BR unknown .
.sp
When combined with the
.B -p
option, reports additional information
about each physical processor.
.RE

.SH OPERANDS
.sp
.LP
The following operands are supported:
.sp
.ne 2
.mk
.na
.I processor_id
.ad
.RS 16n
.rt
The processor
.B ID
of the processor about which information is to be
displayed.
.sp
Specify
.I processor_id
as an individual processor number (for example,
.BR 3 ),
multiple processor numbers separated by spaces (for example, \fB1
2 3\fR), or a range of processor numbers (for example,
.BR 1-4 ).
It is
also possible to combine ranges and (individual or multiple)
\fIprocessor_id\fRs (for example,
.BR "1-3 5 7-8 9" ).
.RE

.SH EXAMPLES
.LP
.B Example 1
Displaying Information About All Configured Processors in
Verbose Mode
.sp
.LP
The following example displays information about all configured processors
in verbose mode.

.sp
.in +2
.nf
\fBpsrinfo \fB-v\fR
.fi
.in -2
.sp

.LP
.B Example 2
Determining If a Processor is On-line
.sp
.LP
The following example uses
.B psrinfo
in a shell script to determine if
a processor is on-line.

.sp
.in +2
.nf
if [ "`psrinfo \fB-s\fR 3 2> /dev/null`" \(mieq 1 ]
then
	echo "processor 3 is up"
fi
.fi
.in -2
.sp

.LP
.B Example 3
Displaying Information About the Physical Processors in the
System
.sp
.LP
With no additional arguments, the
.B -p
option displays a single
integer: the number of physical processors in the system:

.sp
.in +2
.nf
> psrinfo -p
                8
.fi
.in -2
.sp

.sp
.LP
.B psrinfo
also accepts command line arguments (processor \fBID\fRs):

.sp
.in +2
.nf
> psrinfo -p 0 512   # IDs 0 and 512 exist on the
1                    # same physical processor

> psrinfo -p 0 1     # IDs 0 and 1 exist on different
2                    # physical processors
.fi
.in -2
.sp

.sp
.LP
In this example, virtual processors
.B 0
and
.B 512
exist on the same
physical processor. Virtual processors
.B 0
and
.B 1
do not. This is
specific to this example and is and not a general rule.

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 6n
.rt
Successful completion.
.RE

.sp
.ne 2
.mk
.na
.B >0
.ad
.RS 6n
.rt
An error occurred.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.sp
.LP
.BR psradm (1M),
.BR p_online (2),
.BR processor_info (2),
.BR attributes (5)
.SH DIAGNOSTICS
.sp
.ne 2
.mk
.na
.B psrinfo: processor
.B 9: Invalid
.B argument
.ad
.sp .6
.RS 4n
The specified processor does not exist.
.RE

