usr/src/man/man1m/putdev.1m
'\" te
.\" Copyright 1997 AT&T  Copyright (c) 1997 Sun Microsystems, Inc.  All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH putdev 1M "3 Apr 1997" "SunOS 5.11" "System Administration Commands"
.SH NAME
putdev \- edits device table
.SH SYNOPSIS
.LP
.nf
\fBputdev\fR \fB-a\fR \fIalias\fR [\fIattribute\fR=\fIvalue\fR [.\|.\|.]]
.fi

.LP
.nf
\fBputdev\fR \fB-m\fR \fIdevice\fR \fIattribute\fR=\fIvalue\fR [\fIattribute\fR = \fIvalue\fR [.\|.\|.]]
.fi

.LP
.nf
\fBputdev\fR \fB-d\fR \fIdevice\fR [\fIattribute\fR [.\|.\|.]]
.fi

.SH DESCRIPTION
.sp
.LP
.B putdev
adds a new device to the device table, modifies an existing
device description or removes a device entry from the table. The first
synopsis is used to add a device. The second synopsis is used to modify
existing entries by adding or changing attributes. If a specified attribute
is not defined, this option adds that attribute to the device definition. If
a specified attribute is already defined, it modifies the attribute
definition. The third synopsis is used to delete either an entire device
entry or, if the attribute argument is used, to delete an attribute
assignment for a device.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -a
.ad
.RS 6n
.rt
Add a device to the device table using the specified attributes. The device
must be referenced by its
.BR alias .
.RE

.sp
.ne 2
.mk
.na
.B -d
.ad
.RS 6n
.rt
Remove a device from the device table, when executed without the
.I attributes
argument. Used with the
.I attribute
argument, it
deletes the given attribute specification for
.I device
from the table.
.RE

.sp
.ne 2
.mk
.na
.B -m
.ad
.RS 6n
.rt
Modify a device entry in the device table. If an entry already exists, it
adds any specified attributes that are not defined. It also modifies any
attributes which already have a value  with the value specified by this
command.
.RE

.SH OPERANDS
.sp
.LP
The following operands are supported:
.sp
.ne 2
.mk
.na
.I alias
.ad
.RS 13n
.rt
Designates the alias of the device to be added.
.RE

.sp
.ne 2
.mk
.na
.I attribute
.ad
.RS 13n
.rt
Designates a device attribute to be added, modified, or deleted. Can be any
of the device attributes described under
.BR "DEVICE ATTRIBUTES"
except
.BR alias .
This prevents an accidental modification or deletion of
a device's alias from the table.
.RE

.sp
.ne 2
.mk
.na
.I device
.ad
.RS 13n
.rt
Designates the pathname or alias of the device  whose attribute is to be
added, modified, or removed.
.RE

.sp
.ne 2
.mk
.na
.I value
.ad
.RS 13n
.rt
Designates the value to be assigned to a device's attribute.
.RE

.SH DEVICE ATTRIBUTES
.sp
.LP
The following list shows the standard device attributes, used by
applications such as
.BR ufsdump (1M)
and \fBufsrestore\fR(1M), which can
be defined for a device. You are not limited to this list, you can define
any attribute you like.
.sp
.ne 2
.mk
.na
.B alias
.ad
.RS 13n
.rt
The unique name by which a device is known. No two devices in the database
may share the same alias name. The name is limited in length to 14
characters and should contain only alphanumeric characters and the following
special characters if they are escaped with a backslash:  underscore ( _ ),
dollar sign ($), hyphen (\(mi), and period (.).
.RE

.sp
.ne 2
.mk
.na
.B bdevice
.ad
.RS 13n
.rt
The pathname to the block special device node associated with the device,
if any. The associated major/minor combination should be unique within the
database and should match that associated with the
.B cdevice
field, if
any. (It is the administrator's responsibility to ensure that these
.B major/minor
numbers are unique in the database.)
.RE

.sp
.ne 2
.mk
.na
.B capacity
.ad
.RS 13n
.rt
The capacity of the device or of the typical volume, if removable.
.RE

.sp
.ne 2
.mk
.na
.B cdevice
.ad
.RS 13n
.rt
The pathname to the character special device node associated with the
device, if any. The associated major/minor combination should be unique
within the database and should match that associated with the
.BR bdevice
field, if any. (It is the administrator's responsibility to ensure that
these
.B major/minor
numbers are unique in the database.)
.RE

.sp
.ne 2
.mk
.na
.B cyl
.ad
.RS 13n
.rt
Used by the command specified in the
.B mkfscmd
attribute.
.RE

.sp
.ne 2
.mk
.na
.B desc
.ad
.RS 13n
.rt
A description of any instance of a volume associated with this device (such
as floppy diskette).
.RE

.sp
.ne 2
.mk
.na
.B dpartlist
.ad
.RS 13n
.rt
The list of disk partitions associated with this device. Used only if
.BR type=disk .
The list should contain device aliases, each of which must
have
.BR type=dpart .
.RE

.sp
.ne 2
.mk
.na
.B dparttype
.ad
.RS 13n
.rt
The type of disk partition represented by this device. Used only if
.BR type=dpart .
.RB "It should be either " fs " (for file system) or " dp 
(for data partition).
.RE

.sp
.ne 2
.mk
.na
.B erasecmd
.ad
.RS 13n
.rt
The command string that, when executed, erases the device.
.RE

.sp
.ne 2
.mk
.na
.B fmtcmd
.ad
.RS 13n
.rt
The command string that, when executed, formats the device.
.RE

.sp
.ne 2
.mk
.na
.B fsname
.ad
.RS 13n
.rt
The file system name on the file system administered on this partition, as
supplied to the
.B /usr/sbin/labelit
command. This attribute is specified
only if
.B type=dpart
and
.BR dparttype=fs .
.RE

.sp
.ne 2
.mk
.na
.B gap
.ad
.RS 13n
.rt
Used by the command specified in the
.B mkfscmd
attribute.
.RE

.sp
.ne 2
.mk
.na
.B mkfscmd
.ad
.RS 13n
.rt
The command string that, when executed, places a file system on a
previously formatted device.
.RE

.sp
.ne 2
.mk
.na
.B mountpt
.ad
.RS 13n
.rt
The default mount point to use for the device. Used only if the device is
mountable. For disk partitions where
.B type=dpart
and
.BR dparttype=fs ,
this attribute should specify the location where the
partition is normally mounted.
.RE

.sp
.ne 2
.mk
.na
.B nblocks
.ad
.RS 13n
.rt
The number of blocks in the file system administered on this partition.
Used only if
.B type=dpart
and
.BR dparttype=fs .
.RE

.sp
.ne 2
.mk
.na
.B ninodes
.ad
.RS 13n
.rt
The number of inodes in the file system administered on this partition.
Used only if
.B type=dpart
and
.BR dparttype=fs .
.RE

.sp
.ne 2
.mk
.na
.B norewind
.ad
.RS 13n
.rt
The name of the character special device node that allows access to the
serial device without rewinding when the device is closed.
.RE

.sp
.ne 2
.mk
.na
.B pathname
.ad
.RS 13n
.rt
Defines the pathname to an i-node describing the device (used for non-block
or character device pathnames, such as directories).
.RE

.sp
.ne 2
.mk
.na
.B type
.ad
.RS 13n
.rt
A token that represents inherent qualities of the device. Standard types
include: 9-track, ctape, disk, directory, diskette, dpart, and qtape.
.RE

.sp
.ne 2
.mk
.na
.B volname
.ad
.RS 13n
.rt
The volume name on the file system administered on this partition, as
supplied to the
.B /usr/sbin/labelit
command. Used only if
.B type=dpart
and
.BR dparttype=fs .
.RE

.sp
.ne 2
.mk
.na
.B volume
.ad
.RS 13n
.rt
A text string used to describe any instance of a volume associated with
this device. This attribute should not be defined for devices which are not
removable.
.RE

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 5n
.rt
Successful completion.
.RE

.sp
.ne 2
.mk
.na
.B 1
.ad
.RS 5n
.rt
Command syntax was incorrect, an invalid option was used, or an internal
error occurred.
.RE

.sp
.ne 2
.mk
.na
.B 2
.ad
.RS 5n
.rt
The device table could not be opened for reading, or a new device table
could not be created.
.RE

.sp
.ne 2
.mk
.na
.B 3
.ad
.RS 5n
.rt
If executed with the
.B -a
option, indicates that an entry in the device
table with the alias
.B alias
already exits. If executed with the
.B -m
or
.B -d
options, indicates that no entry exists for device
.IR device .
.RE

.sp
.ne 2
.mk
.na
.B 4
.ad
.RS 5n
.rt
Indicates that
.B -d
was requested and one or more of the specified
attributes were not defined for the device.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/device.tab
.ad
.RS 19n
.rt

.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.sp
.LP
.BR devattr (1M),
.BR putdgrp (1M),
.BR ufsdump (1M),
.BR ufsrestore (1M),
.BR attributes (5)
.sp
.LP
\fR
