usr/src/man/man1m/putdgrp.1m
'\" te
.\" Copyright 1989 AT&T  Copyright (c) 1997 Sun Microsystems, Inc.  All Rights Reserved.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH putdgrp 1M "5 Jul 1990" "SunOS 5.11" "System Administration Commands"
.SH NAME
putdgrp \- edits device group table
.SH SYNOPSIS
.LP
.nf
\fBputdgrp\fR [\fB-d\fR] \fIdgroup\fR [\fIdevice\fR]...
.fi

.SH DESCRIPTION
.sp
.LP
\fBputdgrp\fR modifies the device group table. It performs two kinds of
modification. It can modify the table  by creating a new device group or
removing a device group. It can also change group definitions by  adding or
removing a device from the group definition.
.sp
.LP
When the command is invoked with only a
.I dgroup
specification, the
command adds the specified group name to the device group table if it does
not already exist. If the
.B -d
option is also used with only the
\fIdgroup\fR specification, the command deletes the group from the table.
.sp
.LP
When the command is invoked with both a
.I dgroup
and a
.IR device
specification, it adds the given device name(s) to the group definition.
When invoked with both arguments and the
.B -d
option, the command
deletes the device name(s) from the group definition.
.sp
.LP
When the command is invoked with both a
.I dgroup
and a
.IR device
specification and the device group does not exist, it creates the group and
adds the specified devices to that new group.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -d
.ad
.RS 6n
.rt
Delete the group or, if used with
.IR device ,
delete the device  from a
group definition.
.RE

.SH OPERANDS
.sp
.LP
The following operands are supported:
.sp
.ne 2
.mk
.na
.I dgroup
.ad
.RS 10n
.rt
Specify a device group name.
.RE

.sp
.ne 2
.mk
.na
.I device
.ad
.RS 10n
.rt
Specify the pathname or alias of the device that is to be added to, or
deleted from, the device group.
.RE

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 5n
.rt
Successful completion.
.RE

.sp
.ne 2
.mk
.na
.B 1
.ad
.RS 5n
.rt
Command syntax was incorrect, an invalid option was used,  or an internal
error occurred.
.RE

.sp
.ne 2
.mk
.na
.B 2
.ad
.RS 5n
.rt
Device group table could not be opened for reading or a new device group
table could not be created.
.RE

.sp
.ne 2
.mk
.na
.B 3
.ad
.RS 5n
.rt
If executed with the 
.B -d
option, indicates that an entry in the
device group table for the device group 
.I dgroup
does not exist and so
.RI "cannot be deleted. Otherwise, indicates that the  device group" " dgroup"
already exists and cannot be added.
.RE

.sp
.ne 2
.mk
.na
.B 4
.ad
.RS 5n
.rt
If executed with the 
.B -d
option, indicates that the device group
\fIdgroup\fR does not have as members one or more of the specified devices.
Otherwise, indicates that the device group 
.I dgroup
already has one or
more of the specified devices as members.
.RE

.SH EXAMPLES
.LP
\fBExample 1\fR Adding a new device group.
.sp
.LP
The following example adds a new device group:

.sp
.in +2
.nf
example#  \fBputdgrp floppies\fR
.fi
.in -2
.sp

.LP
\fBExample 2\fR Adding a device to a device group.
.sp
.LP
The following example adds a device to a device group:

.sp
.in +2
.nf
example#  \fBputdgrp floppies diskette2\fR
.fi
.in -2
.sp

.LP
\fBExample 3\fR Deleting a device group.
.sp
.LP
The following example deletes a device group:

.sp
.in +2
.nf
example#  \fBputdgrp \fB-d\fB floppies\fR
.fi
.in -2
.sp

.LP
\fBExample 4\fR Deleting a device from a device group.
.sp
.LP
The following example deletes a device from a device group:

.sp
.in +2
.nf
example#  \fBputdgrp \fB-d\fB floppies diskette2\fR
.fi
.in -2
.sp

.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/dgroup.tab
.ad
.RS 19n
.rt

.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.sp
.LP
.BR listdgrp (1M),
.BR putdev (1M),
.BR attributes (5)
