usr/src/man/man1m/pwck.1m
'\" te
.\" Copyright 1989 AT&T , Copyright (c) 2002, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH pwck 1M "27 Aug 2008" "SunOS 5.11" "System Administration Commands"
.SH NAME
pwck, grpck \- password/group file checkers
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/pwck\fR [\fIfilename\fR]
.fi

.LP
.nf
\fB/usr/sbin/grpck\fR [\fIfilename\fR]
.fi

.SH DESCRIPTION
.sp
.LP
.B pwck
scans the password file and notes any inconsistencies. The checks
include validation of the number of fields, login name, user ID, group ID, and
whether the login directory and the program-to-use-as-shell exist.  The default
password file is
.BR /etc/passwd .
.sp
.LP
.B grpck
verifies all entries in the
.B group
file. This verification
includes a check of the number of fields, group name, group ID, whether any
login names belong to more than
.B NGROUPS_MAX
groups, and that all login
names appear in the password file.
.B grpck
also issues a warning if it finds
an entry (a single line) in the
.B group
file longer than  2047 characters.
Such an entry causes group maintenance commands, such as
.BR groupdel (1M)
and
.BR groupmod (1M),
to fail.
.sp
.LP
The default group file is
.BR /etc/group .
.sp
.LP
All messages regarding inconsistent entries are placed on the
.BR stderr
stream.
.SH FILES
.RS +4
.TP
.ie t \(bu
.el o
.B /etc/group
.RE
.RS +4
.TP
.ie t \(bu
.el o
.B /etc/passwd
.RE
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.sp
.LP
.BR groupdel (1M),
.BR groupmod (1M),
.BR getpwent (3C),
.BR group (4),
.BR passwd (4),
.BR attributes (5)
.SH DIAGNOSTICS
.sp
.LP
Group entries in
.B /etc/group
with no login names are flagged.
.sp
.ne 2
.mk
.na
\fBGroup file '\fIfilename\fB\&' is empty\fR
.ad
.sp .6
.RS 4n
The
.B /etc/passwd
or
.B /etc/group
file is an empty file.
.RE

.sp
.ne 2
.mk
.na
.B cannot open file
.IB filename ": No such file or directory"
.ad
.sp .6
.RS 4n
The
.B /etc/passwd
or
.B /etc/group
file does not exist.
.RE

.SH NOTES
.sp
.LP
If no filename argument is given,
.B grpck
checks the local group file,
.BR /etc/group ,
and also makes sure that all login names encountered in the
checked group file are known to the system
.BR getpwent "(3C) routine.  This"
means that the login names may be supplied by a network name service.
