usr/src/man/man1m/quotacheck.1m
'\" te
.\" Copyright 1989 AT&T  Copyright (c) 1996, Sun Microsystems, Inc.  All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH quotacheck 1M "31 Jul 1998" "SunOS 5.11" "System Administration Commands"
.SH NAME
quotacheck \- ufs file system quota consistency checker
.SH SYNOPSIS
.LP
.nf
\fBquotacheck\fR [\fB-fp\fR] [\fB-v\fR] \fIfilesystem\fR...
.fi

.LP
.nf
\fBquotacheck\fR \fB-a\fR [\fB-fpv\fR]
.fi

.SH DESCRIPTION
.sp
.LP
.B quotacheck
examines each mounted ufs file system, builds a table of
current disk usage, and compares this table against the information stored
in the file system's disk quota file. If any inconsistencies are detected,
both the quota file and the current system copy of the incorrect quotas are
updated.
.sp
.LP
.I filesystem
is either a file system mount point or the block device
on which the file system resides.
.sp
.LP
.B quotacheck
expects each file system to be checked to have a quota
file named
.B quotas
in the root directory. If none is present,
.B quotacheck
will not check the file system.
.sp
.LP
.B quotacheck
accesses the character special device in calculating the
actual disk usage for each user. Thus, the file systems that are checked
should be quiescent while
.B quotacheck
is running.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -a
.ad
.RS 6n
.rt
Check the file systems which
.B /etc/mnttab
indicates are ufs file
systems. These file systems must be read-write mounted  with disk quotas
enabled, and have an
.B rq
entry in the
.B mntopts
field in
.BR /etc/vfstab .
.RE

.sp
.ne 2
.mk
.na
.B -f
.ad
.RS 6n
.rt
Force check on file systems with logging enabled. Use in combination with
the
.B -p
option.
.RE

.sp
.ne 2
.mk
.na
.B -p
.ad
.RS 6n
.rt
Check quotas of file systems in parallel. For file systems with logging
enabled, no check is performed unless the
.B -f
option is also
specified.
.RE

.sp
.ne 2
.mk
.na
.B -v
.ad
.RS 6n
.rt
Indicate the calculated disk quotas for each user on a particular file
system.
.B quotacheck
normally reports only those quotas modified.
.RE

.SH USAGE
.sp
.LP
See
.BR largefile (5)
for the description of the behavior of
.B quotacheck
when encountering files greater than or equal to 2 Gbyte (
2^31 bytes).
.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/mnttab
.ad
.RS 15n
.rt
Mounted file systems
.RE

.sp
.ne 2
.mk
.na
.B /etc/vfstab
.ad
.RS 15n
.rt
List of default parameters for each file system
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.sp
.LP
.BR edquota (1M),
.BR quota (1M),
.BR quotaon (1M),
.BR repquota (1M),
.BR attributes (5),
.BR largefile (5),
.BR quotactl (7I),
.BR mount_ufs (1M)
