usr/src/man/man1m/quotaon.1m
'\" te
.\" Copyright (c) 2000, Sun Microsystems, Inc.  All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" Copyright 1989 AT&T
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH quotaon 1M "16 Sep 1996" "SunOS 5.11" "System Administration Commands"
.SH NAME
quotaon, quotaoff \- turn ufs file system quotas on and off
.SH SYNOPSIS
.LP
.nf
\fBquotaon\fR [\fB-v\fR] \fIfilesystem\fR...
.fi

.LP
.nf
\fBquotaon\fR \fB-a\fR [\fB-v\fR]
.fi

.LP
.nf
\fBquotaoff\fR [\fB-v\fR] \fIfilesystem\fR...
.fi

.LP
.nf
\fBquotaoff\fR \fB-a\fR [\fB-v\fR]
.fi

.SH DESCRIPTION
.sp
.LP
.B quotaon
turns on disk quotas for one or more ufs file systems.
.sp
.LP
Before a file system may have quotas enabled, a file named
.BR quotas ,
owned by root, must exist in the root directory of the file system. See
.BR edquota (1M)
for details on how to modify the contents of this file.
.sp
.LP
.B quotaoff
turns off disk quotas for one or more ufs file systems.
.sp
.LP
The file systems specified must already be mounted.
.sp
.LP
These commands update the
.B mntopts
field of the appropriate entries in
.B /etc/mnttab
to indicate when quotas are on or off for each file
system. If quotas are on, the string
.B quota
will be added to
.BR mntopts ;
if quotas are off, the
.B quota
string is not present.
.sp
.LP
.I filesystem
must be either the mount point of a file system, or the
block device on which the file system resides.
.SH OPTIONS
.SS "quotaon"
.sp
.ne 2
.mk
.na
.B -a
.ad
.RS 6n
.rt
This option is normally used at boot time to enable quotas. It applies only
to those file systems in
.B /etc/vfstab
which have ``rq'' in the
.B mntopts
field, are currently mounted ``rw'', and have a \fBquotas\fR
file in the root directory.
.RE

.sp
.ne 2
.mk
.na
.B -v
.ad
.RS 6n
.rt
Display a message for each file system after quotas are turned on.
.RE

.SS "quotaoff"
.sp
.ne 2
.mk
.na
.B -a
.ad
.RS 6n
.rt
Force all file systems in
.B /etc/mnttab
to have their quotas
disabled.
.RE

.sp
.ne 2
.mk
.na
.B -v
.ad
.RS 6n
.rt
Display a message for each file system affected.
.RE

.SH USAGE
.sp
.LP
See
.BR largefile (5)
for the description of the behavior of
.BR quotaon
and
.B quotaoff
when encountering files greater than or equal to 2 Gbyte
( 2^31 bytes).
.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/mnttab
.ad
.RS 15n
.rt
mounted file systems
.RE

.sp
.ne 2
.mk
.na
.B /etc/vfstab
.ad
.RS 15n
.rt
list of default parameters for each file system
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.sp
.LP
.BR edquota (1M),
.BR quota (1M),
.BR quotacheck (1M),
.BR repquota (1M),
.BR mnttab (4),
.BR vfstab (4),
.BR attributes (5),
.BR largefile (5),
.BR quotactl (7I)
