usr/src/man/man1m/quot.1m
'\" te
.\" Copyright (c) 2001, Sun Microsystems, Inc.  All Rights Reserved
.\" Copyright 1989 AT&T
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH quot 1M "30 May 2001" "SunOS 5.11" "System Administration Commands"
.SH NAME
quot \- summarize file system ownership
.SH SYNOPSIS
.LP
.nf
\fBquot\fR [\fB-acfhnv\fR] \fIfilesystem\fR...
.fi

.LP
.nf
\fBquot\fR \fB-a\fR [\fB-cfhnv\fR]
.fi

.SH DESCRIPTION
.sp
.LP
.B quot
displays the number of blocks (1024 bytes) in the named
.I filesystem
(one or more) currently owned by each user. There is a
limit of 2048 blocks. Files larger than this will be counted as a 2048 block
file, but the total block count will be correct.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -a
.ad
.RS 6n
.rt
Generate a report for all mounted file systems.
.RE

.sp
.ne 2
.mk
.na
.B -c
.ad
.RS 6n
.rt
Display three columns giving a file size in blocks, the number of files of
that size, and a cumulative total of blocks containing files of that size or
a smaller size.
.RE

.sp
.ne 2
.mk
.na
.B -f
.ad
.RS 6n
.rt
Display three columns giving, for each user, the number of blocks owned,
the count of number of files, and the user name. This option is incompatible
with the
.B -c
and
.B -v
options.
.RE

.sp
.ne 2
.mk
.na
.B -h
.ad
.RS 6n
.rt
Estimate the number of blocks in the file. This does not account for files
with holes in them.
.RE

.sp
.ne 2
.mk
.na
.B -n
.ad
.RS 6n
.rt
Attach names to the list of files read from standard input. \fBquot\fR
.B -n
cannot be used alone, because it expects data from standard input.
For example, the pipeline
.sp
\fBncheck myfilesystem | sort +0n | quot \fB-n myfilesystem\fR
.sp
will produce a list of all files and their owners. This option is
incompatible with all other options.
.RE

.sp
.ne 2
.mk
.na
.B -v
.ad
.RS 6n
.rt
In addition to the default output, display three columns containing the
number of blocks not accessed in the last 30, 60, and 90 days.
.RE

.SH OPERANDS
.sp
.ne 2
.mk
.na
.I filesystem
.ad
.RS 14n
.rt
mount-point of the filesystem(s) being checked
.RE

.SH USAGE
.sp
.LP
See
.BR largefile (5)
for the description of the behavior of
.BR quot
when encountering files greater than or equal to 2 Gbyte ( 2^31 bytes).
.SH EXIT STATUS
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 6n
.rt
Successful operation.
.RE

.sp
.ne 2
.mk
.na
.B 32
.ad
.RS 6n
.rt
Error condition (bad or missing argument, bad path, or other error).
.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/mnttab
.ad
.RS 15n
.rt
Lists mounted file systems.
.RE

.sp
.ne 2
.mk
.na
.B /etc/passwd
.ad
.RS 15n
.rt
Used to obtain user names
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.sp
.LP
.BR du (1),
.BR mnttab (4),
.BR passwd (4),
.BR attributes (5),
.BR largefile (5)
.SH NOTES
.sp
.LP
This command can only be used by the super-user.
