usr/src/man/man1m/ramdiskadm.1m
'\" te
.\" Copyright (c) 2003, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ramdiskadm 1M "25 Mar 2003" "SunOS 5.11" "System Administration Commands"
.SH NAME
ramdiskadm \- administer ramdisk pseudo device
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/ramdiskadm\fR \fB-a\fR \fIname\fR \fIsize\fR [g | m | k | b]
.fi

.LP
.nf
\fB/usr/sbin/ramdiskadm\fR \fB-d\fR \fIname\fR
.fi

.LP
.nf
\fB/usr/sbin/ramdiskadm\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B ramdiskadm
command administers
.BR ramdisk "(7D), the ramdisk"
driver. Use
.B ramdiskadm
to create a new named ramdisk device, delete an
existing named ramdisk, or list information about existing ramdisks.
.sp
.LP
Ramdisks created using
.B ramdiskadm
are not persistent across
reboots.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -a
.I name size
.ad
.RS 16n
.rt
Create a ramdisk named
.I name
of size
.I size
and its corresponding
block and character device nodes.
.sp
.I name
must be composed only of the characters a-z, A-Z, 0-9, _
(underbar), and - (hyphen), but it must not begin with a hyphen. It must be
no more than 32 characters long. Ramdisk names must be unique.
.sp
The size can be a decimal number, or, when prefixed with
.BR 0x ,
a
hexadecimal number, and can specify the size in bytes (no suffix), 512-byte
blocks (suffix
.BR b ),
kilobytes (suffix
.BR k ),
megabytes (suffix
.BR m )
or gigabytes (suffix
.BR g ).
The size of the ramdisk actually
created might be larger than that specified, depending on the hardware
implementation.
.sp
If the named ramdisk is successfully created, its block device path is
printed on standard out.
.RE

.sp
.ne 2
.mk
.na
.B -d
.I name
.ad
.RS 16n
.rt
Delete an existing ramdisk of the name
.IR name .
This command succeeds
only when the named ramdisk is not open. The associated memory is freed and
the device nodes are removed.
.sp
You can delete only ramdisks created using
.BR ramdiskadm .
It is not
possible to delete a ramdisk that was created during the boot process.
.RE

.sp
.LP
Without options,
.B ramdiskadm
lists any existing ramdisks, their sizes
(in decimal), and whether they can be removed by
.B ramdiskadm
(see the
description of the
.B -d
option, above).
.SH EXAMPLES
.LP
.B Example 1
Creating a 2MB Ramdisk Named
.BR mydisk
.sp
.in +2
.nf
# ramdiskadm -a mydisk 2m
/dev/ramdisk/mydisk
.fi
.in -2
.sp

.LP
.B Example 2
Listing All Ramdisks
.sp
.in +2
.nf
# ramdiskadm
Block Device                   Size  Removable
/dev/ramdisk/miniroot     134217728    No
/dev/ramdisk/certfs         1048576    No
/dev/ramdisk/mydisk         2097152    Yes
.fi
.in -2
.sp

.SH EXIT STATUS
.sp
.LP
.B ramdiskadm
returns the following exit values:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 6n
.rt
Successful completion.
.RE

.sp
.ne 2
.mk
.na
.B >0
.ad
.RS 6n
.rt
An error occurred.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsr
_
Interface StabilityEvolving
.TE

.SH SEE ALSO
.sp
.LP
.BR attributes (5),
.BR ramdisk (7D)
.SH NOTES
.sp
.LP
The abilities of
.B ramdiskadm
and the privilege level of the person who
uses the utility are controlled by the permissions of
.BR /dev/ramdiskctl .
Read access allows query operations, for example, listing device
information. Write access is required to do any state-changing operations,
for example, creating or deleting ramdisks.
.sp
.LP
As shipped,
.B /dev/ramdiskctl
is owned by
.BR root ,
in group
.BR sys ,
and mode 0644, so all users can do query operations but only root
can perform state-changing operations. An administrator can give write
access to non-privileged users, allowing them to add or delete ramdisks.
However, granting such ability entails considerable risk; such privileges
should be given only to a trusted group.
