usr/src/man/man1m/rcapadm.1m
'\" te
.\" Copyright (c) 2003, Sun Microsystems, Inc. All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH rcapadm 1M "18 Dec 2006" "SunOS 5.11" "System Administration Commands"
.SH NAME
rcapadm \- configure resource capping daemon
.SH SYNOPSIS
.LP
.nf
\fBrcapadm\fR
.fi

.LP
.nf
\fBrcapadm\fR [ [\fB-n\fR] \fB-E\fR | \fB-D\fR]
     [\fB-i\fR \fIinterval=value\fR,.\|.\|.,\fIinterval=value\fR] [\fB-c\fR \fIpercent\fR]
     [\fB-z\fR \fIzonename\fR \fB-m\fR \fImaxvalue\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The
.B rcapadm
command allows a user with the privileges described below
to configure various attributes of the resource capping daemon. If used
without arguments,
.B rcapadm
displays the current status of the resource
capping daemon if it has been configured. See \fBrcapd\fR(1M) for more
information.
.sp
.LP
In the current release of the Solaris operating environment, \fBrcapadm\fR
is available to users with all privileges and to users who have the Process
Management profile in their list of profiles. The System Administrator role
includes the Process Management profile.
.SH OPTIONS
.sp
.ne 2
.mk
.na
.B -c
.I percent
.ad
.sp .6
.RS 4n
Set the minimum physical memory utilization for memory cap enforcement. Caps
will not be enforced until the physical memory available to processes is low.
The
.I percent
value should be in the range 0 to 100. The minimum (and
default) value is
.BR 0 ,
which means that memory caps are always
enforced.
.RE

.sp
.ne 2
.mk
.na
.B -D
.ad
.sp .6
.RS 4n
Disable the resource capping daemon so that it will not be started when the
system is booted. Also stop the resource capping daemon now, if the \fB-n\fR
option is not specified and it is currently running.
.RE

.sp
.ne 2
.mk
.na
.B -E
.ad
.sp .6
.RS 4n
Enable the resource capping daemon so that it will be started each time the
system is booted. Also start the resource capping daemon now, if the \fB-n\fR
option is not specified and it is not currently running.
.RE

.sp
.ne 2
.mk
.na
\fB-i\fR \fIinterval=value\fR,.\|.\|.,\fIinterval=value\fR
.ad
.sp .6
.RS 4n
Set intervals for various periodic operations performed by
.BR rcapd .
All
intervals are specified in seconds. You can set the following intervals:
.sp
.ne 2
.mk
.na
.B scan
.ad
.RS 10n
.rt
The interval at which
.B rcapd
scans for new processes. The default scan
interval is every 15 seconds. The minimum value is 1 second.
.RE

.sp
.ne 2
.mk
.na
.B sample
.ad
.RS 10n
.rt
The interval of process resident set size sampling. The default sample
interval is every 5 seconds. The minimum value is 1 second.
.RE

.sp
.ne 2
.mk
.na
.B report
.ad
.RS 10n
.rt
The interval at which various paging statistics are updated by
.BR rcapd ,
in seconds. These statistics can be viewed by using
.BR rcapstat (1SRM).
The
default reporting interval is every 5 seconds. When the interval is set to
.BR 0 ,
statistics will not be updated.
.LP
Note -
.sp
.RS 2
Paging refers to the act of relocating portions of memory, called pages, to
or from physical memory.
.B rcapd
pages out the most infrequently used
pages.
.RE
.RE

.sp
.ne 2
.mk
.na
.B config
.ad
.RS 10n
.rt
The reconfiguration interval, in seconds. At each reconfiguration event,
.B rcapd
checks its configuration file for updates, and scans the project
databases for new project caps. The default reconfiguration interval is every
60 seconds. The minimum interval is
.BR 0 .
When the interval is set to
.BR 0 ,
no periodic reconfiguration occurs, although the running daemon can
still be reconfigured by sending it
.BR SIGHUP .
.RE

.RE

.sp
.ne 2
.mk
.na
.B -m
.I maxvalue
.ad
.sp .6
.RS 4n
Used in conjunction with the
.B -z
option. Specifies a value for
.BR rcap.max-rss ,
a dynamically-set cap on the usage of physical memory for
the zone specified by
.BR -z .
You can apply a scale (\fBK\fR,
.BR M ,
.BR G ,
.BR T )
to the value you specify.
.B K
means kilobyte;
.BR M ,
megabyte;
.BR G ,
gigabyte; and
.BR T ,
.RB "terabyte. For example," " 100M"
is 100 megabytes.
.RE

.sp
.ne 2
.mk
.na
.B -n
.ad
.sp .6
.RS 4n
Do not affect the running state of the resource capping daemon when enabling
or disabling it.
.RE

.sp
.ne 2
.mk
.na
.B -z
.I zonename
.ad
.sp .6
.RS 4n
Used in conjunction with the
.B -m
option. Specifies the zone for which
you are dynamically specifying a cap on physical memory usage (using
.BR -m ).
.RE

.LP
Note -
.sp
.RS 2
To set a persistent cap on memory usage within a zone, use
.BR zonecfg (1M).
.RE
.SH EXAMPLES
.LP
.B Example 1
Configuring the Resource Capping Daemon with Immediate
Enforcement
.sp
.LP
# \fBrcapadm -E -i
scan=\fI15\fR,sample=\fI5\fR,report=\fI5\fR,config=\fI60\fR -c \fI0\fR

.LP
.B Example 2
Specifying a Resource Cap for a Zone
.sp
.LP
The command shown below specifies the maximum amount of memory that can be
consumed by a specified zone. Note that this value lasts only until the next
reboot. To set a persistent cap, use \fBzonecfg\fR(1M).

.sp
.in +2
.nf
# \fBrcapadm -z testzone -m 512M\fR
.fi
.in -2
.sp

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 5n
.rt
Successful completion. The modifications to the current configuration were
valid and made successfully.
.RE

.sp
.ne 2
.mk
.na
.B 1
.ad
.RS 5n
.rt
An error occurred. A fatal error occurred either in obtaining or modifying
the resource capping configuration.
.RE

.sp
.ne 2
.mk
.na
.B 2
.ad
.RS 5n
.rt
Invalid command-line options were specified.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWrcapu
_
Interface StabilityEvolving
.TE

.sp
.LP
The
.B -z
and
.B -m
options are committed interfaces.
.SH SEE ALSO
.sp
.LP
.BR rcapstat (1),
.BR rcapd (1M),
.BR zonecfg (1M),
.BR project (4),
.BR attributes (5),
.BR zones (5)
.sp
.LP
"Physical Memory Control Using the Resource Capping Daemon" in \fISystem
Administration Guide: Solaris Containers-Resource Management, and Solaris
Zones\fR
