usr/src/man/man1m/rcapd.1m
'\" te
.\" Copyright (c) 2004, Sun Microsystems, Inc. All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH rcapd 1M "19 Dec 2006" "SunOS 5.11" "System Administration Commands"
.SH NAME
rcapd \- resource cap enforcement daemon
.SH SYNOPSIS
.LP
.nf
\fBrcapd\fR [\fB-d\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The
.B rcapd
daemon enforces resource caps on collections of processes.
Per-project and per-zone physical memory caps are supported. For information
about projects, see
.BR project (4).
For zones information, see
.BR zones (5)
.sp
.LP
When the resident set size (RSS) of a collection of processes exceeds its
cap,
.B rcapd
takes action and reduces the RSS of the collection.
.sp
.LP
The virtual memory system divides physical memory into segments known as
pages. To read data from a file into memory, the virtual memory system reads
in individual pages. To reduce resource consumption, the daemon can page
out, or relocate, infrequently used pages to an area outside of physical
memory.
.sp
.LP
In the
.B project
file, caps are defined for projects that have positive
values for the following project attribute:
.sp
.ne 2
.mk
.na
.B rcap.max-rss
.ad
.RS 16n
.rt
The total amount of physical memory, in bytes, that is available to the
project's member processes
.RE

.sp
.LP
See
.BR project (4)
for a description of project attributes.
.sp
.LP
For a system with one or more zones, you can dynamically set the
.B rcap.max-rss
value for a zone with
.BR rcapadm "(1M). To set a"
persistent cap on memory usage within a zone, you use \fBzonecfg\fR(1M).
.sp
.LP
You configure
.B rcapd
through the use of
.BR rcapadm "(1M). The daemon"
can be monitored with
.BR rcapstat (1).
Configuration changes are
incorporated into
.B rcapd
by sending it
.B SIGHUP
(see
.BR kill (1)),
or according to the configuration interval (see
.BR rcapadm (1M)).
.SH OPTIONS
.sp
.LP
The following option is supported:
.sp
.ne 2
.mk
.na
.B -d
.ad
.RS 6n
.rt
Enable debug mode. Messages are displayed on the invoking user's
terminal.
.RE

.SH EXAMPLES
.LP
.B Example 1
Setting Resident Set Size Cap Attribute
.sp
.LP
The following line in the
.B /etc/project
database sets an RSS cap of
1073741824 bytes for a project named
.BR foo .

.sp
.in +2
.nf
foo:100::foo,root::rcap.max-rss=10737418240
.fi
.in -2

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 5n
.rt
Successful completion.
.RE

.sp
.ne 2
.mk
.na
.B 1
.ad
.RS 5n
.rt
An error occurred.
.RE

.sp
.ne 2
.mk
.na
.B 2
.ad
.RS 5n
.rt
Invalid command-line options were specified.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/project
.ad
.RS 16n
.rt
Project database.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWrcapu
_
Interface StabilityEvolving
.TE

.SH SEE ALSO
.sp
.LP
.BR rcapstat (1),
.BR svcs (1),
.BR rcapadm (1M),
.BR zonecfg (1M),
.BR svcadm (1M),
.BR project (4),
.BR attributes (5),
.BR smf (5),
.BR zones (5)
.sp
.LP
"Physical Memory Control Using the Resource Capping Daemon" in \fISystem
Administration Guide: Solaris Containers-Resource Management, and Solaris
Zones\fR
.SH NOTES
.sp
.LP
If killed with
.BR SIGKILL ,
.B rcapd
can leave processes in a stopped
state. Use
.B SIGTERM
to cause
.B rcapd
to terminate properly.
.sp
.LP
A collection's RSS can exceed its cap for some time before the cap is
enforced, even if sufficient pageable memory is available. This period of
time can be reduced by shortening the RSS sampling interval with
.BR rcapadm .
.sp
.LP
The
.B rcapd
service is managed by the service management facility,
.BR smf (5),
under the service identifier:
.sp
.in +2
.nf
svc:/system/rcap:default
.fi
.in -2
.sp

.sp
.LP
Administrative actions on this service, such as enabling, disabling, or
requesting restart, can be performed using
.BR svcadm (1M).
The service's
status can be queried using the
.BR svcs (1)
command.
