usr/src/man/man1m/reboot.1m
'\" te
.\" Copyright (c) 2009 Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" Copyright (c) 1983 Regents of the University of California.  All rights reserved.
.\" The Berkeley software License Agreement specifies the terms and conditions for redistribution.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH reboot 1M "24 Aug 2009" "SunOS 5.11" "System Administration Commands"
.SH NAME
reboot \- restart the operating system
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/reboot\fR [\fB-dlnq\fR] [\fIboot_arguments\fR]
.fi

.LP
.nf
\fB/usr/sbin/reboot\fR [\fB-f\fR [\fB-e\fR \fIenvironment\fR] | \fB-p\fR] [\fB-dlnq\fR] [\fIboot_arguments\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The
.B reboot
utility restarts the kernel. The kernel is loaded into
memory by the PROM monitor, which transfers control to the loaded kernel.
.sp
.LP
On x86 systems, when the
.B -f
flag is specified, the running kernel will
load the next kernel into memory, then transfer control to the newly loaded
kernel. This form of
.B reboot
is shown in the second synopsis, above.
.sp
.LP
Although
.B reboot
can be run by the super-user at any time,
.BR shutdown (1M)
is normally used first to warn all users logged in of the
impending loss of service. See
.BR shutdown (1M)
for details.
.sp
.LP
The
.B reboot
utility performs a
.BR sync "(1M) operation on the disks,"
and then a multi-user reboot is initiated. See
.BR init (1M)
for details. On
x86 systems, reboot may also update the boot archive as needed to ensure a
successful reboot.
.sp
.LP
The
.B reboot
utility normally logs the reboot to the system log daemon,
.BR syslogd (1M),
and places a shutdown record in the login accounting file
.BR /var/adm/wtmpx .
These actions are inhibited if the
.B -n
or
.BR -q
options are present.
.sp
.LP
Normally, the system reboots itself at power-up or after crashes.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -d
.ad
.sp .6
.RS 4n
Force a system crash dump before rebooting. See
.BR dumpadm (1M)
for
information on configuring system crash dumps.
.RE

.sp
.ne 2
.mk
.na
.B -e
.ad
.sp .6
.RS 4n
If
.B -f
is present, reboot to the specified boot environment.
.RE

.sp
.ne 2
.mk
.na
.B -f
.ad
.sp .6
.RS 4n
Fast reboot, bypassing firmware and boot loader. The new kernel will be
loaded into memory by the running kernel, and control will be transferred to
the newly loaded kernel. If disk or kernel arguments are specified, they must
be specified before other boot arguments.
.sp
This option is currently available only on x86 systems.
.sp
Service
.B svc:/system/boot-config:default
is enabled by default. It
requires
.B solaris.system.shutdown
as
.B action_authorization
and
.BR value_authorization .
When the
.B config/fastreboot_default
property
is set to
.BR true ,
.B reboot
will behave as
.BR "reboot -f" .
The
value of this property can be changed using
.BR svccfg (1M)
and
.BR svcadm (1M),
to control the default reboot behavior.
.sp
See
.B EXAMPLES
for details.
.RE

.sp
.ne 2
.mk
.na
.B -l
.ad
.sp .6
.RS 4n
Suppress sending a message to the system log daemon,
.BR syslogd (1M)
about
who executed
.BR reboot .
.RE

.sp
.ne 2
.mk
.na
.B -n
.ad
.sp .6
.RS 4n
Avoid calling
.BR sync (2)
and do not log the reboot to
.BR syslogd (1M)
or to
.BR /var/adm/wtmpx .
The kernel still attempts to sync filesystems
prior to reboot, except if the
.B -d
option is also present. If
.B -d
is used with
.BR -n ,
the kernel does not attempt to sync file systems.
.RE

.sp
.ne 2
.mk
.na
.B -p
.ad
.sp .6
.RS 4n
Reboot to prom. This flag can be used to reboot the system through firmware
without changing the default reboot behavior as denoted by the
.B config/fastreboot_default
property setting in
.B system/boot-config
service.
.sp
This option is currently available only on x86 systems. The
.B -p
and
.B -f
options are mutually exclusive.
.RE

.sp
.ne 2
.mk
.na
.B -q
.ad
.sp .6
.RS 4n
Quick. Reboot quickly and ungracefully, without shutting down running
processes first.
.RE

.SH OPERANDS
.sp
.LP
The following operands are supported:
.sp
.ne 2
.mk
.na
.I boot_arguments
.ad
.sp .6
.RS 4n
An optional
.I boot_arguments
specifies arguments to the
.BR uadmin (2)
function that are passed to the boot program and kernel upon restart. The
form and list of arguments is described in the
.BR boot "(1M) and"
.BR kernel (1M)
man pages.. If the arguments are specified, whitespace
between them is replaced by single spaces unless the whitespace is quoted for
the shell. If the
.I boot_arguments
begin with a hyphen, they must be
preceded by the
.B --
delimiter (two hyphens) to denote the end of the
.B reboot
argument list.
.RE

.SH EXAMPLES
.LP
.B Example 1
Passing the
.B -r
and
.B -v
Arguments to
.BR boot
.sp
.LP
In the following example, the delimiter
.B --
(two hyphens) must be used
to separate the options of
.B reboot
from the arguments of
.BR boot (1M).

.sp
.in +2
.nf
example# \fBreboot -dl -- -rv\fR
.fi
.in -2
.sp

.LP
.B Example 2
Rebooting Using a Specific Disk and Kernel
.sp
.LP
The following example reboots using a specific disk and kernel.

.sp
.in +2
.nf
example# \fBreboot disk1 kernel.test/unix\fR
.fi
.in -2
.sp

.LP
.B Example 3
Fast Rebooting
.sp
.LP
The following examples use the
.B -f
option to perform fast reboots.

.sp
.LP
If service
.B svc:/system/boot-config:default
is enabled and property
.B config/fastreboot_default
is set to
.BR true ,
the
.B -f
option can
be omitted.

.sp
.LP
The following command reboots to the default entry in the GRUB (see
.BR grub (5))
menu file
.BR menu.lst .

.sp
.in +2
.nf
example# \fBreboot -f\fR
.fi
.in -2
.sp

.sp
.LP
The following command reboots to another UFS root disk.

.sp
.in +2
.nf
example# \fBreboot -f -- '/dev/dsk/c1d0s0'\fR
.fi
.in -2
.sp

.sp
.LP
The following command reboots to another ZFS root pool.

.sp
.in +2
.nf
example# \fBreboot -f -- 'rpool/ROOT/root2'\fR
.fi
.in -2
.sp

.sp
.LP
The following command reboots to
.B mykernel
on the same disk with
.B -k
option.

.sp
.in +2
.nf
example# \fBreboot -f -- '/platform/i86pc/mykernel/amd64/unix -k'\fR
.fi
.in -2
.sp

.sp
.LP
The following command reboots to
.B mykernel
off another root disk
mounted on
.BR /mnt .

.sp
.in +2
.nf
example# \fBreboot -f -- '/mnt/platform/i86pc/mykernel/amd64/unix -k'\fR
.fi
.in -2
.sp

.sp
.LP
The following command reboots to
.B /platform/i86pc/kernel/$ISADIR/unix
on another boot environment named
.BR second_root .

.sp
.in +2
.nf
example# \fBreboot -f -e second_root\fR
.fi
.in -2
.sp

.sp
.LP
The following command reboots to the same kernel with
.B -kv
options.

.sp
.in +2
.nf
example# \fBreboot -f -- '-kv'\fR
.fi
.in -2
.sp

.sp
.LP
The following commands disable the fast-reboot-by-default behavior.

.sp
.in +2
.nf
example# \fBsvccfg -s "system/boot-config:default" \e\fR
\fBsetprop config/fastreboot_default=false\fR
example# \fBsvcadm refresh svc:/system/boot-config:default\fR
.fi
.in -2
.sp

.sp
.LP
The following commands re-enable the fast-reboot-by-default behavior.

.sp
.in +2
.nf
example# \fBsvccfg -s "system/boot-config:default" \e\fR
\fBsetprop config/fastreboot_default=true\fR
example# \fBsvcadm refresh svc:/system/boot-config:default\fR
.fi
.in -2
.sp

.LP
.B Example 4
Rebooting to a Particular GRUB Menu
.sp
.LP
The following commands will reboot to entry
.B 2
in the GRUB menu.

.sp
.in +2
.nf
example# \fBbootadm list-menu\fR
  the location for the active GRUB menu is: /rpool/boot/grub/menu.lst
  default 0
  timeout 10
  0 zfsbe1
  1 zfsbe1 failsafe
  2 zfsbe2
  3 zfsbe2 Solaris xVM
  4 zfsbe2 failsafe
example# \fBreboot 2\fR
.fi
.in -2
.sp

.SH FILES
.sp
.ne 2
.mk
.na
.B /var/adm/wtmpx
.ad
.sp .6
.RS 4n
login accounting file
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.sp
.LP
.BR mdb (1),
.BR boot (1M),
.BR dumpadm (1M),
.BR fsck (1M),
.BR halt (1M),
.BR init (1M),
.BR kernel (1M),
.BR shutdown (1M),
.BR svcadm (1M),
.BR svccfg (1M),
.BR sync (1M),
.BR syslogd (1M),
.BR sync (2),
.BR uadmin (2),
.BR reboot (3C),
.BR attributes (5),
.BR grub (5)
.SH NOTES
.sp
.LP
The
.B reboot
utility does not execute the scripts in
\fB/etc/rc\fInum\fR.d\fR or execute shutdown actions in
.BR inittab (4).
To
ensure a complete shutdown of system services, use
.BR shutdown (1M)
or
.BR init (1M)
to reboot a Solaris system.
