usr/src/man/man1m/rem_drv.1m
'\" te
.\" Copyright (c) 2007 Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH rem_drv 1M "13 Aug 2007" "SunOS 5.11" "System Administration Commands"
.SH NAME
rem_drv \- remove a device driver from the system
.SH SYNOPSIS
.LP
.nf
\fBrem_drv\fR [\fB-b\fR \fIbasedir\fR] \fIdevice_driver\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B rem_drv
command informs the system that the device driver
.I device_driver
is no longer valid. If possible,
.B rem_drv
unloads
.I device_driver
from memory.
.B rem_drv
also updates the system
driver configuration files.
.sp
.LP
If
.B rem_drv
has been executed, the next time the system is rebooted it
automatically performs a reconfiguration boot (see
.BR kernel (1M)).
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -b
.I basedir
.ad
.sp .6
.RS 4n
Sets the path to the root directory of the diskless client. Used on the
server to execute
.B rem_drv
for a client. The client machine must be
rebooted to unload the driver.
.LP
Note -
.sp
.RS 2
The root file system of any non-global zones must not be referenced with
the
.B -b
option. Doing so might damage the global zone's file system,
might compromise the security of the global zone, and might damage the
non-global zone's file system. See
.BR zones (5).
.RE
.RE

.sp
.ne 2
.mk
.na
.B -C
.ad
.sp .6
.RS 4n
Remove dangling device attribute nodes bound to the driver being removed.
This causes any device ownership or permissions customizations made to any
node not to  be preserved if the driver is added back. Recommended for use
when reprovisioning a machine from one configuration or use to another where
past administrative customizations might not be desired.
.RE

.SH EXAMPLES
.LP
.B Example 1
Removing the
.B sd
Driver
.sp
.LP
The following example removes the
.B sd
driver from use:

.sp
.in +2
.nf
example% rem_drv sd
.fi
.in -2
.sp

.LP
.B Example 2
Removing a Diskless Client
.sp
.LP
The following example removes the driver from the
.B sun1
diskless
client. The driver is not uninstalled or unloaded until the client machine
is rebooted.

.sp
.in +2
.nf
example% rem_drv \fB-b\fR /export/root/sun1 sd
.fi
.in -2
.sp

.sp
.LP
Note the caveat on the use of the
.B -b
option in the description of
that option, above.

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.sp
.LP
.BR add_drv (1M),
.BR kernel (1M),
.BR update_drv (1M),
.BR attributes (5),
.BR zones (5),
.BR devfs (7FS)
