usr/src/man/man1m/removef.1m
'\" te
.\" Copyright 1989 AT&T Copyright (c) 2007, Sun Microsystems, Inc. All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH removef 1M "30 Oct 2007" "SunOS 5.11" "System Administration Commands"
.SH NAME
removef \- remove a file from software database
.SH SYNOPSIS
.LP
.nf
\fBremovef\fR [ [\fB-M\fR] \fB-R\fR \fIroot_path\fR] [\fB-V\fR \fIfs_file\fR] \fIpkginst\fR \fIpath\fR...
.fi

.LP
.nf
\fBremovef\fR [ [\fB-M\fR] \fB-R\fR \fIroot_path\fR] [\fB-V\fR \fIfs_file\fR] \fB-f\fR \fIpkginst\fR
.fi

.SH DESCRIPTION
.sp
.LP
\fBremovef\fR informs the system that the user, or software, intends to
remove a pathname. Output from \fBremovef\fR is the list of input pathnames
that may be safely removed (no other packages have a dependency on them).
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB-f\fR
.ad
.sp .6
.RS 4n
After all files have been processed, \fBremovef\fR should be invoked with
the \fB-f\fR option to indicate that the removal phase is complete.
.RE

.sp
.ne 2
.mk
.na
.B -M
.ad
.sp .6
.RS 4n
Instruct \fBremovef\fR not to use the
\fB$\fIroot_path\fB/etc/vfstab\fR file for determining the client's
mount points. This option assumes the mount points are correct on the server
and it behaves consistently with Solaris 2.5 and earlier releases.
.RE

.sp
.ne 2
.mk
.na
\fB-R\fR \fIroot_path\fR
.ad
.sp .6
.RS 4n
Define the full path name of a directory to use as the
.IR root_path .
All
files, including package system information files, are relocated to a
directory tree starting in the specified
.IR root_path .
The
\fIroot_path\fR may be specified when installing to a client from a server
(for example,
.BR /export/root/client1 ).
.sp
\fBremovef\fR inherits the value of the \fBPKG_INSTALL_ROOT\fR environment
variable. (See ENVIRONMENT VARIABLES, below.) If
.B PKG_INSTALL_ROOT
is
set, such as when the
.B -R
option is used with
.BR pkgadd "(1M) or"
.BR pkgrm (1M),
there is no need to use the \fBremovef -R\fR
option.
.LP
Note -
.sp
.RS 2
The root file system of any non-global zones must not be referenced with
the
.B -R
option. Doing so might damage the global zone's file system,
might compromise the security of the global zone, and might damage the
non-global zone's file system. See
.BR zones (5).
.RE
.RE

.sp
.ne 2
.mk
.na
\fB-V\fR \fIfs_file\fR
.ad
.sp .6
.RS 4n
Specify an alternative \fIfs_file\fR to map the client's file systems. For
example, used in situations where the
\fB$\fIroot_path\fB/etc/vfstab\fR file is non-existent or
unreliable.
.RE

.SH OPERANDS
.sp
.LP
The following operands are supported:
.sp
.ne 2
.mk
.na
.I path
.ad
.sp .6
.RS 4n
The pathname to be removed.
.RE

.sp
.ne 2
.mk
.na
.I pkginst
.ad
.sp .6
.RS 4n
The package instance from which the pathname is being removed.
.RE

.SH EXAMPLES
.LP
\fBExample 1\fR Using \fBremovef\fR
.sp
.LP
The following example uses the \fBremovef\fR command in an optional
pre-install script:

.sp
.in +2
.nf
echo "The following files are no longer part of this package
      and are being removed."
removef $PKGINST /myapp/file1 /myapp/file2 |
while read pathname
do
     echo "$pathname"
     rm \fB-f\fR $pathname
done
removef \fB-f\fR $PKGINST || exit 2
.fi
.in -2
.sp

.SH ENVIRONMENT VARIABLES
.sp
.LP
\fBremovef\fR inherits the value of the following environment variable.
This variable is set when
.BR pkgadd "(1M) or"
.BR pkgrm (1M)
is invoked
with the
.B -R
option.
.sp
.ne 2
.mk
.na
.B PKG_INSTALL_ROOT
.ad
.sp .6
.RS 4n
If present, defines the full path name of a directory to use as the
system's
.B PKG_INSTALL_ROOT
path. All product and package information
files are then looked for in the directory tree, starting with the specified
\fBPKG_INSTALL_ROOT\fR path. If not present, the default system path of
\fB/\fR is used.
.RE

.SH EXIT STATUS
.sp
.ne 2
.mk
.na
.B 0
.ad
.sp .6
.RS 4n
Successful completion.
.RE

.sp
.ne 2
.mk
.na
.B >0
.ad
.sp .6
.RS 4n
An error occurred.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.sp
.LP
\fBpkginfo\fR(1), \fBpkgmk\fR(1),
.BR pkgparam (1),
.BR pkgproto (1),
.BR pkgtrans (1),
\fBinstallf\fR(1M), \fBpkgadd\fR(1M), \fBpkgask\fR(1M),
.BR pkgchk (1M),
.BR pkgrm (1M),
\fBattributes\fR(5), \fBlargefile\fR(5)
.sp
.LP
\fR
.SH NOTES
.sp
.LP
Package commands are \fBlargefile\fR(5)-aware. They handle files larger
than 2 GB in the same way they handle smaller files. In their current
implementations, \fBpkgadd\fR(1M),
.BR pkgtrans (1)
and other package
commands can process a datastream of  up to 4 GB.
