usr/src/man/man1m/reparsed.1m
'\" te
.\" Copyright (c) 2009, Sun Microsystems, Inc. All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH reparsed 1M "30 Sep 2009" "SunOS 5.11" "System Administration Commands"
.SH NAME
reparsed \- reparse point daemon
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/reparse/reparsed\fR
.fi

.SH DESCRIPTION
.sp
.LP
The \fBreparsed\fR daemon processes kernel upcalls to interpret "reparse
points", which are the basis of Microsoft DFS referrals and NFS referrals
support on Solaris CIFS and NFS file servers. Only the root user or a user
with equivalent privileges can run this daemon. The daemon is under SMF
control.
.SH EXIT STATUS
.sp
.ne 2
.mk
.na
.B 0
.ad
.sp .6
.RS 4n
Daemon started successfully.
.RE

.sp
.ne 2
.mk
.na
.B >0
.ad
.sp .6
.RS 4n
Daemon failed to start.
.RE

.sp
.LP
Error information is reported to
.B syslog
at level
.BR LOG_ERR .
.SH FILES
.sp
.ne 2
.mk
.na
.B /usr/lib/reparsed/*.so.1
.ad
.sp .6
.RS 4n
Per-service plugins for
.BR reparsed .
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsr
_
Interface StabilityConsolidation Private
.TE

.SH SEE ALSO
.sp
.LP
.BR svcadm (1M),
.BR syslogd (1M),
.BR libreparse (3LIB),
.BR attributes (5)
.SH NOTES
.sp
.LP
Do not manually stop, start or restart the
.B reparsed
daemon. If you
need to change the state of the daemon, use these commands:
.sp
.in +2
.nf
# \fBsvcadm disable svc:/system/filesystem/reparse\fR
# \fBsvcadm enable svc:/system/filesystem/reparse\fR
# \fBsvcadm restart svc:/system/filesystem/reparse\fR
.fi
.in -2
.sp

.sp
.LP
See \fBsvcadm\fR(1M) for additional information.
