usr/src/man/man1m/repquota.1m
'\" te
.\" Copyright 1989 AT&T  Copyright (c) 1996, Sun Microsystems, Inc.  All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH repquota 1M "16 Sep 1996" "SunOS 5.11" "System Administration Commands"
.SH NAME
repquota \- summarize quotas for a ufs file system
.SH SYNOPSIS
.LP
.nf
\fBrepquota\fR [\fB-v\fR] \fIfilesystem\fR...
.fi

.LP
.nf
\fBrepquota\fR \fB-a\fR [\fB-v\fR]
.fi

.SH DESCRIPTION
.sp
.LP
.B repquota
prints a summary of the disk usage and quotas for the
specified ufs file systems. The current number of files and amount of space
(in kilobytes) is printed for each user along with any quotas created with
.BR edquota (1M).
.sp
.LP
The
.I filesystem
must have the file
.B quotas
in its root
directory.
.sp
.LP
Only the super-user may view quotas which are not their own.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -a
.ad
.RS 6n
.rt
Report on all mounted ufs file systems that have
.B rq
in the
.B mntopts
field of the
.B /etc/vfstab
file.
.RE

.sp
.ne 2
.mk
.na
.B -v
.ad
.RS 6n
.rt
Report quotas for all users, even those who do not consume resources.
.RE

.SH USAGE
.sp
.LP
See
.BR largefile (5)
for the description of the behavior of
.B repquota
when encountering files greater than or equal to 2 Gbyte (
2^31 bytes).
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.sp
.LP
.BR edquota (1M),
.BR quota (1M),
.BR quotacheck (1M),
.BR quotaon (1M),
.BR attributes (5),
.BR largefile (5),
.BR quotactl (7I)
