usr/src/man/man1m/rmmount.1m
'\" te
.\" Copyright (c) 2004, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH rmmount 1M "1 Mar 2007" "SunOS 5.11" "System Administration Commands"
.SH NAME
rmmount \- removable media mounter for CD-ROM, floppy, Jaz drive, and
others
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/rmmount\fR [\fB-D\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The
.B rmmount
utility is a removable media mounter that is executed by
volume management whenever a removable medium, such as a
.B CD-ROM
or a
floppy, is inserted. Removable media is managed by an application or a
volume manager.
.B rmmount
can also be called by using
.BR volrmmount (1).
.sp
.LP
Upon insertion of a medium and following invocation of the
.BR volcheck (1)
command,
.B rmmount
determines what type of file system
(if any) is on that medium. If a file system is present, \fBrmmount\fR
mounts the file system in one of the locations listed below.
.sp
.LP
For a diskette (floppy):
.sp
.ne 2
.mk
.na
.B /floppy/floppy0
.ad
.RS 26n
.rt
symbolic link to mounted floppy in local floppy drive
.RE

.sp
.ne 2
.mk
.na
.B /floppy/floppy_name
.ad
.RS 26n
.rt
mounted named floppy
.RE

.sp
.ne 2
.mk
.na
.B /floppy/unnamed_floppy
.ad
.RS 26n
.rt
mounted unnamed floppy
.RE

.sp
.LP
For a CD-ROM or a DVD-ROM:
.sp
.ne 2
.mk
.na
.B /cdrom/cdrom0
.ad
.sp .6
.RS 4n
symbolic link to mounted
.B CD-ROM
in local
.B CD-ROM
drive
.RE

.sp
.ne 2
.mk
.na
.B /cdrom/CD-ROM_name
.ad
.sp .6
.RS 4n
mounted named
.BR CD-ROM
.RE

.sp
.ne 2
.mk
.na
.B /cdrom/CD-ROM_name/partition
.ad
.sp .6
.RS 4n
mounted named
.B CD-ROM
with partitioned file system
.RE

.sp
.ne 2
.mk
.na
.B /cdrom/unnamed_cdrom
.ad
.sp .6
.RS 4n
mounted unnamed
.BR CD-ROM
.RE

.sp
.LP
For a Zip drive:
.sp
.ne 2
.mk
.na
.B /rmdisk/zip0
.ad
.RS 30n
.rt
symbolic link to mounted Zip medium in local Zip drive
.RE

.sp
.ne 2
.mk
.na
\fB/rmdisk/\fIZip_name\fR
.ad
.RS 30n
.rt
mounted named Zip medium
.RE

.sp
.ne 2
.mk
.na
\fB/rmdisk/\fIZip_name\fR/partition\fR
.ad
.RS 30n
.rt
mounted named Zip medium with partitioned file system
.RE

.sp
.ne 2
.mk
.na
.B /rmdisk/unnamed_zip
.ad
.RS 30n
.rt
mounted unnamed Zip medium
.RE

.sp
.LP
For a Jaz drive:
.sp
.ne 2
.mk
.na
.B /rmdisk/jaz0
.ad
.RS 30n
.rt
symbolic link to mounted Jaz medium in local Jaz drive
.RE

.sp
.ne 2
.mk
.na
\fB/rmdisk/\fIJaz_name\fR
.ad
.RS 30n
.rt
mounted named Jaz medium
.RE

.sp
.ne 2
.mk
.na
\fB/rmdisk/\fIJaz_name\fR/partition\fR
.ad
.RS 30n
.rt
mounted named Jaz medium with partitioned file system
.RE

.sp
.ne 2
.mk
.na
.B /rmdisk/unnamed_Jaz
.ad
.RS 30n
.rt
mounted unnamed Jaz medium
.RE

.sp
.LP
For a generic "rmdisk" drive:
.sp
.ne 2
.mk
.na
.B /rmdisk/rmdisk0
.ad
.sp .6
.RS 4n
symbolic link to mounted removable medium in local removable medium drive
.RE

.sp
.ne 2
.mk
.na
\fB/rmdisk/\fIrmdisk_name\fR
.ad
.sp .6
.RS 4n
mounted named removable medium
.RE

.sp
.ne 2
.mk
.na
\fB/rmdisk/\fIrmdisk_name\fR/partition\fR
.ad
.sp .6
.RS 4n
mounted named removable medium with partitioned file system
.RE

.sp
.ne 2
.mk
.na
.B /rmdisk/unnamed_rmdisk
.ad
.sp .6
.RS 4n
mounted unnamed removable medium
.RE

.sp
.LP
If the media is read-only (for example, a
.B CD-ROM
or a floppy with
write-protect tab set), the file system is mounted read-only.
.sp
.LP
If a file system is not identified,
.B rmmount
does not mount a file
system. See the\fR  for more information on the location of
.BR CD-ROM ,
floppy, and other media without file systems.
.sp
.LP
If a file system type has been determined, it is then checked to see that
it is "clean." If the file system is "dirty," \fBfsck -p\fR (see
.BR fsck (1M))
is run in an attempt to clean it. If
.B fsck
fails, the
file system is mounted read-only.
.sp
.LP
After the mount is complete, "actions" associated with the media type are
executed. These actions allow for the notification to other programs that
new media are available.
.sp
.LP
Actions are executed in the order in which they appear in the configuration
file. The action function can return either
.B 1
or
.BR 0 .
If it
returns
.BR 0 ,
no further actions will be executed. This allows the
function to control which applications are executed.
.sp
.LP
In order to execute an action,
.B rmmount
performs a
.BR dlopen "(3C) on"
the shared object and calls the action function defined within it. The
definition of the interface to actions can be found in
.BR /usr/include/rmmount.h .
.sp
.LP
File systems mounted by
.B rmmount
are always mounted with the
.B nosuid
flag set, thereby disabling setuid programs and access to block
or character devices in that file system. Upon ejection, \fBrmmount\fR
unmounts mounted file systems and executes actions associated with the media
type. If a file system is "busy" (that is, it contains the current working
directory of a live process), the ejection will fail.
.SH OPTIONS
.sp
.ne 2
.mk
.na
.B -D
.ad
.RS 6n
.rt
Turn on the debugging output from the
.B "rmmount dprintf"
calls.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B /usr/lib/rmmount/*.so.1
.ad
.RS 27n
.rt
shared objects used by
.BR rmmount .
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWvolu
.TE

.SH SEE ALSO
.sp
.LP
.BR volcheck (1),
.BR volrmmount (1),
.BR fsck (1M),
.BR dlopen (3C),
.BR attributes (5)
.sp
.LP
\fR
