usr/src/man/man1m/rmt.1m
'\" te
.\" Copyright (c) 1983 Regents of the University of California.
.\" All rights reserved. The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\" Copyright (c) 1995 Sun Microsystems, Inc.  All Rights Reserved.
.\" from UCB 4.3
.TH rmt 1M "6 Nov 2000" "SunOS 5.11" "System Administration Commands"
.SH NAME
rmt \- remote magtape protocol module
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/rmt\fR
.fi

.SH DESCRIPTION
.sp
.LP
\fBrmt\fR is a program used by the remote dump and restore programs in
manipulating a magnetic tape drive through an interprocess communication
connection.
.B rmt
is normally started up with an
.BR rexec "(3SOCKET) or"
.BR rcmd (3SOCKET)
call.
.sp
.LP
The
.B rmt
program accepts requests that are specific to the
manipulation of magnetic tapes, performs the commands, then responds with a
status indication.  All responses are in
.B ASCII
and in one of two
forms. Successful commands have responses of:
.sp
.in +2
.nf

.fi
.in -2
.sp

.sp
.ne 2
.mk
.na
\fBA\fInumber\fB\en\fR
.ad
.RS 14n
.rt
where
.I number
is an
.B ASCII
representation of a decimal number.
.RE

.sp
.LP
Unsuccessful commands are responded to with:
.sp
.ne 2
.mk
.na
\fBE\fIerror-number\fB\en\fIerror-message\fB\en\fR
.ad
.sp .6
.RS 4n
where
.I error-number
is one of the possible error numbers described in
.BR intro (3),
and
.I error-message
is the corresponding error string as
printed from a call to
.BR perror (3C).
.RE

.sp
.LP
 The protocol consists of the following commands:
.sp
.ne 2
.mk
.na
\fBS\en\fR
.ad
.RS 25n
.rt
Return the status of the open device, as obtained with a \fBMTIOCGET\fR
\fBioctl\fR call.  If the operation was successful, an "ack" is sent with
the size of the status buffer, then the status buffer is sent (in binary).
.RE

.sp
.ne 2
.mk
.na
\fBC\fIdevice\fB\en\fR
.ad
.RS 25n
.rt
Close the currently open device. The
.I device
specified is ignored.
.RE

.sp
.ne 2
.mk
.na
\fBI\fIoperation\fB\en\fIcount\fB\en\fR
.ad
.RS 25n
.rt
Perform a
.BR "MTIOCOP ioctl" (2)
command using the specified
.RB "parameters. The parameters are interpreted as the" " ASCII"
representations of the decimal values to place in the
.I mt_op
and
\fImt_count\fR fields of the structure used in the \fBioctl\fR call.   When
the operation is successful the return value is the
.I count
parameter.
.RE

.sp
.ne 2
.mk
.na
\fBL\fIoffset\fB\en\fBwhence\fB\en\fR
.ad
.RS 25n
.rt
Perform an
.BR lseek (2)
operation using the specified parameters. The
response value is returned from the
.B lseek
call.
.RE

.sp
.ne 2
.mk
.na
\fBO\fIdevice\fB\en\fImode\fB\en\fR
.ad
.RS 25n
.rt
Open the specified
.I device
using the indicated
.IR mode .
\fIdevice\fR is a full pathname, and \fImode\fR is an \fBASCII\fR
representation of a decimal number suitable for passing to
.BR open (9E).
If a device is already open, it is closed before a new open is performed.
.RE

.sp
.ne 2
.mk
.na
\fBR\fIcount\fB\en\fR
.ad
.RS 25n
.rt
Read
.I count
bytes of data from the open device.
.B rmt
performs the
requested \fBread\fR(9E) and responds with \fBA\fIcount-read\en\fR if the
read was successful; otherwise an error in  standard format is returned. If
the read was successful, the data read is sent.
.RE

.sp
.ne 2
.mk
.na
\fBW\fIcount\fB\en\fR
.ad
.RS 25n
.rt
Write data onto the open device.
.B rmt
reads
.I count
bytes from the
connection, aborting if a premature
.B EOF
is encountered. The response
value is returned from the
.BR write "(9E) call."
.RE

.sp
.LP
Any other command causes
.B rmt
to exit.
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWrcmdc
.TE

.SH SEE ALSO
.sp
.LP
\fBufsdump\fR(1M), \fBufsrestore\fR(1M),
.BR intro (3),
.BR ioctl (2),
.BR lseek (2),
\fBperror\fR (3C), \fBrcmd\fR(3SOCKET),
.BR rexec (3SOCKET),
.BR attributes (5),
.BR mtio (7I),
.BR open (9E),
.BR read (9E),
.BR write (9E)
.SH DIAGNOSTICS
.sp
.LP
All responses are of the form described above.
.SH BUGS
.sp
.LP
Do not use this for a remote file access protocol.
