usr/src/man/man1m/rmt.1m
'\" te
.\" Copyright (c) 1983 Regents of the University of California.
.\" All rights reserved. The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\" Copyright (c) 1995 Sun Microsystems, Inc.  All Rights Reserved.
.\" from UCB 4.3
.TH rmt 1M "6 Nov 2000" "SunOS 5.11" "System Administration Commands"
.SH NAME
rmt \- remote magtape protocol module
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/rmt\fR
.fi

.SH DESCRIPTION
.sp
.LP
\fBrmt\fR is a program used by the remote dump and restore programs in
manipulating a magnetic tape drive through an interprocess communication
connection. \fBrmt\fR is normally started up with an \fBrexec\fR(3SOCKET) or
\fBrcmd\fR(3SOCKET) call.
.sp
.LP
The \fBrmt\fR program accepts requests that are specific to the
manipulation of magnetic tapes, performs the commands, then responds with a
status indication.  All responses are in \fBASCII\fR and in one of two
forms. Successful commands have responses of:
.sp
.in +2
.nf

.fi
.in -2
.sp

.sp
.ne 2
.mk
.na
\fBA\fInumber\fB\en\fR
.ad
.RS 14n
.rt
where \fInumber\fR is an \fBASCII\fR representation of a decimal number.
.RE

.sp
.LP
Unsuccessful commands are responded to with:
.sp
.ne 2
.mk
.na
\fBE\fIerror-number\fB\en\fIerror-message\fB\en\fR
.ad
.sp .6
.RS 4n
where \fIerror-number\fR is one of the possible error numbers described in
\fBintro\fR(3), and \fIerror-message\fR is the corresponding error string as
printed from a call to \fBperror\fR(3C).
.RE

.sp
.LP
 The protocol consists of the following commands:
.sp
.ne 2
.mk
.na
\fBS\en\fR
.ad
.RS 25n
.rt
Return the status of the open device, as obtained with a \fBMTIOCGET\fR
\fBioctl\fR call.  If the operation was successful, an "ack" is sent with
the size of the status buffer, then the status buffer is sent (in binary).
.RE

.sp
.ne 2
.mk
.na
\fBC\fIdevice\fB\en\fR
.ad
.RS 25n
.rt
Close the currently open device. The \fIdevice\fR specified is ignored.
.RE

.sp
.ne 2
.mk
.na
\fBI\fIoperation\fB\en\fIcount\fB\en\fR
.ad
.RS 25n
.rt
Perform a \fBMTIOCOP\fR \fBioctl\fR(2) command using the specified
parameters. The parameters are interpreted as the \fBASCII\fR
representations of the decimal values to place in the \fImt_op\fR and
\fImt_count\fR fields of the structure used in the \fBioctl\fR call.   When
the operation is successful the return value is the \fIcount\fR parameter.
.RE

.sp
.ne 2
.mk
.na
\fBL\fIoffset\fB\en\fBwhence\fB\en\fR
.ad
.RS 25n
.rt
Perform an \fBlseek\fR(2) operation using the specified parameters. The
response value is returned from the \fBlseek\fR call.
.RE

.sp
.ne 2
.mk
.na
\fBO\fIdevice\fB\en\fImode\fB\en\fR
.ad
.RS 25n
.rt
Open the specified \fIdevice\fR using the indicated \fImode\fR.
\fIdevice\fR is a full pathname, and \fImode\fR is an \fBASCII\fR
representation of a decimal number suitable for passing to \fBopen\fR(9E).
If a device is already open, it is closed before a new open is performed.
.RE

.sp
.ne 2
.mk
.na
\fBR\fIcount\fB\en\fR
.ad
.RS 25n
.rt
Read \fIcount\fR bytes of data from the open device. \fBrmt\fR performs the
requested \fBread\fR(9E) and responds with \fBA\fIcount-read\en\fR if the
read was successful; otherwise an error in  standard format is returned. If
the read was successful, the data read is sent.
.RE

.sp
.ne 2
.mk
.na
\fBW\fIcount\fB\en\fR
.ad
.RS 25n
.rt
Write data onto the open device. \fBrmt\fR reads \fIcount\fR bytes from the
connection, aborting if a premature \fBEOF\fR is encountered. The response
value is returned from the \fBwrite\fR(9E) call.
.RE

.sp
.LP
Any other command causes \fBrmt\fR to exit.
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWrcmdc
.TE

.SH SEE ALSO
.sp
.LP
\fBufsdump\fR(1M), \fBufsrestore\fR(1M), \fBintro\fR(3), \fBioctl\fR(2),
\fBlseek\fR(2), \fBperror \fR(3C), \fBrcmd\fR(3SOCKET),
\fBrexec\fR(3SOCKET), \fBattributes\fR(5), \fBmtio\fR(7I), \fBopen\fR(9E),
\fBread\fR(9E), \fBwrite\fR(9E)
.SH DIAGNOSTICS
.sp
.LP
All responses are of the form described above.
.SH BUGS
.sp
.LP
Do not use this for a remote file access protocol.
