usr/src/man/man1m/rmvolmgr.1m
'\" te
.\" Copyright (c) 2006, Sun Microsystems, Inc. All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH rmvolmgr 1M "28 Nov 2006" "SunOS 5.11" "System Administration Commands"
.SH NAME
rmvolmgr \- HAL-aware removable volume manager
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/rmvolmgr\fR [\fB-chns\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The
.B rmvolmgr
command is a volume manager that can automatically mount
and unmount removable media and hot-pluggable storage. The default mount
point is
.BR /media .
.sp
.LP
\fBrmvolmgr\fR is one of a number of Hardware Abstraction Layer (HAL)-aware
tools that are shipped with the Solaris operating system. See
.BR hald (1M).
.sp
.LP
Multiple instances of
.B rmvolmgr
can be run simultaneously. A system
instance of
.B rmvolmgr
runs by default as a service management facility
(SMF) service (see
.BR smf (5)).
Its fault management resource identifier
(FMRI) is:
.sp
.in +2
.nf
svc:/system/filesystem/rmvolmgr
.fi
.in -2
.sp

.sp
.LP
You can run your own instance of
.B rmvolmgr
by adding it to the
\fB\&.xinitrc\fR file or a similar session startup script. In such a case,
the
.B "system rmvolmgr"
instance will not manage volumes that belong
to you, the owner of the startup script. For example, a user logged on to
the workstation console (\fB/dev/console\fR) who invokes his own instance of
\fBrmvolmgr\fR will own locally connected devices, such as CD-ROM drives and
devices connected to the local USB or FireWire ports.
.sp
.LP
In addition to mounting volumes under
.BR /media ,
\fBrmvolmgr\fR also
creates legacy symbolic links under
.BR /cdrom ,
.BR /floppy ,
and
.BR /rmdisk .
.sp
.LP
\fBrmvolmgr\fR also provides backwards compatibility with CDE removable
media interfaces by maintaining notification files under
.BR /tmp/.removable .
This functionality can be disabled by using the
\fB-c\fR option.
.sp
.LP
The
.B -c
and
.B -n
options can also be specified as SMF properties.
See "Examples."
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -c
.ad
.RS 6n
.rt
Disable CDE compatibility.
.RE

.sp
.ne 2
.mk
.na
.B -h
.ad
.RS 6n
.rt
Display help information and exit.
.RE

.sp
.ne 2
.mk
.na
.B -n
.ad
.RS 6n
.rt
Do not create legacy mountpoint symbolic links.
.RE

.sp
.ne 2
.mk
.na
.B -s
.ad
.RS 6n
.rt
Invoke in system instance mode.
.RE

.SH EXAMPLES
.LP
\fBExample 1\fR Using SMF Properties to Set Options
.sp
.LP
The following \fBsvccfg\fR(1M) command and subcommands use SMF properties
to set the
.B -c
and
.B -n
options.

.sp
.in +2
.nf
example# \fBsvccfg\fR
svc:> \fBselect rmvolmgr\fR
svc:/system/filesystem/rmvolmgr> \fBlistprop rmvolmgr/*\fR
rmvolmgr/legacy_mountpoints     boolean  true
rmvolmgr/cde_compatible         boolean  true
svc:/system/filesystem/rmvolmgr> \fBsetprop \e
  rmvolmgr/legacy_mountpoints=false\fR
svc:/system/filesystem/rmvolmgr> \fBsetprop rmvolmgr/cde_compatible=false\fR
svc:/system/filesystem/rmvolmgr> \fBexit\fR
example#
.fi
.in -2
.sp

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWhalr
_
Interface StabilityVolatile
.TE

.SH SEE ALSO
.sp
.LP
.BR hald (1M),
.BR svccfg (1M),
.BR attributes (5),
.BR hal (5),
.BR smf (5)
