usr/src/man/man1m/rndc.1m
'\" te
.\" Copyright (C) 2004  Internet Systems Consortium, Inc. ("ISC")
.\" Copyright (C) 2000, 2001 Internet Software Consortium.
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND ISC DISCLAIMS ALL WARRANTIES WITH
.\" REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF MERCHANTABILITY
.\" AND FITNESS. IN NO EVENT SHALL ISC BE LIABLE FOR ANY SPECIAL, DIRECT,
.\" INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES WHATSOEVER RESULTING FROM
.\" LOSS OF USE, DATA OR PROFITS, WHETHER IN AN ACTION OF CONTRACT, NEGLIGENCE
.\" OR OTHER TORTIOUS ACTION, ARISING OUT OF OR IN CONNECTION WITH THE USE OR
.\" PERFORMANCE OF THIS SOFTWARE.
.\"
.\" Portions Copyright (c) 2004, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.TH rndc 1M "24 Dec 2008" "SunOS 5.11" "System Administration Commands"
.SH NAME
rndc \- name server control utility
.SH SYNOPSIS
.LP
.nf
\fBrndc\fR [\fB-V\fR] [\fB-c\fR \fIconfig-file\fR] [\fB-k\fR \fIkey-file\fR] [\fB-s\fR \fIserver\fR]
     [\fB-p\fR \fIport\fR] [\fB-y\fR \fIkey_id\fR] \fIcommand\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B rndc
utility controls the operation of a name server. It
supersedes the
.B ndc
utility that was provided in previous BIND
releases. If
.B rndc
is invoked with no command line options or
arguments, it prints a short summary of the supported commands and the
available options and their arguments.
.sp
.LP
The
.B rndc
utility communicates with the name server over a TCP
connection, sending commands authenticated with digital signatures. The only
supported authentication algorithm in the current versions of
.B rndc
and
.BR named (1M)
is HMAC-MD5, which uses a shared secret on each end of the
connection. This algorithm provides TSIG-style authentication for the
command request and the name server's response. All commands sent over the
channel must be signed by a
.I key_id
known to the server.
.sp
.LP
The
.B rndc
utility reads a configuration file to determine how to
contact the name server and decide what algorithm and key it should use.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -c
.I config-file
.ad
.RS 18n
.rt
Use
.I config-file
as the configuration file instead of the default
.BR /etc/rndc.conf .
.RE

.sp
.ne 2
.mk
.na
.B -k
.I key-file
.ad
.RS 18n
.rt
Use
.I key-file
as the key file instead of the default,
.BR /etc/rndc.key .
The key in
.B /etc/rndc.key
is used to authenticate
commands sent to the server if the
.I config-file
does not exist.
.RE

.sp
.ne 2
.mk
.na
.B -s
.I server
.ad
.RS 18n
.rt
The
.I server
argument is the name or address of the server that matches
a server statement in the configuration file for
.BR rndc .
If no server is
supplied on the command line, the host named by the default-server clause in
the options statement of the
.B rndc
configuration file is used.
.RE

.sp
.ne 2
.mk
.na
.B -p
.I port
.ad
.RS 18n
.rt
Send commands to TCP port
.I port
instead of BIND 9's default control
channel port, 953.
.RE

.sp
.ne 2
.mk
.na
.B -V
.ad
.RS 18n
.rt
Enable verbose logging.
.RE

.sp
.ne 2
.mk
.na
.B -y
.I key_id
.ad
.RS 18n
.rt
Use the key
.I key_id
from the configuration file. The \fIkey_id\fR
argument must be known by
.B named
with the same algorithm and secret
string for control message validation to succeed. If no
.I key_id
is
specified,
.B rndc
will first look for a key clause in the server
statement of the server being used, or if no server statement is present for
that host, then the
.B default-key
clause of the options statement. The
configuration file contains shared secrets that are used to send
authenticated control commands to name servers. It should therefore not have
general read or write access.
.RE

.sp
.LP
For the complete set of commands supported by
.BR rndc ,
see the \fIBIND 9
Administrator Reference Manual\fR or run
.B rndc
without arguments to see
its help message.
.SH LIMITATIONS
.sp
.LP
The
.B rndc
utility does not support all the commands of the BIND 8
.B ndc
utility.
.sp
.LP
There is no way to provide the shared secret for a
.I key_id
without
using the configuration file.
.sp
.LP
Several error messages could be clearer.
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWbind
_
Interface StabilityExternal
.TE

.SH SEE ALSO
.sp
.LP
.BR named (1M),
.BR rndc-confgen (1M),
.BR rndc.conf (4),
.BR attributes (5)
.sp
.LP
.I BIND 9 Administrator Reference Manual
