usr/src/man/man1m/roleadd.1m
'\" te
.\" Copyright 1989 AT&T Copyright (c) 2006 Sun Microsystems, Inc. All Rights Reserved.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH roleadd 1M "21 Feb 2006" "SunOS 5.11" "System Administration Commands"
.SH NAME
roleadd \- administer a new role account on the system
.SH SYNOPSIS
.LP
.nf
\fBroleadd\fR [\fB-c\fR \fIcomment\fR] [\fB-d\fR \fIdir\fR] [\fB-e\fR \fIexpire\fR] [\fB-f\fR \fIinactive\fR]
     [\fB-g\fR \fIgroup\fR] [\fB-G\fR \fIgroup\fR [, \fIgroup\fR.\|.\|.]] [\fB-m\fR [\fB-k\fR \fIskel_dir\fR]]
     [\fB-u\fR \fIuid\fR [\fB-o\fR]] [\fB-s\fR \fIshell\fR]
     [\fB-A\fR \fIauthorization\fR [,\fIauthorization.\|.\|.\fR]] [\fB-K\fR \fIkey=value\fR] \fIrole\fR
.fi

.LP
.nf
\fBroleadd\fR \fB-D\fR [\fB-b\fR \fIbase_dir\fR] [\fB-e\fR \fIexpire\fR] [\fB-f\fR \fIinactive\fR]
     [\fB-g\fR \fIgroup\fR] [\fB-A\fR \fIauthorization\fR [,\fIauthorization.\|.\|.\fR]]
     [\fB-P\fR \fIprofile\fR [,\fIprofile.\|.\|.\fR] [\fB-K\fR \fIkey=value\fR]]
.fi

.SH DESCRIPTION
.sp
.LP
\fBroleadd\fR adds a role entry to the \fB/etc/passwd\fR and \fB/etc/shadow\fR
and
.B /etc/user_attr
files. The
.B -A
and
.B -P
options respectively
assign authorizations and profiles to the role. Roles cannot be assigned to
other roles. The
.B -K
option adds a
.I key=value
pair to
\fB/etc/user_attr\fR for a role. Multiple \fIkey=value\fR pairs can be added
with multiple
.B -K
options.
.sp
.LP
\fBroleadd\fR also creates supplementary group memberships for the role
(\fB-G\fR option) and creates the home directory (\fB-m\fR option) for the role
if requested. The new role account remains locked until the
.BR passwd (1)
command is executed.
.sp
.LP
Specifying
.B "roleadd -D"
with the
.BR -g ,
.BR -b ,
.BR -f ,
.BR -e ,
or
.B -K
option (or any combination of these option) sets the
default values for the respective fields. See the
.B -D
option. Subsequent
\fBroleadd\fR commands without the \fB-D\fR option use these arguments.
.sp
.LP
The system file entries created with this command have a limit of 512
characters per line. Specifying long arguments to several options can exceed
this limit.
.sp
.LP
The role (\fBrole\fR) field accepts a string of no more than eight bytes
consisting of characters from the set of alphabetic characters, numeric
characters, period
.RB ( \&. ),
underscore
.RB ( _ ),
and hyphen
.RB ( - ).
The
first character should be alphabetic and the field should contain at least one
lower case alphabetic character. A warning message is written if these
restrictions are not met. A future Solaris release might refuse to accept role
fields that do not meet these requirements.
.sp
.LP
The
.B role
field must contain at least one character and must not contain
a colon (\fB:\fR) or a newline (\fB\en\fR).
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB-A\fR \fIauthorization\fR
.ad
.RS 20n
.rt
One or more comma separated authorizations defined in
.BR auth_attr (4).
Only
a user or role who has grant rights to the authorization can assign it to an
account
.RE

.sp
.ne 2
.mk
.na
\fB-b\fR \fIbase_dir\fR
.ad
.RS 20n
.rt
The default base directory for the system if \fB-d\fI dir\fR is not
specified.
.I base_dir
is concatenated with the account name to define the
home directory. If the
.B -m
option is not used,
.I base_dir
must
exist.
.RE

.sp
.ne 2
.mk
.na
\fB-c\fR \fIcomment\fR
.ad
.RS 20n
.rt
Any text string. It is generally a short description of the role. This
information is stored in the role's
.B /etc/passwd
entry.
.RE

.sp
.ne 2
.mk
.na
\fB-d\fR \fIdir\fR
.ad
.RS 20n
.rt
The home directory of the new role. It defaults to
\fIbase_dir\fR/\fIaccount_name\fR, where \fIbase_dir\fR is the base directory
for new login home directories and
.I account_name
is the new role name.
.RE

.sp
.ne 2
.mk
.na
.B -D
.ad
.RS 20n
.rt
Display the default values for
.IR group ,
.IR base_dir ,
.IR skel_dir ,
.IR shell ,
.IR inactive ,
\fIexpire\fR and \fIkey=value\fR pairs. When used
with the
.BR -g ,
.BR -b ,
.BR -f ,
or
.BR -K ,
.RB "options, the" " -D"
option sets the default values for the specified fields. The default values
are:
.sp
.ne 2
.mk
.na
.B group
.ad
.sp .6
.RS 4n
\fBother\fR (\fBGID\fR of 1)
.RE

.sp
.ne 2
.mk
.na
.B base_dir
.ad
.sp .6
.RS 4n
.B /home
.RE

.sp
.ne 2
.mk
.na
.B skel_dir
.ad
.sp .6
.RS 4n
.B /etc/skel
.RE

.sp
.ne 2
.mk
.na
.B shell
.ad
.sp .6
.RS 4n
\fB/bin/pfsh\fR
.RE

.sp
.ne 2
.mk
.na
.B inactive
.ad
.sp .6
.RS 4n
.B 0
.RE

.sp
.ne 2
.mk
.na
.B expire
.ad
.sp .6
.RS 4n
Null
.RE

.sp
.ne 2
.mk
.na
.B auths
.ad
.sp .6
.RS 4n
Null
.RE

.sp
.ne 2
.mk
.na
\fBprofiles\fR
.ad
.sp .6
.RS 4n
Null
.RE

.sp
.ne 2
.mk
.na
\fBkey=value (pairs defined in \fBuser_attr\fR(4)\fR
.ad
.sp .6
.RS 4n
not present
.RE

.RE

.sp
.ne 2
.mk
.na
\fB-e\fR \fIexpire\fR
.ad
.RS 20n
.rt
Specify the expiration date for a role. After this date, no user is able to
access this role. The expire option argument is a date entered using one of the
date formats included in the template file
.BR /etc/datemsk .
See
.BR getdate (3C).
.sp
If the date format that you choose includes spaces, it must be quoted. For
example, you can enter
.B 10/6/90
or
.BR "October 6, 1990" .
A null value
(\fB" "\fR) defeats the status of the expired date. This option is useful for
creating temporary roles.
.RE

.sp
.ne 2
.mk
.na
\fB-f\fR \fIinactive\fR
.ad
.RS 20n
.rt
The maximum number of days allowed between uses of a role ID before that ID is
declared invalid. Normal values are positive integers. A value of \fB 0\fR
defeats the status.
.RE

.sp
.ne 2
.mk
.na
\fB-g\fR \fIgroup\fR
.ad
.RS 20n
.rt
.RB "An existing group's integer ID or character-string name. Without the" " -D"
option, it defines the new role's primary group membership and defaults to the
default group. You can reset this default value by invoking \fBroleadd
\fB-D \fB-g \fIgroup.\fR
.RE

.sp
.ne 2
.mk
.na
\fB-G\fR \fIgroup\fR
.ad
.RS 20n
.rt
An existing group's integer
.B ID
or character-string name. It defines the
new role's supplementary group membership. Duplicates between
.I group
with
the
.B -g
and
.B -G
.RB "options are ignored. No more than" " NGROUPS_MAX"
groups can be specified.
.RE

.sp
.ne 2
.mk
.na
\fB-k\fR \fIskel_dir\fR
.ad
.RS 20n
.rt
A directory that contains skeleton information (such as \fB\&.profile\fR) that
can be copied into a new role's home directory. This directory must already
exist. The system provides the
.B /etc/skel
directory that can be used for
this purpose.
.RE

.sp
.ne 2
.mk
.na
\fB-K\fR \fIkey=value\fR
.ad
.RS 20n
.rt
A
.I key=value
.RB "pair to add to the role's attributes. Multiple" " -K"
options can be used to add multiple
.I key=value
.RB "pairs. The generic" " -K"
option with the appropriate key can be used instead of the specific implied key
options (\fB-A\fR and
.BR -P ).
See
.BR user_attr (4)
for a list of valid
\fIkey=value\fR pairs. The "type" key is not a valid key for this option. Keys
can not be repeated.
.RE

.sp
.ne 2
.mk
.na
.B -m
.ad
.RS 20n
.rt
Create the new role's home directory if it does not already exist. If the
directory already exists, it must have read, write, and execute permissions by
.IR group ,
where
.I group
is the role's primary group.
.RE

.sp
.ne 2
.mk
.na
.B -o
.ad
.RS 20n
.rt
This option allows a
.B UID
to be duplicated (non-unique).
.RE

.sp
.ne 2
.mk
.na
\fB-P\fR \fIprofile\fR
.ad
.RS 20n
.rt
One or more comma-separated execution profiles defined in
.BR prof_attr (4).
.RE

.sp
.ne 2
.mk
.na
\fB-s\fR \fIshell\fR
.ad
.RS 20n
.rt
Full pathname of the program used as the user's shell on login. It defaults to
an empty field causing the system to use \fB/bin/pfsh\fR as the default. The
value of
.I shell
must be a valid executable file.
.RE

.sp
.ne 2
.mk
.na
\fB-u\fR \fIuid\fR
.ad
.RS 20n
.rt
The
.B UID
of the new role. This
.B UID
must be a non-negative decimal
integer below
.B MAXUID
as defined in
.BR <sys/param.h> \&.
The
.BR UID
defaults to the next available (unique) number above the highest number
currently assigned. For example, if \fBUID\fRs 100, 105, and 200 are assigned,
the next default \fBUID\fR number is 201. (\fBUID\fRs from \fB0\fR-\fB99\fR are
reserved for possible use in future applications.)
.RE

.SH FILES
.sp
.LP
.B /etc/datemsk
.sp
.LP
.B /etc/passwd
.sp
.LP
.B /etc/shadow
.sp
.LP
.B /etc/group
.sp
.LP
.B /etc/skel
.sp
.LP
.B /usr/include/limits.h
.sp
.LP
.B /etc/user_attr
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
_
Interface StabilityEvolving
.TE

.SH SEE ALSO
.sp
.LP
.BR passwd (1),
.BR pfsh (1),
.BR profiles (1),
.BR roles (1),
.BR users (1B),
.BR groupadd (1M),
.BR groupdel (1M),
.BR groupmod (1M),
.BR grpck (1M),
.BR logins (1M),
.BR pwck (1M),
.BR userdel (1M),
.BR usermod (1M),
.BR getdate (3C),
.BR auth_attr (4),
.BR passwd (4),
.BR prof_attr (4),
.BR user_attr (4),
.BR attributes (5)
.SH DIAGNOSTICS
.sp
.LP
In case of an error,
.B roleadd
prints an error message and exits with a
non-zero status.
.sp
.LP
The following indicates that
.B login
specified is already in use:
.sp
.in +2
.nf
UX: roleadd: ERROR: login is already in use. Choose another.
.fi
.in -2
.sp

.sp
.LP
The following indicates that the
.I uid
specified with the
.B -u
option
is not unique:
.sp
.in +2
.nf
UX: roleadd: ERROR: uid \fIuid\fR is already in use. Choose another.
.fi
.in -2
.sp

.sp
.LP
The following indicates that the
.I group
specified with the
.BR -g
option is already in use:
.sp
.in +2
.nf
UX: roleadd: ERROR: group \fIgroup\fR does not exist. Choose another.
.fi
.in -2
.sp

.sp
.LP
The following indicates that the
.I uid
specified with the
.B -u
option
is in the range of reserved \fBUID\fRs (from \fB0\fR-\fB99\fR):
.sp
.in +2
.nf
UX: roleadd: WARNING: uid \fIuid\fR is reserved.
.fi
.in -2
.sp

.sp
.LP
The following indicates that the
.I uid
specified with the
.B -u
option
exceeds
.B MAXUID
as defined in
.BR <sys/param.h> :
.sp
.in +2
.nf
UX: roleadd: ERROR: uid \fIuid\fR is too big. Choose another.
.fi
.in -2
.sp

.sp
.LP
The following indicates that the
.B /etc/passwd
or
.B /etc/shadow
files
do not exist:
.sp
.in +2
.nf
UX: roleadd: ERROR: Cannot update system files - login cannot be created.
.fi
.in -2
.sp

.SH NOTES
.sp
.LP
If a network nameservice such as
.B NIS
or
.B NIS+
is being used to
supplement the local
.B /etc/passwd
file with additional entries,
\fBroleadd\fR cannot change information supplied by the network nameservice.
