usr/src/man/man1m/rolemod.1m
'\" te
.\" Copyright 1989 AT&T Copyright (c) 2009, Sun Microsystems, Inc. All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH rolemod 1M "10 Dec 2008" "SunOS 5.11" "System Administration Commands"
.SH NAME
rolemod \- modify a role's login information on the system
.SH SYNOPSIS
.LP
.nf
\fBrolemod\fR [\fB-u\fR \fIuid\fR [\fB-o\fR]] [\fB-g\fR \fIgroup\fR] [\fB-G\fR \fIgroup\fR [, \fIgroup\fR.\|.\|.]]
     [\fB-d\fR \fIdir\fR [\fB-m\fR]] [\fB-s\fR \fIshell\fR] [\fB-c\fR \fIcomment\fR] [\fB-l\fR \fInew_name\fR]
     [\fB-f\fR \fIinactive\fR] [\fB-e\fR \fIexpire\fR]
     [\fB-A\fR \fIauthorization\fR [, \fIauthorization\fR]]
     [\fB-P\fR \fIprofile\fR [, \fIprofile\fR]] [\fB-K\fR \fIkey=value\fR] \fIrole\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B rolemod
utility modifies a role's login information on the
system. It changes the definition of the specified login and makes the
appropriate login-related system file and file system changes.
.sp
.LP
The system file entries created with this command have a limit of 512
characters per line. Specifying long arguments to several options may exceed
this limit.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB-A\fR \fIauthorization\fR
.ad
.sp .6
.RS 4n
One or more comma separated authorizations as deined in
.BR auth_attr (4).
Only role with
.B grant
rights to the
.B authorization
can assign it
to an account. This replaces any existing authorization setting. If no
authorization list is specified, the existing setting is removed.
.RE

.sp
.ne 2
.mk
.na
\fB-c\fR \fIcomment\fR
.ad
.sp .6
.RS 4n
Specify a comment string.
.I comment
can be any text string. It is
generally a short description of the login, and is currently used as the
field for the user's full name. This information is stored in the user's
\fB/etc/passwd\fR entry.
.RE

.sp
.ne 2
.mk
.na
\fB-d\fR \fIdir\fR
.ad
.sp .6
.RS 4n
Specify the new home directory of the role. It defaults to
.IR base_dir/login ,
where
.I base_dir
is the base directory for new
login home directories, and
.B login
is the new login.
.RE

.sp
.ne 2
.mk
.na
\fB-e\fR \fIexpire\fR
.ad
.sp .6
.RS 4n
Specify the expiration date for a role. After this date, no role will be
able to access this login. The expire option argument is a date entered
using one of the date formats included in the template file
.BR /etc/datemsk .
See
.BR getdate (3C).
.sp
For example, you may enter
.B 10/6/90
or
.BR "October 6, 1990" .
A value
of
.B "`` ''"
defeats the status of the expired date.
.RE

.sp
.ne 2
.mk
.na
\fB-f\fR \fIinactive\fR
.ad
.sp .6
.RS 4n
Specify the maximum number of days allowed between uses of a login
.BR ID
before that login
.B ID
is declared invalid. Normal values are positive
integers. A value of
.B 0
defeats the status.
.RE

.sp
.ne 2
.mk
.na
\fB-g\fR \fIgroup\fR
.ad
.sp .6
.RS 4n
Specify an existing group's integer
.B ID
or character-string name. It
redefines the role's primary group membership.
.RE

.sp
.ne 2
.mk
.na
\fB-G\fR \fIgroup\fR
.ad
.sp .6
.RS 4n
Specify an existing group's integer ID or character string name. It
redefines the role's supplementary group membership. Duplicates between
\fIgroup\fR with the \fB-g\fR and \fB-G\fR options are ignored. No more than
\fBNGROUPS_UMAX\fR groups may be specified as defined in
.BR <param.h> \&.
.RE

.sp
.ne 2
.mk
.na
\fB-K\fR \fIkey=value\fR
.ad
.sp .6
.RS 4n
Replace existing or add to a role's
.I key=value
pair attributes.
Multiple
.B -K
options can be used to replace or add multiple
\fIkey=value\fR pairs. However, keys must not be repeated. The generic
\fB-K\fR option with the appropriate key may be used instead of the specific
implied key options (\fB-A\fR and
.BR -P ).
See
.BR user_attr (4)
for a
list of valid
.I key=value
pairs.
.sp
The keyword
.B type
can be specified with the value
.B role
or the
value
.BR normal .
When using the value
.BR normal ,
the account changes
from a role user to a normal user; using the value
.B role
keeps the
account a role user.
.RE

.sp
.ne 2
.mk
.na
\fB-l\fR \fInew_logname\fR
.ad
.sp .6
.RS 4n
Specify the new login name for the role. The
.I new_logname
argument is
a string no more than eight bytes consisting of characters from the set of
alphabetic characters, numeric characters, period (\fB\&.\fR), underline
(\fB_\fR), and hypen (\fB\(mi\fR). The first character should be alphabetic
and the field should contain at least one lower case alphabetic character. A
warning message will be written if these restrictions are not met. A future
Solaris release may refuse to accept login fields that do not meet these
requirements. The
.I new_logname
argument must contain at least one
character and must not contain a colon (\fB:\fR) or \fBNEWLINE\fR
(\fB\en\fR).
.RE

.sp
.ne 2
.mk
.na
.B -m
.ad
.sp .6
.RS 4n
Move the role's home directory to the new directory specified with the
\fB-d\fR option. If the directory already exists, it must have permissions
read/write/execute by
.IR group ,
where
.I group
is the role's primary
group.
.RE

.sp
.ne 2
.mk
.na
.B -o
.ad
.sp .6
.RS 4n
This option allows the specified
.B UID
to be duplicated (non-unique).
.RE

.sp
.ne 2
.mk
.na
\fB-P\fR \fIprofile\fR
.ad
.sp .6
.RS 4n
One or more comma-separated execution profiles defined in
.BR auth_attr (4).
This replaces any existing profile setting. If no
profile list is specified, the existing setting is removed.
.RE

.sp
.ne 2
.mk
.na
\fB-s\fR \fIshell\fR
.ad
.sp .6
.RS 4n
Specify the full pathname of the program that is used as the role's shell
on login. The value of
.I shell
must be a valid executable file.
.RE

.sp
.ne 2
.mk
.na
\fB-u\fR \fIuid\fR
.ad
.sp .6
.RS 4n
Specify a new
.B UID
for the role. It must be a non-negative decimal
integer less than
.B MAXUID
as defined in
.BR <param.h> \&.
The
\fBUID\fR associated with the role's home directory is not modified with
this option; a role will not have access to their home directory until the
\fBUID\fR is manually reassigned using \fBchown\fR(1).
.RE

.SH OPERANDS
.sp
.LP
The following operands are supported:
.sp
.ne 2
.mk
.na
.B login
.ad
.sp .6
.RS 4n
An existing login name to be modified.
.RE

.SH EXIT STATUS
.sp
.LP
In case of an error,
.B rolemod
prints an error message and exits with
one of the following values:
.sp
.ne 2
.mk
.na
.B 2
.ad
.sp .6
.RS 4n
The command syntax was invalid. A usage message for the \fBrolemod\fR
command is displayed.
.RE

.sp
.ne 2
.mk
.na
.B 3
.ad
.sp .6
.RS 4n
An invalid argument was provided to an option.
.RE

.sp
.ne 2
.mk
.na
.B 4
.ad
.sp .6
.RS 4n
The
.I uid
given with the
.B -u
option is already in use.
.RE

.sp
.ne 2
.mk
.na
.B 5
.ad
.sp .6
.RS 4n
The password files contain an error.
.BR pwconv (1M)
can be used to
correct possible errors. See
.BR passwd (4).
.RE

.sp
.ne 2
.mk
.na
.B 6
.ad
.sp .6
.RS 4n
The login to be modified does not exist, the
.I group
does not exist, or
the login shell does not exist.
.RE

.sp
.ne 2
.mk
.na
.B 8
.ad
.sp .6
.RS 4n
The login to be modified is in use.
.RE

.sp
.ne 2
.mk
.na
.B 9
.ad
.sp .6
.RS 4n
The
.I new_logname
is already in use.
.RE

.sp
.ne 2
.mk
.na
.B 10
.ad
.sp .6
.RS 4n
Cannot update the
.B /etc/group
or
.B /etc/user_attr
file. Other
update requests will be implemented.
.RE

.sp
.ne 2
.mk
.na
.B 11
.ad
.sp .6
.RS 4n
Insufficient space to move the home directory (\fB-m\fR option). Other
update requests will be implemented.
.RE

.sp
.ne 2
.mk
.na
.B 12
.ad
.sp .6
.RS 4n
Unable to complete the move of the home directory to the new home
directory.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/group
.ad
.sp .6
.RS 4n
system file containing group definitions
.RE

.sp
.ne 2
.mk
.na
.B /etc/datemsk
.ad
.sp .6
.RS 4n
system file of date formats
.RE

.sp
.ne 2
.mk
.na
.B /etc/passwd
.ad
.sp .6
.RS 4n
system password file
.RE

.sp
.ne 2
.mk
.na
.B /etc/shadow
.ad
.sp .6
.RS 4n
system file containing users' and roles' encrypted passwords and related
information
.RE

.sp
.ne 2
.mk
.na
.B /etc/user_attr
.ad
.sp .6
.RS 4n
system file containing additional user and role attributes
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
_
Interface StabilityEvolving
.TE

.SH SEE ALSO
.sp
.LP
.BR chown (1),
.BR passwd (1),
.BR users (1B),
.BR groupadd (1M),
.BR groupdel (1M),
.BR groupmod (1M),
.BR logins (1M),
.BR pwconv (1M),
.BR roleadd (1M),
.BR roledel (1M),
.BR useradd (1M),
.BR userdel (1M),
.BR usermod (1M),
.BR getdate (3C),
.BR auth_attr (4),
.BR passwd (4),
.BR attributes (5)
