usr/src/man/man1m/roledel.1m
'\" te
.\" Copyright 1989 AT&T  Copyright (c) 1999, Sun Microsystems, Inc.  All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH roledel 1M "8 Sep 1999" "SunOS 5.11" "System Administration Commands"
.SH NAME
roledel \- delete a role's login from the system
.SH SYNOPSIS
.LP
.nf
\fBroledel\fR [\fB-r\fR] \fIrole\fR
.fi

.SH DESCRIPTION
.sp
.LP
The \fBroledel\fR utility deletes a role account from the system and makes
the appropriate account-related changes to the system file and file system.
\fBroledel\fR also removes the role from each user's list of assumable
roles.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB-r\fR
.ad
.RS 6n
.rt
Remove the role's home directory from the system. This directory must
exist. The files and directories under the home directory will no longer be
accessible following successful execution of the command.
.RE

.SH OPERANDS
.sp
.LP
The following operands are supported:
.sp
.ne 2
.mk
.na
\fIrole\fR
.ad
.RS 8n
.rt
An existing role name to be deleted.
.RE

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
\fB0\fR
.ad
.RS 6n
.rt
Successful completion.
.RE

.sp
.ne 2
.mk
.na
\fB2\fR
.ad
.RS 6n
.rt
Invalid command syntax. A usage message for the \fBroledel\fR command is
displayed.
.RE

.sp
.ne 2
.mk
.na
\fB6\fR
.ad
.RS 6n
.rt
The account to be removed does not exist.
.RE

.sp
.ne 2
.mk
.na
\fB8\fR
.ad
.RS 6n
.rt
The account to be removed is in use.
.RE

.sp
.ne 2
.mk
.na
\fB10\fR
.ad
.RS 6n
.rt
Cannot update the \fB/etc/group\fR or \fB/etc/user_attr\fR file but the
login is removed from the \fB/etc/passwd\fR file.
.RE

.sp
.ne 2
.mk
.na
\fB12\fR
.ad
.RS 6n
.rt
Cannot remove or otherwise modify the home directory.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
\fB/etc/passwd\fR
.ad
.RS 18n
.rt
system password file
.RE

.sp
.ne 2
.mk
.na
\fB/etc/shadow\fR
.ad
.RS 18n
.rt
system file containing roles' encrypted passwords and related information
.RE

.sp
.ne 2
.mk
.na
\fB/etc/group\fR
.ad
.RS 18n
.rt
system file containing group definitions
.RE

.sp
.ne 2
.mk
.na
\fB/etc/user_attr\fR
.ad
.RS 18n
.rt
system file containing additional role attributes
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
lw(2.75i) |lw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.sp
.LP
\fBauths\fR(1), \fBpasswd\fR(1), \fBprofiles\fR(1), \fBroles\fR(1),
\fBusers\fR(1B), \fBgroupadd\fR(1M), \fBgroupdel\fR(1M), \fBgroupmod\fR(1M),
\fBlogins\fR(1M), \fBroleadd\fR(1M), \fBrolemod\fR(1M), \fBuseradd\fR(1M),
\fBuserdel\fR(1M), \fBusermod\fR(1M), \fBpasswd\fR(4), \fBprof_attr\fR(4),
\fBuser_attr\fR(4), \fBattributes\fR(5)
.SH NOTES
.sp
.LP
The \fBroledel\fR utility only deletes an account definition that is in the
local \fB/etc/group\fR, \fB/etc/passwd\fR, \fB/etc/shadow\fR, and
\fB/etc/user_attr\fR file. file. If a network name service such as \fBNIS\fR
or \fBNIS+\fR is being used to supplement the local \fB/etc/passwd\fR file
with additional entries, \fBroledel\fR cannot change information supplied by
the network name service.
