usr/src/man/man1m/route.1m
'\" te
.\" Copyright (C) 2009, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH route 1M "3 Feb 2009" "SunOS 5.11" "System Administration Commands"
.SH NAME
route \- manually manipulate the routing tables
.SH SYNOPSIS
.LP
.nf
\fBroute\fR [\fB-fnvq\fR] \fIsub-command\fR [ [\fImodifiers\fR] \fIargs\fR]
.fi

.LP
.nf
\fBroute\fR [\fB-fnvq\fR] [\fB-p\fR [\fB-R\fR \fIroot-dir\fR]] add | delete [\fImodifiers\fR] \fIdestination\fR \fIgateway\fR
     [\fIargs\fR]
.fi

.LP
.nf
\fBroute\fR [\fB-fnvq\fR] change | get [\fImodifiers\fR] \fIdestination\fR
     [\fIgateway\fR [\fIargs\fR]]
.fi

.LP
.nf
\fBroute\fR [\fB-fn\fR] monitor [\fImodifiers\fR]
.fi

.LP
.nf
\fBroute\fR [\fB-fnvq\fR] flush [\fImodifiers\fR]
.fi

.LP
.nf
\fBroute\fR \fB-p\fR [\fB-R\fR \fIroot-dir\fR] show
.fi

.SH DESCRIPTION
.sp
.LP
.B route
manually manipulates the network routing tables. These tables
are normally maintained by the system routing daemon, such as
.BR in.routed (1M)
and
.BR in.ripngd (1M).
.sp
.LP
.B route
supports a limited number of general options, but a rich
command language. Users can specify an arbitrary request that can be
delivered by means of the programmatic interface discussed in
.BR route (7P).
.sp
.LP
.B route
uses a routing socket and the new message types
.BR RTM_ADD ,
.BR RTM_DELETE ,
.BR RTM_GET ,
and
.BR RTM_CHANGE .
While only superusers
can modify routing tables, the
.B RTM_GET
operation is allowed for
non-privileged users.
.SH OPTIONS
.sp
.ne 2
.mk
.na
.B -f
.ad
.RS 15n
.rt
Flush the routing tables of all gateway entries. If you use the \fB-f\fR
option in conjunction with any of the
.B route
.RB sub-commands, " route"
flushes the gateways before performing the sub-command. Specify the table to
flush by placing the
.B inet
or
.B inet6
modifier immediately after
the \fB-f\fR option. If unspecified, flushing IPv4 (\fBinet\fR) routes is
the default.
.RE

.sp
.ne 2
.mk
.na
.B -n
.ad
.RS 15n
.rt
Prevent attempts to print host and network names symbolically when
reporting actions. This option is useful when name servers are unavailable.

.RE

.sp
.ne 2
.mk
.na
.B -p
.ad
.RS 15n
.rt
Make changes to the network route tables persistent across system restarts.
The operation is applied to the network routing tables first and, if
successful, is then applied to the list of saved routes used at system
startup. In determining whether an operation was successful, a failure to
add a route that already exists or to delete a route that is not in the
routing table is ignored. Particular care should be taken when using host or
network names in persistent routes, as network-based name resolution
services are not available at the time routes are added at startup.
.RE

.sp
.ne 2
.mk
.na
.B -q
.ad
.RS 15n
.rt
Suppress all output.
.RE

.sp
.ne 2
.mk
.na
.B -R
.I root-dir
.ad
.RS 15n
.rt
Specify an alternate root directory where
.B route
applies changes. This
option is ignored unless used in conjunction with the
.B -p
option. When
.B -R
is specified, route changes are applied only to the list of saved
routes to be used at startup,
.B not
to the network routing tables. In
addition, certain checks, such as the existence of network interfaces used
with
.BR -ifp ,
are skipped. This can be useful from within JumpStart
scripts, where the root directory of the system being modified is in a
location other than
.BR / .
.RE

.sp
.ne 2
.mk
.na
.B -v
.ad
.RS 15n
.rt
Print additional details in verbose mode.
.RE

.SS "Subcommands"
.sp
.LP
The following subcommands are supported:
.sp
.ne 2
.mk
.na
.B add
.ad
.RS 11n
.rt
Add a route.
.RE

.sp
.ne 2
.mk
.na
.B change
.ad
.RS 11n
.rt
Change aspects of a route (such as its gateway).
.RE

.sp
.ne 2
.mk
.na
.B delete
.ad
.RS 11n
.rt
Delete a specific route.
.RE

.sp
.ne 2
.mk
.na
.B flush
.ad
.RS 11n
.rt
Remove all gateway entries from the routing table.
.RE

.sp
.ne 2
.mk
.na
.B get
.ad
.RS 11n
.rt
Look up and display the route for a destination.
.RE

.sp
.ne 2
.mk
.na
.B monitor
.ad
.RS 11n
.rt
Continuously report any changes to the routing information base, routing
lookup misses, or suspected network partitionings.
.RE

.sp
.ne 2
.mk
.na
.B show
.ad
.RS 11n
.rt
Display the list of routes to be applied at system startup. Can be used
only in conjunction with the
.B -p
option.
.RE

.sp
.LP
The
.B add
and
.B delete
sub-commands have the following syntax:
.sp
.in +2
.nf
route [ -fnvq ] cmd \fIdestination\fR \fIgateway\fR [metric/netmask]
.fi
.in -2
.sp

.sp
.LP
where
.I cmd
is
.B add
or
.BR delete ,
.I destination
is the
destination host or network, and
.I gateway
is the next-hop intermediary
through which packets should be routed. Modifiers described in
.B OPERANDS
can be placed anywhere on the command line.
.sp
.LP
The
.B get
and
.B change
sub-commands have the following syntax:
.sp
.in +2
.nf
route [ -fnvq ] \fIcmd\fR \fIdestination\fR [\fIgateway\fR [metric/netmask]]
.fi
.in -2
.sp

.sp
.LP
where
.I cmd
is
.B get
or
.BR change ,
.I destination
is the
destination host or network, and
.I gateway
is the next-hop intermediary
through which packets should be routed. Modifiers described in
.B OPERANDS
can be placed anywhere on the command line.
.sp
.LP
The
.B monitor
sub-command has the following syntax:
.sp
.in +2
.nf
route monitor [ -inet | -inet6 ]
.fi
.in -2
.sp

.SH OPERANDS
.sp
.LP
.B route
executes its sub-commands on routes to destinations by way of
gateways.
.SS "Destinations and Gateways"
.sp
.LP
By default, destination and gateway addresses are interpreted as IPv4
addresses. All symbolic names are tried first as a host name, using
.BR getipnodebyname (3SOCKET).
If this lookup fails in the AF_INET case,
.BR getnetbyname (3SOCKET)
interprets the name as that of a network.
.sp
.LP
Including an optional modifier on the command line before the address
changes how the
.B route
sub-command interprets it.
.sp
.LP
The following modifiers are supported:
.sp
.ne 2
.mk
.na
.B -inet
.ad
.RS 10n
.rt
Force the address to be interpreted as an IPv4 address, that is, under the
.B AF_INET
address family.
.RE

.sp
.ne 2
.mk
.na
.B -inet6
.ad
.RS 10n
.rt
Force the address to be interpreted as an IPv6 address, that is, under the
.B AF_INET6
address family.
.RE

.sp
.LP
For IPv4 addresses, routes to a particular host are by default
distinguished from those to a network by interpreting the Internet address
specified as the destination. If the destination has a \fBlocal address
part\fR (that is, the portion not covered by the netmask) of
.BR 0 ,
or if
the destination is resolved as the symbolic name of a network, then the
route is assumed to be to a network; otherwise, it is presumed to be a route
to a host.
.sp
.LP
You can force this selection by using one of the following modifiers:
.sp
.ne 2
.mk
.na
.B -host
.ad
.RS 9n
.rt
Force the destination to be interpreted as a host.
.RE

.sp
.ne 2
.mk
.na
.B -net
.ad
.RS 9n
.rt
Force the destination to be interpreted as a network.
.RE

.sp
.LP
For example:
.sp

.sp
.TS
tab();
cw(2.75i) cw(2.75i)
lw(2.75i) lw(2.75i)
.
DestinationDestination Equivalent
_
\fB128.32\fR\fB-host\fR \fB128.0.0.32\fR
\fB128.32.130\fR\fB-host\fR \fB128.32.0.130\fR
\fB-net\fR \fB128.32\fR\fB128.32.0.0\fR
\fB-net\fR \fB128.32.130\fR\fB128.32.130.0\fR
.TE

.sp
.LP
Two modifiers avoid confusion between addresses and keywords (for example.,
.B host
used as a symbolic host name). You can distinguish a
.I destination
by preceding it with the
.B -dst
modifier. You can
distinguish a gateway address by using the
.B -gateway
modifier. If the
destination is directly reachable by way of an interface requiring no
intermediary IP router to act as a gateway, this can be indicated by using
the \fB\-interface\fR or \fB\-iface\fR modifier.
.sp
.LP
In the following example, the route does not refer to an external gateway
(router), but rather to one of the machine's interfaces. Packets with IP
destination addresses matching the destination and mask on such a route are
sent out on the interface identified by the gateway address. For interfaces
using the ARP protocol, this type of route is used to specify that all
matching destinations are local to the physical link. That is, a host could
be configured to ARP for all addresses, without regard to the configured
interface netmask, by adding a default route using this command. For
example:
.sp
.in +2
.nf
example# route add default \fIhostname\fR -interface
.fi
.in -2
.sp

.sp
.LP
where gateway address
.I hostname
is the name or IP address associated
with the network interface over which all matching packets should be sent.
On a host with a single network interface,
.I hostname
is usually the
same as the
.I nodename
returned by the
.B "uname -n"
command. See
.BR uname (1).
.sp
.LP
For backward compatibility with older systems, directly reachable routes
can also be specified by placing a
.B 0
after the gateway address:
.sp
.in +2
.nf
example# route add default \fIhostname\fR 0
.fi
.in -2
.sp

.sp
.LP
This value was once a route metric, but this metric is no longer used. If
the value is specified as
.BR 0 ,
then the destination is directly
reachable (equivalent to specifying
.BR \-interface ).
If it is
non-zero but cannot be interpreted as a subnet mask, then a gateway is used
(default).
.sp
.LP
With the
.B AF_INET
address family or an IPv4 address, a separate subnet
mask can be specified. This can be specified in one of the following ways:
.RS +4
.TP
.ie t \(bu
.el o
IP address following the gateway address . This is typically specified in
.I decimal dot
notation as for
.BR inet_addr "(3SOCKET) rather than in"
symbolic form.
.RE
.RS +4
.TP
.ie t \(bu
.el o
IP address following the
.B -netmask
qualifier.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Slash character and a decimal length appended to the destination address.
.RE
.sp
.LP
If a subnet mask is not specified, the mask used is the subnet mask of the
output interface selected by the gateway address, if the classful network of
the destination is the same as the classful network of the interface.
Otherwise, the classful network mask for the destination address is used.
.sp
.LP
Each of the following examples creates an IPv4 route to the destination
.B 192.0.2.32
subnet with a subnet mask of
.BR 255.255.255.224 :
.sp
.in +2
.nf
example# route add 192.0.2.32/27 somegateway
example# route add 192.0.2.32 -netmask 255.255.255.224 somegateway
example# route add 192.0.2.32 somegateway 255.255.255.224
.fi
.in -2
.sp

.sp
.LP
For IPv6, only the slash format is accepted. The following example creates
an IPv6 route to the destination \fB33fe::\fR with a netmask of \fB16\fR
one-bits followed by 112 zero-bits.
.sp
.in +2
.nf
example# route add -inet6 3ffe::/16 somegateway
.fi
.in -2
.sp

.sp
.LP
In cases where the gateway does not uniquely identify the output interface
(for example, when several interfaces have the same address), you can use
the \fB-ifp\fR \fIifname\fR modifier to specify the interface by name.  For
example, \fB-ifp lo0\fR associates the route with the \fBlo0\fR
interface. If the named interface is an underlying interface in an IPMP (IP
multipathing) group, then requests to add a route will automatically be
translated to the corresponding IPMP IP interface, and requests to delete or
change a route on an underlying interface will fail.
.SS "Routing Flags"
.sp
.LP
Routes have associated flags that influence operation of the protocols when
sending to destinations matched by the routes. These flags can be set (and
in some cases cleared, indicated by
.BR ~ )
by including the following
modifiers on the command line:
.sp

.sp
.TS
tab();
cw(1.32i) cw(1.24i) cw(2.94i)
lw(1.32i) lw(1.24i) lw(2.94i)
.
ModifierFlagDescription
_
\fB-interface\fR\fB~RTF_GATEWAY\fRDestination is directly reachable
\fB-iface\fR\fB~RTF_GATEWAY\fRAlias for interface modifier
\fB-static\fR\fBRTF_STATIC\fRManually added route
\fB-nostatic\fR\fB~RTF_STATIC\fRT{
Pretend route was added by kernel or routing daemon
T}
\fB-reject\fR\fBRTF_REJECT\fREmit an ICMP unreachable when matched
\fB-blackhole\fR\fBRTF_BLACKHOLE\fRSilently discard packets duing updates
\fB-proto1\fR\fBRTF_PROTO1\fRSet protocol specific routing flag #1
\fB-proto2\fR\fBRTF_PROTO2\fRSet protocol specific routing flag #2
\fB-private\fR\fBRTF_PRIVATE\fRDo not advertise this route
\fB-multirt\fR\fBRTF_MULTIRT\fRCreates the specified redundant route
\fB-setsrc\fR\fBRTF_SETSRC\fRAssigns the default source address
.TE

.sp
.LP
The optional modifiers
.BR -rtt ,
.BR -rttvar ,
.BR -sendpipe ,
.BR -recvpipe ,
.BR -mtu ,
.BR -hopcount ,
.BR -expire ,
and
.B -ssthresh
provide initial values to quantities maintained in the
routing entry by transport level protocols, such as
.BR TCP .
These can be
individually locked either by preceding each modifier to be locked by the
.B -lock
meta-modifier, or by specifying that all ensuing metrics can be
locked by the
.B -lockrest
meta-modifier.
.sp
.LP
Some transport layer protocols can support only some of these metrics. The
following optional modifiers are supported:
.sp
.ne 2
.mk
.na
.B -expire
.ad
.RS 13n
.rt
Lifetime for the entry. This optional modifier is not currently
supported.
.RE

.sp
.ne 2
.mk
.na
.B -hopcount
.ad
.RS 13n
.rt
Maximum hop count. This optional modifier is not currently supported.
.RE

.sp
.ne 2
.mk
.na
.B -mtu
.ad
.RS 13n
.rt
Maximum MTU in bytes.
.RE

.sp
.ne 2
.mk
.na
.B -recvpipe
.ad
.RS 13n
.rt
Receive pipe size in bytes.
.RE

.sp
.ne 2
.mk
.na
.B -rtt
.ad
.RS 13n
.rt
Round trip time in microseconds.
.RE

.sp
.ne 2
.mk
.na
.B -rttvar
.ad
.RS 13n
.rt
Round trip time variance in microseconds.
.RE

.sp
.ne 2
.mk
.na
.B -sendpipe
.ad
.RS 13n
.rt
Send pipe size in bytes.
.RE

.sp
.ne 2
.mk
.na
.B -ssthresh
.ad
.RS 13n
.rt
Send pipe size threshold in bytes.
.RE

.sp
.ne 2
.mk
.na
.B -secattr
.ad
.RS 13n
.rt
Security attributes of the route. This modifier is available only if the
system is configured with the Solaris Trusted Extensions feature.
.sp
The
.B -secattr
modifier has the following format:
.sp
.in +2
.nf
min_sl=\fIval\fR,max_sl=\fIval\fR,doi=\fIval\fR,cipso
.fi
.in -2

or:
.sp
.in +2
.nf
sl=VAL,doi=VAL,cipso
.fi
.in -2

In the first form, above, the
.I val
for
.B min_sl
and
.BR max_sl
is a sensitivity label in either hex or string form. The
.I val
for
.B doi
is a non-negative integer. The route will apply only for packets
with the same domain of interpretation as defined by the
.B doi
value and
within the accreditation range defined by the
.B min_sl
and
.BR max_sl
values. The
.B cipso
keyword is optional and set by default. Valid
.BR min_sl ,
.B max_sl
and
.B doi
keyword/value pairs are mandatory.
Note that if
.I val
contains a space, it must be protected by double
quotes.
.sp
The second form, above, is equivalent to specifying the first form with the
same
.B VAL
for
.B min_sl
and
.BR max_sl .
The second form should be
used for the
.B get
command, because
.B get
uses only a single
sensitivity label.
.RE

.SS "Compatibility"
.sp
.LP
The modifiers
.B host
and
.B net
are taken to be equivalent to
.B -host
and
.BR -net .
To specify a symbolic address that
matches one of these names, use the
.B dst
or
.B gateway
keyword to
.RB "distinguish it. For example:" " -dst host"
.sp
.LP
The following two flags are also accepted for compatibility with older
systems, but have no effect.
.sp

.sp
.TS
tab();
cw(2.84i) cw(2.66i)
lw(2.84i) lw(2.66i)
.
ModifierFlag
_
\fB-cloning\fRRTF_CLONING
\fB-xresolve\fRRTF_XRESOLVE
.TE

.sp
.LP
The
.B "-ifa hostname"
modifier is also accepted, but has no
effect.
.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/defaultrouter
.ad
.RS 22n
.rt
List of default routers
.RE

.sp
.ne 2
.mk
.na
.B /etc/hosts
.ad
.RS 22n
.rt
List of host names and net addresses
.RE

.sp
.ne 2
.mk
.na
.B /etc/networks
.ad
.RS 22n
.rt
List of network names and addresses
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.sp
.LP
.BR uname (1),
.BR in.ripngd (1M),
.BR in.routed (1M),
.BR netstat (1M),
.BR routed (1M),
.BR ioctl (2),
.BR getipnodebyname (3SOCKET),
.BR getnetbyname (3SOCKET),
.BR inet_addr (3SOCKET),
.BR defaultrouter (4),
.BR hosts (4),
.BR networks (4),
.BR attributes (5),
.BR ARP (7P),
.BR ip (7P),
.BR route (7P),
.BR routing (7P)
.SH DIAGNOSTICS
.sp
.ne 2
.mk
.na
\fBadd\fR [ \fBhost\fR\||\ \fBnetwork\|]\fR
\fIdestination\fR:\fIgateway flags\fR
.ad
.sp .6
.RS 4n
The specified route is being added to the tables. The values printed are
from the routing table entry supplied in the
.BR ioctl (2)
call. If the
gateway address used was not the primary address of the gateway (the first
one returned by
.BR getipnodebyname "(3SOCKET)) the gateway address is"
printed numerically as well as symbolically.
.RE

.sp
.ne 2
.mk
.na
\fBdelete\fR [ \fBhost\fR\||\ \fBnetwork\fR\|]
\fIdestination\fR:\fIgateway flags\fR
.ad
.br
.na
\fBchange\fR [ \fBhost\fR\||\ \fBnetwork\fR\|]
\fIdestination\fR:\fIgateway flags\fR
.ad
.sp .6
.RS 4n
As
.BR add ,
but when deleting or changing an entry.
.RE

.sp
.ne 2
.mk
.na
.I destination
.B done
.ad
.sp .6
.RS 4n
When the \fB-f\fR flag is specified, or the \fBflush\fR sub-command is
used, each routing table entry deleted is indicated with a message of this
form.
.RE

.sp
.ne 2
.mk
.na
.B Network is unreachable
.ad
.sp .6
.RS 4n
An attempt to add a route failed because the gateway listed was not on a
directly-connected network. Give the next-hop gateway instead.
.RE

.sp
.ne 2
.mk
.na
.B not in table
.ad
.sp .6
.RS 4n
A
.B delete
operation was attempted for an entry that is not in the
table.
.RE

.sp
.ne 2
.mk
.na
.B entry exists
.ad
.sp .6
.RS 4n
An
.B add
operation was attempted for a route that already exists in the
kernel.
.RE

.sp
.ne 2
.mk
.na
.B routing table overflow
.ad
.sp .6
.RS 4n
An operation was attempted, but the system was unable to allocate memory to
create the new entry.
.RE

.sp
.ne 2
.mk
.na
.B insufficient privileges
.ad
.sp .6
.RS 4n
An attempt to add, delete, change, or flush a route failed because the
calling process does not have appropriate privileges.
.RE

.SH NOTES
.sp
.LP
Specifying that destinations are local (with the \fB-interface\fRmodifier)
assumes that the routers implement
.BR "proxy ARP" ,
meaning that they
respond to ARP queries for all reachable destinations. Normally, using
either router discovery or RIP is more reliable and scalable than using
proxy ARP. See \fBin.routed\fR(1M) for information related to RIP.
.sp
.LP
Combining the all destinations are local route with subnet or network
routes can lead to unpredictable results. The search order as it relates to
the all destinations are local route are undefined and can vary from release
to release.
