usr/src/man/man1m/rpc.yppasswdd.1m
'\" te
.\" Copyright (c) 2004, Sun Microsystems, Inc. All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH rpc.yppasswdd 1M "24 Aug 2004" "SunOS 5.11" "System Administration Commands"
.SH NAME
rpc.yppasswdd, yppasswdd \- server for modifying NIS password file
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/netsvc/yp/rpc.yppasswdd\fR [\fB-D\fR \fIdirectory\fR]
     [\fB-nogecos\fR] [\fB-noshell\fR] [\fB-nopw\fR]
     [\fB-m\fR \fIargument1\fR \fIargument2\fR.\|.\|.]
.fi

.LP
.nf
\fB/usr/lib/netsvc/yp/rpc.yppasswdd\fR
     [\fIpasswordfile\fR [\fIadjunctfile\fR]]
     [\fB-nogecos\fR] [\fB-noshell\fR] [\fB-nopw\fR]
     [\fB-m\fR \fIargument1\fR \fIargument2\fR.\|.\|.]
.fi

.SH DESCRIPTION
.sp
.LP
\fBrpc.yppasswdd\fR is a server that handles password change requests from
.BR yppasswd (1).
It changes a password entry in the
.BR passwd ,
.BR shadow ,
and
.B security/passwd.adjunct
files. The
.B passwd
and
\fBshadow\fR files provide the basis for the \fBpasswd.byname\fR and
\fBpasswd.byuid\fR maps. The \fBpasswd.adjunct\fR file provides the basis
for the
.B passwd.adjunct.byname
and
.B passwd.adjunct.byuid
maps.
Entries in the
.BR passwd ,
\fBshadow\fR or \fBpasswd.adjunct\fR files are
changed only if the password presented by
.BR yppasswd (1)
matches the
encrypted password of the entry. All password files are located in the
\fBPWDIR\fR directory.
.sp
.LP
If the
.B -D
option is given, the
.BR passwd ,
\fBshadow,\fR or
\fBpasswd.adjunct\fR files are placed under the directory path that is the
argument to
.BR -D .
.sp
.LP
If the
.BR -noshell ,
\fB-nogecos\fR or \fB-nopw\fR options are given,
these fields cannot be changed remotely using
.BR chfn ,
.BR chsh ,
or
.BR passwd (1).
.sp
.LP
If the
.B -m
option is given, a \fBmake\fR(1S) is performed in
\fB/var/yp\fR after any of the
.BR passwd ,
.BR shadow ,
or
\fBpasswd.adjunct\fR files are modified. All arguments following the flag
are passed to
.BR make .
.sp
.LP
The second of the listed syntaxes is provided only for backward
compatibility. If the second syntax is used, the \fBpasswordfile\fR is the
full pathname of the password file and \fBadjunctfile\fR is the full
pathname of the optional
.B passwd.adjunct
file. If a shadow file is
found in the same directory as
.BR passwordfile ,
the
.B shadowfile
is
used as described above. Use of this syntax and the discovery of a
\fBshadowfile\fR file generates diagnostic output. The daemon, however,
starts normally.
.sp
.LP
The first and second syntaxes are mutually exclusive. You cannot specify
the full pathname of the
.BR passwd ,
\fBpasswd.adjunct\fR files and use
the
.B -D
option at the same time.
.sp
.LP
The daemon is started automatically on the master server of the passwd map
by
.BR ypstart "(1M), which is invoked at boot time by the"
\fBsvcs:/network/nis/server:default\fR service.
.sp
.LP
The server does not insist on the presence of a
.B shadow
file unless
there is no
.B -D
option present or the directory named with the
.BR -D
option is
.BR /etc .
In addition, a
.B passwd.adjunct
file is not
necessary. If the
.B -D
option is given, the server attempts to find a
\fBpasswd.adjunct\fR file in the \fBsecurity\fR subdirectory of the named
directory. For example, in the presence of
.B "-D /var/yp"
the server
checks for a
.B /var/yp/security/passwd.adjunct
file.
.sp
.LP
If only a
.B passwd
file exists, then the encrypted password is expected
in the second field. If both a
.B passwd
and a
.B passwd.adjunct
file
exist, the encrypted password is expected in the second field of the adjunct
file with
.I ##username
in the second field of the
.B passwd
file. If
all three files are in use, the encrypted password is expected in the
\fBshadow\fR file. Any deviation causes a password update to fail.
.sp
.LP
If you remove or add a
.B shadow
or
.B passwd.adjunct
file after
\fBrpc.yppasswdd\fR has started, you must stop and restart the daemon to
enable it to recognize the change. See \fBypstart\fR(1m) for information on
restarting the daemon.
.sp
.LP
The
.B rpc.yppasswdd
daemon considers a shell that has a name that
begins with 'r' to be a restricted shell. By default, the daemon does not
check whether a shell begins with an '\fBr\fR'. However, you can tell it to
do so by uncommenting the
.B check_restricted_shell_name=1
line in
\fB/etc/default/yppasswdd\fR. The result will be to restrict a user's
ability to change from his default shell. See
.BR yppasswdd (4).
.sp
.LP
On start up,
.B yppasswdd
checks for the existence of a NIS to LDAP
(N2L) configuration file,
.BR /var/yp/NISLDAPmapping .
If the configuration
file is present, the daemon runs in N2L mode. If the file is not present,
\fByppasswdd\fR runs in traditional, non-N2L mode.
.sp
.LP
In N2L mode, changes are written directly to the Directory Information Tree
(DIT). If the changes are written successfully, the NIS map is updated. The
NIS source files,
.BR passwd ,
.BR shadow ,
and
.BR passwd.adjunct ,
for
example, are not updated. Thus, in N2L mode, the
.B -D
option is
meaningless. In N2L mode,
.B yppasswdd
propagates changes by calling
.BR yppush (1M)
instead of
.BR ypmake "(1M). The"
.B -m
option is thus
unused.
.sp
.LP
During an NIS-to-LDAP transition, the
.B yppasswdd
daemon uses the
N2L-specific map,
.BR ageing.byname ,
to read and write password aging
information to the DIT. If you are not using password aging, then the
\fBageing.byname\fR mapping is ignored.
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWypu
.TE

.SH SEE ALSO
.sp
.LP
.BR svcs (1),
.BR make (1S),
.BR passwd (1),
.BR yppasswd (1),
.BR inetd (1M),
.BR svcadm (1M),
.BR ypmake (1M),
.BR yppush (1M),
.BR ypstart (1M),
.BR NISLDAPmapping (4),
.BR passwd (4),
.BR shadow (4),
.BR ypfiles (4),
.BR yppasswdd (4),
.BR ypserv (4),
.BR attributes (5),
.BR smf (5)
.SH NOTES
.sp
.LP
If
.B make
has not been installed and the
.B -m
option is given, the
daemon outputs a warning and proceeds, effectively ignoring the \fB-m\fR
flag.
.sp
.LP
When using the
.B -D
.RB "option, you should make sure that the" " PWDIR"
of the \fB/var/yp/Makefile\fR is set accordingly.
.sp
.LP
The second listed syntax is supplied only for backward compatibility and
might be removed in a future release of this daemon.
.sp
.LP
The Network Information Service (\fBNIS\fR) was formerly known as Sun
Yellow Pages
.RB ( YP ).
The functionality of the two remains the same; only
the name has changed. The name Yellow Pages is a registered trademark in the
United Kingdom of British Telecommunications PLC, and cannot be used without
permission.
.sp
.LP
The NIS server service is managed by the service management facility,
\fBsmf\fR(5), under the service identifier:
.sp
.in +2
.nf
svcs:/network/nis/server:default
.fi
.in -2
.sp

.sp
.LP
Administrative actions on this service, such as enabling, disabling, or
requesting restart, can be performed using
.BR svcadm (1M).
The service's
status can be queried using the
.BR svcs (1)
command.
