usr/src/man/man1m/rpc.smserverd.1m
'\" te
.\" Copyright (c) 2004, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH rpc.smserverd 1M "1 Mar 2007" "SunOS 5.11" "System Administration Commands"
.SH NAME
rpc.smserverd \- removable media device server
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/smedia/rpc.smserverd\fR
.fi

.SH DESCRIPTION
.sp
.LP
.B rpc.smserverd
is a server that handles requests from client
applications, such as volume management software, for access to removable
media devices. In addition to volume management software,
.BR rmformat (1)
and the CDE Filemanager (when performing removable media operations) are
.B rpc.smserverd
clients. The
.B rpc.smserverd
daemon is started by
.BR inetd (1M)
when a client makes a call to a Solaris-internal library to
access a SCSI, IDE, or USB device. The daemon is not started if a client
attempts to access a  floppy or PCMCIA device. Once started, the daemon
remains active until such time as it is idle for three minutes or more.
.sp
.LP
The
.B rpc.smserverd
daemon is provided for the exclusive use of the
client applications mentioned above. It has no external, customer-accessible
interfaces, including no configuration file.
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWvolu
.TE

.SH SEE ALSO
.sp
.LP
.BR svcs (1),
.BR inetadm (1M),
.BR inetd (1M),
.BR svcadm (1M),
.BR attributes (5),
.BR smf (5)
.SH NOTES
.sp
.LP
The
.B rpc.smserverd
service is managed by the service management
facility,
.BR smf (5),
under the service identifier:
.sp
.in +2
.nf
svc:/network/rpc/smserver
.fi
.in -2
.sp

.sp
.LP
Administrative actions on this service, such as enabling, disabling, or
requesting restart, can be performed using
.BR svcadm (1M).
Responsibility
for initiating and restarting this service is delegated to
.BR inetd (1M).
Use
.BR inetadm (1M)
to make configuration changes and to view
configuration information for this service. The service's status can be
queried using the
.BR svcs (1)
command.
