usr/src/man/man1m/rpc.nisd.1m
'\" te
.\" Copyright (C) 2004, Sun Microsystems, Inc. All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH rpc.nisd 1M "13 Aug 2004" "SunOS 5.11" "System Administration Commands"
.SH NAME
rpc.nisd, nisd \- NIS+ service daemon
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/rpc.nisd\fR [\fB-ACDFhlv\fR] [\fB-Y\fR [\fB-B\fR [\fB-t\fR \fInetid\fR]]]
     [\fB-d\fR \fIdictionary\fR] [\fB-L\fR \fIload\fR] [\fB-S\fR \fIlevel\fR] [\fB-m\fR \fImappingfile\fR]
     [\fB-x\fR \fIattribute=value\fR].\|.\|. [\fB-z\fR \fInumber\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The \fBrpc.nisd\fR daemon is an RPC service that implements the NIS+
service. This daemon must be running on all machines that serve a portion of
the NIS+ namespace.
.sp
.LP
\fBrpc.nisd\fR is usually started from a system startup script.
.sp
.LP
The \fB-B\fR option causes \fBrpc.nisd\fR to start an auxiliary process,
\fBrpc.nisd_resolv\fR, which provides ypserv compatible DNS forwarding for
NIS host requests. \fBrpc.nisd_resolv\fR can also be started independently.
See \fBrpc.nisd_resolv\fR(1M) for more information on using
\fBrpc.nisd_resolv\fR independently.
.sp
.LP
The \fB/etc/default/rpc.nisd\fR file contains the following default
parameter settings. See \fBFILES\fR.
.sp
.ne 2
.mk
.na
\fBENABLE_NIS_YP_EMULATION\fR
.ad
.RS 27n
.rt
Specifies whether the server is put into NIS (YP) compatibility mode.
\fBENABLE_NIS_YP_EMULATION=YES\fR is equivalent to the \fB-Y\fR command-line
option. The default value for \fBENABLE_NIS_YP_EMULATION\fR is \fBNO\fR.
.RE

.SH OPTIONS
.sp
.ne 2
.mk
.na
\fB-A\fR
.ad
.RS 22n
.rt
Authentication verbose mode. The daemon logs all the authentication related
activities to \fBsyslogd\fR(1M) with \fBLOG_INFO\fR priority.
.RE

.sp
.ne 2
.mk
.na
\fB-B\fR
.ad
.RS 22n
.rt
Provide ypserv compatible DNS forwarding for NIS host requests. The DNS
resolving process, \fBrpc.nisd_resolv\fR, is started and controlled by
\fBrpc.nisd\fR. This option requires that the \fB/etc/resolv.conf\fR file be
setup for communication with a DNS nameserver. The \fBnslookup\fR utility
can be used to verify communication with a DNS nameserver. See
\fBresolv.conf\fR(4) and \fBnslookup\fR(1M).
.RE

.sp
.ne 2
.mk
.na
\fB-C\fR
.ad
.RS 22n
.rt
Open diagnostic channel on \fB/dev/console\fR.
.RE

.sp
.ne 2
.mk
.na
\fB-D\fR
.ad
.RS 22n
.rt
Debug mode. Do not fork.
.RE

.sp
.ne 2
.mk
.na
\fB-d\fR \fIdictionary\fR
.ad
.RS 22n
.rt
Specify an alternate dictionary for the \fBNIS+\fR database. The primary
use of this option is for testing. Note that the string is not interpreted,
rather it is simply passed to the \fBdb_initialize\fR function.>
.RE

.sp
.ne 2
.mk
.na
\fB-F\fR
.ad
.RS 22n
.rt
Force the server to do a checkpoint of the database when it starts up.
Forced checkpoints may be required when the server is low on disk space.
This option removes updates from the transaction log that have propagated to
all of the replicas.
.RE

.sp
.ne 2
.mk
.na
\fB-h\fR
.ad
.RS 22n
.rt
Print list of options.
.RE

.sp
.ne 2
.mk
.na
\fB-L\fR \fInumber\fR
.ad
.RS 22n
.rt
Specify the ``load'' the \fBNIS+\fR service is allowed to place on the
server. The load is specified in terms of the \fInumber\fR of child
processes that the server may spawn. The value of \fInumber\fR must be at
least 1 for the callback functions to work correctly. The default is 128.
.RE

.sp
.ne 2
.mk
.na
\fB-m\fR \fImappingfile\fR
.ad
.RS 22n
.rt
Specify the name of a configuration file that maps NIS+ objects (especially
tables and columns) to LDAP (entries and attributes). See
\fBNIS+LDAPmapping\fR(4). The default path is \fB/var/nis\fR. The default
mapping file is \fBNIS+LDAPmapping\fR. If this file exists, the
\fBrpc.nisd\fR daemon will map data to and from LDAP. A template mapping
file that covers the normal NIS+ directories and tables is installed as
\fB/var/nis/NIS+LDAPmapping.template\fR.
.sp
A NIS+ object must have a valid mapping entry in the mapping file in order
to have data for that table read from or written to the LDAP repository.
.sp
The \fBrpc.nisd\fR(4) file contains specifications for LDAP server
addresses, LDAP authentication method, and the like. See
\fBNIS+LDAPmapping\fR(4) for an overview of the setup you need to map NIS+
data to or from LDAP.
.RE

.sp
.ne 2
.mk
.na
\fB-S\fR \fIlevel\fR
.ad
.RS 22n
.rt
Set the authorization security level of the service. The argument is a
number between 0 and 2. By default, the daemon runs at security level 2.
.sp
.ne 2
.mk
.na
\fB0\fR
.ad
.RS 5n
.rt
Security level 0 is designed to be used for testing and initial setup of
the NIS+ namespace. When running at level 0, the daemon does not enforce any
access controls. Any client is allowed to perform any operation, including
updates and deletions.
.RE

.sp
.ne 2
.mk
.na
\fB1\fR
.ad
.RS 5n
.rt
At security level 1, the daemon accepts both  \fBAUTH_SYS\fR and
\fBAUTH_DES\fR credentials for authenticating clients and authorizing them
to perform NIS+ operations. This is not a secure mode of operation since
\fBAUTH_SYS\fR credentials are easily forged.  It should not be used on
networks in which any untrusted users may potentially have access.
.RE

.sp
.ne 2
.mk
.na
\fB2\fR
.ad
.RS 5n
.rt
At security level 2, the daemon only accepts authentication using the
security mechanisms configured by \fBnisauthconf\fR(1M). The default
security mechanism is \fBAUTH_DES\fR. Security level 2 is the default if the
\fB-S\fR option is not used.
.RE

.RE

.sp
.ne 2
.mk
.na
\fB-t\fR \fInetid\fR
.ad
.RS 22n
.rt
Use \fInetid\fR as the transport for communication between \fBrpc.nisd\fR
and \fBrpc.nisd_resolv\fR. The default transport is \fBticots\fR(7D) (
\fBtcp\fR on SunOS 4.x systems).
.RE

.sp
.ne 2
.mk
.na
\fB-v\fR
.ad
.RS 22n
.rt
Verbose. With this option, the daemon sends a running narration of what it
is doing to the syslog daemon (see \fBsyslogd\fR(1M)) at \fBLOG_INFO\fR
priority. This option is most useful for debugging problems with the
service. See also \fB-A\fR option.
.RE

.sp
.ne 2
.mk
.na
\fB-x\fR \fIattribute=value\fR
.ad
.RS 22n
.rt
Specify the value of the named \fIattribute\fR. Attributes that control the
NIS+ to LDAP mapping operation are derived as follows:
.RS +4
.TP
1.
Retrieve from LDAP.
.RE
.RS +4
.TP
2.
Override with values from the \fImappingfile\fR, if any. See the \fB-m\fR
option.
.RE
.RS +4
.TP
3.
Override with values from the command line \fB-x\fR options.
.RE
See \fBNIS+LDAPmapping\fR(4) and \fBrpc.nisd\fR(4) for the recognized
attributes and their syntax.
.sp
As a special case, you can use the \fBnisplusLdapConfig*\fR attributes to
derive additional information from LDAP. You can only specify the
\fBnisplusLdapConfig*\fR attributes in \fBrpc.nisd\fR(4) or by means of the
command line.
.RE

.sp
.ne 2
.mk
.na
\fB-Y\fR
.ad
.RS 22n
.rt
Put the server into NIS (YP) compatibility mode. When operating in this
mode, the NIS+ server will respond to NIS Version 2 requests using the
version 2 protocol. Because the YP protocol is not authenticated, only those
items that have read access to nobody (the unauthenticated request) will be
visible through the V2 protocol. It supports only the standard Version 2
maps in this mode (see \fB-B\fR option and \fBNOTES\fR in \fBypfiles\fR(4)).
See \fBFILES\fR.
.RE

.sp
.ne 2
.mk
.na
\fB-z\fR \fInumber\fR
.ad
.RS 22n
.rt
Specify the maximum RPC record size that can be used over connection
oriented transports. The default is 9000 bytes. If you specify a size less
than the default value, the default value will be used instead.
.RE

.SH EXAMPLES
.LP
\fBExample 1 \fRSetting up the NIS+ Service
.sp
.LP
The following example sets up the NIS+ service.

.sp
.in +2
.nf
example% \fBrpc.nisd\fR
.fi
.in -2
.sp

.LP
\fBExample 2 \fRSetting Up NIS+ Service Emulating YP With DNS Forwarding
.sp
.LP
The following example sets up the NIS+ service, emulating YP with DNS
forwarding.

.sp
.in +2
.nf
example% \fBrpc.nisd -YB\fR
.fi
.in -2
.sp

.LP
\fBExample 3 \fRSpecifying NIS+ and LDAP Mapping Information
.sp
.LP
The following example shows how to specify that all additional NIS+ and
LDAP mapping information should be retrieved from DN "dc=x,dc=y,dc=z", from
the LDAP server at IP address 1.2.3.4, port 389. The examples uses the
simple authentication method and the \fBcn=nisplusAdmin,ou=People,\fR proxy
user. The \fB-m\fR option is omitted for clarity in this example..

.sp
.in +2
.nf
-x nisplusLDAPconfigDN=dc=x,dc=y,dc=z \e
-x nisplusLDAPconfigPreferredServerList=127.0.0.1:389 \e
-x nisplusLDAPconfigAuthenticationMethod=simple \e
-x nisplusLDAPconfigProxyUser=cn=nisplusAdmin,ou=People, \e
-x nisplusLDAPconfigProxyPassword=xyzzy
.fi
.in -2
.sp

.SH ENVIRONMENT VARIABLES
.sp
.ne 2
.mk
.na
\fBNETPATH\fR
.ad
.RS 11n
.rt
The transports that the NIS+ service will use can be limited by setting
this environment variable. See \fBnetconfig\fR(4).
.RE

.SH FILES
.sp
.ne 2
.mk
.na
\fB/var/nis/data/parent.object\fR
.ad
.sp .6
.RS 4n
This file describes the namespace that is logically above the NIS+
namespace. The most common type of parent object is a DNS object. This
object contains contact information for a server of that domain.
.RE

.sp
.ne 2
.mk
.na
\fB/var/nis/data/root.object\fR
.ad
.sp .6
.RS 4n
This file describes the root object of the NIS+ namespace. It is a standard
XDR-encoded NIS+ directory object that can be modified by authorized clients
using the \fBnis_modify\fR(3NSL) interface.
.RE

.sp
.ne 2
.mk
.na
\fB/etc/default/rpc.nisd\fR
.ad
.sp .6
.RS 4n
LDAP connection and general \fBrpc.nisd\fR configuration. You can override
some of the settings by command-line options.
.RE

.sp
.ne 2
.mk
.na
\fB/var/nis/NIS+LDAPmapping\fR
.ad
.sp .6
.RS 4n
Default path for LDAP mapping file. See the discussion of the \fB-m\fR
option.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWnisu
.TE

.SH SEE ALSO
.sp
.LP
\fBsvcs\fR(1), \fBnis_cachemgr\fR(1M), \fBnisauthconf\fR(1M),
\fBnisinit\fR(1M), \fBnissetup\fR(1M), \fBnisldapmaptest\fR(1M),
\fBnslookup\fR(1M), \fBrpc.nisd_resolv\fR(1M), \fBrpc.nispasswdd\fR(1M),
\fBsvcadm\fR(1M), \fBsyslogd\fR(1M), \fBnis_modify\fR(3NSL),
\fBNIS+LDAPmapping\fR(4), \fBnetconfig\fR(4), \fBnisfiles\fR(4), \fB
resolv.conf\fR(4), \fBrpc.nisd\fR(4), \fBypfiles\fR(4), \fBattributes\fR(5),
\fBsmf\fR(5), \fBticots\fR(7D)
.SH NOTES
.sp
.LP
NIS+ might not be supported in future releases of the Solaris Operating
system. Tools to aid the migration from NIS+ to LDAP are available in the
current Solaris release. For more information, visit
http://www.sun.com/directory/nisplus/transition.html.
.sp
.LP
The \fBrpc.nisd\fR service is managed by the service management facility,
\fBsmf\fR(5), under the service identifier:
.sp
.in +2
.nf
svc:/network/rpc/nisplus:default
.fi
.in -2
.sp

.sp
.LP
Administrative actions on this service, such as enabling, disabling, or
requesting restart, can be performed using \fBsvcadm\fR(1M). The service's
status can be queried using the \fBsvcs\fR(1) command.
