usr/src/man/man1m/rpc.bootparamd.1m
'\" te
.\" Copyright 1989 AT&T
.\" Copyright (C) 2004, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH rpc.bootparamd 1M "1 Aug 2004" "SunOS 5.11" "System Administration Commands"
.SH NAME
rpc.bootparamd, bootparamd \- boot parameter server
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/rpc.bootparamd\fR [\fB-d\fR]
.fi

.SH DESCRIPTION
.sp
.LP
.B rpc.bootparamd
is a server process that provides information from a
.B bootparams
database to diskless clients at boot time. See
.BR bootparams (4)
.sp
.LP
The source for the
.B bootparams
database is determined by the
.BR nsswitch.conf (4)
file (on the machine running the
.B rpc.bootparamd
process).
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -d
.ad
.RS 6n
.rt
Display debugging information.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/bootparams
.ad
.RS 22n
.rt
boot parameter data base
.RE

.sp
.ne 2
.mk
.na
.B /etc/nsswitch.conf
.ad
.RS 22n
.rt
configuration file for the name-service switch
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWbsu
.TE

.SH SEE ALSO
.sp
.LP
\fBsvcs\fR(1),\fBsvcadm\fR(1M), \fBbootparams\fR(4),
.BR nsswitch.conf (4),
.BR attributes (5),
.BR smf (5)
.SH NOTES
.sp
.LP
A diskless client requires service from at least one
.BR rpc.bootparamd
process running on a server that is on the same IP subnetwork as the
diskless client.
.sp
.LP
Some routines that compare hostnames use case-sensitive string comparisons;
some do not. If an incoming request fails, verify that the case of the
hostname in the file to be parsed matches the case of the hostname called
for, and attempt the request again.
.sp
.LP
The
.B rpc.bootparamd
service is managed by the service management
facility,
.BR smf (5),
under the service identifier:
.sp
.in +2
.nf
svc:/network/rpc/bootparams
.fi
.in -2
.sp

.sp
.LP
Administrative actions on this service, such as enabling, disabling, or
requesting restart, can be performed using
.BR svcadm (1M).
The service's
status can be queried using the
.BR svcs (1)
command.
