usr/src/man/man1m/rpc.mdcommd.1m
'\" te
.\" Copyright (c) 2004, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH rpc.mdcommd 1M "29 Oct 2004" "SunOS 5.11" "System Administration Commands"
.SH NAME
rpc.mdcommd \- multi-node disk set services
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/rpc.mdcommd\fR
.fi

.SH DESCRIPTION
.sp
.LP
.B rpc.mdcommd
is an
.BR rpc (4)
daemon that functions as a server
process.
.B rpc.mdcommd
manages communication among hosts participating
in a multi-node disk set configuration.
.sp
.LP
.B rpc.mdcommd
is invoked by
.BR inetd (1M).
.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 6n
.rt
Successful completion.
.RE

.sp
.ne 2
.mk
.na
.B >0
.ad
.RS 6n
.rt
An error occurred.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWmfu
_
StabilityEvolving
.TE

.SH SEE ALSO
.sp
.LP
.BR svcs (1),
.BR inetadm (1M),
.BR inetd (1M),
.BR metaset (1M),
.BR svcadm (1M),
.BR rpc (3NSL),
.BR rpc (4),
.BR services (4),
.BR attributes (5),
.BR smf (5)
.sp
.LP
\fR
.SH NOTES
.sp
.LP
The
.B rpc.mdcommd
service is managed by the service management
facility,
.BR smf (5),
under the service identifier:
.sp
.in +2
.nf
svc:/network/rpc/mdcomm
.fi
.in -2
.sp

.sp
.LP
Administrative actions on this service, such as enabling, disabling, or
requesting restart, can be performed using
.BR svcadm (1M).
Responsibility
for initiating and restarting this service is delegated to
.BR inetd (1M).
Use \fBinetadm\fR(1M) to make configuration changes and to view
configuration information for this service. The service's status can be
queried using the
.BR svcs (1)
command.
