usr/src/man/man1m/rpc.sprayd.1m
'\" te
.\" Copyright 1989 AT&T  Copyright (c) 2004 Sun Microsystems, Inc. - All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH rpc.sprayd 1M "4 Nov 2004" "SunOS 5.11" "System Administration Commands"
.SH NAME
rpc.sprayd, sprayd \- spray server
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/netsvc/spray/rpc.sprayd\fR
.fi

.SH DESCRIPTION
.sp
.LP
.B rpc.sprayd
is a server that records the packets sent by
.BR spray (1M).
The
.B rpc.sprayd
daemon may be started by
.BR inetd (1M)
or
.BR listen (1M).
.sp
.LP
The service provided by
.B rpc.sprayd
is not useful as a networking
benchmark as it uses unreliable connectionless transports, (udp for
example). It can report a large number of packets dropped when the drops
were caused by the program sending packets faster than they can be buffered
locally (before the packets get to the network medium).
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWrcmds
.TE

.SH SEE ALSO
.sp
.LP
.BR svcs (1),
.BR inetadm (1M),
.BR inetd (1M)
.BR listen (1M),
.BR pmadm (1M),
.BR sacadm (1M),
.BR spray (1M),
.BR svcadm (1M),
.BR attributes (5),
.BR smf (5)
.SH NOTES
.sp
.LP
The
.B rpc.sprayd
service is managed by the service management facility,
.BR smf (5),
under the service identifier:
.sp
.in +2
.nf
svc:/network/rpc/spray:default
.fi
.in -2
.sp

.sp
.LP
Administrative actions on this service, such as enabling, disabling, or
requesting restart, can be performed using
.BR svcadm (1M).
Responsibility
for initiating and restarting this service is delegated to
.BR inetd (1M).
Use \fBinetadm\fR(1M) to make configuration changes and to view
configuration information for this service. The service's status can be
queried using the
.BR svcs (1)
command.
