usr/src/man/man1m/rpc.rexd.1m
'\" te
.\" Copyright (c) 2004, Sun Microsystems, Inc.  All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH rpc.rexd 1M "5 Nov 2004" "SunOS 5.11" "System Administration Commands"
.SH NAME
rpc.rexd, rexd \- RPC-based remote execution server
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/rpc.rexd\fR [\fB-s\fR]
.fi

.SH DESCRIPTION
.sp
.LP
.B rpc.rexd
is the Sun
.B RPC
server for remote program execution.
This daemon is started by
.BR inetd "(1M) whenever a remote execution"
request is made.
.sp
.LP
For non-interactive programs, the standard file descriptors are connected
directly to
.B TCP
connections. Interactive programs involve
pseudo-terminals, in a fashion that is similar to the login sessions
provided by
.BR rlogin (1).
This daemon may use
.B NFS
to mount file
systems specified in the remote execution request.
.sp
.LP
There is a
.B 10240
byte limit for arguments to be encoded and passed
from the sending to the receiving system.
.SH OPTIONS
.sp
.LP
The following option is supported:
.sp
.ne 2
.mk
.na
.B -s
.ad
.RS 6n
.rt
Secure. When specified, requests must have valid
.B DES
credentials. If
the request does not have a
.B DES
credential it is rejected. The default
publickey credential is rejected. Only newer
.BR on (1)
commands send
.B DES
credentials.
.sp
If access is denied with an authentication error, you may have to set your
publickey with the
.BR chkey (1)
command.
.sp
Specifying the
.B -s
option without presenting secure credentials will
.RB "result in an error message:" " Unix too weak auth (DesONly)!"
.RE

.SH SECURITY
.sp
.LP
.B rpc.rexd
uses
.BR pam (3PAM)
for account and session management.
The
.B PAM
configuration policy, listed through
.BR /etc/pam.conf ,
specifies the modules to be used for
.BR rpc.rexd .
Here is a partial
.B pam.conf
file with
.B rpc.rexd
entries for account and session
management using the UNIX module.
.sp
.in +2
.nf
rpc.rexd   account requisite       pam_roles.so.1
rpc.rexd   account required        pam_projects.so.1
rpc.rexd   account required        pam_unix_account.so.1

rpc.rexd      session required      pam_unix_session.so.1
.fi
.in -2

.sp
.LP
If there are no entries for the
.B rpc.rexd
service, the entries for the
"other" service will be used. \fBrpc.rexd\fR uses the \fBgetpwuid()\fR call
to determine whether the given user is a legal user.
.SH FILES
.sp
.ne 2
.mk
.na
.BI /dev/pts n
.ad
.RS 23n
.rt
Pseudo-terminals used for interactive mode
.RE

.sp
.ne 2
.mk
.na
.B /etc/passwd
.ad
.RS 23n
.rt
Authorized users
.RE

.sp
.ne 2
.mk
.na
.B /tmp_rex/rexd??????
.ad
.RS 23n
.rt
Temporary mount points for remote file systems
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWnisu
.TE

.SH SEE ALSO
.sp
.LP
.BR chkey (1),
.BR on (1),
.BR rlogin (1),
.BR svcs (1),
.BR inetadm (1M),
.BR inetd (1M),
.BR svcadm (1M),
.BR pam (3PAM),
.BR pam.conf (4),
.BR publickey (4),
.BR attributes (5),
.BR pam_authtok_check (5),
.BR pam_authtok_get (5),
.BR pam_authtok_store (5),
.BR pam_dhkeys (5),
.BR pam_passwd_auth (5),
.BR pam_unix_account (5),
.BR pam_unix_auth (5),
.BR pam_unix_session (5),
.BR smf (5)
.SH DIAGNOSTICS
.sp
.LP
Diagnostic messages are normally printed on the console, and returned to
the requestor.
.SH NOTES
.sp
.LP
Root cannot execute commands using
.B rexd
client programs such as
.BR on (1).
.sp
.LP
The
.BR pam_unix (5)
module is no longer supported. Similar functionality
is provided by
.BR pam_authtok_check (5),
.BR pam_authtok_get (5),
.BR pam_authtok_store (5),
.BR pam_dhkeys (5),
.BR pam_passwd_auth (5),
.BR pam_unix_account (5),
.BR pam_unix_auth (5),
and
.BR pam_unix_session (5).
.sp
.LP
The
.B rpc.rexd
service is managed by the service management facility,
.BR smf (5),
under the service identifier:
.sp
.in +2
.nf
svc:/network/rpc/rex:default
.fi
.in -2
.sp

.sp
.LP
Administrative actions on this service, such as enabling, disabling, or
requesting restart, can be performed using
.BR svcadm (1M).
Responsibility
for initiating and restarting this service is delegated to
.BR inetd (1M).
Use
.BR inetadm (1M)
to make configuration changes and to view
configuration information for this service. The service's status can be
queried using the
.BR svcs (1)
command.
