usr/src/man/man1m/rpc.rstatd.1m
'\" te
.\" Copyright (c) 2004, Sun Microsystems, Inc. All Rights Reserved.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH rpc.rstatd 1M "4 Nov 2004" "SunOS 5.11" "System Administration Commands"
.SH NAME
rpc.rstatd, rstatd \- kernel statistics server
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/netsvc/rstat/rpc.rstatd\fR
.fi

.SH DESCRIPTION
.sp
.LP
.B rpc.rstatd
is a server which returns performance statistics obtained
from the kernel.
.BR rup (1)
uses
.B rpc.rstatd
to collect the
.B uptime
information that it displays.
.sp
.LP
.B rpc.rstatd
is an RPC service.
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWrcmds
.TE

.SH SEE ALSO
.sp
.LP
.BR rup (1),
.BR svcs (1),
.BR inetadm (1M),
.BR inetd (1M),
.BR svcadm (1M),
.BR services (4),
.BR attributes (5),
.BR smf (5)
.SH NOTES
.sp
.LP
The
.B rpc.rstatd
service is managed by the service management facility,
.BR smf (5),
under the service identifier:
.sp
.in +2
.nf
svc:/network/rpc/rstat:default
.fi
.in -2
.sp

.sp
.LP
Administrative actions on this service, such as enabling, disabling, or
requesting restart, can be performed using
.BR svcadm (1M).
Responsibility
for initiating and restarting this service is delegated to
.BR inetd (1M).
Use \fBinetadm\fR(1M) to make configuration changes and to view
configuration information for this service. The service's status can be
queried using the
.BR svcs (1)
command.
