usr/src/man/man1m/rpc.ypupdated.1m
'\" te
.\" Copyright (C) 2003, Sun Microsystems, Inc. All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH rpc.ypupdated 1M "20 Mar 2003" "SunOS 5.11" "System Administration Commands"
.SH NAME
rpc.ypupdated, ypupdated \- server for changing NIS information
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/netsvc/yp/rpc.ypupdated\fR [\fB-is\fR]
.fi

.SH DESCRIPTION
.sp
.LP
\fBypupdated\fR is a daemon that updates information in the Network
Information Service (NIS). \fBypupdated\fR consults the  \fBupdaters\fR(4)
file in the  \fB/var/yp\fR directory to determine which \fBNIS\fR maps
should be updated and how to change them.
.sp
.LP
By default, the daemon requires the most secure method of authentication
available to it, either \fBDES\fR (secure) or \fBUNIX\fR (insecure).
.sp
.LP
On start up, \fBypupdated\fR checks for the existence of a NIS to LDAP
(N2L) configuration file, \fB/var/yp/NISLDAPmapping\fR. If the file is
present, \fBypupdated\fR generates an informational message and exits.
\fBypupdated\fR is not supported in N2L mode.
.SH OPTIONS
.sp
.ne 2
.mk
.na
\fB-i\fR
.ad
.RS 6n
.rt
Accept \fBRPC\fR calls with the insecure  \fBAUTH_UNIX\fR credentials. This
allows programmatic updating of the \fBNIS\fR maps in all networks.
.RE

.sp
.ne 2
.mk
.na
\fB-s\fR
.ad
.RS 6n
.rt
Accept only calls authenticated using the secure  \fBRPC\fR mechanism
(\fBAUTH_DES\fR authentication). This disables programmatic updating of the
\fBNIS\fR maps unless the network supports these calls.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
\fB/var/yp/updaters\fR
.ad
.RS 26n
.rt
Configuration file for \fBrpc.updated\fR command.
.RE

.sp
.ne 2
.mk
.na
\fB/var/yp/NISLDAPmapping\fR
.ad
.RS 26n
.rt
Configuration file for N2L
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availability SUNWypu
_
Interface StabilityEvolving
.TE

.SH SEE ALSO
.sp
.LP
\fBkeyserv\fR(1M), \fBupdaters\fR(4), \fBNISLDAPmapping\fR(4),
\fBattributes\fR(5)
.sp
.LP
\fR
.SH NOTES
.sp
.LP
The Network Information Service (\fBNIS\fR) was formerly known as Sun
Yellow Pages (\fBYP\fR).  The functionality of the two services remains the
same. Only the name has changed. The name Yellow Pages is a registered
trademark in the United Kingdom of British Telecommunications PLC, and it
must not be used without permission.
