usr/src/man/man1m/rpc.nisd_resolv.1m
'\" te
.\" Copyright (C) 2001, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH rpc.nisd_resolv 1M "12 Dec 2001" "SunOS 5.11" "System Administration Commands"
.SH NAME
rpc.nisd_resolv, nisd_resolv \- NIS+ service daemon
.SH SYNOPSIS
.LP
.nf
\fBrpc.nisd_resolv\fR [\fB-v\fR | \fB-V\fR] [\fB-F\fR [\fB-C\fR \fIfd\fR]] [\fB-t\fR \fIxx\fR] [\fB-p\fR \fIyy\fR]
.fi

.SH DESCRIPTION
.sp
.LP
.B rpc.nisd_resolv
is an auxiliary process which provides
.BR DNS
forwarding service for NIS hosts requests to both
.B ypserv
and
.B rpc.nisd
that are running in the NIS compatibility mode. It is
generally started by invoking
.BR rpc.nisd "(1M) with the"
.B -B
option or
.BR ypserv (1M)
with the
.B -d
option. Although it is not recommended,
.B rpc.nisd_resolv
can also be started independently with the following
options.
.sp
.LP
This command requires that the
.B /etc/resolv.conf
file be setup for
communication with a DNS nameserver. The
.B nslookup
utility can be used
to verify communication with a DNS nameserver. See
.BR resolv.conf (4)
and
.BR nslookup (1M).
.SH OPTIONS
.sp
.ne 2
.mk
.na
.B -F
.ad
.RS 9n
.rt
Run in foreground.
.RE

.sp
.ne 2
.mk
.na
.B -C
.I fd
.ad
.RS 9n
.rt
Use
.I fd
for service xprt (from
.BR nisd ).
.RE

.sp
.ne 2
.mk
.na
.B -v
.ad
.RS 9n
.rt
Verbose. Send output to the syslog daemon.
.RE

.sp
.ne 2
.mk
.na
.B -V
.ad
.RS 9n
.rt
Verbose. Send output to stdout.
.RE

.sp
.ne 2
.mk
.na
.B -t
.I xx
.ad
.RS 9n
.rt
Use transport
.IR xx .
.RE

.sp
.ne 2
.mk
.na
.B -p
.I yy
.ad
.RS 9n
.rt
Use transient program#
.IR yy .
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWnisu
.TE

.SH SEE ALSO
.sp
.LP
.BR nslookup (1M),
.BR rpc.nisd (1M),
.BR resolv.conf (4),
.BR attributes (5)
.SH NOTES
.sp
.LP
NIS+ might not be supported in future releases of the Solaris Operating
system. Tools to aid the migration from NIS+ to LDAP are available in the
current Solaris release. For more information, visit
http://www.sun.com/directory/nisplus/transition.html.
