usr/src/man/man1m/rpc.nispasswdd.1m
'\" te
.\" Copyright (C) 2004, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH rpc.nispasswdd 1M "13 Aug 2004" "SunOS 5.11" "System Administration Commands"
.SH NAME
rpc.nispasswdd, nispasswdd \- NIS+ password update daemon
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/rpc.nispasswdd\fR [\fB-a\fR \fIattempts\fR] [\fB-c\fR \fIminutes\fR] [\fB-D\fR]
     [\fB-g\fR] [\fB-v\fR]
.fi

.SH DESCRIPTION
.sp
.LP
.B rpc.nispasswdd
daemon is an
.B "ONC+ RPC"
service that services
password update requests from
.BR nispasswd (1)
and
.BR yppasswd (1).
It
updates password entries in the NIS+
.B passwd
table.
.sp
.LP
.B rpc.nispasswdd
is normally started from a system startup script after
.RB "the NIS+ server (" rpc.nisd "(1M)) has been started. " rpc.nispasswdd 
will determine whether it is running on a machine that is a master server
for one or more NIS+ directories. If it discovers that the host is not a
master server, then it will promptly exit. It will also determine if
.BR rpc.nisd (1M)
is running in NIS (YP) compatibility mode (the
.BR -Y option)
and will register as
.B yppasswdd
for NIS (YP) clients as
well.
.sp
.LP
.B rpc.nispasswdd
will syslog all failed password update attempts, which
will allow an administrator to determine whether someone was trying to
"crack" the passwords.
.sp
.LP
.B rpc.nispasswdd
has to be run by a superuser.
.SH OPTIONS
.sp
.ne 2
.mk
.na
.B -a
.I attempts
.ad
.RS 15n
.rt
Set the maximum number of attempts allowed to authenticate the caller
within a password update request session. Failed attempts are
.BR syslogd (1M)
and the request is cached by the daemon. After the maximum
number of allowed attempts the daemon severs the connection to the client.
The default value is set to
.BR 3 .
.RE

.sp
.ne 2
.mk
.na
.B -c
.I minutes
.ad
.RS 15n
.rt
Set the number of minutes a failed password update request should be cached
by the daemon. This is the time during which if the daemon receives further
password update requests for the same user and authentication of the caller
fails, then the daemon will simply not respond. The default value is set to
.BR 30 minutes.
.RE

.sp
.ne 2
.mk
.na
.B -D
.ad
.RS 15n
.rt
Debug. Run in debugging mode.
.RE

.sp
.ne 2
.mk
.na
.B -g
.ad
.RS 15n
.rt
Generate
.B DES
credential. By default the
.B DES
credential is not
generated for the user if they do not have one. By specifying this option,
if the user does not have a credential, then one will be generated for them
and stored in the NIS+ cred table.
.RE

.sp
.ne 2
.mk
.na
.B -v
.ad
.RS 15n
.rt
Verbose. With this option, the daemon sends a running narration of what it
is doing to the syslog daemon. This option is useful for debugging
problems.
.RE

.SH EXIT STATUS
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 5n
.rt
success
.RE

.sp
.ne 2
.mk
.na
.B 1
.ad
.RS 5n
.rt
an error has occurred.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWnisu
.TE

.SH SEE ALSO
.sp
.LP
.BR svcs (1),
.BR nispasswd (1),
.BR passwd (1),
.BR yppasswd (1),
.BR rpc.nisd (1M),
.BR syslogd (1M),
.BR svcadm (1M),
.BR nsswitch.conf (4),
.BR attributes (5),
.BR smf (5)
.SH NOTES
.sp
.LP
NIS+ might not be supported in future releases of the Solaris Operating
system. Tools to aid the migration from NIS+ to LDAP are available in the
current Solaris release. For more information, visit
http://www.sun.com/directory/nisplus/transition.html.
.sp
.LP
The
.B rpc.nispasswdd
service is managed by the service management
facility,
.BR smf (5),
under the service identifier:
.sp
.in +2
.nf
 svc:/network/rpc/nisplus:default
.fi
.in -2
.sp

.sp
.LP
Administrative actions on this service, such as enabling, disabling, or
requesting restart, can be performed using
.BR svcadm (1M).
The service's
status can be queried using the
.BR svcs (1)
command.
