usr/src/man/man1m/rpcbind.1m
'\" te
.\" Copyright 1989 AT&T
.\" Copyright (C) 2006, Sun Microsystems, Inc. All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH rpcbind 1M "1 Aug 2006" "SunOS 5.11" "System Administration Commands"
.SH NAME
rpcbind \- universal addresses to RPC program number mapper
.SH SYNOPSIS
.LP
.nf
\fBrpcbind\fR [\fB-d\fR] [\fB-w\fR]
.fi

.SH DESCRIPTION
.sp
.LP
\fBrpcbind\fR is a server that converts \fBRPC\fR program numbers into
universal addresses. It must be running on the host to be able to make
\fBRPC\fR calls on a server on that machine.
.sp
.LP
When an
.B RPC
service is started, it tells
.B rpcbind
the address at
which it is listening, and the
.B RPC
program numbers it is prepared to
serve. When a client wishes to make an
.B RPC
call to a given program
number, it first contacts
.B rpcbind
on the server machine to determine
the address where
.B RPC
requests should be sent.
.sp
.LP
\fBrpcbind\fR should be started before any other \fBRPC\fR service.
Normally, standard
.B RPC
servers are started by port monitors, so
\fBrpcbind\fR must be started before port monitors are invoked.
.sp
.LP
When
.B rpcbind
is started, it checks that certain name-to-address
translation-calls function correctly. If they fail, the network
configuration databases can be corrupt. Since
.B RPC
services cannot
function correctly in this situation,
.B rpcbind
reports the condition
and terminates.
.sp
.LP
\fBrpcbind\fR maintains an open transport end for each transport that it
uses for indirect calls. This is the
.B UDP
port on most systems.
.sp
.LP
The
.B rpcbind
service is managed by the service management facility,
\fBsmf\fR(5), under the service identifier:
.sp
.in +2
.nf
svc:/network/rpc/bind
.fi
.in -2
.sp

.sp
.LP
Administrative actions on this service, such as enabling, disabling, or
requesting restart, can be performed using \fBsvcadm\fR(1M). \fBrpcbind\fR
can only be started by the superuser or someone in the Primary Administrator
role.
.sp
.LP
The configuration properties of this service can be modified with
.BR svccfg (1M).
.sp
.LP
The following SMF property is used to allow or disallow access to
\fBrpcbind\fR by remote clients:
.sp
.in +2
.nf
config/local_only = true
.fi
.in -2

.sp
.LP
The default value,
.BR true ,
shown above, disallows remote access; a
value of \fBfalse\fR allows remove access. See EXAMPLES.
.sp
.LP
The FMRI
.B svc:network/rpc/bind
property group \fBconfig\fR contains
the following property settings:
.sp
.ne 2
.mk
.na
.B enable_tcpwrappers
.ad
.RS 22n
.rt
Specifies that the TCP wrappers facility is used to control access to TCP
services. The value
.B true
enables checking. The default value for
\fBenable_tcpwrappers\fR is
.BR false .
If the
.BR enable_tcpwrappers
parameter is enabled, then all calls to
.B rpcbind
originating from
non-local addresses are automatically wrapped by the TCP wrappers facility.
The
.B syslog
facility code daemon is used to log allowed connections
(using the \fBinfo\fR severity level) and denied traffic (using the
\fBwarning\fR severity level). See
.BR syslog.conf (4)
for a description of
\fBsyslog\fR codes and severity levels. The stability level of the TCP
wrappers facility and its configuration files is External. As the TCP
wrappers facility is not controlled by Sun, intrarelease incompatibilities
are not uncommon. See
.BR attributes (5).
.RE

.sp
.ne 2
.mk
.na
.B verbose_logging
.ad
.RS 22n
.rt
Specifies whether the TCP wrappers facility logs all calls orjust the
denied calls. The default is
.BR false .
This option has no effect if TCP
wrappers are not enabled.
.RE

.sp
.ne 2
.mk
.na
.B allow_indirect
.ad
.RS 22n
.rt
Specifies whether
.B rpcbind
allows indirect calls at all. By default,
\fBrpcbind\fR allows most indirect calls, except to a number of standard
services(\fBkeyserv\fR,
.BR automount ,
.BR mount ,
.BR nfs ,
.BR rquota ,
and selected NIS and
.B rpcbind
procedures). Setting
\fBallow_indirect\fR to \fBfalse\fR causes all indirect calls to be dropped.
The default is
.BR true .
NIS broadcast clients rely on this functionality
on NIS servers.
.RE

.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -d
.ad
.RS 6n
.rt
Run in debug mode. In this mode,
.B rpcbind
does not fork when it
starts. It prints additional information during operation, and aborts on
certain errors. With this option, the name-to-address translation
consistency checks are shown in detail.
.RE

.sp
.ne 2
.mk
.na
.B -w
.ad
.RS 6n
.rt
Do a warm start. If
.B rpcbind
aborts or terminates on
.B SIGINT
or
.BR SIGTERM ,
it writes the current list of registered services to
\fB/var/run/portmap.file\fR and
.BR /var/run/rpcbind.file .
Starting
\fBrpcbind\fR with the \fB-w\fR option instructs it to look for these files
and start operation with the registrations found in them. This allows
\fBrpcbind\fR to resume operation without requiring all \fBRPC\fR services
to be restarted.
.RE

.SH EXAMPLES
.LP
\fBExample 1\fR Allowing Remote Access
.sp
.LP
The following sequence of commands allows remote access to
.BR rpcbind .

.sp
.in +2
.nf
# \fBsvccfg -s svc:/network/rpc/bind setprop config/local_only = false\fR
# \fBsvcadm refresh svc:/network/rpc/bind\fR
.fi
.in -2
.sp

.SH FILES
.sp
.ne 2
.mk
.na
\fB/var/run/portmap.file\fR
.ad
.RS 25n
.rt
Stores the information for
.B RPC
services registered over IP based
transports for warm start purposes.
.RE

.sp
.ne 2
.mk
.na
\fB/var/run/rpcbind.file\fR
.ad
.RS 25n
.rt
Stores the information for all registered
.B RPC
services for warm start
purposes.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
_
Interface StabilitySee below.
.TE

.sp
.LP
TCP wrappers is External.
.SH SEE ALSO
.sp
.LP
\fBsmf\fR(5), \fBrpcinfo\fR(1M), \fBsvcadm\fR(1M), \fBsvccfg\fR(1M),
.BR rpcbind (3NSL),
.BR syslog.conf (4),
.BR attributes (5),
.BR smf (5)
.sp
.LP
For information on the TCP wrappers facility, see the \fBhosts_access(4)\fR
man page, delivered as part of the Solaris operating environment in
\fB/usr/sfw/man\fR and available in the \fBSUNWtcpd\fR package.
.SH NOTES
.sp
.LP
Terminating
.B rpcbind
with
.B SIGKILL
prevents the warm-start files
from being written.
.sp
.LP
All
.B RPC
servers are restarted if the following occurs: \fBrpcbind\fR
crashes (or is killed with
.B SIGKILL)
and is unable to to write the
warm-start files;
.B rpcbind
is started without the
.B -w
option after
a graceful termination. Otherwise, the warm start files are not found by
.BR rpcbind .
