usr/src/man/man1m/rpcinfo.1m
'\" te
.\" Copyright (c) 2001 Sun Microsystems, Inc. All Rights Reserved
.\" Copyright 1989 AT&T
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH rpcinfo 1M "13 Jul 2001" "SunOS 5.11" "System Administration Commands"
.SH NAME
rpcinfo \- report RPC information
.SH SYNOPSIS
.LP
.nf
\fBrpcinfo\fR [\fB-m\fR | \fB-s\fR] [\fIhost\fR]
.fi

.LP
.nf
\fBrpcinfo\fR \fB-p\fR [\fIhost\fR]
.fi

.LP
.nf
\fBrpcinfo\fR \fB-T\fR \fItransport\fR \fIhost\fR \fIprognum\fR [\fIversnum\fR]
.fi

.LP
.nf
\fBrpcinfo\fR \fB-l\fR [\fB-T\fR \fItransport\fR] \fIhost\fR \fIprognum\fR \fIversnum\fR
.fi

.LP
.nf
\fBrpcinfo\fR [\fB-n\fR \fIportnum\fR] \fB-u\fR \fIhost\fR \fIprognum\fR [\fIversnum\fR]
.fi

.LP
.nf
\fBrpcinfo\fR [\fB-n\fR \fIportnum\fR] \fB-t\fR \fIhost\fR \fIprognum\fR [\fIversnum\fR]
.fi

.LP
.nf
\fBrpcinfo\fR \fB-a\fR \fIserv_address\fR \fB-T\fR \fItransport\fR \fIprognum\fR [\fIversnum\fR]
.fi

.LP
.nf
\fBrpcinfo\fR \fB-b\fR [\fB-T\fR \fItransport\fR] \fIprognum\fR \fIversnum\fR
.fi

.LP
.nf
\fBrpcinfo\fR \fB-d\fR [\fB-T\fR \fItransport\fR] \fIprognum\fR \fIversnum\fR
.fi

.SH DESCRIPTION
.sp
.LP
\fBrpcinfo\fR makes an \fBRPC\fR call to an \fBRPC\fR server and reports what
it finds.
.sp
.LP
In the first synopsis, \fBrpcinfo\fR lists all the registered \fBRPC\fR
services with
.B rpcbind
on
.IR host .
If
.I host
is not specified, the
local host is the default. If
.B -s
is used, the information is displayed
in a concise format.
.sp
.LP
In the second synopsis, \fBrpcinfo\fR lists all the
.B RPC
services
registered with
.BR rpcbind ,
version 2. Note that the format of the
information is different in the first and the second synopsis. This is because
the second synopsis is an older protocol used to collect the information
displayed (version 2 of the
.B rpcbind
protocol).
.sp
.LP
The third synopsis makes an
.B RPC
call to procedure 0 of
.IR prognum
and
.I versnum
on the specified
.I host
and reports whether a response
was received.
.I transport
is the transport which has to be used for
contacting the given service. The remote address of the service is obtained by
making a call to the remote
.BR rpcbind .
.sp
.LP
The
.I prognum
argument is a number that represents an
.B RPC
program
number (see
.BR rpc (4)).
.sp
.LP
If a
.I versnum
is specified, \fBrpcinfo\fR attempts to call that version
of the specified
.IR prognum .
Otherwise, \fBrpcinfo\fR attempts to find all
the registered version numbers for the specified
.I prognum
by calling
version 0, which is presumed not to exist; if it does exist, \fBrpcinfo\fR
attempts to obtain this information by calling an extremely high version
number instead, and attempts to call each registered version. Note that the
version number is required for
.B -b
and
.B -d
options.
.sp
.LP
The
.B EXAMPLES
section describe other ways of using
.BR rpcinfo .
.SH OPTIONS
.sp
.ne 2
.mk
.na
.BI -T " transport"
.ad
.RS 19n
.rt
Specify the transport on which the service is required. If this option is not
specified, \fBrpcinfo\fR uses the transport specified in the \fBNETPATH\fR
environment variable, or if that is unset or
.I NULL,
the transport in the
\fBnetconfig\fR(4) database is used. This is a generic option, and can be used
in conjunction with other options as shown in the
.BR SYNOPSIS .
.RE

.sp
.ne 2
.mk
.na
\fB-a\fR \fIserv_address\fR
.ad
.RS 19n
.rt
Use
.I serv_address
as the (universal) address for the service on
\fItransport\fR to \fBping\fR procedure 0 of the specified \fIprognum\fR and
report whether a response was received. The
.B -T
option is required with
the
.B -a
option. If
.I versnum
is not specified, \fBrpcinfo\fR tries to
ping all available version numbers for that program number. This option avoids
calls to remote
.B rpcbind
to find the address of the service. The
\fIserv_address\fR is specified in universal address format of the given
transport.
.RE

.sp
.ne 2
.mk
.na
.B -b
.ad
.RS 19n
.rt
Make an
.B RPC
broadcast to procedure 0 of the specified
.I prognum
and
\fIversnum\fR and report all hosts that respond. If \fItransport\fR is
specified, it broadcasts its request only on the specified transport. If
broadcasting is not supported by any transport, an error message is printed.
Use of broadcasting should be limited because of the potential for adverse
effect on other systems.
.RE

.sp
.ne 2
.mk
.na
.B -d
.ad
.RS 19n
.rt
Delete registration for the
.B RPC
service of the specified
.IR prognum
and
.IR versnum .
If
.I transport
is specified, unregister the service on
only that transport, otherwise unregister the service on all the transports on
which it was registered. Only the owner of a service can delete a
registration, except the superuser, who can delete any service.
.RE

.sp
.ne 2
.mk
.na
.B -l
.ad
.RS 19n
.rt
Display a list of entries with a given
.I prognum
and
.I versnum
on the
specified
.IR host .
Entries are returned for all transports in the same
protocol family as that used to contact the remote
.BR rpcbind .
.RE

.sp
.ne 2
.mk
.na
.B -m
.ad
.RS 19n
.rt
Display a table of statistics of
.B rpcbind
operations on the given
.IR host .
The table shows statistics for each version of
.BR rpcbind
(versions 2, 3 and 4), giving the number of times each procedure was requested
and successfully serviced, the number and type of remote call requests that
were made, and information about
.B RPC
address lookups that were handled.
This is useful for monitoring
.B RPC
activities on
.IR host .
.RE

.sp
.ne 2
.mk
.na
.BI -n " portnum"
.ad
.RS 19n
.rt
Use
.I portnum
as the port number for the
.B -t
and
.B -u
options
instead of the port number given by
.BR rpcbind .
Use of this option avoids a
call to the remote
.B rpcbind
to find out the address of the service. This
option is made obsolete by the
.B -a
option.
.RE

.sp
.ne 2
.mk
.na
.B -p
.ad
.RS 19n
.rt
Probe
.B rpcbind
on
.I host
using version 2 of the
.BR rpcbind
protocol, and display a list of all registered
.B RPC
programs. If
\fIhost\fR is not specified, it defaults to the local host. This option is not
useful for IPv6; use
.B -s
(see below) instead. Note that version 2 of the
\fBrpcbind\fR protocol was previously known as the portmapper protocol.
.RE

.sp
.ne 2
.mk
.na
.B -s
.ad
.RS 19n
.rt
Display a concise list of all registered
.B RPC
programs on
.IR host .
If
\fIhost\fR is not specified, it defaults to the local host.
.RE

.sp
.ne 2
.mk
.na
.B -t
.ad
.RS 19n
.rt
Make an
.B RPC
call to procedure 0 of
.I prognum
on the specified
\fIhost\fR using \fBTCP,\fR and report whether a response was received. This
option is made obsolete by the
.B -T
option as shown in the third
synopsis.
.RE

.sp
.ne 2
.mk
.na
.B -u
.ad
.RS 19n
.rt
Make an
.B RPC
call to procedure 0 of
.I prognum
on the specified
\fIhost\fR using \fBUDP,\fR and report whether a response was received. This
option is made obsolete by the
.B -T
option as shown in the third
synopsis.
.RE

.SH EXAMPLES
.LP
\fBExample 1 \fBRPC\fR services.
.sp
.LP
To show all of the
.B RPC
services registered on the local machine use:

.sp
.in +2
.nf
\fBexample%\fR \fBrpcinfo\fR
.fi
.in -2
.sp

.sp
.LP
To show all of the
.B RPC
services registered with
.B rpcbind
on the
machine named
.B klaxon
use:

.sp
.in +2
.nf
\fBexample%\fR \fBrpcinfo\fR \fBklaxon\fR
.fi
.in -2
.sp

.sp
.LP
The information displayed by the above commands can be quite lengthy. Use the
\fB-s\fR option to display a more concise list:

.sp
.in +2
.nf
\fBexample%\fR \fBrpcinfo\fR \fB-s\fR \fBklaxon\fR
.fi
.in -2
.sp

.sp

.sp
.TS
tab();
lw(.7i) lw(.47i) lw(2.82i) lw(.7i) lw(.81i)
lw(.7i) lw(.47i) lw(2.82i) lw(.7i) lw(.81i)
.
\fBprogram\fR\fBvrsn\fR\fBnetid(s)\fR\fBservice\fR\fBowner\fR
\fB100000\fR\fB2,3,4\fR\fBtcp,udp,ticlts,ticots,ticotsord\fR\fBrpcbind\fR\fBsuperuser\fR
\fB100008\fR\fB1\fR\fBticotsord,ticots,ticlts,udp,tcp\fR\fBwalld\fR\fBsuperuser\fR
\fB100002\fR\fB2,1\fR\fBticotsord,ticots,ticlts,udp,tcp\fR\fBrusersd\fR\fBsuperuser\fR
\fB100001\fR\fB2,3,4\fR\fBticotsord,ticots,tcp,ticlts,udp\fR\fBrstatd\fR\fBsuperuser\fR
\fB100012\fR\fB1\fR\fBticotsord,ticots,ticlts,udp,tcp\fR\fBsprayd\fR\fBsuperuser\fR
\fB100007\fR\fB3\fR\fBticotsord,ticots,ticlts,udp,tcp\fR\fBypbind\fR\fBsuperuser\fR
\fB100029\fR\fB1\fR\fBticotsord,ticots,ticlts\fR\fBkeyserv\fR\fBsuperuser\fR
\fB100078\fR\fB4\fR\fBticotsord,ticots,ticlts\fR\fB-\fRsuperuser
\fB100024\fR\fB1\fR\fBticotsord,ticots,ticlts,udp,tcp\fR\fBstatus\fR\fBsuperuser\fR
\fB100021\fR\fB2,1\fR\fBticotsord,ticots,ticlts,udp,tcp\fR\fBnlockmgr\fR\fBsuperuser\fR
\fB100020\fR\fB1\fR\fBticotsord,ticots,ticlts,udp,tcp\fR\fBllockmgr\fR\fBsuperuser\fR
.TE

.sp
.LP
To show whether the
.B RPC
service with program number
.I prognum
and
version
.I versnum
is registered on the machine named
.B klaxon
for the
transport
.B TCP
use:

.sp
.in +2
.nf
\fBexample% rpcinfo \fB-T\fB tcp klaxon \fIprognum versnum\fR
.fi
.in -2
.sp

.sp
.LP
To show all
.B RPC
services registered with version 2 of the
.BR rpcbind
protocol on the local machine use:

.sp
.in +2
.nf
\fBexample%\fR \fBrpcinfo\fR \fB-p\fR
.fi
.in -2
.sp

.sp
.LP
To delete the registration for version 1 of the
.B walld
(program number
.BR 100008 )
service for all transports use:

.sp
.in +2
.nf
\fBexample# rpcinfo \fB-d\fB 100008 1\fR
.fi
.in -2
.sp

.sp
.LP
or

.sp
.in +2
.nf
\fBexample# rpcinfo \fB-d\fB walld 1\fR
.fi
.in -2
.sp

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.sp
.LP
.BR rpcbind (1M),
.BR rpc (3NSL),
\fBnetconfig\fR(4), \fBrpc\fR(4),
.BR attributes (5)
