usr/src/man/man1m/rquotad.1m
'\" te
.\" Copyright (c) 2004, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH rquotad 1M "30 Apr 2009" "SunOS 5.11" "System Administration Commands"
.SH NAME
rquotad \- remote quota server
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/nfs/rquotad\fR
.fi

.SH DESCRIPTION
.sp
.LP
.B rquotad
is an
.BR rpc (4)
server which returns quotas for a user of
a local file system which is mounted by a remote machine over the
.BR NFS.
The results are used by
.BR quota (1M)
to display user quotas for remote
file systems. The
.B rquotad
daemon is normally invoked by
.BR inetd (1M).
.SH USAGE
.sp
.LP
See
.BR largefile (5)
for the description of the behavior of
.BR rquotad
when encountering files greater than or equal to 2 Gbyte (2^31 bytes).
.SH FILES
.sp
.ne 2
.mk
.na
.B quotas
.ad
.RS 10n
.rt
quota file at a UFS file system root
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWnfssu
.TE

.SH SEE ALSO
.sp
.LP
.BR svcs (1),
.BR automountd (1M),
.BR inetadm (1M),
.BR inetd (1M),
.BR mount_nfs (1M),
.BR quota (1M),
.BR share_nfs (1M),
.BR svcadm (1M),
.BR rpc (4),
.BR services (4),
.BR attributes (5),
.BR largefile (5),
.BR smf (5)
.sp
.LP
\fR
.SH NOTES
.sp
.LP
The
.B rquotad
service is managed by the service management facility,
.BR smf (5),
under the service identifier:
.sp
.in +2
.nf
svc:/network/nfs/rquota
.fi
.in -2
.sp

.sp
.LP
Administrative actions on this service, such as enabling, disabling, or
requesting restart, can be performed using
.BR svcadm (1M).
Responsibility
for initiating and restarting this service is delegated to
.BR inetd (1M).
Use
.BR inetadm (1M)
to make configuration changes and to view
configuration information for this service. The service's status can be
queried using the
.BR svcs (1)
command.
.sp
.LP
If it is disabled, it will be enabled by
.BR mount_nfs (1M),
.BR share_nfs (1M),
and
.BR automountd "(1M) unless its"
.B application/auto_enable
property is set to
.BR false .
