usr/src/man/man1m/rtc.1m
'\" te
.\" Copyright (c) 2003, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2019, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH rtc 1M "28 Oct 2019" "SunOS 5.11" "System Administration Commands"
.SH NAME
rtc \- provide all real-time clock and GMT-lag management
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/rtc\fR [\fB-c\fR] [\fB-z\fR \fIzone-name\fR]
.fi

.SH DESCRIPTION
.sp
.LP
On x86 systems, the
.B rtc
command reconciles the difference in the way
that time is established between UNIX and MS-DOS systems. UNIX systems
utilize Greenwich Mean Time
.RB ( GMT ),
while
.B MS-DOS
systems utilize
local time.
.sp
.LP
Without arguments,
.B rtc
displays the currently configured time zone
string. The currently configured time zone string is based on what was last
recorded by
.BR rtc-z
.IR zone-name .
.sp
.LP
The
.B rtc
command is not normally run from a shell prompt; it is
generally invoked by the system. Commands such as
.BR date (1)
and
.BR rdate (1M),
which are used to set the time on a system, invoke
.B /usr/sbin/rtc -c
to ensure that daylight savings time
.RB ( DST )
is corrected for properly.
.SH OPTIONS
.sp
.ne 2
.TP 16n
.B -c
This option checks for
.B DST
and makes corrections if necessary. It is
normally run once a day by a
.B cron
job.
.sp
If there is no
.B RTC
time zone or
.B /etc/rtc_config
file, this
option will do nothing.

.sp
.ne 2
.TP
.B -d
Enable debugging.

.sp
.ne 2
.TP
.B -n
Enable no write mode. No changes are made to files or to the system.

.sp
.ne 2
.TP
.BI "-z " zone-name
.rt
This option, which is normally run by the system at software installation
time, is used to specify the time zone in which the
.B RTC
is to be
maintained. It updates the configuration file
.B /etc/rtc_config
with the
name of the specified zone and the current
.B GMT
lag for that zone. If
there is an existing
.B rtc_config
file, this command will update it. If
not, this command will create it.

.SH FILES
.sp
.ne 2
.TP 19n
.B /etc/rtc_config
The data file used to record the time zone and
.B GMT
lag. This file is
completely managed by
.BR /usr/sbin/rtc ,
and it is read by the kernel.

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Architecturex86
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.sp
.LP
.BR date (1),
.BR rdate (1M),
.BR attributes (5)
