usr/src/man/man1m/sacadm.1m
'\" te
.\" Copyright (c) 1996, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright 1989 AT&T
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH sacadm 1M "14 Sep 1992" "SunOS 5.11" "System Administration Commands"
.SH NAME
sacadm \- service access controller administration
.SH SYNOPSIS
.LP
.nf
\fBsacadm\fR \fB-a\fR \fB-p\fR \fIpmtag\fR \fB-t\fR \fItype\fR \fB-c\fR \fIcmd\fR \fB-v\fR \fIver\fR [\fB-f\fR dx] [\fB-n\fR \fIcount\fR]
     [\fB-y\fR \fIcomment\fR] [\fB-z\fR \fIscript\fR]
.fi

.LP
.nf
\fBsacadm\fR \fB-r\fR \fB-p\fR \fIpmtag\fR
.fi

.LP
.nf
\fBsacadm\fR \fB-s\fR \fB-p\fR \fIpmtag\fR
.fi

.LP
.nf
\fBsacadm\fR \fB-k\fR \fB-p\fR \fIpmtag\fR
.fi

.LP
.nf
\fBsacadm\fR \fB-e\fR \fB-p\fR \fIpmtag\fR
.fi

.LP
.nf
\fBsacadm\fR \fB-d\fR \fB-p\fR \fIpmtag\fR
.fi

.LP
.nf
\fBsacadm\fR \fB-l\fR [\fB-p\fR \fIpmtag\fR | \fB-t\fR \fItype\fR]
.fi

.LP
.nf
\fBsacadm\fR \fB-L\fR [\fB-p\fR \fIpmtag\fR | \fB-t\fR \fItype\fR]
.fi

.LP
.nf
\fBsacadm\fR \fB-g\fR \fB-p\fR \fIpmtag\fR [\fB-z\fR \fIscript\fR]
.fi

.LP
.nf
\fBsacadm\fR \fB-G\fR [\fB-z\fR \fIscript\fR]
.fi

.LP
.nf
\fBsacadm\fR \fB-x\fR [\fB-p\fR \fIpmtag\fR]
.fi

.SH DESCRIPTION
.sp
.LP
\fBsacadm\fR is the administrative command for the upper level of the
Service Access Facility hierarchy (port monitor administration).
\fBsacadm\fR performs the following functions:
.RS +4
.TP
.ie t \(bu
.el o
adds or removes a port monitor
.RE
.RS +4
.TP
.ie t \(bu
.el o
starts or stops a port monitor
.RE
.RS +4
.TP
.ie t \(bu
.el o
enables or disables a port monitor
.RE
.RS +4
.TP
.ie t \(bu
.el o
installs or replaces a per-system configuration script
.RE
.RS +4
.TP
.ie t \(bu
.el o
installs or replaces a per-port monitor configuration script
.RE
.RS +4
.TP
.ie t \(bu
.el o
prints requested port monitor information
.RE
.sp
.LP
Requests about the status of port monitors (\fB-l\fR and
.BR -L )
and
requests to print per-port monitor and per-system configuration scripts
(\fB-g\fR and \fB-G\fR without the \fB-z\fR option) may be executed by any
user on the system. Other
.B sacadm
commands may be executed only by the
super-user.
.SH OPTIONS
.sp
.ne 2
.mk
.na
.B -a
.ad
.RS 14n
.rt
Add a port monitor. When adding a port monitor,
.B sacadm
creates the
supporting directory structure in \fB/etc/saf\fR and \fB/var/saf\fR and adds
an entry for the new port monitor to
.BR /etc/saf/_sactab .
The file
\fB_sactab\fR already exists on the delivered system. Initially, it is empty
except for a single line, which contains the version number of the Service
Access Controller. Unless the command line that adds the new port monitor
includes the \fB-f\fR option with the
.B -x
argument, the new port
monitor will be started. Because of the complexity of the options and
arguments that follow the
.B "- a"
option, it may be convenient to use a
command script or the menu system to add port monitors.
.RE

.sp
.ne 2
.mk
.na
\fB-c\fR \fIcmd\fR
.ad
.RS 14n
.rt
Execute the command string
.I cmd
.RB "to start a port monitor. The" " -c"
option may be used only with a
.BR -a .
A
.B -a
option requires a
.BR -c .
.RE

.sp
.ne 2
.mk
.na
.B -d
.ad
.RS 14n
.rt
Disable the port monitor
.IR pmtag .
.RE

.sp
.ne 2
.mk
.na
.B -e
.ad
.RS 14n
.rt
Enable the port monitor
.IR pmtag .
.RE

.sp
.ne 2
.mk
.na
\fB-f dx\fR
.ad
.RS 14n
.rt
The \fB-f\fR option  specifies one or both of the following two flags which
are then included in the flags field of the
.B _sactab
entry for the new
port monitor. If the \fB-f\fR option is not included on the command line, no
flags are set and the default conditions prevail. By default, a port monitor
is started. A \fB-f\fR option with no following argument is illegal.
.sp
.ne 2
.mk
.na
.B d
.ad
.RS 5n
.rt
Do not enable the new port monitor.
.RE

.sp
.ne 2
.mk
.na
.B x
.ad
.RS 5n
.rt
Do not start the new port monitor.
.RE

.RE

.sp
.ne 2
.mk
.na
.B -g
.ad
.RS 14n
.rt
The
.B -g
option is used to request output or to install or replace the
per-port monitor configuration script
\fB/etc/saf/\fIpmtag\fB/_config\fR. \fB-g\fR requires a \fB-p\fR
option. The
.B -g
option with only a
.B -p
option prints the per-port
monitor configuration script for port monitor
.IR pmtag .
The
.BR -g
option with a
.B -p
option and a
.B -z
option installs  the file
\fBscript\fR as the per-port monitor configuration script for port monitor
.IR pmtag .
Other combinations of options with
.B -g
are invalid.
.RE

.sp
.ne 2
.mk
.na
.B -G
.ad
.RS 14n
.rt
The
.B -G
option is used to request output or to install or replace the
per-system configuration script
.BR /etc/saf/_sysconfig .
The
.BR -G
option by itself prints the per-system configuration script. The \fB-G\fR
option in combination with a
.B -z
option  installs the file
.BR script
as the per-system configuration script. Other combinations of options with a
\fB-G\fR option are invalid.
.RE

.sp
.ne 2
.mk
.na
.B -k
.ad
.RS 14n
.rt
Stop port monitor
.IR pmtag .
.RE

.sp
.ne 2
.mk
.na
.B -l
.ad
.RS 14n
.rt
The
.B -l
option is used to request port monitor information. The
\fB-l\fR by itself lists all port monitors on the system. The \fB-l\fR
option in combination with the
.B -p
option lists only the port monitor
specified by
.IR pmtag .
A
.B -l
in combination with the
.B -t
option
lists all port monitors of type
.BR type .
Any other combination of options
with the
.B -l
option is invalid.
.RE

.sp
.ne 2
.mk
.na
.B -L
.ad
.RS 14n
.rt
The
.B -L
option is identical to the
.B -l
option except that the
output appears in a condensed format.
.RE

.sp
.ne 2
.mk
.na
\fB-n\fR \fIcount\fR
.ad
.RS 14n
.rt
Set the restart count to
.IR count .
If a restart count is not specified,
count is set to
.BR 0 .
A count of
.B 0
indicates that the port monitor
is not to be restarted if it fails.
.RE

.sp
.ne 2
.mk
.na
\fB-p\fR \fIpmtag\fR
.ad
.RS 14n
.rt
Specifies the tag associated with a port monitor.
.RE

.sp
.ne 2
.mk
.na
.B -r
.ad
.RS 14n
.rt
Remove port monitor
.IR pmtag .
\fBsacadm\fR removes the port monitor
entry from
.BR /etc/saf/_sactab .
If the removed port monitor is not
running, then no further action is taken. If the removed port monitor is
running, the Service Access Controller (SAC) sends it
.B SIGTERM
to
indicate that it should shut down. Note that the port monitor's directory
structure remains intact.
.RE

.sp
.ne 2
.mk
.na
.B -s
.ad
.RS 14n
.rt
Start a port monitor. The SAC starts the port monitor \fIpmtag\fR.
.RE

.sp
.ne 2
.mk
.na
.B -t type
.ad
.RS 14n
.rt
Specifies the port monitor type.
.RE

.sp
.ne 2
.mk
.na
.B -v ver
.ad
.RS 14n
.rt
Specifies the version number of the port monitor. This version number may
be given as
.sp
.in +2
.nf
\fB-v\fB `\fIpmspec\fR \fB-V\fR`
.fi
.in -2
.sp

where
.I pmspec
is the special administrative command for port monitor
.IR pmtag .
This special command is
.B ttyadm
for
.B ttymon
and
\fBnlsadmin\fR for
.BR listen .
The version stamp of the port monitor is
known by the command and is returned when
.I pmspec
is invoked with a
\fB-V\fR option.
.RE

.sp
.ne 2
.mk
.na
.B -x
.ad
.RS 14n
.rt
The
.B -x
option by itself  tells the SAC to read its database file
(\fB_sactab\fR). The \fB-x\fR option with the \fB-p\fR option tells port
monitor
.I pmtag
to read its administrative file.
.RE

.sp
.ne 2
.mk
.na
\fB-y\fR \fIcomment\fR
.ad
.RS 14n
.rt
Include
.I comment
in the
.B _sactab
entry for port monitor
.IR pmtag .
.RE

.sp
.ne 2
.mk
.na
.B -z script
.ad
.RS 14n
.rt
Used with the
.B -g
and
.B -G
options to specify the name of a file
that contains a configuration script. With the
.B -g
.RB option, " script"
is a per-port monitor configuration script; with
.B -G
it is a per-system
configuration script. Modifying a configuration script is a three-step
procedure. First a copy of the existing script is made (\fB-g\fR or
.BR -G ).
Then the copy is edited. Finally, the copy is put in place over
the existing script (\fB-g\fR or \fB-G\fR with \fB-z\fR).
.RE

.SH OUTPUT
.sp
.LP
If successful,
.B sacadm
will exit with a status of
.BR 0 .
If
\fBsacadm\fR fails for any reason, it will exit with a nonzero status.
Options that request information will write the information on the standard
output. In the condensed format
.RB ( -L ),
port monitor information is
printed as a sequence of colon-separated fields; empty fields are indicated
by two successive colons. The standard format (\fB-l\fR) prints a header
identifying the columns, and port monitor information is aligned under the
appropriate headings. In this format, an empty field is indicated by a
hyphen. The comment character is \fB#\fR.
.SH EXAMPLES
.LP
\fBExample 1\fR A sample output of the \fBsacadm\fR command.
.sp
.LP
The following command line adds a port monitor. The port monitor tag is
.BR npack ;
its type is
.BR listen ;
if necessary, it will restart three
times before failing; its administrative command is
.BR nlsadmin ;
and the
configuration script to be read is in the file
.BR script :

.sp
.in +2
.nf
\fBsacadm \fB-a\fB \fB-p\fB npack \fB-t\fB listen \fB-c\fB /usr/lib/saf/listen npack\fR
\fB-v\fB `nlsadmin \fB-V\fB` \fB-n\fB 3 \fB-z\fB script\fR
.fi
.in -2
.sp

.sp
.LP
Remove a port monitor whose tag is
.BR pmtag :

.sp
.in +2
.nf
\fBsacadm\fR \fB-r\fR \fB-p\fR \fBpmtag\fR
.fi
.in -2
.sp

.sp
.LP
Start the port monitor whose tag is
.BR pmtag :

.sp
.in +2
.nf
\fBsacadm\fR \fB-s\fR \fB-p\fR \fBpmtag\fR
.fi
.in -2
.sp

.sp
.LP
Stop the port monitor whose tag is
.BR pmtag :

.sp
.in +2
.nf
\fBsacadm\fR \fB-k\fR \fB-p\fR \fBpmtag\fR
.fi
.in -2
.sp

.sp
.LP
Enable the port monitor whose tag is
.BR pmtag :

.sp
.in +2
.nf
\fBsacadm\fR \fB-e\fR \fB-p\fR \fBpmtag\fR
.fi
.in -2
.sp

.sp
.LP
Disable the port monitor whose tag is
.BR pmtag :

.sp
.in +2
.nf
\fBsacadm\fR \fB-d\fR \fB-p\fR \fBpmtag\fR
.fi
.in -2
.sp

.sp
.LP
List status information for all port monitors:

.sp
.in +2
.nf
\fBsacadm\fR \fB-l\fR
.fi
.in -2
.sp

.sp
.LP
List status information for the port monitor whose tag is
.BR pmtag :

.sp
.in +2
.nf
\fBsacadm\fR \fB-l\fR \fB-p\fR \fBpmtag\fR
.fi
.in -2
.sp

.sp
.LP
List the same information in condensed format:

.sp
.in +2
.nf
\fBsacadm\fR \fB-L\fR \fB-p\fR \fBpmtag\fR
.fi
.in -2
.sp

.sp
.LP
List status information for all port monitors whose type is
.BR listen :

.sp
.in +2
.nf
\fBsacadm\fR \fB-l\fR \fB-t\fR \fBlisten\fR
.fi
.in -2
.sp

.sp
.LP
Replace the per-port monitor configuration script associated with the port
monitor whose tag is
.B pmtag
with the contents of the file
\fBfile.config\fR:

.sp
.in +2
.nf
\fBsacadm\fR \fB-g\fR \fB-p\fR \fBpmtag\fR \fB-z\fR \fBfile.config\fR
.fi
.in -2
.sp

.SH FILES
.sp
.ne 2
.mk
.na
\fB/etc/saf/_sactab\fR
.ad
.RS 26n
.rt

.RE

.sp
.ne 2
.mk
.na
\fB/etc/saf/_sysconfig\fR
.ad
.RS 26n
.rt

.RE

.sp
.ne 2
.mk
.na
\fB/etc/saf/\fIpmtag\fB/_config\fR
.ad
.RS 26n
.rt

.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.sp
.LP
.BR pmadm (1M),
.BR sac (1M),
\fBdoconfig\fR(3NSL), \fBattributes\fR(5)
