usr/src/man/man1m/sar.1m
'\" te
.\" Copyright 1989 AT&T Copyright (c) 2004, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH sar 1M "20 Aug 2004" "SunOS 5.11" "System Administration Commands"
.SH NAME
sar, sa1, sa2, sadc \- system activity report package
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/sa/sadc\fR [\fIt\fR \fIn\fR] [\fIofile\fR]
.fi

.LP
.nf
\fB/usr/lib/sa/sa1\fR [\fIt\fR \fIn\fR]
.fi

.LP
.nf
\fB/usr/lib/sa/sa2\fR [\fB-aAbcdgkmpqruvwy\fR] [\fB-e\fR \fItime\fR] [\fB-f\fR \fIfilename\fR]
     [\fB-i\fR \fIsec\fR] [\fB-s\fR \fItime\fR]
.fi

.SH DESCRIPTION
.sp
.LP
System activity data can be accessed at the special request of a user (see
.BR sar (1))
and automatically, on a routine basis, as described here. The
operating system contains several counters that are incremented as various
system actions occur. These include counters for
.B CPU
utilization,
buffer usage, disk and tape
.B I/O
activity,
.B TTY
device activity,
switching and system-call activity, file-access, queue activity,
inter-process communications, and paging. For more general system
statistics, use
.BR iostat (1M),
.BR sar (1),
or
.BR vmstat (1M).
.sp
.LP
.B sadc
and two shell procedures,
.B sa1
and
.BR sa2 ,
are used to
sample, save, and process this data.
.sp
.LP
.BR sadc ,
the data collector, samples system data
.I n
times, with an
interval of
.I t
seconds between samples, and writes in binary format to
.I ofile
or to standard output. The sampling interval
.I t
should be
greater than 5 seconds; otherwise, the activity of
.B sadc
itself may
affect the sample. If
.I t
and
.I n
are omitted, a special record is
written. This facility can be used at system boot time, when booting to a
multi-user state, to mark the time at which the counters restart from zero.
For example, when accounting is enabled, the
.B svc:/system/sar:default
service writes the restart mark to the daily data file using the command
entry:
.sp
.in +2
.nf
su sys -c "/usr/lib/sa/sadc /var/adm/sa/sa\&'date +%d\&'"
.fi
.in -2
.sp

.sp
.LP
The shell script
.BR sa1 ,
a variant of
.BR sadc ,
is used to collect and
store data in the binary file
.BI /var/adm/sa/sa dd,
where
.B dd
is the current day. The arguments
.I t
and
.I n
cause records to be
written
.I n
times at an interval of
.I t
seconds, or once if omitted.
The following entries in
.B /var/spool/cron/crontabs/sys
will produce
records every 20 minutes during working hours and hourly otherwise:
.sp
.in +2
.nf
0 * * * 0-6 /usr/lib/sa/sa1
20,40 8\(mi17 * * 1\(mi5 /usr/lib/sa/sa1
.fi
.in -2
.sp

.sp
.LP
See
.BR crontab (1)
for details.
.sp
.LP
The shell script
.BR sa2 ,
a variant of
.BR sar ,
writes a daily report
in the file
.BI /var/adm/sa/sar dd.
See the
.B OPTIONS
section in
.BR sar (1)
for an explanation of the various options. The following entry
in
.B /var/spool/cron/crontabs/sys
will report important activities
hourly during the working day:
.sp
.in +2
.nf
5 18 * * 1\(mi5 /usr/lib/sa/sa2 \fB-s\fR 8:00 \fB-e\fR 18:01 \fB-i\fR 1200 \fB-A\fR
.fi
.in -2
.sp

.SH FILES
.sp
.ne 2
.mk
.na
.B /tmp/sa.adrfl
.ad
.sp .6
.RS 4n
address file
.RE

.sp
.ne 2
.mk
.na
.B /var/adm/sa/sadd
.ad
.sp .6
.RS 4n
Daily data file
.RE

.sp
.ne 2
.mk
.na
.B /var/adm/sa/sardd
.ad
.sp .6
.RS 4n
Daily report file
.RE

.sp
.ne 2
.mk
.na
.B /var/spool/cron/crontabs/sys
.ad
.sp .6
.RS 4n

.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWaccu
.TE

.SH SEE ALSO
.sp
.LP
.BR crontab (1),
.BR sag (1),
.BR sar (1),
.BR svcs (1),
.BR timex (1),
.BR iostat (1M),
.BR svcadm (1M),
.BR vmstat (1M),
.BR attributes (5),
.BR smf (5)
.sp
.LP
\fR
.SH NOTES
.sp
.LP
The
.B sar
service is managed by the service management facility,
.BR smf (5),
under the service identifier:
.sp
.in +2
.nf
svc:/system/sar
.fi
.in -2
.sp

.sp
.LP
Administrative actions on this service, such as enabling, disabling, or
requesting restart, can be performed using
.BR svcadm (1M).
The service's
status can be queried using the
.BR svcs (1)
command.
