usr/src/man/man1m/savecore.1m
'\" te
.\" Copyright (c) 2004, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" Copyright (c) 1983 Regents of the University of California.
.\" All rights reserved. The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.TH savecore 1M "25 Sep 2004" "SunOS 5.11" "System Administration Commands"
.SH NAME
savecore \- save a crash dump of the operating system
.SH SYNOPSIS
.LP
.nf
\fB/usr/bin/savecore\fR [\fB-Lvd\fR] [\fB-f\fR \fIdumpfile\fR] [\fIdirectory\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The
.B savecore
utility saves a crash dump of the kernel (assuming that
one was made) and writes a reboot message in the shutdown log. It is invoked
by the
.B dumpadm
service each time the system boots.
.sp
.LP
.B savecore
saves the crash dump data in the file
\fIdirectory\fB/vmcore.\fIn\fR and the kernel's namelist in
\fIdirectory\fB/unix.\fIn.\fR The trailing \fB\&.\fIn\fR in the
pathnames is replaced by a number which grows every time
.B savecore
is
run in that directory.
.sp
.LP
Before writing out a crash dump,
.B savecore
reads a number from the
file \fIdirectory\fB/minfree\fR. This is the minimum number of kilobytes
that must remain free on the file system containing
.IR directory .
If
after saving the crash dump the file system containing
.I directory
would
have less free space the number of kilobytes specified in
.BR minfree ,
the
crash dump is not saved. if the
.B minfree
file does not exist,
.B savecore
assumes a
.B minfree
value of 1 megabyte.
.sp
.LP
The
.B savecore
utility also logs a reboot message using facility
.B LOG_AUTH
(see
.BR syslog (3C)).
If the system crashed as a result of
a panic,
.B savecore
logs the panic string too.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -d
.ad
.RS 15n
.rt
Disregard dump header valid flag. Force
.B savecore
to attempt to save a
crash dump even if the header information stored on the dump device
indicates the dump has already been saved.
.RE

.sp
.ne 2
.mk
.na
.B -f
.I dumpfile
.ad
.RS 15n
.rt
Attempt to save a crash dump from the specified file instead of from the
system's current dump device. This option may be useful if the information
stored on the dump device has been copied to an on-disk file by means of the
.BR dd (1M)
command.
.RE

.sp
.ne 2
.mk
.na
.B -L
.ad
.RS 15n
.rt
Save a crash dump of the live running Solaris system, without actually
rebooting or altering the system in any way. This option forces
.B savecore
to save a live snapshot of the system to the dump device, and
then immediately to retrieve the data and to write it out to a new set of
crash dump files in the specified directory. Live system crash dumps can
only be performed if you have configured your system to have a dedicated
dump device using
.BR dumpadm (1M).
.sp
.B savecore -L
does not suspend the system, so the contents of
memory continue to change while the dump is saved. This means that live
crash dumps are not fully self-consistent.
.RE

.sp
.ne 2
.mk
.na
.B -v
.ad
.RS 15n
.rt
Verbose. Enables verbose error messages from
.BR savecore .
.RE

.SH OPERANDS
.sp
.LP
The following operands are supported:
.sp
.ne 2
.mk
.na
.I directory
.ad
.RS 13n
.rt
Save the crash dump files to the specified directory. If
.I directory
is
not specified,
.B savecore
saves the crash dump files to the default
.B savecore
.IR directory ,
configured by
.BR dumpadm (1M).
.RE

.SH FILES
.sp
.ne 2
.mk
.na
\fIdirectory\fB/vmcore.\fIn\fR
.ad
.RS 29n
.rt

.RE

.sp
.ne 2
.mk
.na
\fIdirectory\fB/unix.\fIn\fR
.ad
.RS 29n
.rt

.RE

.sp
.ne 2
.mk
.na
.IB directory /bounds
.ad
.RS 29n
.rt

.RE

.sp
.ne 2
.mk
.na
.IB directory /minfree
.ad
.RS 29n
.rt

.RE

.sp
.ne 2
.mk
.na
\fB/var/crash/\&'uname \fB-n\&'\fR
.ad
.RS 29n
.rt
default crash dump directory
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.sp
.LP
.BR adb (1),
.BR mdb (1),
.BR svcs (1),
.BR dd (1M),
.BR dumpadm (1M),
.BR svcadm (1M),
.BR syslog (3C),
.BR attributes (5),
.BR smf (5)
.SH NOTES
.sp
.LP
The system crash dump service is managed by the service management
facility,
.BR smf (5),
under the service identifier:
.sp
.in +2
.nf
svc:/system/dumpadm:default
.fi
.in -2
.sp

.sp
.LP
Administrative actions on this service, such as enabling, disabling, or
requesting restart, can be performed using
.BR svcadm (1M).
The service's
status can be queried using the
.BR svcs (1)
command.
.sp
.LP
If the dump device is also being used as a swap device, you must run
.B savecore
very soon after booting, before the swap space containing the
crash dump is overwritten by programs currently running.
