usr/src/man/man1m/sckmd.1m
'\" te
.\" Copyright (c) 2005, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH sckmd 1M "25 Apr 2006" "SunOS 5.11" "System Administration Commands"
.SH NAME
sckmd \- Sun cryptographic key management daemon
.SH SYNOPSIS
.LP
.nf
\fB/usr/platform/sun4u/lib/sckmd\fR
.fi

.SH DESCRIPTION
.sp
.LP
.B sckmd
is a server process that resides on a high-end system domain to
maintain the Internet Protocol Security (\fBIPsec\fR) Security Associations
(\fBSAs\fR) needed to secure communications between a Service Processor or
System Controller (SC) and platform management software running within a
domain. The
.BR cvcd (1M)
and
.BR dcs (1M)
daemons use these Security
Associations. See \fBipsec\fR(7P) for a description of Security
Associations.
.sp
.LP
The
.B sckmd
daemon receives \fBSA\fRs from the Service Processor or
.B SC
and installs these
.BR SA "s in a domain's Security Association"
Database (\fBSADB\fR) using \fBpf_key\fR(7P).
.sp
.LP
.B sckmd
starts up at system boot time as an
.B SMF
service. The
.B FMRI
for the
.B sckmd
service is:
.sp
.in +2
.nf
svc:/platform/sun4u/sckmd:default
.fi
.in -2
.sp

.sp
.LP
A domain supports only one running
.B sckmd
process at a time.
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWsckmx.u, SUNWsckmu.u, SUNWsckmr
_
Interface StabilityEvolving
.TE

.SH SEE ALSO
.sp
.LP
.BR cvcd (1M),
.BR dcs (1M),
.BR ipsecconf (1M),
.BR ipsecalgs (1M),
.BR attributes (5),
.BR ipsec (7P),
.BR ipsecah (7P),
.BR ipsecesp (7P),
.BR pf_key (7P)
.SH NOTES
.sp
.LP
The
.B sckmd
service is used only on Sun Fire high-end systems and the
.B SPARC
Enterprise Server family. It provides a mechanism for exchanging
.B IPsec
keys between a domain and its System Controller (\fBSC\fR) or
Service Processor. These platforms use
.B IPsec
to secure the
communications between the
.B SC
or Service Processor and certain
platform-specific daemons in the domain. Such daemons currently include
.BR cvcd (1M)
and
.BR dcs (1M).
.sp
.LP
The documentation for each platform that supports
.B sckmd
describes how
to configure its use of
.B IPsec
for such communications. Also, the
documentation for each specific application describes how to configure its
security policies and
.B IPsec
options in a manner appropriate for the
target platform. Refer to the platform- and application-specific
documentation for detailed information.
