usr/src/man/man1m/sconadm.1m
'\" te
.\" Copyright (c) 2005, Sun Microsystems, Inc. All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH sconadm 1M "27 Feb 2006" "SunOS 5.11" "System Administration Commands"
.SH NAME
sconadm \- register system information
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/sconadm\fR register \fB-a\fR
     [\fB-e\fR softwareUpdate | \fB-E\fR softwareUpdate]
     [\fB-h\fR \fIhostname\fR] [\fB-l\fR \fIlogfile\fR] [\fB-N\fR]
     [\fB-p\fR \fIproxy_host\fR[:\fIproxy_port\fR]]
     [\fB-r\fR \fIregistration_profile\fR] [\fB-u\fR \fIusername\fR]
     [\fB-x\fR \fIproxy_username\fR]
.fi

.LP
.nf
\fB/usr/sbin/sconadm\fR proxy [\fB-l\fR \fIlogfile\fR]
     [\fB-p\fR \fIproxy_host\fR[:\fIproxy_port\fR]]
     [\fB-r\fR \fIregistration_profile\fR] [\fB-x\fR \fIproxy_username\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The
.B sconadm
utility is a command-line version of the Basic
Registration GUI. In the first form of the command in the SYNOPSIS,
.B sconadm
uses the
.B register
subcommand to register a host with a
registration server. In the second form,
.B sconadm
uses the
.BR proxy
subcommand to configure all of the components for software update to use an
HTTP web proxy.
.sp
.LP
The parameters specified with
.BR -u ,
.B -e
(or
.BR -E ),
.BR -h ,
.BR -p ,
and
.B -x
override values specified in your registration
profile. A template for this profile, owned by root, with read-only
permissions, is stored in
.BR /usr/lib/breg/data/RegistrationProfile.properties .
See
.BR registration_profile (4).
.sp
.LP
For the
.B proxy
subcommand, the proxy password is stored in the
.B RegistrationProfile.properties
file, available if proxy authentication
is needed. Storage in the profile prevents proxy passwords from being
exposed as part of a listing of processes on a system.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -a
.ad
.RS 30n
.rt
Accept "Terms of Use and Binary Code License". Absence of this option means
that you do not accept the license.
.RE

.sp
.ne 2
.mk
.na
.B -e
softwareUpdate\fR
.ad
.RS 30n
.rt
Enable client to be managed at the Sun-hosted Update Connection Service.
.RE

.sp
.ne 2
.mk
.na
.B -E
softwareUpdate\fR
.ad
.RS 30n
.rt
Disable client's ability to be managed at the Sun-hosted Update Connection
Service.
.RE

.sp
.ne 2
.mk
.na
.B -h
.I hostname
.ad
.RS 30n
.rt
Hostname of the machine you want to register.
.RE

.sp
.ne 2
.mk
.na
.B -l
.I logfile
.ad
.RS 30n
.rt
Pathname of log file.
.RE

.sp
.ne 2
.mk
.na
.B -N
.ad
.RS 30n
.rt
Never register.
.RE

.sp
.ne 2
.mk
.na
\fB-p\fR \fIproxy_host\fR[:\fIproxy_port\fR]\fR
.ad
.RS 30n
.rt
Proxy host name and optional proxy port number.
.RE

.sp
.ne 2
.mk
.na
.B -r
.I registration_profile
.ad
.RS 30n
.rt
Pathname to a registration profile.
.RE

.sp
.ne 2
.mk
.na
.B -u
.I username
.ad
.RS 30n
.rt
User name (a Sun Online Account).
.RE

.sp
.ne 2
.mk
.na
.B -x
.I proxy_username
.ad
.RS 30n
.rt
User name on the proxy host.
.RE

.SH EXAMPLES
.sp
.LP
Unless specified otherwise, the commands below require root privileges or
privileges equivalent to root. See
.BR privileges (5).
.LP
.B Example 1
Registering a New System
.sp
.LP
Assume a file
.BR registrationprofile.properties " in"
.B /tmp
that
contains the following:

.sp
.in +2
.nf
userName=\fIuser123\fR
password=\fIabc123\fR
hostName=
subscriptionKey=
portalEnabled=false
proxyHostName=
proxyPort=
proxyUserName=
proxyPassword=
.fi
.in -2

.sp
.LP
To register a new system using the profile above, you enter:

.sp
.in +2
.nf
\fB/usr/sbin/sconadm register -a -r /tmp/registrationprofile.properties\fR
.fi
.in -2
.sp

.LP
.B Example 2
Reregistering a System with a Different User
.sp
.LP
Assume a file
.BR registrationprofile.properties " in"
.B /tmp
with the
contents shown below. Note the changed specification for
.B userName
and
.BR password .

.sp
.in +2
.nf
userName=\fInewuser\fR
password=\fInewpassword\fR
hostName=
subscriptionKey=
portalEnabled=false
proxyHostName=
proxyPort=
proxyUserName=
proxyPassword=
.fi
.in -2

.sp
.LP
To reregister a new system using the profile above, you enter the same
command you entered to register the system:

.sp
.in +2
.nf
\fB/usr/sbin/sconadm register -a -r /tmp/registrationprofile.properties\fR
.fi
.in -2
.sp

.LP
.B Example 3
Reregistering a System, Adding a Sun Subscription Key
.sp
.LP
Modify
.B registrationprofile.properties
as follows:

.sp
.in +2
.nf
userName=\fInewuser\fR
password=\fInewpassword\fR
hostName=
subscriptionKey=\fIabc12345678\fR
portalEnabled=false
proxyHostName=
proxyPort=
proxyUserName=
proxyPassword=
.fi
.in -2

.sp
.LP
Run the command:

.sp
.in +2
.nf
\fB/usr/sbin/sconadm register -a -r /tmp/registrationprofile.properties\fR
.fi
.in -2
.sp

.LP
.B Example 4
Reregistering and Enabling Access to all Update Connection
Services
.sp
.LP
Modify
.B registrationprofile.properties
as follows:

.sp
.in +2
.nf
userName=\fInewuser\fR
password=\fInewpassword\fR
hostName=
subscriptionKey=\fIabc12345678\fR
portalEnabled=false
proxyHostName=
proxyPort=
proxyUserName=
proxyPassword=
.fi
.in -2

.sp
.LP
Note that
.B portalEnabled
is set to
.BR false .
Run the command:

.sp
.in +2
.nf
\fB/usr/sbin/sconadm register -a -r /tmp/registrationprofile.properties \e
-e softwareUpdate\fR
.fi
.in -2
.sp

.LP
.B Example 5
Never Registering
.sp
.LP
To never register a system, enter:

.sp
.in +2
.nf
\fB/usr/sbin/sconadm register -N\fR
.fi
.in -2
.sp

.LP
.B Example 6
Using a Proxy Server With Proxy Authentication
.sp
.LP
Edit
.B registrationprofile.properties
as follows:

.sp
.in +2
.nf
userName=
password=
hostName=
subscriptionKey=
portalEnabled=
proxyHostName=webcache.mycompany.com
proxyPort=8080
proxyUserName=\fImyCompanyProxyUserName\fR
proxyPassword=\fImyCompanyProxyPassword\fR
.fi
.in -2

.sp
.LP
Run the command:

.sp
.in +2
.nf
\fB/usr/sbin/sconadm proxy -r /tmp/registrationprofile.properties\fR
.fi
.in -2
.sp

.LP
.B Example 7
Changing Proxy Host Settings
.sp
.LP
Edit
.B registrationprofile.properties
as follows:

.sp
.in +2
.nf
userName=
password=
hostName=
subscriptionKey=
portalEnabled=
proxyHostName=webcache.mycompany.com
proxyPort=8080
proxyUserName=\fImyCompanyProxyUserName\fR
proxyPassword=\fImyCompanyProxyPassword\fR
.fi
.in -2

.sp
.LP
Run the command:

.sp
.in +2
.nf
\fB/usr/sbin/sconadm proxy -r /tmp/registrationprofile.properties\fR
.fi
.in -2
.sp

.sp
.LP
Then, change the
.B proxyHostName
value by running the following
command:

.sp
.in +2
.nf
\fB/usr/sbin/sconadm proxy -r /tmp/registrationprofile.properties \e
-p newproxy.mycompany.com\fR
.fi
.in -2
.sp

.sp
.LP
After the preceding command all proxies use
.BR newproxy.mycompany.com .

.LP
.B Example 8
Resetting a System Not to Use a Proxy
.sp
.LP
Edit
.B registrationprofile.properties
as follows:

.sp
.in +2
.nf
userName=
password=
hostName=
subscriptionKey=
portalEnabled=
proxyHostName=
proxyPort=
proxyUserName=
proxyPassword=
.fi
.in -2

.sp
.LP
Note that values for all proxy fields are null.

.sp
.LP
Run the command:

.sp
.in +2
.nf
\fB/usr/sbin/sconadm proxy -r /tmp/registrationprofile.properties\fR
.fi
.in -2
.sp

.SH EXIT STATUS
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 6n
.rt
Success.
.RE

.sp
.ne 2
.mk
.na
.B >0
.ad
.RS 6n
.rt
An error occurred.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B /usr/lib/breg/data/RegistrationProfile.properties
.ad
.sp .6
.RS 4n
Registration profile template.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWbrg
_
Interface StabilityStable
.TE

.SH SEE ALSO
.sp
.LP
.BR registration_profile (4),
.BR attributes (5),
.BR privileges (5)
