usr/src/man/man1m/setuname.1m
'\" te
.\" Copyright 1989 AT&T Copyright (c) 1998 Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH setuname 1M "9 Jul 2003" "SunOS 5.11" "System Administration Commands"
.SH NAME
setuname \- change machine information
.SH SYNOPSIS
.LP
.nf
\fBsetuname\fR [\fB-t\fR] [\fB-n\fR \fInode\fR] [\fB-s\fR \fIname\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The
.B setuname
utility changes the parameter value for the system name
and node name. Each parameter can be changed using
.B setuname
and the
appropriate option.
.sp
.LP
Either or both the
.B -s
and
.B -n
options must be given when
invoking
.BR setuname .
.sp
.LP
The system architecture may place requirements on the size of the system
and network node name. The command will issue a fatal warning message and an
error message if the name entered is incompatible with the system
requirements.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.BI -n " node"
.ad
.RS 11n
.rt
Changes the node name.
.I node
specifies the new network node name and
can consist of alphanumeric characters and the special characters dash,
underbar, and dollar sign.
.RE

.sp
.ne 2
.mk
.na
.BI -s " name"
.ad
.RS 11n
.rt
Changes the system name.
.I name
specifies new system name and can
consist of alphanumeric characters and the special characters dash,
underbar, and dollar sign.
.RE

.sp
.ne 2
.mk
.na
.B -t
.ad
.RS 11n
.rt
Temporary change. No attempt will be made to create a permanent change.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.sp
.LP
.BR attributes (5)
.SH NOTES
.sp
.LP
.B setuname
attempts to change the parameter values in two places: the
running kernel and, as necessary per implementation, to cross system
reboots. A temporary change changes only the running kernel.
