usr/src/man/man1m/sf880drd.1m
'\" te
.\" Copyright (c) 2004, Sun Microsystems, Inc. All Rights Reserved.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH sf880drd 1M "13 Aug 2004" "SunOS 5.11" "System Administration Commands"
.SH NAME
sf880drd \- Sun Fire 880 Dynamic Reconfiguration daemon
.SH SYNOPSIS
.LP
.nf
\fBsf880drd\fR
.fi

.SH DESCRIPTION
.sp
.LP
The Sun Fire 880 Dynamic Reconfiguration daemon,
.BR sf880drd ,
is part of
the
.B PCI
and system bus hotplug framework.
.B sf880drd
starts at
boot time. It has no configuration options and does not report any system
status.
.sp
.LP
.B sf880drd
implements the Sun Fire
.B 880
console-less system
administration (per-slot pushbuttons and
.B LED
status indicators). It
also manages various aspects of
.BR CPU "/memory hotplug."
.SH FILES
.sp
.ne 2
.mk
.na
.B /usr/platform/SUNW,Sun-Fire-880/lib/sf880drd
.ad
.sp .6
.RS 4n

.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWsfdr.u
.TE

.SH SEE ALSO
.sp
.LP
.BR svcs (1),
.BR cfgadm (1M),
.BR cfgadm_pci (1M),
.BR cfgadm_sbd (1M),
.BR svcadm (1M),
.BR attributes (5),
.BR smf (5)
.SH NOTES
.sp
.LP
The
.B sf880drd
service is managed by the service management facility,
.BR smf (5),
under the service identifier:
.sp
.in +2
.nf
svc:/platform/sun4u/sf880drd
.fi
.in -2
.sp

.sp
.LP
Administrative actions on this service, such as enabling, disabling, or
requesting restart, can be performed using
.BR svcadm (1M).
The service's
status can be queried using the
.BR svcs (1)
command.
