usr/src/man/man1m/sftp-server.1m
'\" te
.\" To view license terms, attribution, and copyright for OpenSSH,
.\" the default path is /var/sadm/pkg/SUNWsshdr/install/copyright.
.\" If the Solaris operating environment has been installed anywhere
.\" other than the default, modify the specified path to access the file
.\" at the installed location.
.\" Portions Copyright (c) 2007, Sun Microsystems, Inc. All Rights Reserved.
.TH sftp-server 1M "24 Oct 2007" "SunOS 5.11" "System Administration Commands"
.SH NAME
sftp-server \- SFTP server subsystem
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/ssh/sftp-server\fR [\fB-f\fR \fIlog_facility\fR] [\fB-l\fR \fIlog_level\fR]
.fi

.SH DESCRIPTION
.sp
.LP
.B sftp-server
implements the server side of the SSH File Transfer
Protocol as defined in the IETF
.BR draft-ietf-secsh-filexfer .
.sp
.LP
.B sftp-server
is a subsystem for
.BR sshd "(1M) and must not be run"
directly. Command-line flags to
.B sftp-server
should be specified in the
Subsystem declaration. See
.BR sshd_config (4)
for more information.
.sp
.LP
To enable the \fBsftp-server\fR subsystem for \fBsshd\fR add the following
to
.BR /etc/ssh/sshd_config :
.sp
.in +2
.nf
Subsystem   sftp     /usr/lib/ssh/sftp-server
.fi
.in -2
.sp

.sp
.LP
See
.BR sshd_config (4)
for a description of the format and contents of
that file.
.sp
.LP
There is no relationship between the protocol used by
.B sftp-server
and
the FTP protocol (RFC 959) provided by
.BR in.ftpd .
.SH OPTIONS
.sp
.LP
Valid options are listed below. As stated above, these are to be specified
in the Subsystem declation of
.BR sshd_config .
.sp
.ne 2
.mk
.na
.B -f
.I log_facility
.ad
.sp .6
.RS 4n
Specifies the facility code that is used when logging messages from
.BR sftp-server .
The possible values are:
.BR DAEMON ,
.BR USER ,
.BR AUTH ,
.BR LOCAL0 ,
.BR LOCAL1 ,
.BR LOCAL2 ,
.BR LOCAL3 ,
.BR LOCAL4 ,
.BR LOCAL5 ,
.BR LOCAL6 ,
.BR LOCAL7 .
The default is
.BR AUTH .
.RE

.sp
.ne 2
.mk
.na
.B -l
.I log_level
.ad
.sp .6
.RS 4n
Specifies which messages will be logged by
.BR sftp-server .
The possible
values are:
.BR QUIET ,
.BR FATAL ,
.BR ERROR ,
.BR INFO ,
.BR VERBOSE ,
.BR DEBUG ,
.BR DEBUG1 ,
.BR DEBUG2 ,
and
.BR DEBUG3 .
.B INFO
and
.B VERBOSE
log transactions that \fBsftp-server\fR
performs on behalf of the client.
.B DEBUG
and
.B DEBUG1
are
equivalent.
.B DEBUG2
and
.B DEBUG3
each specify higher levels of
debugging output. The default is
.BR ERROR .
.RE

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 6n
.rt
Successful completion.
.RE

.sp
.ne 2
.mk
.na
.B >0
.ad
.RS 6n
.rt
An error occurred.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B /usr/lib/ssh/sftp-server
.ad
.RS 28n
.rt
Server-side binary.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWsshdu
_
Interface StabilityEvolving
.TE

.SH SEE ALSO
.sp
.LP
.BR sftp (1),
.BR ssh (1),
.BR ssh-add (1),
.BR ssh-keygen (1),
.BR sshd (1M),
.BR sshd_config (4),
.BR attributes (5)
