usr/src/man/man1m/share_nfs.1m
'\" te
.\" Copyright (C) 2008, Sun Microsystems, Inc. All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH share_nfs 1M "6 May 2009" "SunOS 5.11" "System Administration Commands"
.SH NAME
share_nfs \- make local NFS file systems available for mounting by remote
systems
.SH SYNOPSIS
.LP
.nf
\fBshare\fR [\fB-d\fR \fIdescription\fR] [\fB-F\fR nfs] [\fB-o\fR \fIspecific_options\fR] \fIpathname\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B share
utility makes local file systems available for mounting by
remote systems. It starts the \fBnfsd\fR(1M) and \fBmountd\fR(1M) daemons if
they are not already running.
.sp
.LP
If no argument is specified, then
.B share
displays all file systems
currently shared, including
.B NFS
file systems and file systems shared
through other distributed file system packages.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -d
.I description
.ad
.sp .6
.RS 4n
Provide a comment that describes the file system to be shared.
.RE

.sp
.ne 2
.mk
.na
.B -F nfs
.ad
.sp .6
.RS 4n
Share
.B NFS
file system type.
.RE

.sp
.ne 2
.mk
.na
.B -o
.I specific_options
.ad
.sp .6
.RS 4n
Specify
.I specific_options
in a comma-separated list of keywords and
attribute-value-assertions for interpretation by the
file-system-type-specific command. If
.I specific_options
is not
specified, then by default sharing is read-write to all clients.
.I specific_options
can be any combination of the following:
.sp
.ne 2
.mk
.na
.B aclok
.ad
.sp .6
.RS 4n
Allows the
.B NFS
server to do access control for
.B NFS
Version 2
clients (running SunOS 2.4 or earlier). When
.B aclok
is set on the
server, maximal access is given to all clients. For example, with
.B aclok
set, if anyone has read permissions, then everyone does. If
.B aclok
is not set, minimal access is given to all clients.
.RE

.sp
.ne 2
.mk
.na
\fBanon=\fIuid\fR
.ad
.sp .6
.RS 4n
Set
.I uid
to be the effective user
.B ID
of unknown users. By
default, unknown users are given the effective user \fBID\fR
.BR UID_NOBODY .
If
.I uid
is set to \fB\(mi1\fR, access is denied.
.RE

.sp
.ne 2
.mk
.na
\fIcharset\fR=\fIaccess_list\fR
.ad
.sp .6
.RS 4n
Where
.I charset
is one of:
.BR euc-cn ,
.BR euc-jp ,
.BR euc-jpms ,
.BR euc-kr ,
.BR euc-tw ,
.BR iso8859-1 ,
.BR iso8859-2 ,
.BR iso8859-5 ,
.BR iso8859-6 ,
.BR iso8859-7 ,
.BR iso8859-8 ,
.BR iso8859-9 ,
.BR iso8859-13 ,
.BR iso8859-15 ,
.BR koi8-r .
.sp
Clients that match the
.I access_list
for one of these properties will
be assumed to be using that character set and file and path names will be
converted to UTF-8 for the server.
.RE

.sp
.ne 2
.mk
.na
.B index=file
.ad
.sp .6
.RS 4n
Load
.B file
rather than a listing of the directory containing this file
when the directory is referenced by an
.BR "NFS URL" .
.RE

.sp
.ne 2
.mk
.na
.B log=tag
.ad
.sp .6
.RS 4n
Enables
.B NFS
server logging for the specified file system. The
optional tag determines the location of the related log files. The \fBtag\fR
is defined in
.BR etc/nfs/nfslog.conf .
If no
.B tag
is specified, the
default values associated with the
.B "global tag"
in
.B etc/nfs/nfslog.conf
is used. Support of NFS server logging is only
available for NFS Version 2 and Version 3 requests.
.RE

.sp
.ne 2
.mk
.na
\fBnone=\fIaccess_list\fR
.ad
.sp .6
.RS 4n
Access is not allowed to any client that matches the access list. The
exception is when the access list is an asterisk
.RB ( * ),
in which case
.B ro
or
.B rw
can override
.BR none .
.RE

.sp
.ne 2
.mk
.na
.B nosub
.ad
.sp .6
.RS 4n
Prevents clients from mounting subdirectories of shared directories. For
example, if
.B /export
is shared with the
.B nosub
option on server
.I fooey
then a
.B NFS
client cannot do:
.sp
.in +2
.nf
mount -F nfs fooey:/export/home/mnt
.fi
.in -2
.sp

NFS Version 4 does not use the
.B MOUNT
protocol. The
.B nosub
option
only applies to NFS Version 2 and Version 3 requests.
.RE

.sp
.ne 2
.mk
.na
.B nosuid
.ad
.sp .6
.RS 4n
By default, clients are allowed to create files on the shared file system
with the setuid or setgid mode enabled. Specifying
.B nosuid
causes the
server file system to silently ignore any attempt to enable the setuid or
setgid mode bits.
.RE

.sp
.ne 2
.mk
.na
.B public
.ad
.sp .6
.RS 4n
Moves the location of the public file handle from
.B root
(\fB/\fR) to
the exported directory for Web\fBNFS\fR-enabled browsers and clients. This
option does not enable Web\fBNFS\fR service; Web\fBNFS\fR is always on. Only
one file system per server may use this option. Any other option, including
the
.B -ro=list
and
.B -rw=list
options can be included with the
.B public
option.
.RE

.sp
.ne 2
.mk
.na
.B ro
.ad
.sp .6
.RS 4n
Sharing is read-only to all clients.
.RE

.sp
.ne 2
.mk
.na
\fBro=\fIaccess_list\fR
.ad
.sp .6
.RS 4n
Sharing is read-only to the clients listed in
.IR access_list ;
overrides
the
.B rw
suboption for the clients specified. See \fIaccess_list\fR
below.
.RE

.sp
.ne 2
.mk
.na
\fBroot=\fIaccess_list\fR
.ad
.sp .6
.RS 4n
Only root users from the hosts specified in
.I access_list
have root
access. See
.I access_list
below. By default, no host has root access, so
root users are mapped to an anonymous user
.B ID
(see the
\fBanon=\fIuid\fR option described above). Netgroups can be used if the
file system shared is using UNIX authentication
.RB (  AUTH_SYS ).
.RE

.sp
.ne 2
.mk
.na
\fBroot_mapping=\fIuid\fR
.ad
.sp .6
.RS 4n
For a client that is allowed root access, map the root UID to the specified
user id.
.RE

.sp
.ne 2
.mk
.na
.B rw
.ad
.sp .6
.RS 4n
Sharing is read-write to all clients.
.RE

.sp
.ne 2
.mk
.na
\fBrw=\fIaccess_list\fR
.ad
.sp .6
.RS 4n
Sharing is read-write to the clients listed in
.IR access_list ;
overrides
the
.B ro
suboption for the clients specified. See \fIaccess_list\fR
below.
.RE

.sp
.ne 2
.mk
.na
\fBsec=\fImode\fR[\fB:\fImode\fR].\|.\|.\fR
.ad
.sp .6
.RS 4n
Sharing uses one or more of the specified security modes. The
.I mode
in
the \fBsec=\fImode\fR option must be a node name supported on the client.
If the
.B sec=
option is not specified, the default security mode used is
.B AUTH_SYS.
Multiple
.B sec=
options can be specified on the command
line, although each mode can appear only once. The security modes are
defined in
.BR nfssec (5).
.sp
Each
.B sec=
option specifies modes that apply to any subsequent
.B window=, rw, ro, rw=, ro=
and
.B root=
options that are provided
before another
.BR sec= "option. Each additional"
.B sec=
resets the
security mode context, so that more
.B "window=, rw,"
.B ro,
.B rw=, ro=
and
.B root=
options can be supplied for additional
modes.
.RE

.sp
.ne 2
.mk
.na
\fBsec=\fInone\fR
.ad
.sp .6
.RS 4n
If the option \fBsec=\fInone\fR is specified when the client uses
.B AUTH_NONE,
or if the client uses a security mode that is not one that
the file system is shared with, then the credential of each \fBNFS\fR
request is treated as unauthenticated. See the \fBanon=\fIuid\fR option
for a description of how unauthenticated requests are handled.
.RE

.sp
.ne 2
.mk
.na
.B secure
.ad
.sp .6
.RS 4n
This option has been deprecated in favor of the \fBsec=\fIdh\fR
option.
.RE

.sp
.ne 2
.mk
.na
\fBwindow=\fIvalue\fR
.ad
.sp .6
.RS 4n
When sharing with \fBsec=\fIdh\fR, set the maximum life time (in
seconds) of the
.B RPC
request's credential (in the authentication
header) that the
.B NFS
server allows. If a credential arrives with a
life time larger than what is allowed, the
.B NFS
server rejects the
request. The default value is 30000 seconds (8.3 hours).
.RE

.RE

.SS "\fIaccess_list\fR"
.sp
.LP
The
.I access_list
argument is a colon-separated list whose components
may be any number of the following:
.sp
.ne 2
.mk
.na
.B hostname
.ad
.sp .6
.RS 4n
The name of a host. With a server configured for
.B DNS
or
.BR LDAP
naming in the \fBnsswitch\fR "hosts" entry, any hostname must be represented
as a fully qualified
.B DNS
or
.B LDAP
name.
.RE

.sp
.ne 2
.mk
.na
.B netgroup
.ad
.sp .6
.RS 4n
A netgroup contains a number of hostnames. With a server configured for
\fBDNS\fR or \fBLDAP\fR naming in the \fBnsswitch\fR "hosts" entry, any
hostname in a netgroup must be represented as a fully qualified
.B DNS
or
.B LDAP
name.
.RE

.sp
.ne 2
.mk
.na
.B domain name suffix
.ad
.sp .6
.RS 4n
To use domain membership the server must use
.B DNS
or
.B LDAP
to
resolve hostnames to \fBIP\fR addresses; that is, the "hosts" entry in the
\fB/etc/nsswitch.conf\fR must specify "dns" or "ldap" ahead of "nis" or
"nisplus", since only \fBDNS\fR and \fBLDAP\fR return the full domain name
of the host. Other name services like
.B NIS
or
.B NIS+
cannot be used
to resolve hostnames on the server because when mapping an
.B IP
address
to a hostname they do not return domain information. For example,
.sp
.in +2
.nf
NIS or NIS+   172.16.45.9 --> "myhost"
.fi
.in -2
.sp

and
.sp
.in +2
.nf
DNS or LDAP   172.16.45.9 -->
     "myhost.mydomain.mycompany.com"
.fi
.in -2
.sp

The domain name suffix is distinguished from hostnames and netgroups by a
prefixed dot. For example,
.sp
.B rw=.mydomain.mycompany.com
.sp
A single dot can be used to match a hostname with no suffix. For example,
.sp
.B rw=.
.sp
matches "mydomain" but not "mydomain.mycompany.com". This feature can be
used to match hosts resolved through
.B NIS
and
.B NIS+
rather than
.B DNS
and
.BR LDAP .
.RE

.sp
.ne 2
.mk
.na
.B network
.ad
.sp .6
.RS 4n
The network or subnet component is preceded by an at-sign
.RB ( @ ).
It can
be either a name or a dotted address. If a name, it is converted to a dotted
address by
.BR getnetbyname "(3SOCKET). For example,"
.sp
.B =@mynet
.sp
would be equivalent to:
.sp
.B =@172.16
or
.BR =@172.16.0.0
.sp
The network prefix assumes an octet-aligned netmask determined from the
zeroth octet in the low-order part of the address up to and including the
high-order octet, if you want to specify a single IP address (see below). In
the case where network prefixes are not byte-aligned, the syntax allows a
mask length to be specified explicitly following a slash (\fB/\fR)
delimiter. For example,
.sp
.B =@theothernet/17
or
.BR =@172.16.132/22
.sp
\&.\|.\|.where the mask is the number of leftmost contiguous significant bits
in the corresponding IP address.
.sp
When specifying individual IP addresses, use the same
.B @
notation
described above, without a netmask specification. For example:
.sp
.in +2
.nf
=@172.16.132.14
.fi
.in -2
.sp

Multiple, individual IP addresses would be specified, for example, as:
.sp
.in +2
.nf
root=@172.16.132.20:@172.16.134.20
.fi
.in -2
.sp

.RE

.sp
.LP
A prefixed minus sign (\fB\(mi\fR) denies access to that component of
.IR access_list .
The list is searched sequentially until a match is found
that either grants or denies access, or until the end of the list is
reached. For example, if host "terra" is in the "engineering" netgroup,
then
.sp
.in +2
.nf
rw=-terra:engineering
.fi
.in -2
.sp

.sp
.LP
denies access to
.B terra
but
.sp
.in +2
.nf
rw=engineering:-terra
.fi
.in -2
.sp

.sp
.LP
grants access to
.BR terra .
.SH OPERANDS
.sp
.LP
The following operands are supported:
.sp
.ne 2
.mk
.na
.I pathname
.ad
.sp .6
.RS 4n
The pathname of the file system to be shared.
.RE

.SH EXAMPLES
.LP
.B Example 1
Sharing A File System With Logging Enabled
.sp
.LP
The following example shows the
.B /export
file system shared with
logging enabled:

.sp
.in +2
.nf
example% \fBshare -o log /export\fR
.fi
.in -2
.sp

.sp
.LP
The default global logging parameters are used since no tag identifier is
specified. The location of the log file, as well as the necessary logging
work files, is specified by the global entry in
.BR /etc/nfs/nfslog.conf .
The \fBnfslogd\fR(1M) daemon runs only if at least one file system entry in
.B /etc/dfs/dfstab
is shared with logging enabled upon starting or
rebooting the system. Simply sharing a file system with logging enabled from
the command line does not start the \fBnfslogd\fR(1M).

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.sp .6
.RS 4n
Successful completion.
.RE

.sp
.ne 2
.mk
.na
.B >0
.ad
.sp .6
.RS 4n
An error occurred.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/dfs/fstypes
.ad
.sp .6
.RS 4n
list of system types,
.B NFS
by default
.RE

.sp
.ne 2
.mk
.na
.B /etc/dfs/sharetab
.ad
.sp .6
.RS 4n
system record of shared file systems
.RE

.sp
.ne 2
.mk
.na
.B /etc/nfs/nfslogtab
.ad
.sp .6
.RS 4n
system record of logged file systems
.RE

.sp
.ne 2
.mk
.na
.B /etc/nfs/nfslog.conf
.ad
.sp .6
.RS 4n
logging configuration file
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWnfssu
.TE

.SH SEE ALSO
.sp
.LP
.BR mount (1M),
.BR mountd (1M),
.BR nfsd (1M),
.BR nfslogd (1M),
.BR share (1M),
.BR unshare (1M),
.BR getnetbyname (3SOCKET),
.BR nfslog.conf (4),
.BR netgroup (4),
.BR attributes (5),
.BR nfssec (5)
.SH NOTES
.sp
.LP
If the
.B sec=
option is presented at least once, all uses of the
.B "window=, rw,"
.B "ro, rw=,"
.B ro=
and
.BR root=
options must come \fBafter\fR the first \fBsec=\fR option. If the \fBsec=\fR
option is not presented, then \fBsec=\fIsys\fR is implied.
.sp
.LP
If one or more explicit
.B sec=
options are presented,
.I sys
must
appear in one of the options mode lists for accessing using the
.B AUTH_SYS
security mode to be allowed. For example:
.sp
.in +2
.nf
\fBshare\fR \fB-F\fR \fBnfs /var\fR
\fBshare\fR \fB-F\fR \fBnfs\fR \fB-o\fR \fBsec=sys /var\fR
.fi
.in -2
.sp

.sp
.LP
grants read-write access to any host using
.B AUTH_SYS,
but
.sp
.in +2
.nf
\fBshare\fR \fB-F\fR \fBnfs\fR \fB-o\fR \fBsec=dh /var\fR
.fi
.in -2
.sp

.sp
.LP
grants no access to clients that use
.BR AUTH_SYS.
.sp
.LP
Unlike previous implementations of
.BR share_nfs ,
access checking for the
.B window=, rw, ro, rw=,
and
.B ro=
options is done per
.BR NFS
request, instead of per mount request.
.sp
.LP
Combining multiple security modes can be a security hole in situations
where the
.B ro=
and
.B rw=
options are used to control access to
weaker security modes. In this example,
.sp
.in +2
.nf
\fBshare\fR \fB-F\fR \fBnfs\fR \fB-o\fR \fBsec=dh,rw,sec=sys,rw=hosta /var\fR
.fi
.in -2
.sp

.sp
.LP
an intruder can forge the IP address for
.B hosta
(albeit on each
.B NFS
request) to side-step the stronger controls of \fBAUTH_DES.\fR
Something like:
.sp
.in +2
.nf
\fBshare\fR \fB-F\fR \fBnfs\fR \fB-o\fR \fBsec=dh,rw,sec=sys,ro /var\fR
.fi
.in -2
.sp

.sp
.LP
is safer, because any client (intruder or legitimate) that avoids
.B AUTH_DES
only gets read-only access. In general, multiple security
modes per
.B share
command should only be used in situations where the
clients using more secure modes get stronger access than clients using less
secure modes.
.sp
.LP
If
.B rw=,
and
.B ro=
options are specified in the same
.BR sec=
clause, and a client is in both lists, the order of the two options
determines the access the client gets. If client
.B hosta
is in two
netgroups -
.B group1
and
.B group2
- in this example, the client
would get read-only access:
.sp
.in +2
.nf
\fBshare\fR \fB-F\fR \fBnfs\fR \fB-o\fR \fBro=group1,rw=group2 /var\fR
.fi
.in -2
.sp

.sp
.LP
In this example
.B hosta
would get read-write access:
.sp
.in +2
.nf
\fBshare\fR \fB-F\fR \fBnfs\fR \fB-o\fR \fBrw=group2,ro=group1 /var\fR
.fi
.in -2
.sp

.sp
.LP
If within a
.B sec=
clause, both the
.B ro
and
.B rw=
options are
specified, for compatibility, the order of the options rule is not enforced.
All hosts would get read-only access, with the exception to those in the
read-write list. Likewise, if the
.B ro=
and
.B rw
options are
specified, all hosts get read-write access with the exceptions of those in
the read-only list.
.sp
.LP
The
.B ro=
and
.B rw=
options are guaranteed to work over
.BR UDP
and
.B TCP
but may not work over other transport providers.
.sp
.LP
The
.B root=
option with
.B AUTH_SYS
is guaranteed to work over
.B UDP
and
.B TCP
but may not work over other transport providers.
.sp
.LP
The
.B root=
option with
.B AUTH_DES
is guaranteed to work over any
transport provider.
.sp
.LP
There are no interactions between the
.B root=
option and the \fBrw, ro,
rw=,\fR and
.B ro=
options. Putting a host in the
.B root
list does
not override the semantics of the other options. The access the host gets is
the same as when the
.B root=
options is absent. For example, the
following
.B share
command denies access to
.BR hostb:
.sp
.in +2
.nf
\fBshare\fR \fB-F\fR \fBnfs\fR \fB-o\fR \fBro=hosta,root=hostb /var\fR
.fi
.in -2
.sp

.sp
.LP
The following gives read-only permissions to \fBhostb:\fR
.sp
.in +2
.nf
\fBshare\fR \fB-F\fR \fBnfs\fR \fB-o\fR \fBro=hostb,root=hostb /var\fR
.fi
.in -2
.sp

.sp
.LP
The following gives read-write permissions to \fBhostb:\fR
.sp
.in +2
.nf
\fBshare\fR \fB-F\fR \fBnfs\fR \fB-o\fR \fBro=hosta,rw=hostb,root=hostb /var\fR
.fi
.in -2
.sp

.sp
.LP
If the file system being shared is a symbolic link to a valid pathname, the
canonical path (the path which the symbolic link follows) are shared. For
example, if \fB/export/foo\fR is a symbolic link to \fB/export/bar\fR
(\fB/export/foo -> /export/bar\fR), the following \fBshare\fR command
results in
.B /export/bar
as the shared pathname (and not
.BR /export/foo ).
.sp
.in +2
.nf
\fBexample# share\fR \fB-F\fR \fBnfs /export/foo\fR
.fi
.in -2
.sp

.sp
.LP
An
.B NFS
mount of
.B server:/export/foo
results in
.B server:/export/bar
really being mounted.
.sp
.LP
This line in the \fB/etc/dfs/dfstab\fR file shares the \fB/disk\fR file
system read-only at boot time:
.sp
.in +2
.nf
\fBshare\fR \fB-F\fR \fBnfs\fR \fB-o\fR \fBro /disk\fR
.fi
.in -2
.sp

.sp
.LP
The same command entered from the command line does not share the
.B /disk
file system unless there is at least one file system entry in
the \fB/etc/dfs/dfstab\fR file. The \fBmountd\fR(1M) and \fBnfsd\fR(1M)
daemons only run if there is a file system entry in \fB/etc/dfs/dfstab\fR
when starting or rebooting the system.
.sp
.LP
The \fBmountd\fR(1M) process allows the processing of a path name the
contains a symbolic link. This allows the processing of paths that are not
themselves explicitly shared with
.BR share_nfs .
For example,
.B /export/foo
might be a symbolic link that refers to
.BR /export/bar
which has been specifically shared. When the client mounts \fB/export/foo\fR
the
.B mountd
processing follows the symbolic link and responds with the
.BR /export/bar .
The NFS Version 4 protocol does not use the
.BR mountd
processing and the client's use of
.B /export/foo
does not work as it
does with NFS Version 2 and Version 3 and the client receives an error when
attempting to mount
.BR /export/foo .
