usr/src/man/man1m/shareall.1m
'\" te
.\" Copyright 1989 AT&T  Copyright (c) 1995, Sun Microsystems, Inc.  All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH shareall 1M "6 Nov 2000" "SunOS 5.11" "System Administration Commands"
.SH NAME
shareall, unshareall \- share, unshare multiple resources
.SH SYNOPSIS
.LP
.nf
\fBshareall\fR [\fB-F\fR \fIFSType\fR [,\fIFSType\fR].\|.\|.] [\fB-|\fR \fIfile\fR]
.fi

.LP
.nf
\fBunshareall\fR [\fB-F\fR \fIFSType\fR [,\fIFSType\fR].\|.\|.]
.fi

.SH DESCRIPTION
.sp
.LP
When used with no arguments,
.B shareall
shares all resources from
.BR file ,
which contains a list of
.B share
command lines. If the
operand is a hyphen (\(mi), then the
.B share
command lines are obtained
from the standard input. Otherwise, if neither a
.B file
nor a hyphen is
specified, then the file
.B /etc/dfs/dfstab
is used as the default.
.sp
.LP
Resources may be shared by specific file system types by specifying the
file systems in a comma-separated list as an argument to
.BR -F .
.sp
.LP
.B unshareall
unshares all currently shared resources. Without a
.B -F
flag, it unshares resources for all distributed file system
types.
.SH OPTIONS
.sp
.ne 2
.mk
.na
.BI -F " FSType"
.ad
.RS 13n
.rt
Specify file system type. Defaults to the first entry in
.BR /etc/dfs/fstypes .
.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/dfs/dfstab
.ad
.RS 19n
.rt

.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.sp
.LP
.BR share (1M),
.BR unshare (1M),
.BR attributes (5)
