usr/src/man/man1m/sharectl.1m
'\" te
.\" Copyright (c) 2007, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH sharectl 1M "16 Mar 2009" "SunOS 5.11" "System Administration Commands"
.SH NAME
sharectl \- configure and manage file sharing service
.SH SYNOPSIS
.LP
.nf
\fBsharectl\fR  [\fB-h\fR]
.fi

.LP
.nf
\fBsharectl\fR  status [\fB-h\fR] [\fIprotocol\fR]
.fi

.LP
.nf
\fBsharectl\fR  get [\fB-h\fR] [\fB-p\fR \fIproperty\fR].\|.\|. \fIprotocol\fR
.fi

.LP
.nf
\fBsharectl\fR  set [\fB-h\fR] [\fB-p\fR \fIproperty\fR=\fIvalue\fR].\|.\|. \fIprotocol\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B sharectl
command operates on file-sharing protocols, such as NFS.
The command sets the client and server operational properties, takes and
restores configuration snapshots, and gets status of the protocol service.
.sp
.LP
The
.B get
and
.B set
subcommands (see below) require root privileges
or that you assume the Primary Administrator role. A non-privileged user can
change the Solaris CIFS client's persistent settings when granted the SMBFS
Management rights profile in the
.B /etc/user_attr
file. See
.BR user_attr (4)
and
.BR rbac (5).
An authorized user can use
.B sharectl
to set global values for Solaris CIFS server properties in
the Solaris server management facility. See
.BR smb (4).
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -h
.ad
.sp .6
.RS 4n
Displays usage message.
.RE

.sp
.ne 2
.mk
.na
\fB-p\fR \fIproperty\fR[=\fIvalue\fR]\fR
.ad
.sp .6
.RS 4n
Specifies a property. See "Subcommands," below.
.RE

.SS "Subcommands"
.sp
.LP
.B sharectl
supports the subcommands described below. The form of a
.B sharectl
command is:
.sp
.in +2
.nf
# \fBsharectl \fIsubcommand\fR [\fIoption\fR]\fR
.fi
.in -2
.sp

.sp
.ne 2
.mk
.na
\fBget\fR [\fB-p\fR\ \fIproperty\fR] \fIprotocol\fR
.ad
.sp .6
.RS 4n
Get the property values for the specified protocol. If no
.B -p
option
is provided, get all the properties for the specified protocol. For NFS,
properties correspond to entries in the
.B /etc/default/nfs
file. See
.BR nfs (4).
.RE

.sp
.ne 2
.mk
.na
\fBset\fR [\fB-p\fR\ \fIproperty\fR=\fIvalue\fR].\|.\|. \fIprotocol\fR
.ad
.sp .6
.RS 4n
Set properties for the specified file sharing protocol.
.RE

.sp
.ne 2
.mk
.na
\fBstatus\fR [\fIprotocol\fR]\fR
.ad
.sp .6
.RS 4n
Display status of the specified protocol, or, if no protocol is specified,
of all file-sharing protocols.
.RE

.SH EXAMPLES
.LP
.B Example 1
Setting a Property
.sp
.LP
The following command sets the minimum version of the server NFS protocol
to version 3.

.sp
.in +2
.nf
% \fBsharectl -p server_versmin=3 nfs\fR
.fi
.in -2
.sp

.LP
.B Example 2
Getting Properties
.sp
.LP
The following command gets the properties for the NFS protocol.

.sp
.in +2
.nf
% \fBsharectl get nfs\fR
lockd_listen_backlog=32
lockd_servers=20
lockd_retransmit_timeout=5
grace_period=90
nfsmapid_domain=sun.com
servers=16
server_versmin=2
server_versmax=4
max_connections=-1
.fi
.in -2
.sp

.sp
.LP
The following command gets the value of the grace_period property for the
NFS protocol.

.sp
.in +2
.nf
% \fBsharectl get -p grace_period nfs\fR
grace_period=90
.fi
.in -2
.sp

.LP
.B Example 3
Obtaining Status
.sp
.LP
The following command obtains the status of all file-sharing protocols on a
system.

.sp
.in +2
.nf
% \fBsharectl status\fR
nfs      enabled
.fi
.in -2
.sp

.LP
.B Example 4
Configuring Global Settings
.sp
.LP
The following command shows how an authorized user can use
.BR sharectl
commands to configure global settings for the
.B ex.com
environment in
the service management facility (SMF). See
.BR nsmbrc (4)
for a description
of the example environment,
.BR ex.com .
See
.BR smf (5)
for a description
of the SMF.

.sp
.in +2
.nf
# \fBsharectl set -p section=default -p workgroup=SALES \e
-p timeout=5 smbfs\fR
# \fBsharectl set -p section=FSERVER -p addr=fserv.ex.com smbfs\fR
# \fBsharectl set -p section=RSERVER -p workgroup=REMGROUP \e
-p addr=rserv.ex.com smbfs\fR
# \fBsharectl set -p section=RSERVER:george -p timeout=30 smbfs\fR
# \fBsharectl set -p section="SSERV:*:POKY" -p addr=sserv.ex.com \e
-p timeout=25 smbfs\fR
.fi
.in -2
.sp

.LP
.B Example 5
Displaying Current Settings
.sp
.LP
The following command shows how an authorized user can use the \fBsharectl
get\fR command to view the global settings for \fBsmbfs\fR in the SMF. The
values shown are those set by the previous example.

.sp
.in +2
.nf
% # \fBsharectl get smbfs\fR
[default]
workgroup=SALES
timeout=5
[FSERVER]
addr=fserv.ex.com
[RSERVER]
workgroup=REMGROUP
addr=rserv.ex.com
[RSERVER:george]
timeout=30
[SSERV:*:POKY]
addr=sserv.ex.com
timeout=25
.fi
.in -2
.sp

.SH EXIT STATUS
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 12n
.rt
Successful completion.
.RE

.sp
.ne 2
.mk
.na
.I non-zero
.ad
.RS 12n
.rt
Command failed.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B /usr/include/libshare.h
.ad
.RS 27n
.rt
Error codes used for exit status.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
.BR sharemgr (1M),
.BR nfs (4),
.BR nsmbrc (4),
.BR user_attr (4),
.BR attributes (5),
.BR rbac (5),
.BR smb (4),
.BR smf (5),
.BR standards (5)
