usr/src/man/man1m/showrev.1m
'\" te
.\" Copyright (c) 2002 Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH showrev 1M "6 Apr 2005" "SunOS 5.11" "System Administration Commands"
.SH NAME
showrev \- show machine, software revision, and patch revision
information
.SH SYNOPSIS
.LP
.nf
\fB/usr/bin/showrev\fR [\fB-a\fR] [\fB-p\fR | \fB-p\fR \fB-R\fR \fIroot_path\fR] [\fB-w\fR]
     [\fB-c\fR \fIcommand\fR] [\fB-s\fR \fIhostname\fR]
.fi

.SH DESCRIPTION
.sp
.LP
.B showrev
displays revision information for the current hardware and
software. With no arguments,
.B showrev
shows the system revision
information including hostname, hostid, release, kernel architecture,
application architecture, hardware provider, domain, and kernel version.
.sp
.LP
If a command is supplied with the
.B -c
option,
.B showrev
shows the
.B PATH
and
.B LD_LIBRARY_PATH
and finds out all the directories
within the
.B PATH
that contain it. For each file found, its file type,
revision, permissions, library information, and checksum are printed as
well.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -a
.ad
.RS 16n
.rt
Print all system revision information available. Window system and patch
information are added.
.RE

.sp
.ne 2
.mk
.na
.B -c
.I command
.ad
.RS 16n
.rt
Print the revision information about
.IR command.
.RE

.sp
.ne 2
.mk
.na
.B -p
.ad
.RS 16n
.rt
Print only the revision information about patches.
.RE

.sp
.ne 2
.mk
.na
.B -R
.I root_path
.ad
.RS 16n
.rt
Define the full path name of a directory to use as the
.IR root_path .
By
specifying the root path,
.B showrev
retrieves the revision information
about the patch from package system information files located under a
directory tree starting at
.IR root_path .
The
.I root_path
can be
specified when retrieving installed patch information in a client from a
server, for example,
.BR /export/root/client1 .
.LP
Note -
.sp
.RS 2
The root file system of any non-global zones must not be referenced with
the
.B -R
option. Doing so might damage the global zone's file system,
might compromise the security of the global zone, and might damage the
non-global zone's file system. See
.BR zones (5).
.RE
.RE

.sp
.ne 2
.mk
.na
.B -s
.I hostname
.ad
.RS 16n
.rt
Perform this operation on the specified
.IR hostname .
The
.BR -s
operation completes correctly only when
.I hostname
is running Solaris
2.5 or compatible versions.
.RE

.sp
.ne 2
.mk
.na
.B -w
.ad
.RS 16n
.rt
Print only the OpenWindows revision information.
.RE

.SH OUTPUT
.sp
.LP
Varies, based on flags passed. If no flags are passed, output similar to
the following appears:
.sp
.in +2
.nf
     Hostname: system1
	Hostid: 7233808e
	Release: 5.10
	Kernel architecture: sun4u
	Application architecture: sparc
	Hardware provider: Sun_Microsystems
	Domain: a.network.COM
	Kernel version: SunOS 5.10 generic
.fi
.in -2
.sp

.SH EXIT STATUS
.sp
.LP
The following error values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 6n
.rt
Successful completion.
.RE

.sp
.ne 2
.mk
.na
.B >0
.ad
.RS 6n
.rt
An error occurred.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWadmc
.TE

.SH SEE ALSO
.sp
.LP
.BR arch (1),
.BR ldd (1),
.BR mcs (1),
.BR sum (1),
.BR patchadd (1M),
.BR attributes (5)
.SH BUGS
.sp
.LP
For the
.B -s
option to work when
.B hostname
is running a version of
Solaris prior to 2.5, the Solstice AdminSuite must be installed on
.BR hostname .
