usr/src/man/man1m/showmount.1m
'\" te
.\" Copyright (c) 1997, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH showmount 1M "26 Oct 2004" "SunOS 5.11" "System Administration Commands"
.SH NAME
showmount \- show remote mounts
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/showmount\fR [\fB-ade\fR] [\fIhostname\fR]
.fi

.SH DESCRIPTION
.sp
.LP
.B showmount
lists the clients that have remotely mounted a filesystem
from
.IR host .
This information is maintained by the
.BR mountd (1M)
server on
.IR host ,
and is saved across crashes in the file
.BR /etc/rmtab .
The default value for
.I host
is the value returned by
.BR hostname (1).
.sp
.LP
The
.B showmount
command does not display the names of NFS Version 4
clients.
.SH OPTIONS
.sp
.ne 2
.mk
.na
.B -a
.ad
.RS 6n
.rt
Print all remote mounts in the format:
.sp
.B hostname : directory
.sp
where
.B hostname
is the name of the client, and
.B directory
is the
root of the file system that has been mounted.
.RE

.sp
.ne 2
.mk
.na
.B -d
.ad
.RS 6n
.rt
List directories that have been remotely mounted by clients.
.RE

.sp
.ne 2
.mk
.na
.B -e
.ad
.RS 6n
.rt
Print the list of shared file systems.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/rmtab
.ad
.RS 14n
.rt

.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWnfscu
.TE

.SH SEE ALSO
.sp
.LP
.BR hostname (1),
.BR mountd (1M),
.BR attributes (5)
.sp
.LP
\fR
.SH BUGS
.sp
.LP
If a client crashes, its entry will not be removed from the list of remote
mounts on the server.
