usr/src/man/man1m/shutdown.1m
'\" te
.\" Copyright (c) 2001 Sun Microsystems, Inc.  All Rights Reserved.
.\" Copyright 1989 AT&T
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH shutdown 1M "9 May 2001" "SunOS 5.11" "System Administration Commands"
.SH NAME
shutdown \- shut down system, change system state
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/shutdown\fR [\fB-y\fR] [\fB-g\fR \fIgrace-period\fR] [\fB-i\fR \fIinit-state\fR]
     [\fImessage\fR]
.fi

.SH DESCRIPTION
.sp
.LP
.B shutdown
is executed by the super user to change the state of the
machine. In most cases, it is used to change from the multi-user state
(state 2) to another state.
.sp
.LP
By default,
.B shutdown
brings the system to a state where only the
console has access to the operating system. This state is called
single-user.
.sp
.LP
Before starting to shut down daemons and killing processes, \fBshutdown\fR
sends a warning message and, by default, a final message asking for
confirmation.
.I message
is a string that is sent out following the
standard warning message "The system will be shut down in .\|.\|." If the
string contains more than one word, it should be contained within single
(\fB\&'\fR) or double (\fB"\fR) quotation marks.
.sp
.LP
The warning message and the user provided
.I message
are output when
there are 7200, 3600, 1800, 1200, 600, 300, 120, 60, and 30 seconds
remaining before
.B shutdown
begins. See
.BR EXAMPLES .
.sp
.LP
System state definitions are:
.sp
.ne 2
.mk
.na
.B state 0
.ad
.RS 14n
.rt
Stop the operating system.
.RE

.sp
.ne 2
.mk
.na
.B state 1
.ad
.RS 14n
.rt
State 1 is referred to as the administrative state. In state 1 file systems
required for multi-user operations are mounted, and logins requiring access
to multi-user file systems can be used. When the system comes up from
firmware mode into state 1, only the console is active and other multi-user
(state 2) services are unavailable. Note that not all user processes are
stopped when transitioning from multi-user state to state 1.
.RE

.sp
.ne 2
.mk
.na
.B state s, S
.ad
.RS 14n
.rt
State s (or S) is referred to as the single-user state. All user processes
are stopped on transitions to this state. In the single-user state, file
systems required for multi-user logins are unmounted and the system can only
be accessed through the console. Logins requiring access to multi-user file
systems cannot be used.
.RE

.sp
.ne 2
.mk
.na
.B state 5
.ad
.RS 14n
.rt
Shut the machine down so that it is safe to remove the power. Have the
machine remove power, if possible. The
.B rc0
procedure is called to
perform this task.
.RE

.sp
.ne 2
.mk
.na
.B state 6
.ad
.RS 14n
.rt
Stop the operating system and reboot to the state defined by the
.B initdefault
entry in
.BR /etc/inittab .
The
.B rc6
procedure is
called to perform this task.
.RE

.SH OPTIONS
.sp
.ne 2
.mk
.na
.B -y
.ad
.RS 19n
.rt
Pre-answer the confirmation question so the command can be run without user
intervention.
.RE

.sp
.ne 2
.mk
.na
.BI -g " grace-period"
.ad
.RS 19n
.rt
Allow the super user to change the number of seconds from the 60-second
default.
.RE

.sp
.ne 2
.mk
.na
.BI -i " init-state"
.ad
.RS 19n
.rt
If there are warnings,
.I init-state
specifies the state
.B init
is
to be in. By default, system state `\fBs\fR' is used.
.RE

.SH EXAMPLES
.LP
.B Example 1
Using
.BR shutdown
.sp
.LP
In the following example,
.B shutdown
is being executed on host
.B foo
and is scheduled in 120 seconds. The warning message is output 2
minutes, 1 minute, and 30 seconds before the final confirmation message.

.sp
.in +2
.nf
example# shutdown -i S -g 120 "===== disk replacement ====="
Shutdown started.   Tue Jun   7  14:51:40 PDT  1994

Broadcast Message from root (pts/1) on foo Tue Jun  7 14:51:41.\|.\|.
The system will be shut down in 2 minutes
===== disk replacement =====
Broadcast Message from root (pts/1) on foo Tue Jun  7 14:52:41.\|.\|.
The system will be shut down in 1 minutes
===== disk replacement =====
Broadcast Message from root (pts/1) on foo Tue Jun  7 14:53:41.\|.\|.
The system will be shut down in 30 seconds
===== disk replacement =====
Do you want to continue? (y or n):
.fi
.in -2
.sp

.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/inittab
.ad
.RS 16n
.rt
controls process dispatching by
.BR init
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.sp
.LP
.BR boot (1M),
.BR halt (1M),
.BR init (1M),
.BR killall (1M),
.BR reboot (1M),
.BR ufsdump (1M),
.BR init.d (4),
.BR inittab (4),
.BR nologin (4),
.BR attributes (5)
.SH NOTES
.sp
.LP
When a system transitions down to the
.B S
or
.B s
state, the
.B /etc/nologin
file (see
.BR nologin (4))
is created. Upon subsequent
transition to state 2 (multi-user state), this file is removed by a script
in the
.B /etc/rc2.d
directory.
