usr/src/man/man1m/slpd.1m
'\" te
.\" Copyright (C) 2004, Sun Microsystems, Inc. All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH slpd 1M "23 Aug 2004" "SunOS 5.11" "System Administration Commands"
.SH NAME
slpd \- Service Location Protocol Daemon
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/inet/slpd\fR [\fB-f\fR \fIconfiguration-file\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The
.B slpd
daemon provides common server functionality for the Service
Location Protocol ("\fBSLP\fR") versions 1 and 2, as defined by \fBIETF\fR
in
.I "RFC 2165"
and
.IR "RFC 2608" .
.B SLP
provides a scalable
framework for the discovery and selection of network services.
.sp
.LP
.B slpd
provides the following framework services:
.sp
.ne 2
.mk
.na
.B Directory Agent
.ad
.sp .6
.RS 4n
This service automatically caches service advertisements from service
agents to provide them to user agents, and makes directory agent
advertisements of its services. This service is optional.
.B slpd
does
not provide directory agent service by default. Directory agents are not
databases, and they do not need to be maintained.
.RE

.sp
.ne 2
.mk
.na
.B Service Agent Server
.ad
.sp .6
.RS 4n
All service agents on the local host register and deregister with this
server. This service responds to all requests for services, and forwards
registrations to directory agents. By default,
.B slpd
is a service agent
server.
.RE

.sp
.ne 2
.mk
.na
.B Passive Directory Agent Discovery
.ad
.sp .6
.RS 4n
This service listens for directory agent advertisements and maintains a
table of active directory agents.  When a user agent wishes to discover a
directory agent, it can simply query
.BR slpd ,
obviating the need to
perform discovery by means of multicast. By default,
.B slpd
performs
this service.
.RE

.sp
.ne 2
.mk
.na
.B Proxy Registration
.ad
.sp .6
.RS 4n
This service can act as a proxy service agent for services that cannot
register themselves.
.B slpd
reads the proxy registration file for
information on services it is to proxy. By default, no services are
registered by proxy.
.RE

.sp
.LP
All configuration options are available from the configuration file.
.B slpd
reads its configuration file upon startup.
.sp
.LP
Stop and start the slpd daemon using
.BR svcadm "(1M).  Use the command"
.B svcadm enable network/slp
to start the slpd daemon.  Use the command
.B svcadm disable network/slp
to stop it.
.sp
.LP
The file
.B /etc/inet/slp.conf
must exist before the
.B slp
service
can start the daemon. Only the example file \fB/etc/inet/slp.conf.example\fR
is present by default. To enable
.BR SLP ,
copy
.B /etc/inet/slp.conf.example
to \fB/etc/inet/slp.conf\fR.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -f
.I configuration-file
.ad
.RS 25n
.rt
Specify an alternate configuration file
.RE

.SH EXAMPLES
.LP
.B Example 1
Stopping the
.B slpd
daemon
.sp
.LP
The following command stops the
.B slpd
daemon:

.sp
.in +2
.nf
example# svcadm disable network/slp
.fi
.in -2
.sp

.LP
.B Example 2
Restarting the
.B slpd
daemon
.sp
.LP
The following command restarts the
.B slpd
daemon:

.sp
.in +2
.nf
example# svcadm restart network/slp
.fi
.in -2
.sp

.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/inet/slp.conf
.ad
.RS 22n
.rt
The default configuration file
.RE

.sp
.ne 2
.mk
.na
.B slpd.reg
.ad
.RS 22n
.rt
The proxy registration file
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWslpu, SUNWslpr
_
CSIEnabled
_
Interface Stability		Evolving
.TE

.SH SEE ALSO
.sp
.LP
.BR svcs (1),
.BR svcadm (1M),
.BR slp_api (3SLP),
.BR slp.conf (4),
.BR slpd.reg (4),
.BR attributes (5),
.BR smf (5),
.BR slp (7P)
.sp
.LP
\fR
.sp
.LP
Guttman, E.,  Perkins, C., Veizades, J., and Day, M., \fIRFC 2608, Service
Location Protocol, Version 2\fR, The Internet Society, June 1999.
.SH NOTES
.sp
.LP
The
.B slpd
service is managed by the service management facility,
.BR smf (5),
under the service identifier:
.sp
.in +2
.nf
svc:/network/slp
.fi
.in -2
.sp

.sp
.LP
Administrative actions on this service, such as enabling, disabling, or
requesting restart, can be performed using
.BR svcadm (1M).
The service's
status can be queried using the
.BR svcs (1)
command.
