usr/src/man/man1m/smbadm.1m
'\" te
.\" Copyright (c) 2009, Sun Microsystems, Inc. All Rights Reserved.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH smbadm 1M "8 Jan 2009" "SunOS 5.11" "System Administration Commands"
.SH NAME
smbadm \- configure and manage CIFS local groups and users, and manage domain
membership
.SH SYNOPSIS
.LP
.nf
\fBsmbadm add-member\fR -m \fImember\fR [[-m \fImember\fR] \&.\|.\|.] \fIgroup\fR
.fi

.LP
.nf
\fBsmbadm create\fR [-d \fIdescription\fR] \fIgroup\fR
.fi

.LP
.nf
\fBsmbadm delete\fR \fIgroup\fR
.fi

.LP
.nf
\fBsmbadm disable-user\fR \fIusername\fR
.fi

.LP
.nf
\fBsmbadm enable-user\fR \fIusername\fR
.fi

.LP
.nf
\fBsmbadm get\fR [[-p \fIproperty\fR] \&.\|.\|.] \fIgroup\fR
.fi

.LP
.nf
\fBsmbadm join\fR -u \fIusername\fR \fIdomain\fR
.fi

.LP
.nf
\fBsmbadm join\fR -w \fIworkgroup\fR
.fi

.LP
.nf
\fBsmbadm list\fR
.fi

.LP
.nf
\fBsmbadm remove-member\fR -m \fImember\fR [[-m \fImember\fR] \&.\|.\|.] \fIgroup\fR
.fi

.LP
.nf
\fBsmbadm rename\fR \fIgroup\fR \fInew-group\fR
.fi

.LP
.nf
\fBsmbadm set\fR -p \fIproperty\fR=\fIvalue\fR [[-p \fIproperty\fR=\fIvalue\fR] \&.\|.\|.] \fIgroup\fR
.fi

.LP
.nf
\fBsmbadm show\fR [-m] [-p] [\fIgroup\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The
.B smbadm
command is used to configure
.B CIFS
local groups and to
manage domain membership. You can also use the
.B smbadm
command to enable
or disable SMB password generation for individual local users.
.sp
.LP
.B CIFS
local groups can be used when Windows accounts must be members of
some local groups and when Windows style privileges must be granted. Solaris
local groups cannot provide these functions.
.sp
.LP
There are two types of local groups: user defined and built-in. Built-in
local groups are predefined local groups to support common administration
tasks.
.sp
.LP
In order to provide proper identity mapping between
.B CIFS
local groups
and Solaris groups, a
.B CIFS
local group must have a corresponding Solaris
group. This requirement has two consequences: first, the group name must
conform to the intersection of the Windows and Solaris group name rules. Thus,
a
.B CIFS
local group name can be up to eight (8) characters long and
contain only lowercase characters and numbers. Second, a Solaris local group
has to be created before a
.B CIFS
local group can be created.
.sp
.LP
Built-in groups are standard Windows groups and are predefined by the
.B CIFS
service. The built-in groups cannot be added, removed, or renamed,
and these groups do not follow the
.B CIFS
local group naming
conventions.
.sp
.LP
When the
.B CIFS
server is started, the following built-in groups are
available:
.sp
.ne 2
.mk
.na
.B Administrators
.ad
.sp .6
.RS 4n
Group members can administer the system.
.RE

.sp
.ne 2
.mk
.na
.B Backup Operators
.ad
.sp .6
.RS 4n
Group members can bypass file access controls to back up and restore files.
.RE

.sp
.ne 2
.mk
.na
.B Power Users
.ad
.sp .6
.RS 4n
Group members can share directories.
.RE

.sp
.LP
Solaris local users must have an SMB password for authentication and to gain
access to CIFS resources. This password is created by using the
.BR passwd (1)
command when the
.B pam_smb_password
module is added to the
system's PAM configuration. See the
.BR pam_smb_passwd (5)
man page.
.sp
.LP
The
.B disable-user
and
.B enable-user
subcommands control SMB
password-generation for a specified local user. When disabled, the user is
prevented from connecting to the Solaris CIFS service. By default, SMB
password-generation is enabled for all local users.
.sp
.LP
To reenable a disabled user, you must use the
.B enable-user
subcommand
and then reset the user's password by using the
.B passwd
command. The
.B pam_smb_passwd.so.1
module must be added to the system's PAM
configuration to generate an SMB password.
.SS "Escaping Backslash Character"
.sp
.LP
For the
.BR add-member ,
.BR remove-member ,
and
.B join
(with
.BR -u )
subcommands, the backslash character (\fB\e\fR) is a valid separator between
member or user names and domain names. The backslash character is a shell
special character and must be quoted. For example, you might escape the
backslash character with another backslash character:
\fIdomain\fB\e\e\fIusername\fR. For more information about handling
shell special characters, see the man page for your shell.
.SH OPERANDS
.sp
.LP
The
.B smbadm
command uses the following operands:
.sp
.ne 2
.mk
.na
.I domain
.ad
.sp .6
.RS 4n
Specifies the name of an existing Windows domain to join.
.RE

.sp
.ne 2
.mk
.na
.I group
.ad
.sp .6
.RS 4n
Specifies the name of the
.B CIFS
local group.
.RE

.sp
.ne 2
.mk
.na
.I username
.ad
.sp .6
.RS 4n
Specifies the name of a Solaris local user.
.RE

.SH SUB-COMMANDS
.sp
.LP
The
.B smbadm
command includes these subcommands:
.sp
.ne 2
.mk
.na
.B add-member
-m \fImember\fR [[-m \fImember\fR] \&.\|.\|.]
.I group
.ad
.sp .6
.RS 4n
Adds the specified member to the specified
.B CIFS
local group. The
.B -m
.I member
option specifies the name of a
.B CIFS
local group
member. The member name must include an existing user name and an optional
domain name.
.sp
Specify the member name in either of the following formats:
.sp
.in +2
.nf
[\fIdomain\fR\e]\fIusername\fR
[\fIdomain\fR/]\fIusername\fR
.fi
.in -2
.sp

For example, a valid member name might be \fBsales\eterry\fR or
.BR sales/terry ,
where
.B sales
is the Windows domain name and
.B terry
is the name of a user in the
.B sales
domain.
.RE

.sp
.ne 2
.mk
.na
.B create
[\fB-d\fR \fIdescription\fR] \fIgroup\fR
.ad
.sp .6
.RS 4n
Creates a
.B CIFS
local group with the specified name. You can optionally
specify a description of the group by using the
.B -d
option.
.RE

.sp
.ne 2
.mk
.na
.B delete
.I group
.ad
.sp .6
.RS 4n
Deletes the specified
.B CIFS
local group. The built-in groups cannot be
deleted.
.RE

.sp
.ne 2
.mk
.na
.B disable
.I username
.ad
.sp .6
.RS 4n
Disables SMB password-generation capabilities for the specified local user. A
disabled local user is prevented from accessing the system by means of the
CIFS service. When a local user account is disabled, you cannot use the
.B passwd
command to modify the user's SMB password until the user account
is reenabled.
.RE

.sp
.ne 2
.mk
.na
.B enable
.I username
.ad
.sp .6
.RS 4n
Enables SMB password-generation capabilities for the specified local user.
After the password-generation capabilities are reenabled, you must use the
.B passwd
command to generate the SMB password for the local user before he
can connect to the CIFS service.
.sp
The
.B passwd
command manages both the Solaris password and SMB password
for this user if the
.B pam_smb_passwd
module has been added to the
system's PAM configuration.
.RE

.sp
.ne 2
.mk
.na
\fBget\fR [[\fB-p\fR \fIproperty\fR=\fIvalue\fR] \&.\|.\|.]
.I group
.ad
.sp .6
.RS 4n
Retrieves property values for the specified group. If no property is
specified, all property values are shown.
.RE

.sp
.ne 2
.mk
.na
.B join -u
.I username domain
.ad
.sp .6
.RS 4n
Joins a Windows domain or a workgroup.
.sp
The default mode for the
.B CIFS
service is workgroup mode, which uses the
default workgroup name,
.BR WORKGROUP .
.sp
An authenticated user account is required to join a domain, so you must
specify the Windows administrative user name with the
.B -u
option. If the
password is not specified on the command line, the user is prompted for it.
This user should be the domain administrator or any user who has
administrative privileges for the target domain.
.sp
.I username
and
.I domain
can be entered in any of the following
formats:
.sp
.in +2
.nf
\fIusername\fR[+\fIpassword\fR] \fIdomain\fR
\fIdomain\fR\e\fIusername\fR[+\fIpassword\fR]
\fIdomain\fR/\fIusername\fR[+\fIpassword\fR]
\fIusername\fR@\fIdomain\fR
.fi
.in -2
.sp

\&.\|.\|.where \fIdomain\fR can be the NetBIOS or DNS domain name.
.sp
If a machine trust account for the system already exists on a domain
controller, any authenticated user account can be used when joining the
domain. However, if the machine trust account does
.B not
already exist, an
account that has administrative privileges on the domain is required to join
the domain.
.RE

.sp
.ne 2
.mk
.na
.B join -w
.I workgroup
.ad
.sp .6
.RS 4n
Joins a Windows domain or a workgroup.
.sp
The
.B -w
.I workgroup
option specifies the name of the workgroup to
join when using the
.B join
subcommand.
.RE

.sp
.ne 2
.mk
.na
.B list
.ad
.sp .6
.RS 4n
Shows information about the current workgroup or domain. The information
typically includes the workgroup name or the primary domain name. When in
domain mode, the information includes domain controller names and trusted
domain names.
.sp
Each entry in the ouput is identified by one of the following tags:
.sp
.ne 2
.mk
.na
.B - [*] -
.ad
.RS 11n
.rt
Primary domain
.RE

.sp
.ne 2
.mk
.na
.B - [.] -
.ad
.RS 11n
.rt
Local domain
.RE

.sp
.ne 2
.mk
.na
.B - [-] -
.ad
.RS 11n
.rt
Other domains
.RE

.sp
.ne 2
.mk
.na
.B - [+] -
.ad
.RS 11n
.rt
Selected domain controller
.RE

.RE

.sp
.ne 2
.mk
.na
.B remove-member
-m \fImember\fR [[-m \fImember\fR] \&.\|.\|.]
.I group
.ad
.sp .6
.RS 4n
Removes the specified member from the specified
.B CIFS
local group. The
.B -m
.I member
option specifies the name of a
.B CIFS
local group
member. The member name must include an existing user name and an optional
domain name.
.sp
Specify the member name in either of the following formats:
.sp
.in +2
.nf
[\fIdomain\fR\e]\fIusername\fR
[\fIdomain\fR/]\fIusername\fR
.fi
.in -2
.sp

For example, a valid member name might be \fBsales\eterry\fR or
.BR sales/terry ,
where
.B sales
is the Windows domain name and
.B terry
is the name of a user in the
.B sales
domain.
.RE

.sp
.ne 2
.mk
.na
.B rename
.I group new-group
.ad
.sp .6
.RS 4n
Renames the specified
.B CIFS
local group. The group must already exist.
The built-in groups cannot be renamed.
.RE

.sp
.ne 2
.mk
.na
\fBset -p\fR \fIproperty\fR=\fIvalue\fR [[\fB-p\fR
\fIproperty\fR=\fIvalue\fR] \&.\|.\|.] \fIgroup\fR
.ad
.sp .6
.RS 4n
Sets configuration properties for a
.B CIFS
local group. The description
and the privileges for the built-in groups cannot be changed.
.sp
The \fB-p\fR \fIproperty\fB=\fIvalue\fR option specifies the list of
properties to be set on the specified group.
.sp
The group-related properties are as follows:
.sp
.ne 2
.mk
.na
.B backup=[on|off]
.ad
.sp .6
.RS 4n
Specifies whether members of the
.B CIFS
local group can bypass file
access controls to back up file system objects.
.RE

.sp
.ne 2
.mk
.na
\fBdescription=\fIdescription-text\fR
.ad
.sp .6
.RS 4n
Specifies a text description for the
.B CIFS
local group.
.RE

.sp
.ne 2
.mk
.na
.B restore=[on|off]
.ad
.sp .6
.RS 4n
Specifies whether members of the
.B CIFS
local group can bypass file
access controls to restore file system objects.
.RE

.sp
.ne 2
.mk
.na
.B take-ownership=[on|off]
.ad
.sp .6
.RS 4n
Specifies whether members of the
.B CIFS
local group can take ownership of
file system objects.
.RE

.RE

.sp
.ne 2
.mk
.na
\fBshow\fR [\fB-m\fR] [\fB-p\fR] [\fIgroup\fR]\fR
.ad
.sp .6
.RS 4n
Shows information about the specified
.B CIFS
local group or groups. If no
group is specified, information is shown for all groups. If the \fB-m\fR
option is specified, the group members are also shown. If the
.B -p
option
is specified, the group privileges are also shown.
.RE

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 13n
.rt
Successful completion.
.RE

.sp
.ne 2
.mk
.na
.B >0
.ad
.RS 13n
.rt
An error occurred.
.RE

.SH ATTRIBUTES
.sp
.LP
See the
.BR attributes (5)
man page for descriptions of the following
attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWsmbsu
_
Utility Name and OptionsUncommitted
_
Utility Output FormatNot-An-Interface
_
\fBsmbadm join\fRObsolete
.TE

.SH SEE ALSO
.sp
.LP
.BR passwd (1),
.BR groupadd (1M),
.BR idmap (1M),
.BR idmapd (1M),
.BR kclient (1M),
.BR share (1M),
.BR sharectl (1M),
.BR sharemgr (1M),
.BR smbd (1M),
.BR smbstat (1M),
.BR smb (4),
.BR smbautohome (4),
.BR attributes (5),
.BR pam_smb_passwd (5),
.BR smf (5)
