usr/src/man/man1m/smbd.1m
'\" te
.\" Copyright (c) 2007, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH smbd 1M "5 Feb 2008" "SunOS 5.11" "System Administration Commands"
.SH NAME
smbd \- CIFS server daemon
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/smbsrv/smbd\fR
.fi

.SH DESCRIPTION
.sp
.LP
The \fBsmbd\fR daemon handles \fBCIFS\fR/\fBSMB\fR requests from \fBCIFS\fR
.RB "clients, such as Windows clients. Only processes with" " {PRIV_SYS_SMB}"
and sufficient privileges to write the
.B /var/run
directory can run this
daemon.
.sp
.LP
The
.B smbd
daemon is automatically invoked by using the
.BR sharemgr
command over all available transports. By default,
.B smbd
starts over
the NetBIOS-Over-TCP (\fBNBT\fR) and
.B TCP
transports.
.sp
.LP
When
.B smbd
is started over
.BR NBT ,
the following services are
started:
.RS +4
.TP
.ie t \(bu
.el o
The NetBIOS name service is started on
.B UDP
port 137.
.RE
.RS +4
.TP
.ie t \(bu
.el o
The NetBIOS datagram service is started on
.B UDP
port 138.
.RE
.RS +4
.TP
.ie t \(bu
.el o
The NetBIOS session service is started on
.B TCP
port 139.
.RE
.sp
.LP
When the
.B smbd
daemon is started over TCP, the CIFS service is started
on TCP port 445.
.sp
.LP
Only one instance of
.B smbd
may be running at a time.
.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 13n
.rt
Daemon exited cleanly.
.RE

.sp
.ne 2
.mk
.na
.B 95
.ad
.RS 13n
.rt
Daemon exited with a fatal error.
.RE

.sp
.ne 2
.mk
.na
.B 96
.ad
.RS 13n
.rt
Daemon exited with a configuration error.
.RE

.SH ATTRIBUTES
.sp
.LP
See the
.BR attributes (5)
man page for descriptions of the following
attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWsmbsu
_
Interface StabilityUncommitted
.TE

.SH SEE ALSO
.sp
.LP
.BR ps (1),
.BR svcs (1),
.BR sharectl (1M),
.BR sharemgr (1M),
.BR smbadm (1M),
.BR smbstat (1M),
.BR svcadm (1M),
.BR smb (4),
.BR smbautohome (4),
.BR system (4),
.BR attributes (5),
.BR smf (5)
.SH NOTES
.sp
.LP
Use the
.B svcadm
command to perform administrative actions on the
.B smbd
service, such as enabling, disabling, or restarting the service.
Use the
.B svcs
command to query the service status.
.sp
.LP
The
.B smbd
service is managed by the service management facility under
the service identifier
.BR svc:/network/smb/server .
.sp
.LP
If the
.B smbd
service is disabled, it will be enabled by the
.BR sharemgr (1M)
command,  unless its
.B auto_enable
property is set
to false.
