usr/src/man/man1m/smbiod.1m
'\" te
.\" Copyright (c) 2009, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH smbiod 1M "7 Jul 2009" "SunOS 5.11" "System Administration Commands"
.SH NAME
smbiod \- SMB client I/O daemon
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/smbfs/smbiod\fR
.fi

.SH DESCRIPTION
.sp
.LP
.B smbiod
is a helper program that initiates an SMB reconnection, when
needed.
.sp
.LP
When a user runs an
.B smbutil
or
.B mount_smbfs
command, an
.B smbiod
process is started and continues to run until that user no
longer has any SMB client connections. Only one
.B smbiod
process runs
for each user that has SMB client connections.
.sp
.LP
Each
.B smbiod
process instantiates a door service on one of the
following files:
.RS +4
.TP
.ie t \(bu
.el o
.BI /tmp/.smbiod- UID
file for normal users
.RE
.RS +4
.TP
.ie t \(bu
.el o
.B /var/run/smbiod-0
file for superuser
.RE
.sp
.LP
The
.B smbiod
daemon has no external, customer-accessible interfaces.
.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 13n
.rt
Successful completion.
.RE

.sp
.ne 2
.mk
.na
.B >0
.ad
.RS 13n
.rt
An error occurred.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B /usr/lib/smbfs/smbiod
.ad
.RS 25n
.rt
SMB I/O daemon.
.RE

.sp
.ne 2
.mk
.na
.BI /tmp/.smbiod- UID
.ad
.RS 25n
.rt
File on which to instantiate a door service for user
.IR UID .
.RE

.sp
.ne 2
.mk
.na
.B /var/run/smbiod-0
.ad
.RS 25n
.rt
File on which to instantiate a door service for superuser.
.RE

.SH ATTRIBUTES
.sp
.LP
See the
.BR attributes (5)
man page for descriptions of the following
attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWsmbfsu
_
Interface StabilityUncommitted
.TE

.SH SEE ALSO
.sp
.LP
.BR ps (1),
.BR smbutil (1),
.BR mount_smbfs (1M),
.BR attributes (5),
.BR smbfs (7FS)
