usr/src/man/man1m/smbios.1m
'\" te
.\" Copyright (c) 2005, Sun Microsystems, Inc. All Rights Reserved.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH smbios 1M "31 Aug 2005" "SunOS 5.11" "System Administration Commands"
.SH NAME
smbios \- display the contents of a System Management BIOS image
.SH SYNOPSIS
.LP
.nf
\fBsmbios\fR [\fB-BeOsx\fR] [\fB-i\fR \fIid\fR] [\fB-t\fR \fItype\fR] [\fB-w\fR \fIfile\fR] [\fIfile\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The
.B smbios
utility displays the contents of the System Management
BIOS (SMBIOS) image exported by the current system or stored in a file.
SMBIOS is an industry-standard mechanism for low-level system software to
export hardware configuration information to higher-level system management
software. The SMBIOS data format itself is defined by the Distributed
Management Task Force (DMTF). Refer to http://www.dmtf.org for more
information about SMBIOS and to obtain a copy of the SMBIOS specification
and implementation guidelines.
.sp
.LP
The SMBIOS image consists of a table of structures, each describing some
aspect of the system software or hardware configuration. By default,
.B smbios
displays the entire contents of the current SMBIOS image. If
the
.B -s
option is specified,
.B smbios
displays a summary of the
structures that are present in the image. If the
.B -w
option is
specified,
.B smbios
writes a copy of the SMBIOS image to the specified
file.
.B smbios
can then be applied to the resulting file to display its
content.
.sp
.LP
.B smbios
attempts to display each structure and its content in a human-
readable fashion. If
.B smbios
does not recognize a structure's type or
content, the raw hexadecimal data for the structure is displayed.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -B
.ad
.RS 11n
.rt
Disable header validation for broken BIOSes.
.sp
By default,
.B smbios
attempts to validate the SMBIOS header by
verifying the anchor strings, header checksums, and version number. This
option might be necessary when a BIOS has a non-compliant header.
.RE

.sp
.ne 2
.mk
.na
.B -e
.ad
.RS 11n
.rt
 Display the contents of the SMBIOS entry point rather than the contents of the SMBIOS structure table.
.RE

.sp
.ne 2
.mk
.na
.B -i
.I id
.ad
.RS 11n
.rt
Display only the specified structure, named by its integer id.
.RE

.sp
.ne 2
.mk
.na
.B -O
.ad
.RS 11n
.rt
 Display obsolete structure types.
.sp
By default,
.B smbios
elides output for structures whose type is marked
as obsolete in the DMTF SMBIOS specification.
.RE

.sp
.ne 2
.mk
.na
.B -s
.ad
.RS 11n
.rt
Display only a summary listing of the structure identifiers and types,
instead of the content of each selected structure.
.RE

.sp
.ne 2
.mk
.na
.B -t
.I type
.ad
.RS 11n
.rt
Display only those structures whose type matches the specified integer
type, as defined the DMTF SMBIOS specification.
.RE

.sp
.ne 2
.mk
.na
.B -w
.I file
.ad
.RS 11n
.rt
Write a copy of the SMBIOS image to the specified file and exit.
.sp
The SMBIOS entry point is written to the start of the file with its
structure table address set to the file offset of the structure table, and a
new entry point checksum is computed.
.RE

.sp
.ne 2
.mk
.na
.B -x
.ad
.RS 11n
.rt
Display raw hexadecimal data for the selected structures in addition to
human-readable output.
.sp
By default, hexadecimal data is only displayed if
.B smbios
cannot
display human-readable output for the selected structures.
.RE

.SH OPERANDS
.sp
.LP
The following operands are supported:
.sp
.ne 2
.mk
.na
.I file
.ad
.RS 8n
.rt
Specifies an alternate SMBIOS image to display instead of the current
system's SMBIOS image.
.RE

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 6n
.rt
Successful completion. All structures in the SMBIOS image were examined
successfully.
.RE

.sp
.ne 2
.mk
.na
.B 1
.ad
.RS 6n
.rt
A fatal error occurred, such as failure to open the specified file or
device, or corruption in the image.
.RE

.sp
.ne 2
.mk
.na
.B 2
.ad
.RS 6n
.rt
Invalid command-line options were specified.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B /dev/smbios
.ad
.RS 16n
.rt
Kernel SMBIOS image device. This device special file is used to export a
snapshot of the current system SMBIOS image.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
_
Interface StabilitySee below.
.TE

.sp
.LP
The command-line options are Evolving. The human-readable output is
Unstable.
.SH SEE ALSO
.sp
.LP
.BR prtdiag (1M),
.BR attributes (5),
.BR smbios (7D)
.sp
.LP
.I System Management BIOS Reference Specification
(see
http://www.dmtf.org)
.SH NOTES
.sp
.LP
The implementation of a System Management BIOS image is entirely at the
discretion of the system and BIOS vendors. Not all systems export an SMBIOS.
The SMBIOS structure content varies widely between systems and BIOS vendors
and frequently does not comply with the guidelines included in the
specification. Some structure fields might not be filled in by the BIOS at
all, and others might be filled inwith non-conforming values.
