usr/src/man/man1m/smtnrhdb.1m
'\" te
.\" Copyright (c) 2009, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH smtnrhdb 1M "19 Dec 2008" "SunOS 5.11" "System Administration Commands"
.SH NAME
smtnrhdb \- manage entries in the tnrhdb database
.SH SYNOPSIS
.LP
.nf
\fB/usr/sadm/bin/smtnrhdb\fR \fIsubcommand\fR [\fIauth_args\fR] \fB--\fR \fIsubcommand_args\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The
.B smtnrhdb
command adds, modifies, deletes, and lists entries in
the
.B tnrhdb
database.
.sp
.LP
The
.B tnrhdb
database specifies which remote-host template to use for
each host, including the local host, in the distributed system. If a host's
IP address cannot be matched to some entry in the
.B tnrhdb
database,
communication with the host is not permitted.
.sp
.LP
The
.B smtnrhdb
command requires the Solaris Management Console to be
initialized for the command to succeed (see \fBsmc\fR(1M)). After rebooting
the Solaris Management Console server, the first
.B smc
connection can
time out, so you might need to retry the command.
.SS "Valid Host Addresses and Wildcards"
.sp
.LP
The trusted network software uses a network "longest prefix of matching
bits" mechanism when looking for a host. The software looks first for the IP
address of the host. If the software does not find this address, then the
software falls back to searching for an IP address with the longest prefix
of a matching bit pattern, and so on.
.LP
Note -
.sp
.RS 2
The actual numeric value of the subnet  address or other subnetting
information on the system (for example, from the
.BR netmasks (4)
file)
are not considered by this mechanism.
.RE
.sp
.LP
Using the "longest prefix of matching bits" mechanism, an IPv4 address of
0.0.0.0 is a wildcard address with a prefix length of 0 and hence matches
any IPv4 address. For more information about prefi x lengths in IPv4 and
IPv6 addresses, see
.IR "System Administration Guide: IP Services" .
.sp
.LP
The
.B smtnrhdb
command accepts a hostname, IP address, and wildcard
address with as optional prefix as valid addresses. See
.IR subcommand_args ,
below, for the format of valid addresses.
.SH SUB-COMMANDS
.sp
.LP
.B smtnrhdb
\fIsubcommand\fRs are:
.sp
.ne 2
.mk
.na
.B add
.ad
.sp .6
.RS 4n
Adds a new entry to the
.B tnrhdb
database. To add an entry, the
administrator must have the
.B solaris.network.host.write
and
.B solaris.network.security.write
authorizations.
.RE

.sp
.ne 2
.mk
.na
.B delete
.ad
.sp .6
.RS 4n
Deletes an entry from the
.B tnrhdb
database. To delete an entry, the
administrator must have the
.B solaris.network.host.write
and
.B solaris.network.security.write
authorizations.
.RE

.sp
.ne 2
.mk
.na
.B list
.ad
.sp .6
.RS 4n
Lists all entries in the
.B tnrhdb
database. To list an entry, the
administrator must have the
.B solaris.network.host.read
and
.B solaris.network.security.read
authorizations.
.RE

.sp
.ne 2
.mk
.na
.B modify
.ad
.sp .6
.RS 4n
Modifies an entry in the
.B tnrhdb
database. To modify an entry, the
administrator must have the
.B solaris.network.host.write
and
.B solaris.network.security.write
authorizations.
.RE

.SH OPTIONS
.sp
.LP
The
.B smtnrhdb
authentication arguments,
.IR auth_args ,
are derived
from the
.B smc
arg set. These arguments are the same regardless of which
subcommand you use.
.sp
.LP
The subcommand-specific options,
.IR subcommand_args ,
must be preceded by
the
.B --
option.
.SS "\fIauth_args\fR"
.sp
.LP
The valid
.I auth_args
are
.BR -D ,
.BR -H ,
.BR -l ,
.BR -p ,
.BR -r ,
and
.BR -u ;
they are all optional. If no
.I auth_args
are
specified, certain defaults will be assumed and the user might be prompted
for additional information, such as a password for authentication purposes.
These letter options can also be specified by their equivalent option words
preceded by a double dash. For example, you can use either
.B -D
or
.BR --domain .
.sp
.ne 2
.mk
.na
.B -D
|
.B --domain
.I domain
.ad
.sp .6
.RS 4n
Specifies the default domain that you want to manage. The syntax of
\fIdomain\fR=\fItype\fR:/\fIhost_name\fR/\fIdomain_name\fR, where \fItype\fR
is
.BR dns ,
.BR ldap ,
or
.BR file ;
.I host_name
is the name of the
server; and
.I domain_name
is the name of the domain you want to
manage.
.sp
If you do not specify this option, the Solaris Management Console assumes
the
.B file
default domain on whatever server you choose to manage,
meaning that changes are local to the server. Toolboxes can change the
domain on a tool-by-tool basis; this option specifies the domain for all
other tools.
.RE

.sp
.ne 2
.mk
.na
.B -H
|
.B --hostname
.I host_name:port
.ad
.sp .6
.RS 4n
Specifies the
.I host_name
and
.I port
to which you want to connect.
If you do not specify a
.IR port ,
the system connects to the default port,
.BR 898 .
If you do not specify
.IR host_name:port ,
the Solaris
Management Console connects to the local host on port
.BR 898 .
.RE

.sp
.ne 2
.mk
.na
.B -l
|
.B --rolepassword
.I role_password
.ad
.sp .6
.RS 4n
Specifies the password for the
.IR role_name .
If you specify a
.I role_name
but do not specify a
.IR role_password ,
the system prompts
you to supply a
.IR role_password .
Passwords specified on the command line
can be seen by any user on the system, hence this option is considered
insecure.
.RE

.sp
.ne 2
.mk
.na
.B -p
|
.B --password
.I password
.ad
.sp .6
.RS 4n
Specifies the password for the
.IR user_name .
If you do not specify a
password, the system prompts you for one. Passwords specified on the command
line can be seen by any user on the system, hence this option is considered
insecure.
.RE

.sp
.ne 2
.mk
.na
.B -r
|
.B --rolename
.I role_name
.ad
.sp .6
.RS 4n
Specifies a role name for authentication. If you do not specify this
option, no role is assumed.
.RE

.sp
.ne 2
.mk
.na
.B -u
|
.B --username
.I user_name
.ad
.sp .6
.RS 4n
Specifies the user name for authentication. If you do not specify this
option, the user identity running the console process is assumed.
.RE

.sp
.ne 2
.mk
.na
.B --
.ad
.sp .6
.RS 4n
This option is required and must always follow the preceding options. If
.RB "you do not enter the preceding options, you must still enter the" " --"
option.
.RE

.SS "\fIsubcommand_args\fR"
.sp
.LP
.B Note:
Descriptions and other arg options that contain white spaces
must be enclosed in double quotes.
.sp
.ne 2
.mk
.na
.B -h
.ad
.sp .6
.RS 4n
Displays the command's usage statement.
.RE

.sp
.ne 2
.mk
.na
.B -H
.I hostname
.ad
.sp .6
.RS 4n
Specifies the name of the host. For the list subcommand, the hostname
argument is not specified. This is not required if the ipaddress subcommand
argument is specified.
.RE

.sp
.ne 2
.mk
.na
.B -i
.I ipaddress
.ad
.sp .6
.RS 4n
Specifies the
.B IP
address of the host. This is not required if the
hostname subcommand argument is specified. This option is not valid with the
.B -w
option.
.RE

.sp
.ne 2
.mk
.na
.B -n
.I templatename
.ad
.sp .6
.RS 4n
Specifies the name of an existing template.
.RE

.sp
.ne 2
.mk
.na
.B -p
.I prefixlen
.ad
.sp .6
.RS 4n
Specifies the prefix length (in bits) of a wildcard representation of the
IP address. The prefix is the left-most portion of the IP address. This
option is valid only with the
.B -w
option. For example, when the value
of
.B -w
.I ipaddress-wildcard
is 192.168.0.0, a
.I prefixlen
value
of 24 indicates that the wildcard matches all addresses on the 192.168.0
network. With a
.I prefixlen
of 32, the wildcard 192.168.0.0 matches all
addresses on the 192.168.0.0 network.
.RE

.sp
.ne 2
.mk
.na
.B -w
.I ipaddress-wildcard
.ad
.sp .6
.RS 4n
Specifies the IP address of the subnet using a wildcard.
.RE

.RS +4
.TP
.ie t \(bu
.el o
One of the following sets of arguments must be specified for subcommand
.BR add :
.sp
.in +2
.nf
\fB-H\fR \fIhostname\fR \fB-n\fR \fItemplatename\fR |
\fB-i\fR \fIipaddress\fR \fB-n\fR \fItemplatename\fR |
\fB-w\fR \fIipaddress-wildcard\fR \fB-n\fR \fItemplatename\fR [ \fB-p\fR \fIprefixlen\fR ] |
\fB-h\fR
.fi
.in -2
.sp

.RE
.RS +4
.TP
.ie t \(bu
.el o
One of the following sets of arguments must be specified for subcommand
.BR modify :
.sp
.in +2
.nf
\fB-H\fR \fIhostname\fR \fB-n\fR \fItemplatename\fR |
\fB-i\fR \fIipaddress\fR \fB-n\fR \fItemplatename\fR |
\fB-w\fR \fIipaddress-wildcard\fR \fB-n\fR \fItemplatename\fR [ \fB-p\fR \fIprefixlen\fR ] |
\fB-h\fR
.fi
.in -2
.sp

.RE
.RS +4
.TP
.ie t \(bu
.el o
One of the following sets of arguments must be specified for subcommand
.BR delete :
.sp
.in +2
.nf
\fB-H\fR \fIhostname\fR |
\fB-i\fR \fIipaddress\fR |
\fB-w\fR \fIipaddress-wildcard\fR [ \fB-p\fR \fIprefixlen\fR ] |
\fB-h\fR
.fi
.in -2
.sp

.RE
.RS +4
.TP
.ie t \(bu
.el o
The subcommand
.B list
takes the following argument:
.sp
.in +2
.nf
\fB-h\fR
.fi
.in -2
.sp

.RE
.SH EXAMPLES
.LP
.B Example 1
Specifying the Template Name for a Wildcard IP Address
.sp
.LP
The admin role specifies the template name,
.BR cipso_lan ,
for a series
of hosts that use the IP address wildcard
.B 192.168.113.0
on the local
file system. Since no authorization arguments were specified, the
administrator connects to port 898 of the local host on the local server
with the file domain type, which are the defaults. The administrator is
prompted for the admin password.

.sp
.in +2
.nf
$ \fBusr/sadm/bin/smtnrhdb add -- -w 192.168.113.0 -n cipso_lan\fR
.fi
.in -2
.sp

.LP
.B Example 2
Deleting an Entry in the
.B tnrhdb
Database
.sp
.LP
The admin role connects to port 898 (which happens to be the default) of
the LDAP server and deletes a host entry from the database by specifying its
IP address,
.BR 192.168.113.8 .
Since the domain was not specified, the
file domain type and local server are used by default. The administrator is
prompted for the admin password.

.sp
.in +2
.nf
# \fB/usr/sadm/bin/smtnrhdb delete \
-D ldap:/example.domain -i 192.168.113.8\fR
.fi
.in -2
.sp

.LP
.B Example 3
Adding a Subnet to the
.B tnrhdb
Database
.sp
.LP
The following command adds all the addresses on the 192.168.55.0 subnet,
from 192.168.55.1 to 192.168.55.255, to the
.B tnrhdb
database:

.sp
.in +2
.nf
# \fB/usr/sadm/bin/smtnrhdb add \e
-D file:/machine1.ExampleCo.COM/machine1.ExampleCo.COM \e
 -- -w 192.168.55.0 -n cipso\fR
Authenticating as user: \fBroot\fR
Type /? for help, pressing <enter> accepts the default denoted by [ ]
Please enter a string value for: password \fB::\fR
Loading Tool: com.exampleco.admin.hostmgr.cli.smtnrhdb.HostMgrTnrhdbCli
from machine1.ExampleCo.COM
Login to machine1.ExampleCo.COM as user root was successful.
Download of com.exampleco.admin.hostmgr.cli.smtnrhdb.HostMgrTnrhdbCli
from machine1.ExampleCo.COM
was successful.
.fi
.in -2
.sp

.LP
.B Example 4
Adding Subnet 192.168.0 to the
.B tnrhdb
Database
.sp
.LP
The following command adds all the addresses on the 192.168.0 subnet, from
192.168.0.1 to 192.168.0.255 to the
.B tnrhdb
database. The prefix, 24,
indicates that the first 24 bits (192.168.0) are fixed. Only the final zero
is a wildcard.

.sp
.in +2
.nf
# \fB/usr/sadm/bin/smtnrhdb add \e
-D file:/machine1.ExampleCo.COM/machine1.ExampleCo.COM \e
 -- -w 192.168.0.0 -p 24 -n cipso\fR

Login to machine1.ExampleCo.COM as user root was successful.
Download of com.exampleco.admin.hostmgr.cli.smtnrhdb.HostMgrTnrhdbCli
from machine1.ExampleCo.COM was successful.
.fi
.in -2
.sp

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.sp .6
.RS 4n
Successful completion.
.RE

.sp
.ne 2
.mk
.na
.B 1
.ad
.sp .6
.RS 4n
Invalid command syntax. A usage message displays.
.RE

.sp
.ne 2
.mk
.na
.B 2
.ad
.sp .6
.RS 4n
An error occurred while executing the command. An error message displays.
.RE

.SH FILES
.sp
.LP
The following files are used by the
.B smtnrhdb
command:
.sp
.ne 2
.mk
.na
.B /etc/security/tsol/tnrhdb
.ad
.sp .6
.RS 4n
Trusted network remote-host database.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWmgts
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
.BR smc (1M),
.BR netmasks (4),
.BR attributes (5)
.sp
.LP
.I System Administration Guide: Security Services
.SH NOTES
.sp
.LP
The functionality described on this manual page is available only if the
system is configured with Trusted Extensions.
