usr/src/man/man1m/smtnzonecfg.1m
'\" te
.\" Copyright (c) 2007, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH smtnzonecfg 1M "31 Oct 2007" "SunOS 5.11" "System Administration Commands"
.SH NAME
smtnzonecfg \- manage entries in the zone configuration database for
Trusted Extensions networking
.SH SYNOPSIS
.LP
.nf
\fB/usr/sadm/bin/smtnzonecfg\fR \fIsubcommand\fR [\fIauth_args\fR] \fB--\fR [\fIsubcommand_args\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The
.B smtnzonecfg
command adds, modifies, deletes, and lists entries in
the
.B tnzonecfg
database.
.sp
.LP
.B smtnzonecfg
\fIsubcommand\fRs are:
.sp
.ne 2
.mk
.na
.B add
.ad
.RS 10n
.rt
Adds a new entry to the
.B tnzonecfg
database. To add an entry, the
administrator must have the
.B solaris.network.host.write
and
.B solaris.network.security.write
authorizations.
.RE

.sp
.ne 2
.mk
.na
.B modify
.ad
.RS 10n
.rt
Modifies an entry in the
.B tnzonecfg
database. To modify an entry, the
administrator must have the
.B solaris.network.host.write
and
.B solaris.network.security.write
authorizations.
.RE

.sp
.ne 2
.mk
.na
.B delete
.ad
.RS 10n
.rt
Deletes an entry from the
.B tnzonecfg
database. To delete an entry, the
administrator must have the
.B solaris.network.host.write
and
.B solaris.network.security.write
authorizations.
.RE

.sp
.ne 2
.mk
.na
.B list
.ad
.RS 10n
.rt
Lists entries in the
.B tnzonecfg
database. To list an entry, the
administrator must have the
.B solaris.network.host.read
and
.B solaris.network.security.read
authorizations.
.RE

.SH OPTIONS
.sp
.LP
The
.B smtnzonecfg
authentication arguments,
.IR auth_args ,
are
derived from the
.B smc
argument set and are the same regardless of which
subcommand you use. The
.B smtnzonecfg
command requires the Solaris
Management Console to be initialized for the command to succeed (see
.BR smc (1M)).
After rebooting the Solaris Management Console server, the
first smc connection can time out, so you might need to retry the command.
.sp
.LP
The subcommand-specific options,
.IR subcommand_args ,
must be
.B preceded
by the
.B --
option.
.SS "\fIauth_args\fR"
.sp
.LP
The valid
.I auth_args
are
.BR -D ,
.BR -H ,
.BR -l ,
.BR -p ,
.BR -r ,
and
.BR -u ;
they are all optional. If no
.I auth_args
are
specified, certain defaults will be assumed and the user can be prompted for
additional information, such as a password for authentication purposes.
These letter options can also be specified by their equivalent option words
preceded by a double dash. For example, you can use either
.B -D
or
.BR --domain .
.sp
.ne 2
.mk
.na
.B -D
|
.B --domain
.I domain
.ad
.sp .6
.RS 4n
Specifies the default domain that you want to manage. The syntax of
\fIdomain\fR=\fItype\fR:/\fIhost_name\fR/\fIdomain_name\fR, where \fItype\fR
is
.BR dns ,
.BR ldap ,
or
.BR file ;
.I host_name
is the name of the
server; and
.I domain_name
is the name of the domain you want to
manage.
.sp
If you do not specify this option, the Solaris Management Console assumes
the
.B file
default domain on whatever server you choose to manage,
meaning that changes are local to the server. Toolboxes can change the
domain on a tool-by-tool basis. This option specifies the domain for all
other tools.
.RE

.sp
.ne 2
.mk
.na
.B -H
|
.B --hostname
.I host_name:port
.ad
.sp .6
.RS 4n
Specifies the
.I host_name
and
.I port
to which you want to connect.
If you do not specify a
.IR port ,
the system connects to the default port,
.BR 898 .
If you do not specify
.IR host_name:port ,
the Solaris
Management Console connects to the local host on port
.BR 898 .
.RE

.sp
.ne 2
.mk
.na
.B -l
|
.B --rolepassword
.I role_password
.ad
.sp .6
.RS 4n
Specifies the password for the
.IR role_name .
If you specify a
.I role_name
but do not specify a
.IR role_password ,
the system prompts
you to supply a
.IR role_password .
Passwords specified on the command line
can be seen by any user on the system, hence this option is considered
insecure.
.RE

.sp
.ne 2
.mk
.na
.B -p
|
.B --password
.I password
.ad
.sp .6
.RS 4n
Specifies the password for the
.IR user_name .
If you do not specify a
password, the system prompts you for one. Passwords specified on the command
line can be seen by any user on the system, hence this option is considered
insecure.
.RE

.sp
.ne 2
.mk
.na
.B -r
|
.B --rolename
.I role_name
.ad
.sp .6
.RS 4n
Specifies a role name for authentication. If you do not specify this
option, no role is assumed.
.RE

.sp
.ne 2
.mk
.na
.B -u
|
.B --username
.I user_name
.ad
.sp .6
.RS 4n
Specifies the user name for authentication. If you do not specify this
option, the user identity running the console process is assumed.
.RE

.sp
.ne 2
.mk
.na
.B --
.ad
.sp .6
.RS 4n
This option is required and must always follow the preceding options. If
.RB "you do not enter the preceding options, you must still enter the" " --"
option.
.RE

.SS "\fIsubcommand_args\fR"
.sp
.LP
Descriptions and other argument options that contain white spaces must be
enclosed in double quotes.
.sp
.ne 2
.mk
.na
.B -h
.ad
.sp .6
.RS 4n
Displays the command's usage statement.
.RE

.sp
.ne 2
.mk
.na
.B -n
.I zonename
.ad
.sp .6
.RS 4n
Specifies the zone name for the entry. This name is used when the zone is
configured. See \fBzonecfg\fR(1M), under the \fB-z zonename\fR option, for
the constraints on zone names. The specified zone name must be one of the
configured zones on the system. The following command returns a list of
configured zones:
.sp
.in +2
.nf
/usr/sbin/zoneadm list -c
.fi
.in -2
.sp

.RE

.sp
.ne 2
.mk
.na
.B -l
.I label
.ad
.sp .6
.RS 4n
Specifies the label for the zone. This field is used to label the zone when
the zone is booted. Each zone must have a unique label.
.RE

.sp
.ne 2
.mk
.na
\fB-x policymatch\fR=\fB0\fR|\fB1\fR
.ad
.sp .6
.RS 4n
Specifies the policy match level for non-transport traffic. Only values of
.B 0
(match the label) or
.B 1
(be within the label range of the zone)
are accepted.
.sp
ICMP packets that are received on the global zone IP address are accepted
based on the label range of the global zone's security template if the
global zone's
.I policymatch
field is set to 1. When this field is set to
0 for a zone, the zone will not respond to an ICMP echo request from a host
with a different label.
.sp
This subcommand argument is optional. If not specified, it will have a
default value of 0.
.RE

.sp
.ne 2
.mk
.na
\fB-x mlpzone\fR=""|\fIport/protocol\fR
.ad
.sp .6
.RS 4n
Specifies the multilevel port configuration entry for zone-specific IP
addresses. Multiple
.I port/protocol
combinations are separated by a
semi-colon. The empty string can be specified to remove all existing MLP
zone values. This subcommand argument is optional.
.sp
An MLP is used to provide multilevel service in the global zone as well as
in non-global zones. As an example of how a non-global zone can use an MLP,
consider setting up two labeled zones,
.B internal
and
.BR public .
The
.B internal
zone can access company networks; the
.B public
zone can
access public internet but not the company's internal networks. For safe
browsing, when a user in the
.B internal
zone wants to browse the
Internet, the
.B internal
zone browser forwards the URL to the
.B public
zone, and the web content is then displayed in a
.B public
zone web browser. That way, if the download in
.B public
zone compromises
the web browser, it cannot affect the company's internal network. To set
this up, TCP port
.B 8080
in the
.B public
zone is an MLP
(\fB8080/tcp\fR), and the security template for the \fBpublic\fR zone has a
label range from
.B PUBLIC
to
.BR INTERNAL .
.RE

.sp
.ne 2
.mk
.na
\fB-x mlpshared\fR=""|\fIport/protocol\fR
.ad
.sp .6
.RS 4n
Specifies the multilevel port configuration entry for shared IP addresses.
Multiple
.I port/protocol
combinations are separated by a semi-colon. The
empty string can be specified to remove all existing MLP shared values. This
subcommand argument is optional.
.sp
A shared IP address can reduce the total number of IP addresses that are
needed on the system, especially when configuring a large number of zones.
Unlike the case of the zone-specific IP address, when MLPs are declared on
shared IP addresses, only the global zone can receive the incoming network
traffic that is destined for the MLP.
.RE

.RS +4
.TP
.ie t \(bu
.el o
One of the following sets of arguments must be specified for subcommand
.BR add :
.sp
.in +2
.nf
\fB-n\fR \fIzonename\fR \fB-l\fR \fIlabel\fR [\fB-x\fR policymatch=\fIpolicy-match-level\fR \e
\fB-x\fR mlpzone=\fIport/protocol\fR;.... | \e
\fB-x\fR mlpshared=\fIport/protocol\fR;.... ]
\fB-h\fR
.fi
.in -2
.sp

.RE
.RS +4
.TP
.ie t \(bu
.el o
One of the following sets of arguments must be specified for subcommand
.BR modify :
.sp
.in +2
.nf
\fB-n\fR \fIzonename\fR [\fB-l\fR \fIlabel\fR] [\fB-x\fR policymatch=\fIpolicy-match-level\fR \e
\fB-x\fR mlpzone=\fIport/protocol\fR;.... |\e
\fB-x\fR mlpshared=\fIport/protocol\fR;.... ]
\fB-h\fR
.fi
.in -2
.sp

.RE
.RS +4
.TP
.ie t \(bu
.el o
One of the following arguments must be specified for subcommand
.BR delete :
.sp
.in +2
.nf
\fB-n\fR \fIzonename\fR |
\fB-h\fR
.fi
.in -2
.sp

.RE
.RS +4
.TP
.ie t \(bu
.el o
The following argument can be specified for subcommand
.BR list :
.sp
.in +2
.nf
\fB-n\fR \fIzonename\fR |
\fB-h\fR
.fi
.in -2
.sp

.RE
.SH EXAMPLES
.LP
.B Example 1
Adding a New Entry to the Zone Configuration Database
.sp
.LP
The admin role creates a new zone entry,
.BR public ,
with a label of
.BR public ,
a policy match level of 1, and a shared MLP port and protocol
of 666 and TCP. The administrator is prompted for the admin password.

.sp
.in +2
.nf
$ \fB/usr/sadm/bin/smtnzonecfg add -- -n public -l public \e
-x policymatch=1 -x mlpshared=666/tcp\fR
.fi
.in -2
.sp

.LP
.B Example 2
Modifying an Entry in the Zone Configuration Database
.sp
.LP
The admin role changes the
.B public
entry in the \fBtnzonecfg\fR
database to
.BR needtoknow .
The administrator is prompted for the admin
password.

.sp
.in +2
.nf
$ \fB/usr/sadm/bin/smtnzonecfg modify -- -n public -l needtoknow\fR
.fi
.in -2
.sp

.LP
.B Example 3
Listing the Zone Configuration Database
.sp
.LP
The admin role lists the entries in the
.B tnzonecfg
database. The
administrator is prompted for the admin password.

.sp
.in +2
.nf
$ \fB/usr/sadm/bin/smtnzonecfg list --\fR
.fi
.in -2
.sp

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 5n
.rt
Successful completion.
.RE

.sp
.ne 2
.mk
.na
.B 1
.ad
.RS 5n
.rt
Invalid command syntax. A usage message displays.
.RE

.sp
.ne 2
.mk
.na
.B 2
.ad
.RS 5n
.rt
An error occurred while executing the command. An error message displays.
.RE

.SH FILES
.sp
.LP
The following files are used by the
.B smtnzonecfg
command:
.sp
.ne 2
.mk
.na
.B /etc/security/tsol/tnzonecfg
.ad
.sp .6
.RS 4n
Trusted zone configuration database.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWmgts
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
.BR smc (1M),
.BR attributes (5)
.SH NOTES
.sp
.LP
The functionality described on this manual page is available only if the
system is configured with Trusted Extensions.
