usr/src/man/man1m/smtnrhtp.1m
'\" te
.\" Copyright (c) 2007, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH smtnrhtp 1M "31 Oct 2007" "SunOS 5.11" "System Administration Commands"
.SH NAME
smtnrhtp \- manage entries in the trusted network template database
.SH SYNOPSIS
.LP
.nf
\fB/usr/sadm/bin/smtnrhtp\fR \fIsubcommand\fR [\fIauth_args\fR] \fB--\fR [\fIsubcommand_args\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The
.B smtnrhtp
command adds, modifies, deletes, and lists entries in the
.B tnrhtp
database.
.sp
.LP
.B smtnrhtp
\fIsubcommand\fRs are:
.sp
.ne 2
.mk
.na
.B add
.ad
.RS 10n
.rt
Adds a new entry to the
.B tnrhtp
database. To add an entry, the
administrator must have the
.B solaris.network.security.read
and
.B solaris.network.security.write
authorizations.
.RE

.sp
.ne 2
.mk
.na
.B modify
.ad
.RS 10n
.rt
Modifies an entry in the
.B tnrhtp
database. To modify an entry, the
administrator must have the
.B solaris.network.security.read
and
.B solaris.network.security.write
authorizations.
.RE

.sp
.ne 2
.mk
.na
.B delete
.ad
.RS 10n
.rt
Deletes an entry from
.B tnrhtp
database. To delete an entry, the
administrator must have the
.B solaris.network.security.read
and
.B solaris.network.security.write
authorizations.
.RE

.sp
.ne 2
.mk
.na
.B list
.ad
.RS 10n
.rt
Lists entries in the
.B tnrhtp
database. To list an entry, the
administrator must have the
.BR solaris.network.security.read
authorizations.
.RE

.SH OPTIONS
.sp
.LP
The
.B smtnrhtp
authentication arguments,
.IR auth_args ,
are derived from
the
.B smc
argument set and are the same regardless of which subcommand you
use. The
.B smtnrhtp
command requires the Solaris Management Console to be
initialized for the command to succeed (see
.BR smc (1M)).
After rebooting the
Solaris Management Console server, the first smc connection can time out, so
you might need to retry the command.
.sp
.LP
The subcommand-specific options,
.IR subcommand_args ,
must be
.BR preceded
by the
.B --
option.
.SS "\fIauth_args\fR"
.sp
.LP
The valid
.I auth_args
are
.BR -D ,
.BR -H ,
.BR -l ,
.BR -p ,
.BR -r ,
and
.BR -u ;
they are all optional. If no
.I auth_args
are
specified, certain defaults will be assumed and the user might be prompted for
additional information, such as a password for authentication purposes. These
letter options can also be specified by their equivalent option words preceded
by a double dash. For example, you can use either
.B -D
or
.BR --domain .
.sp
.ne 2
.mk
.na
.B -D
|
.B --domain
.I domain
.ad
.sp .6
.RS 4n
Specifies the default domain that you want to manage. The syntax of
\fIdomain\fR=\fItype\fR:/\fIhost_name\fR/\fIdomain_name\fR, where
.I type
is
.BR dns ,
.BR ldap ,
or
.BR file ;
.I host_name
is the name of the
server; and
.I domain_name
is the name of the domain you want to manage.
.sp
If you do not specify this option, the Solaris Management Console assumes the
.B file
default domain on whatever server you choose to manage, meaning that
changes are local to the server. Toolboxes can change the domain on a
tool-by-tool basis; this option specifies the domain for all other tools.
.RE

.sp
.ne 2
.mk
.na
.B -H
|
.B --hostname
.I host_name:port
.ad
.sp .6
.RS 4n
Specifies the
.I host_name
and
.I port
to which you want to connect. If
you do not specify a
.IR port ,
the system connects to the default port,
.BR 898 .
If you do not specify
.IR host_name:port ,
the Solaris Management
Console connects to the local host on port
.BR 898 .
.RE

.sp
.ne 2
.mk
.na
.B -l
|
.B --rolepassword
.I role_password
.ad
.sp .6
.RS 4n
Specifies the password for the
.IR role_name .
If you specify a
.I role_name
but do not specify a
.IR role_password ,
the system prompts
you to supply a
.IR role_password .
Passwords specified on the command line
can be seen by any user on the system, hence this option is considered
insecure.
.RE

.sp
.ne 2
.mk
.na
.B -p
|
.B --password
.I password
.ad
.sp .6
.RS 4n
Specifies the password for the
.IR user_name .
If you do not specify a
password, the system prompts you for one. Passwords specified on the command
line can be seen by any user on the system, hence this option is considered
insecure.
.RE

.sp
.ne 2
.mk
.na
.B -r
|
.B --rolename
.I role_name
.ad
.sp .6
.RS 4n
Specifies a role name for authentication. If you do not specify this option,
no role is assumed.
.RE

.sp
.ne 2
.mk
.na
.B -u
|
.B --username
.I user_name
.ad
.sp .6
.RS 4n
Specifies the user name for authentication. If you do not specify this option,
the user identity running the console process is assumed.
.RE

.sp
.ne 2
.mk
.na
.B --
.ad
.sp .6
.RS 4n
This option is required and must always follow the preceding options. If you
do not enter the preceding options, you must still enter the
.B --
option.
.RE

.SS "\fIsubcommand_args\fR"
.sp
.LP
Descriptions and other argument options that contain white spaces must be
enclosed in double quotes.
.sp
.ne 2
.mk
.na
.B -h
.ad
.RS 26n
.rt
Displays the command's usage statement.
.RE

.sp
.ne 2
.mk
.na
.B -n
.I templatename
.ad
.RS 26n
.rt
Specifies the name of the template.
.RE

.sp
.ne 2
.mk
.na
.B -t
.I hosttype
.ad
.RS 26n
.rt
Specifies the host type of the new host. Valid values are
.B unlabeled
and
.BR cipso .
The
.B cipso
host type is for hosts that use CIPSO (Common IP
Security Options - Tag Type 1 only) to label packets.
.RE

.sp
.ne 2
.mk
.na
.BR "-x doi" =\fIdoi-value\fR
.ad
.RS 26n
.rt
Specifies the
.B DOI
value (the domain of interpretation). In the case of
the
.B unlabeled
host type, this is the domain of interpretation for the
.BR def_label .
.sp
The domain of interpretation defines the set of rules for translating between
the external or internal representation of the security attributes and their
network representation. When systems that are configured with Trusted
Extensions software have the same
.BR doi ,
they share that set of rules. In
the case of the
.B unlabeled
host type, these systems also share the same
interpretation for the default attributes that are assigned to the unlabeled
templates that have that same
.BR doi .
.RE

.sp
.ne 2
.mk
.na
.BR "-x max" =\fImaximum-label\fR
.ad
.RS 26n
.rt
Specifies the maximum label. Together with
.BR min ,
this value specifies the
label accreditation range for the remote hosts that use this template. Values
can be a hex value or string  (such as
.BR admin_high ).
.RE

.sp
.ne 2
.mk
.na
.BR "-x min" =\fIminimum-label\fR
.ad
.RS 26n
.rt
Specifies the minimum label. Together with
.BR max ,
this value specifies the
label accreditation range for the remote hosts that use this template. For
gateway systems,
.B min
and
.B max
define the default range for
forwarding labeled packets. The label range for routes is typically set by
using a
.BR route "(1M) subcommand with the"
.B -secattr
option. When the
label range for routes is not specified, the
.B min
to
.B max
range in
the security template is used. Values can be a hex value or string (such as
.BR admin_low ).
.RE

.sp
.ne 2
.mk
.na
.BR "-x label" =\fIdefault-label\fR
.ad
.RS 26n
.rt
Specifies the default label  to be applied to incoming data from remote hosts
that do not support these attributes. This option does not apply if
.I hosttype
is
.BR cipso .
Values can be a hex value or string (such as
.BR admin_low ).
.RE

.sp
.ne 2
.mk
.na
\fB-x slset\fR=\fIl1\fR,\fIl2\fR,\fIl3\fR,\fIl4\fR
.ad
.RS 26n
.rt
Specifies a set of sensitivity labels. For gateway systems, the labels in
.B slset
are used for forwarding labeled packets.
.B slset
is optional.
You can specify up to four label values, separated by commas. Values can be a
hex value or string  (such as
.BR admin_low ).
.RE

.RS +4
.TP
.ie t \(bu
.el o
One of the following sets of arguments must be specified for subcommand
.BR add :
.sp
.in +2
.nf
\fB-n\fR \fItemplate name\fR (
.fi
.in -2
.sp

.RS +4
.TP
.ie t \(bu
.el o
.B -t cipso
[ \fB-x doi\fR=\fIdoi-value\fR \fB-x\fR
\fBmin\fR=\fIminimum-label\fR \fB-x max\fR=\fImaximum-label\fR \fB-x\fR
\fBslset\fR=\fIl1\fR,\fIl2\fR,\fIl3\fR,\fIl4\fR ] |
.RE
.RS +4
.TP
.ie t \(bu
.el o
.B -t
unlabeled [ \fB-x doi\fR=\fIdoi-value\fR \fB-x\fR
\fBmin\fR=\fIminimum-label\fR \fB-x max\fR=\fImaximum-label\fR \fB-x\fR
\fBlabel\fR=\fIdefault-label\fR \fB-x\fR
\fBslset\fR=\fIl1\fR,\fIl2\fR,\fIl3\fR,\fIl4\fR ] |
.RE
.RS +4
.TP
.ie t \(bu
.el o
.B -h
.RE
.sp
.in +2
.nf
)
.fi
.in -2
.sp

.RE
.RS +4
.TP
.ie t \(bu
.el o
One of the following sets of arguments must be specified for subcommand
.BR modify :
.sp
.in +2
.nf
\fB-n\fR \fItemplate name\fR (
.fi
.in -2
.sp

.RS +4
.TP
.ie t \(bu
.el o
.B -t cipso
[ \fB-x doi\fR=\fIdoi-value\fR \fB-x\fR
\fBmin\fR=\fIminimum-label\fR \fB-x max\fR=\fImaximum-label\fR \fB-x\fR
\fBslset\fR=\fIl1\fR,\fIl2\fR,\fIl3\fR,\fIl4\fR ] |
.RE
.RS +4
.TP
.ie t \(bu
.el o
.B -t
unlabeled [ \fB-x doi\fR=\fIdoi-value\fR \fB-x\fR
\fBmin\fR=\fIminimum-label\fR \fB-x max\fR=\fImaximum-label\fR \fB-x\fR
\fBlabel\fR=\fIdefault-label\fB-x slset\fR=\fIl1\fR,\fIl2\fR,\fIl3\fR,\fIl4\fR
] |
.RE
.RS +4
.TP
.ie t \(bu
.el o
.B -h
.RE
.sp
.in +2
.nf
)
.fi
.in -2
.sp

If the host type is changed, all options for the new host type must be
specified.
.RE
.RS +4
.TP
.ie t \(bu
.el o
One of the following sets of arguments must be specified for subcommand
.BR delete :
.sp
.in +2
.nf
\fB-n\fR \fItemplatename\fR |
\fB-h\fR
.fi
.in -2
.sp

.RE
.RS +4
.TP
.ie t \(bu
.el o
The following argument can be specified for subcommand
.BR list :
.sp
.in +2
.nf
\fB-n\fR \fItemplatename\fR |
\fB-h\fR
.fi
.in -2
.sp

.RE
.SH EXAMPLES
.LP
.B Example 1
Adding a New Entry to the Network Template Database
.sp
.LP
The admin role connects to port
.B 898
of the LDAP server and creates the
.B unlabeled_ntk
entry in the
.B tnrhtp
database. The new template is
assigned a host type of
.BR unlabeled ,
a domain of interpretation of
.BR 1 ,
minimum label of
.BR public ,
maximum label of
.BR restricted ,
and a default
label of
.BR needtoknow .
The administrator is prompted for the admin
password.

.sp
.in +2
.nf
$ /usr/sadm/bin/smtnrhtp \e
add -D ldap:\fIdirectoryname\fR -H \fIservername\fR:898 -- \e
-n unlabeled_ntk -t unlabeled -x DOI=1 \e
-x min=public -x max=restricted -x label="need to know"
.fi
.in -2
.sp

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 5n
.rt
Successful completion.
.RE

.sp
.ne 2
.mk
.na
.B 1
.ad
.RS 5n
.rt
Invalid command syntax. A usage message displays.
.RE

.sp
.ne 2
.mk
.na
.B 2
.ad
.RS 5n
.rt
An error occurred while executing the command. An error message displays.
.RE

.SH FILES
.sp
.LP
The following files are used by the
.B smtnrhtp
command:
.sp
.ne 2
.mk
.na
.B /etc/security/tsol/tnrhtp
.ad
.RS 29n
.rt
Trusted network remote-host templates.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWmgts
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
.BR smc (1M),
.BR attributes (5)
.SH NOTES
.sp
.LP
The functionality described on this manual page is available only if the
system is configured with Trusted Extensions.
.SH WARNINGS
.sp
.LP
Changing a template while the network is up can change the security view of an
undetermined number of hosts.
.sp
.LP
Allowing unlabeled hosts onto a Solaris Trusted Extensions network is a
security risk. To avoid compromising the rest of your network, such hosts must
be
.B trusted
in the sense that the administrator is certain that these
unlabeled hosts will not be used to compromise the distributed system. These
hosts should also be physically protected to restrict access to authorized
individuals. If you cannot guarantee that an unlabeled host is physically
secure from tampering, it and similar hosts should be isolated on a separate
branch of the network.
.sp
.LP
If the security template is modified while the network is up, the changes do
not take effect immediately unless
.BR tnctl "(1M) is used to update the"
template entries. Otherwise, the changes take effect when next polled by the
trusted network daemon,
.BR tnd (1M).
Administrators are allowed to add new
templates and modify attributes of existing templates while the network is
up.
