usr/src/man/man1m/sndrd.1m
'\" te
.\" Copyright (c) 2007, Sun Microsystems, Inc. All rights reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH sndrd 1M "2 Oct 2007" "SunOS 5.11" "System Administration Commands"
.SH NAME
sndrd \- Remote Mirror daemon
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/sndrd\fR [\fB-c\fR \fImax_connections\fR] [\fB-l\fR \fIlisten_backlog\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The
.B sndrd
daemon processes client Remote Mirror requests. Only the
root user or a user with equivalent privileges can run this daemon. The
daemon is automatically invoked in run level 2.
.B sndrd
restarts the TCP
transport layers.
.sp
.LP
Administrators wanting to change startup parameters for
.B sndrd
should,
as root or equivalent, make changes in the
.B /etc/default/sndr
file
rather than editing the
.B /lib/svc/method/svc-rdcsyncd
file. See
.BR sndr (4).
.SH OPTIONS
.sp
.LP
The
.B sndrd
daemon supports the following options:
.sp
.ne 2
.mk
.na
.B -c
.I max_connections
.ad
.sp .6
.RS 4n
Sets the maximum number of connections allowed to the server over
connection-oriented transports. By default, the number of connections is
16.
.RE

.sp
.ne 2
.mk
.na
.B -l
.I listen_backlog
.ad
.sp .6
.RS 4n
Sets connection queue length for the RDC TCP over a connection-oriented
transport. The default value is 10 entries.
.RE

.SH EXIT STATUS
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 13n
.rt
Daemon started successfully.
.RE

.sp
.ne 2
.mk
.na
.B >0
.ad
.RS 13n
.rt
Daemon failed to start.
.RE

.sp
.LP
Error information is reported to
.B syslog
at level
.BR LOG_ERR .
.SH FILES
.sp
.ne 2
.mk
.na
.B /lib/svc/method/svc-rdcsyncd
.ad
.sp .6
.RS 4n
Shell script for starting
.BR sndrd .
.RE

.sp
.ne 2
.mk
.na
.B /lib/svc/method/svc-rdc
.ad
.sp .6
.RS 4n
Shell script for stopping
.BR sndrd .
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWrdcr, SUNWrdcu
_
Interface StabilityEvolving
.TE

.SH SEE ALSO
.sp
.LP
.BR svcadm (1M),
.BR syslogd (1M),
.BR ds.log (4),
.BR attributes (5)
.SH NOTES
.sp
.LP
Do not manually stop the sndrd deamon. If you need to manually stop sndrd
perform these steps. This stops both the
.B sndrd
and
.BR sndrsyncd
daemons.
.sp
.in +2
.nf
# svcadm disable svc:/system/nws_rdc
.fi
.in -2

.sp
.in +2
.nf
# svcadm disable svc:/system/nws_rdcsyncd
.fi
.in -2

.sp
.LP
Do not manually start or restart the sndrd deamon. If you need to manually
start sndrd perform these steps. This starts both the sndrd and sndrsyncd
daemons.
.sp
.in +2
.nf
# svcadm enable svc:/system/nws_rdc
.fi
.in -2

.sp
.in +2
.nf
# svcadm enable svc:/system/nws_rdcsyncd
.fi
.in -2

.sp
.LP
See
.BR svcadm (1M)
for additional information.
