usr/src/man/man1m/soconfig.1m
'\" te
.\" Copyright (c) 2008, Sun Microsystems, Inc.  All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH soconfig 1M "29 Oct 2008" "SunOS 5.11" "System Administration Commands"
.SH NAME
soconfig \- configure transport providers for use by sockets
.SH SYNOPSIS
.LP
.nf
\fB/sbin/soconfig\fR \fB-f\fR \fIfile\fR
.fi

.LP
.nf
\fB/sbin/soconfig\fR \fIfamily\fR \fItype\fR \fIprotocol\fR [\fIpath\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The
.B soconfig
utility configures the transport provider driver for use
with sockets. It specifies how the family, type, and protocol parameters in
the \fBsocket\fR(3SOCKET) call are mapped to the name of a transport
provider such as
.BR /dev/tcp .
This utility can be used to add an
additional mapping or remove a previous mapping.
.sp
.LP
The \fBinit\fR(1M) utility uses \fBsoconfig\fR with the
.BR sock2path (4)
file during the booting sequence.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -f
.I file
.ad
.RS 11n
.rt
Set up the
.B soconfig
configuration for each driver according to the
information stored in
.BR file .
A
.B soconfig
file consists of lines of
at least the first three fields listed below, separated by spaces:
.sp
.I family  type  protocol  path
.sp
These fields are described in the
.B OPERANDS
section below.
.sp
An example of
.B file
can be found in the
.B EXAMPLES
section
below.
.RE

.SH OPERANDS
.sp
.LP
The following operands are supported:
.sp
.ne 2
.mk
.na
.I family
.ad
.RS 17n
.rt
The protocol family as listed in the
.B /usr/include/sys/socket.h
file,
expressed as an integer.
.RE

.sp
.ne 2
.mk
.na
.I type
.ad
.RS 17n
.rt
The socket type as listed in the
.B /usr/include/sys/socket.h
file,
expressed as an integer.
.RE

.sp
.ne 2
.mk
.na
.I protocol
.ad
.RS 17n
.rt
The protocol number as specified in the family-specific
.B include
file,
expressed as an integer. For example, for
.B AF_INET
this number is
specified in
.BR /usr/include/netinet/in.h .
An unspecified protocol number
is denoted with the value zero.
.RE

.sp
.ne 2
.mk
.na
.I module
|
.I path
.ad
.RS 17n
.rt
The module name or path name of a device that corresponds to the transport
provider, such as
.B tcp
or
.BR /dev/tcp .
Modules must reside in
.BR kernel/socketmod .
A device name must begin with
.BR /dev .
If this
parameter is specified, the configuration will be added for the specified
family, type, and protocol. If this parameter is not specified, the
configuration will be removed.
.RE

.SH EXAMPLES
.LP
.B Example 1
Using \fBsoconfig\fR
.sp
.LP
The following example sets up a module for family
.B AF_INET
and type
.BR SOCK_STREAM :

.sp
.in +2
.nf
example# \fBsoconfig 2 2 0 tcp\fR
.fi
.in -2
.sp

.sp
.LP
The following example sets up
.B /dev/tcp
for family
.B AF_INET
and
type
.BR SOCK_STREAM :

.sp
.in +2
.nf
example# \fBsoconfig 2 2 0 /dev/tcp\fR
.fi
.in -2
.sp

.sp
.LP
The following is a sample file used with the
.B -f
option. Comment lines
begin with a hash mark
.RB ( # ):

.sp
.in +2
.nf
#   Family  Type  Protocol   Module | Path
      2       2       0          tcp
      2       2       6          tcp

      2       1       0          udp
      2       1       17         udp

      1       2       0          /dev/ticotsord
      1       1       0          /dev/ticlts

      2       4       0          icmp
.fi
.in -2
.sp

.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/sock2path
.ad
.RS 18n
.rt
File containing mappings from sockets to transport providers.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsr
.TE

.SH SEE ALSO
.sp
.LP
.BR init (1M),
.BR sock2path (4),
.BR attributes (5)
.sp
.LP
.I Network Interface Guide
