usr/src/man/man1m/solstice.1m
'\" te
.\" Copyright 1989 AT&T  Copyright (c) 1995, Sun Microsystems, Inc.  All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH solstice 1M "15 Sep 1995" "SunOS 5.11" "System Administration Commands"
.SH NAME
solstice \- access system administration tools with a graphical user
interface
.SH SYNOPSIS
.LP
.nf
\fB/bin/solstice\fR
.fi

.SH DESCRIPTION
.sp
.LP
.B solstice
used on a system presents the
.BR "Solstice Launcher" ,
a
graphical user interface that provides access to the Solstice AdminSuite
product family of system administration tools. The tools that appear in the
launcher depend on what Solstice products you installed on your system.
.sp
.LP
Help is available by using the Help button.
.SH USAGE
.sp
.LP
The
.B "Solstice Launcher"
allows you to do the following tasks:
.sp
.ne 2
.mk
.na
.B Launch applications
.ad
.sp .6
.RS 4n
Use the
.B "Solstice Launcher"
to launch system administration tools.
.RE

.sp
.ne 2
.mk
.na
.B Register applications
.ad
.sp .6
.RS 4n
Use the
.B "Solstice Launcher"
to add and register applications locally
with the launcher.
.RE

.sp
.ne 2
.mk
.na
.B Remove applications
.ad
.sp .6
.RS 4n
Use the
.B "Solstice Launcher"
to remove locally registered
applications.
.RE

.sp
.ne 2
.mk
.na
.B Customize application properties
.ad
.sp .6
.RS 4n
Use the
.B "Solstice Launcher"
to show, hide, or remove applications in
the launcher,  reorder the icons, change the launcher window width,  modify
applications properties, and add applications.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B /$HOME/.solstice_registry
.ad
.RS 29n
.rt
Local registry information.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWsadml
.TE

.SH SEE ALSO
.sp
.LP
.BR soladdapp (1M),
.BR soldelapp (1M),
.BR attributes (5)
.SH NOTES
.sp
.LP
The
.B " Solstice Launcher"
adds or removes local applications that are
private to the user (not local to the system) only. The properties of
globally registered applications that are used by local and remote users
sharing the software from a particular
.B /opt
directory cannot be
modified from the
.BR "Solstice Launcher" .
To register global applications
for use by local and remote users, use the
.BR soladdapp (1M)
command. To
remove globally registered applications, use the
.BR soldelapp (1M)
command.
