usr/src/man/man1m/statd.1m
'\" te
.\" Copyright 1989 AT&T  Copyright (c) 2004 Sun Microsystems, Inc.  All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH statd 1M "18 Nov 2004" "SunOS 5.11" "System Administration Commands"
.SH NAME
statd \- network status monitor
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/nfs/statd\fR
.fi

.SH DESCRIPTION
.sp
.LP
.B statd
is an intermediate version of the status monitor. It interacts
with \fBlockd\fR(1M) to provide the crash and recovery functions for the
locking services on NFS.
.B statd
keeps track of the clients with
processes which hold locks on a server. When the server reboots after a
crash,
.B statd
sends a message to the
.B statd
on each client
indicating that the server has rebooted. The client
.B statd
processes
then inform the
.B lockd
on the client that the server has rebooted. The
client
.B lockd
then attempts to reclaim the lock(s) from the server.
.sp
.LP
.B statd
on the client host also informs the
.B statd
on the
server(s) holding locks for the client when the client has rebooted. In this
case, the
.B statd
on the server informs its
.B lockd
that all locks
held by the rebooting client should be released, allowing other processes to
lock those files.
.sp
.LP
.B lockd
is started by \fBautomountd\fR(1M), \fBmount_nfs\fR(1M), and
.BR share (1M)
if NFS automounts are needed.
.SH FILES
.sp
.ne 2
.mk
.na
.B /var/statmon/sm
.ad
.sp .6
.RS 4n
lists hosts and network addresses to be contacted after a reboot
.RE

.sp
.ne 2
.mk
.na
.B /var/statmon/sm.bak
.ad
.sp .6
.RS 4n
lists hosts and network addresses that could not be contacted after last
reboot
.RE

.sp
.ne 2
.mk
.na
.B /var/statmon/state
.ad
.sp .6
.RS 4n
includes a number which changes during a reboot
.RE

.sp
.ne 2
.mk
.na
.B /usr/include/rpcsvc/sm_inter.x
.ad
.sp .6
.RS 4n
contains the rpcgen source code for the interface services provided by the
statd daemon.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWnfscu
.TE

.SH SEE ALSO
.sp
.LP
.BR svcs (1),
.BR automountd (1M),
.BR lockd (1M),
.BR mount_nfs (1M),
.BR share (1M),
.BR svcadm (1M),
.BR attributes (5),
.BR smf (5)
.sp
.LP
\fR
.SH NOTES
.sp
.LP
The crash of a server is only detected upon its recovery.
.sp
.LP
The
.B statd
service is managed by the service management facility,
.BR smf (5),
under the service identifier:
.sp
.in +2
.nf
svc:/network/nfs/status
.fi
.in -2
.sp

.sp
.LP
Administrative actions on this service, such as enabling, disabling, or
requesting restart, can be performed using
.BR svcadm (1M).
The service's
status can be queried using the
.BR svcs (1)
command.
.sp
.LP
If it is disabled, it will be enabled by \fBmount_nfs\fR(1M),
.BR share_nfs (1M),
and
.BR automountd "(1M) unless  its"
.B application/auto_enable
property is set to \fBfalse\fR.
