usr/src/man/man1m/strace.1m
'\" te
.\" Copyright 1989 AT&T  Copyright (c) 1997 Sun Microsystems, Inc.  All Rights Reserved.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH strace 1M "4 Oct 1994" "SunOS 5.11" "System Administration Commands"
.SH NAME
strace \- print STREAMS trace messages
.SH SYNOPSIS
.LP
.nf
\fBstrace\fR [\fImid\fR \fIsid\fR \fIlevel\fR]...
.fi

.SH DESCRIPTION
.sp
.LP
\fBstrace\fR without arguments writes all STREAMS event trace messages from
all drivers and modules to its standard output. These messages are obtained
from the STREAMS log driver (see \fBlog\fR(7D)). If arguments are provided,
they must be in triplets of the form
.IR "mid, sid, level" ,
where
.IR mid
is a STREAMS module
.B ID
number,
.I sid
is a sub-ID number,  and
\fIlevel\fR is a tracing priority level. Each triplet indicates that tracing
messages are to be received from the given module/driver, sub-ID (usually
indicating minor device), and priority level equal to, or less than the
given level. The token
.B all
may be used for any member to indicate no
restriction for that attribute.
.sp
.LP
The format of each trace message output is:
.sp
.LP
<\fIseq\fR> <\fBtime\fR> <\fIticks\fR> <\fIlevel\fR> <\fIflags\fR>
<\fImid\fR> <\fIsid\fR> <\fItext\fR>
.sp
.ne 2
.mk
.na
\fB<\fIseq\fR>\fR
.ad
.RS 11n
.rt
trace sequence number
.RE

.sp
.ne 2
.mk
.na
\fB<time\fR>\fR
.ad
.RS 11n
.rt
time of message in
.IR hh:mm:ss
.RE

.sp
.ne 2
.mk
.na
\fB<\fIticks\fR>\fR
.ad
.RS 11n
.rt
time of message in machine ticks since boot
.RE

.sp
.ne 2
.mk
.na
\fB<\fIlevel\fR>\fR
.ad
.RS 11n
.rt
tracing priority level
.RE

.sp
.ne 2
.mk
.na
\fB<\fIflags\fR>\fR
.ad
.RS 11n
.rt
E : message is also in the error log F : indicates a fatal error N : mail
was sent to the system administrator (hardcoded as root)
.RE

.sp
.ne 2
.mk
.na
\fB<\fImid\fR>\fR
.ad
.RS 11n
.rt
module
.B ID
number of source
.RE

.sp
.ne 2
.mk
.na
\fB<\fIsid\fR>\fR
.ad
.RS 11n
.rt
sub-ID number of source
.RE

.sp
.ne 2
.mk
.na
\fB<\fItext\fR>\fR
.ad
.RS 11n
.rt
formatted text of the trace message
.RE

.sp
.LP
Once initiated,
.B strace
will continue to execute until terminated by
the user.
.SH EXAMPLES
.LP
\fBExample 1\fR A sample output of the \fBstrace\fR command:
.sp
.LP
The following example outputs all trace messages from the module or driver
whose module
.B ID
is
.BR 41 :

.sp
.in +2
.nf
\fBstrace  41 all all\fR
.fi
.in -2
.sp

.sp
.LP
The following example outputs those trace messages from driver or module
\fBID 41\fR with sub-IDs
.BR 0 ,
.BR 1 ,
or
.BR 2 :

.sp
.in +2
.nf
\fBstrace  41 0 1  41 1 1  41 2 0\fR
.fi
.in -2
.sp

.sp
.LP
Messages from sub-IDs
.B 0
and
.B 1
must have  a tracing level less
than or equal to
.BR 1 .
Those from sub-ID
.B 2
must have a tracing
level of
.BR 0 .

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.sp
.LP
.BR attributes (5),
.BR log (7D)
.sp
.LP
\fR
.SH NOTES
.RS +4
.TP
.ie t \(bu
.el o
There is no restriction to the number of
.B strace
processes opening the
\fBSTREAMS\fR log driver at a time.
.RE
.RS +4
.TP
.ie t \(bu
.el o
The log-driver records the list of the triplets specified in the command
invocation, and compares each potential trace message against this list to
decide if it should be formatted and sent up to the
.B strace
process.
Hence, long lists of triplets will have a greater impact on overall STREAMS
performance. Running
.B strace
will have the most impact on the timing of
the modules and  drivers generating the trace messages that are sent to the
\fBstrace\fR process. If trace messages are generated faster than the
\fBstrace\fR process can handle them,  some of the messages will be lost.
This last case can be determined by examining the sequence numbers on the
trace messages output.
.RE
