usr/src/man/man1m/strclean.1m
'\" te
.\" Copyright 1989 AT&T  Copyright (c) 1997 Sun Microsystems, Inc.  All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH strclean 1M "14 Sep 1992" "SunOS 5.11" "System Administration Commands"
.SH NAME
strclean \- STREAMS error logger cleanup program
.SH SYNOPSIS
.LP
.nf
\fBstrclean\fR [\fB-a\fR \fIage\fR] [\fB-d\fR \fIlogdir\fR]
.fi

.SH DESCRIPTION
.sp
.LP
.B strclean
is used to clean up the STREAMS error logger directory on a
regular basis (for example, by using
.BR cron .
By default, all files with
names matching
.B error.*
in
.B /var/adm/streams
that have not been
modified in the last three days are removed.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -a
.I age
.ad
.RS 13n
.rt
The maximum age in days for a log file can be changed using the
.BR -a
option.
.RE

.sp
.ne 2
.mk
.na
.B -d
.I logdir
.ad
.RS 13n
.rt
A directory other than
.B /var/adm/streams
can be specified using the
.B -d
option.
.RE

.SH EXAMPLES
.LP
.B Example 1
A sample of using the
.B strclean
command.
.sp
.LP
This example has the same result as running
.B strclean
with no
arguments:

.sp
.in +2
.nf
example%  \fBstrclean \fB-d\fB /var/adm/streams \fB-a\fB 3\fR
.fi
.in -2
.sp

.SH FILES
.sp
.LP
.BR /var/adm/streams/error. *
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.sp
.LP
.BR cron (1M),
.BR strerr (1M),
.BR attributes (5)
.sp
.LP
\fR
.SH NOTES
.sp
.LP
.B strclean
is typically run from
.B cron
on a daily or weekly
basis.
