usr/src/man/man1m/strclean.1m
'\" te
.\" Copyright 1989 AT&T  Copyright (c) 1997 Sun Microsystems, Inc.  All Rights Reserved.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH strclean 1M "14 Sep 1992" "SunOS 5.11" "System Administration Commands"
.SH NAME
strclean \- STREAMS error logger cleanup program
.SH SYNOPSIS
.LP
.nf
\fBstrclean\fR [\fB-a\fR \fIage\fR] [\fB-d\fR \fIlogdir\fR]
.fi

.SH DESCRIPTION
.sp
.LP
\fBstrclean\fR is used to clean up the STREAMS error logger directory on a
regular basis (for example, by using
.BR cron .
By default, all files with
names matching
.B error.*
in
.B /var/adm/streams
that have not been
modified in the last three days are removed.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB-a\fR \fIage\fR
.ad
.RS 13n
.rt
The maximum age in days for a log file can be changed using the
.BR -a
option.
.RE

.sp
.ne 2
.mk
.na
\fB-d\fR \fIlogdir\fR
.ad
.RS 13n
.rt
A directory other than
.B /var/adm/streams
can be specified using the
\fB-d\fR option.
.RE

.SH EXAMPLES
.LP
\fBExample 1\fR A sample of using the \fBstrclean\fR command.
.sp
.LP
This example has the same result as running
.B strclean
with no
arguments:

.sp
.in +2
.nf
example%  \fBstrclean \fB-d\fB /var/adm/streams \fB-a\fB 3\fR
.fi
.in -2
.sp

.SH FILES
.sp
.LP
.BR /var/adm/streams/error. *
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.sp
.LP
.BR cron (1M),
.BR strerr (1M),
.BR attributes (5)
.sp
.LP
\fR
.SH NOTES
.sp
.LP
\fBstrclean\fR is typically run from \fBcron\fR on a daily or weekly
basis.
