usr/src/man/man1m/strerr.1m
'\" te
.\" Copyright 1989 AT&T  Copyright (c) 1997 Sun Microsystems, Inc.  All Rights Reserved.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH strerr 1M "4 Oct 1994" "SunOS 5.11" "System Administration Commands"
.SH NAME
strerr \- STREAMS error logger daemon
.SH SYNOPSIS
.LP
.nf
\fBstrerr\fR
.fi

.SH DESCRIPTION
.sp
.LP
.B strerr
receives error log messages from the STREAMS-based log driver
(see \fBlog\fR(7D)) and appends them to a log file. The resultant error log
files reside in the directory
.BR /var/adm/streams ,
and are named
\fBerror.\fImm\fB-dd\fR, where \fImm\fR is the month and \fBdd\fR
is the day of the messages contained in each log file.
.sp
.LP
The format of an error log message is:
.sp
.LP
<\fIseq\fR> <\fBtime\fR> <\fIticks\fR> <\fIflags\fR> <\fImid\fR> <\fIsid\fR>
<\fItext\fR>
.sp
.ne 2
.mk
.na
\fB<\fIseq\fR>\fR
.ad
.RS 11n
.rt
error sequence number
.RE

.sp
.ne 2
.mk
.na
\fB<time\fR>\fR
.ad
.RS 11n
.rt
time of message in hh:mm:ss
.RE

.sp
.ne 2
.mk
.na
\fB<\fIticks\fR>\fR
.ad
.RS 11n
.rt
time of message in machine ticks since boot priority level
.RE

.sp
.ne 2
.mk
.na
\fB<\fIflags\fR>\fR
.ad
.RS 11n
.rt
.B T
: the message was also sent to a tracing process
.B F
: indicates
a fatal error
.B N
: send mail to the system administrator (hardcoded as
root)
.RE

.sp
.ne 2
.mk
.na
\fB<\fImid\fR>\fR
.ad
.RS 11n
.rt
module
.B ID
number of source
.RE

.sp
.ne 2
.mk
.na
\fB<\fIsid\fR>\fR
.ad
.RS 11n
.rt
sub-ID number of source
.RE

.sp
.ne 2
.mk
.na
\fB<\fItext\fR>\fR
.ad
.RS 11n
.rt
formatted text of the error message
.RE

.sp
.LP
Messages that appear in the error log are intended to report exceptional
conditions that require the attention of the system administrator.   Those
messages which indicate the total failure of a STREAMS-based driver or module
should have the
.B F
flag set. Those messages requiring the immediate
attention of the administrator will have the
.B N
flag set, which causes
the error logger to send the message to the system administrator using
.BR mail .
The priority level usually has no meaning in the error log but
will have meaning if the message is also sent to a tracer process.
.sp
.LP
Once initiated,
.B strerr
continues to execute until terminated by the
user. It is commonly executed asynchronously.
.SH FILES
.sp
.ne 2
.mk
.na
\fB/var/adm/streams/error.\fImm\fB-dd\fR
.ad
.sp .6
.RS 4n
error log file.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.sp
.LP
.BR attributes (5),
.BR log (7D)
.sp
.LP
\fR
.SH NOTES
.sp
.LP
There is no restriction to the number of
.B strerr
processes opening the
\fBSTREAMS\fR-based log driver at a time.
.sp
.LP
If a module or driver is generating a large number of error messages,
running the error logger will cause a degradation in STREAMS performance. If
a large burst of messages are generated in a short time, the log driver may
not be able to deliver some of the messages. This situation is indicated by
gaps in the sequence numbering of the messages in the log files.
