usr/src/man/man1m/sttydefs.1m
'\" te
.\" Copyright 1989 AT&T  Copyright (c) 1997 Sun Microsystems, Inc.  All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH sttydefs 1M "14 Sep 1992" "SunOS 5.11" "System Administration Commands"
.SH NAME
sttydefs \- maintain line settings and hunt sequences for TTY ports
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/sttydefs\fR \fB-a\fR \fIttylabel\fR [\fB-b\fR] [\fB-f\fR \fIfinal-flags\fR]
     [\fB-i\fR \fIinitial-flags\fR] [\fB-n\fR \fInextlabel\fR]
.fi

.LP
.nf
\fB/usr/sbin/sttydefs\fR \fB-l\fR [\fIttylabel\fR]
.fi

.LP
.nf
\fB/usr/sbin/sttydefs\fR \fB-r\fR \fIttylabel\fR
.fi

.SH DESCRIPTION
.sp
.LP
.B sttydefs
is an administrative command that maintains the line
settings and hunt sequences for the system's TTY ports by making entries in,
and deleting entries from the
.B /etc/ttydefs
file.
.sp
.LP
.B sttydefs
with a
.B -a
or
.B -r
option may be invoked only by
the super-user.
.B sttydefs
with
.B -l
may be invoked by any user on
the system.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -a
.I ttylabel
.ad
.RS 20n
.rt
Add a record to the
.B ttydefs
file, using
.I ttylabel
as its label.
The following describes the effect of the
.BR -b ,
.BR -n ,
.BR -i ,
or
.B -f
options when used in conjunction with the
.B -a
option:
.RE

.sp
.ne 2
.mk
.na
.B -b
.ad
.RS 20n
.rt
Enable autobaud. Autobaud allows the system to set the line speed of a
given TTY port to the line speed of the device connected to the port without
the user's intervention.
.RE

.sp
.ne 2
.mk
.na
.B -f
.I final-flags
.ad
.RS 20n
.rt
Specify the value to be used in the
.I final-flags
field in
.BR /etc/ttydefs .
.I final-flags
must be in a format recognized by the
.B stty
command.
.I final-flags
are the
.BR termio (7I)
settings used
by
.B ttymon
after receiving a successful connection request and
immediately before invoking the service on the port. If this option is not
specified,
.BR sttydefs " will set "
.I final-flags
equal to the
.BR termio (7I)
flags
.B 9600
and
.BR sane .
.RE

.sp
.ne 2
.mk
.na
.B -i
.I initial-flags
.ad
.RS 20n
.rt
Specify the value to be used in the
.I initial-flags
field in
.BR /etc/ttydefs .
.I initial-flags
must be in a format recognized by
the
.B stty
command. These flags are used by
.B ttymon
when searching
for the  correct baud rate. They are set prior to writing the prompt. If
this option is not specified,
.B sttydefs
will set \fIinitial-flags\fR
equal to the
.BR termio (7I)
flag
.BR 9600 .
.RE

.sp
.ne 2
.mk
.na
.B -n
.I nextlabel
.ad
.RS 20n
.rt
Specify the value to be used in the
.I nextlabel
field in
.BR /etc/ttydefs .
If this option is not specified,
.B sttydefs
will set
.I nextlabel
equal to
.IR ttylabel .
.RE

.sp
.ne 2
.mk
.na
\fB-l\fR[\fIttylabel\fR]\fR
.ad
.RS 20n
.rt
If a
.I ttylabel
is specified,
.B sttydefs
displays the record from
.B /etc/ttydefs
whose TTY label matches the specified
.IR ttylabel .
If
no
.I ttylabel
is specified,
.B sttydefs
displays the entire contents
of
.BR /etc/ttydefs .
.B sttydefs
verifies that each entry it displays
is correct and that the entry's
.I nextlabel
field references an
existing
.RE

.sp
.ne 2
.mk
.na
.B -r
.I ttylabel
.ad
.RS 20n
.rt
Remove any record in the
.B ttydefs
file  that has
.I ttylabel
as its
label.
.RE

.SH OUTPUT
.sp
.LP
If successful,
.B sttydefs
will exit with a status of
.BR 0 .
.B sttydefs -l
will generate the requested information and send it
to standard output.
.SH EXAMPLES
.LP
.B Example 1
A sample of
.B sttydefs
command.
.sp
.LP
The following command lists all the entries in the
.B ttydefs
file and
prints an error message for each invalid entry that is detected.

.sp
.in +2
.nf
example# \fBsttydefs\fR \fB-l\fR
.fi
.in -2
.sp

.sp
.LP
The following shows a command that requests information for a single label
and its output:

.sp
.in +2
.nf
example# \fBsttydefs\fR \fB-l\fR 9600
------------------------------------------------------------------
9600:9600 hupcl erase ^h:9600 sane ixany tab3 hupcl erase ^h::4800
------------------------------------------------------------------
ttylabel:	9600
initial flags:	9600 hupcl erase ^h
final flags:	9600 sane ixany tab3 hupcl erase ^h
autobaud:	no
nextlabel:      4800
.fi
.in -2
.sp

.sp
.LP
The following sequence of commands will add the labels
.BR 1200 ,
.BR 2400 ,
.BR 4800 ,
and
.B 9600
and put them in a circular list:

.sp
.in +2
.nf
sttydefs \fB-a\fR 1200 \fB-n\fR 2400 \fB-i\fR 1200 \fB-f\fR "1200 sane"
sttydefs \fB-a\fR 2400 \fB-n\fR 4800 \fB-i\fR 2400 \fB-f\fR "2400 sane"
sttydefs \fB-a\fR 4800 \fB-n\fR 9600 \fB-i\fR 4800 \fB-f\fR "4800 sane"
sttydefs \fB-a\fR 9600 \fB-n\fR 1200 \fB-i\fR 9600 \fB-f\fR "9600 sane"
.fi
.in -2
.sp

.SH FILES
.sp
.LP
.B /etc/ttydefs
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.sp
.LP
.BR attributes (5),
.BR termio (7I)
