usr/src/man/man1m/su.1m
'\" te
.\" Copyright 1989 AT&T
.\" Copyright (C) 2004, Sun Microsystems, Inc.
.\" All Rights Reserved.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH su 1M "26 Feb 2004" "SunOS 5.11" "System Administration Commands"
.SH NAME
su \- become superuser or another user
.SH SYNOPSIS
.LP
.nf
\fBsu\fR [\fB-\fR] [\fIusername\fR [arg.\|.\|.]]
.fi

.SH DESCRIPTION
.sp
.LP
The
.B su
command allows one to become another user without logging off
or to assume a role. The default user
.I name
is
.BR root
(superuser).
.sp
.LP
To use
.BR su ,
the appropriate password must be supplied (unless the
invoker is already
.BR root ).
If the password is correct,
.B su
creates
a new shell process that has the real and effective user
.B ID,
group
\fBIDs,\fR and supplementary group list set to those of the specified
.IR username .
Additionally, the new shell's project ID is set to the
default project ID of the specified user. See
\fBgetdefaultproj\fR(3PROJECT), \fBsetproject\fR(3PROJECT). The new shell
will be the shell specified in the shell field of
.IR username "'s password"
file entry (see
.BR passwd (4)).
If no shell is specified,
\fB/usr/bin/sh\fR is used (see
.BR sh (1)).
If superuser privilege is
requested and the shell for the superuser cannot be invoked using
.BR exec (2),
\fB/sbin/sh\fR is used as a fallback. To return to normal
user
.B ID
privileges, type an
.B EOF
character (CTRL-D) to exit the
new shell.
.sp
.LP
Any additional arguments given on the command line are passed to the new
shell. When using programs such as
.BR sh ,
an
.I arg
of the form
\fB-c\fI string\fR executes \fIstring\fR using the shell and an \fIarg\fR
of
.B -r
gives the user a restricted shell.
.sp
.LP
To create a login environment, the command \fB"su -"\fR does the
following:
.RS +4
.TP
.ie t \(bu
.el o
In addition to what is already propagated, the
.B LC*
and
.BR LANG
environment variables from the specified user's environment are also
propagated.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Propagate
.B TZ
from the user's environment. If
.B TZ
is not found in
the user's environment,
.B su
uses the
.B TZ
value from the
\fBTIMEZONE\fR parameter found in \fB/etc/default/login\fR.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Set \fBMAIL\fR to \fB/var/mail/\fInew_user\fR.
.RE
.sp
.LP
If the first argument to
.B su
is a dash (-), the environment will be
changed to what would be expected if the user actually logged in as the
specified user. Otherwise, the environment is passed along, with the
exception of \fB$\fBPATH\fB,\fR  which is controlled by \fBPATH\fR and
\fBSU\fBPATH\fR in \fB/etc/default/su\fR.
.sp
.LP
All attempts to become another user using
.B su
are logged in the log
file
.B /var/adm/sulog
(see
.BR sulog (4)).
.SH SECURITY
.sp
.LP
\fBsu\fR uses \fBpam\fR(3PAM) with the service name \fBsu\fR for
authentication, account management, and credential establishment.
.SH EXAMPLES
.LP
\fBExample 1\fR Becoming User \fBbin\fR While Retaining Your Previously
Exported Environment
.sp
.LP
To become user
.B bin
while retaining your previously exported
environment, execute:

.sp
.in +2
.nf
example% \fBsu bin\fR
.fi
.in -2
.sp

.LP
\fBExample 2\fR Becoming User \fBbin\fR and Changing to \fBbin\fR's Login
Environment
.sp
.LP
To become user
.B bin
but change the environment to what would be
expected if
.B bin
had originally logged in, execute:

.sp
.in +2
.nf
example% \fBsu - bin\fR
.fi
.in -2
.sp

.LP
\fBExample 3\fR Executing command with user \fBbin\fR's Environment and
Permissions
.sp
.LP
To execute command with the temporary environment and permissions of user
.BR bin ,
type:

.sp
.in +2
.nf
example% \fBsu - bin -c "\fIcommand args\fR"\fR
.fi
.in -2
.sp

.SH ENVIRONMENT VARIABLES
.sp
.LP
Variables with
.B LD_
prefix are removed for security reasons. Thus,
\fBsu bin\fR will not retain previously exported variables with \fBLD_\fR
prefix while becoming user
.BR bin .
.sp
.LP
If any of the
.B LC_*
variables (
.BR LC_CTYPE ,
.BR LC_MESSAGES ,
.BR LC_TIME ,
.BR LC_COLLATE ,
.BR LC_NUMERIC ,
and
.BR LC_MONETARY )
(see
.BR environ (5))
are not set in the environment, the operational
behavior of
.B su
for each corresponding locale category is determined by
the value of the
.B LANG
environment variable. If
.B LC_ALL
is set,
its contents are used to override both the
.B LANG
and the other
\fBLC_*\fR variables. If none of the above variables are set in the
environment, the "C" (U.S. style) locale determines how \fBsu\fR behaves.
.sp
.ne 2
.mk
.na
.B LC_CTYPE
.ad
.RS 15n
.rt
Determines how
.B su
handles characters. When
.B LC_CTYPE
is set to a
valid value,
.B su
can display and handle text and filenames containing
valid characters for that locale.
.B su
can display and handle Extended
Unix Code (\fBEUC\fR) characters where any individual character can be
.BR 1 ,
.BR 2 ,
or
.B 3
bytes wide.
.B su
can also handle
.BR EUC
characters of \fB1\fR, \fB2\fR, or more column widths. In the "C" locale,
only characters from ISO 8859-1 are valid.
.RE

.sp
.ne 2
.mk
.na
.B LC_MESSAGES
.ad
.RS 15n
.rt
Determines how diagnostic and informative messages are presented. This
includes the language and style of the messages, and the correct form of
affirmative and negative responses. In the "C" locale, the messages are
presented in the default form found in the program itself (in most cases,
U.S. English).
.RE

.SH FILES
.sp
.ne 2
.mk
.na
\fB$\fBHOME\fB/.profile\fR
.ad
.RS 22n
.rt
user's login commands for
.B sh
and
.BR ksh
.RE

.sp
.ne 2
.mk
.na
.B /etc/passwd
.ad
.RS 22n
.rt
system's password file
.RE

.sp
.ne 2
.mk
.na
\fB/etc/profile\fR
.ad
.RS 22n
.rt
system-wide
.B sh
and
.B ksh
login commands
.RE

.sp
.ne 2
.mk
.na
.B /var/adm/sulog
.ad
.RS 22n
.rt
log file
.RE

.sp
.ne 2
.mk
.na
\fB/etc/default/su\fR
.ad
.RS 22n
.rt
the default parameters in this file are:
.sp
.ne 2
.mk
.na
.B SULOG
.ad
.RS 11n
.rt
If defined, all attempts to
.B su
to another user are logged in the
indicated file.
.RE

.sp
.ne 2
.mk
.na
.B CONSOLE
.ad
.RS 11n
.rt
If defined, all attempts to
.B su
to
.B root
are logged on the
console.
.RE

.sp
.ne 2
.mk
.na
.B PATH
.ad
.RS 11n
.rt
Default path. (\fB/usr/bin:\fR)
.RE

.sp
.ne 2
.mk
.na
\fBSU\fBPATH\fR
.ad
.RS 11n
.rt
Default path for a user invoking
.B su
to
.BR root .
(\fB/usr/sbin:/usr/bin\fR)
.RE

.sp
.ne 2
.mk
.na
.B SYSLOG
.ad
.RS 11n
.rt
Determines whether the \fBsyslog\fR(3C) \fBLOG_AUTH\fR facility should be
used to log all
.B su
attempts.
.B LOG_NOTICE
messages are generated
for \fBsu\fR's to root, \fBLOG_INFO\fR messages are generated for \fBsu\fR's
to other users, and
.B LOG_CRIT
messages are generated for failed
\fBsu\fR attempts.
.RE

.RE

.sp
.ne 2
.mk
.na
\fB/etc/default/login\fR
.ad
.RS 22n
.rt
the default parameters in this file are:
.sp
.ne 2
.mk
.na
.B TIMEZONE
.ad
.RS 12n
.rt
Sets the TZ environment variable of the shell.
.RE

.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.sp
.LP
.BR csh (1),
.BR env (1),
.BR ksh (1),
.BR login (1),
.BR roles (1),
.BR sh (1),
.BR syslogd (1M),
.BR exec (2),
\fBgetdefaultproj\fR(3PROJECT), \fBsetproject\fR(3PROJECT), \fBpam\fR(3PAM),
.BR pam_authenticate (3PAM),
.BR pam_acct_mgmt (3PAM),
.BR pam_setcred (3PAM),
\fBpam.conf\fR(4), \fBpasswd\fR(4),
.BR profile (4),
.BR sulog (4),
.BR syslog (3C),
.BR attributes (5),
.BR environ (5)
