usr/src/man/man1m/svc.configd.1m
'\" te
.\" Copyright (c) 2004, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH svc.configd 1M "27 Oct 2004" "SunOS 5.11" "System Administration Commands"
.SH NAME
svc.configd \- Service Management Facility repository daemon
.SH SYNOPSIS
.LP
.nf
\fB/lib/svc/bin/svc.configd\fR
.fi

.SH DESCRIPTION
.sp
.LP
.B svc.configd
is the repository daemon for the Service Management
Facility.
.B svc.configd
is invoked automatically during system startup,
and restarted if any failures occur.
.B svc.configd
should never be
invoked directly.
.sp
.LP
.RB "Interaction with " svc.configd " is by way of " libscf (3LIB)
and the
command line tools:\fBsvcs\fR(1),
.BR svcprop (1),
.BR svcadm (1M),
and
.BR svccfg (1M).
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsr
.TE

.SH SEE ALSO
.sp
.LP
.BR svcs (1),
.BR svcprop (1),
.BR svcadm (1M),
.BR svccfg (1M),
.BR libscf (3LIB),
.BR attributes (5)
