usr/src/man/man1m/swap.1m
'\" te
.\" Copyright (c) 2008, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright 1989 AT&T
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH swap 1M "11 Apr 2008" "SunOS 5.11" "System Administration Commands"
.SH NAME
swap \- swap administrative interface
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/swap\fR \fB-a\fR \fIswapname\fR [\fIswaplow\fR] [\fIswaplen\fR]
.fi

.LP
.nf
\fB/usr/sbin/swap\fR \fB-d\fR \fIswapname\fR [\fIswaplow\fR]
.fi

.LP
.nf
\fB/usr/sbin/swap\fR \fB-l\fR [\fB-h\fR | \fB-k\fR]
.fi

.LP
.nf
\fB/usr/sbin/swap\fR \fB-s\fR [\fB-h\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The
.B swap
utility provides a method of adding, deleting, and
monitoring the system swap areas used by the memory manager.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB-a\fR \fIswapname\fR [\fIswaplow\fR] [\fIswaplen\fR]\fR
.ad
.sp .6
.RS 4n
Add the specified swap area. This option can only be used by the superuser
or by one who has assumed the Primary Administrator role.
.I swapname
is
the name of the swap area or regular file. For example, on system running a
UFS root file system, specify a slice, such as
.BR /dev/dsk/c0t0d0s1 ,
or a
regular file for a swap area. On a system running a ZFS file system, specify
a ZFS volume, such as
.BR /dev/zvol/dsk/rpool/swap ,
for a swap area. Using
a regular file for swap is not supported on a ZFS file system. In addition,
you cannot use the same ZFS volume for both the swap area and a dump device
when the system is running a ZFS root file system.
.sp
\fIswaplow\fR is the offset in 512-byte blocks into the file where the swap
area should begin.
.I swaplen
is the desired length of the swap area in
512-byte blocks. The value of
.I swaplen
can not be less than
.BR 16 .
For example, if
.I n
blocks are specified, then (\fIn\fR-1) blocks would
be the actual swap length.
.I swaplen
must be at least one page in
length. The size of a page of memory can be determined by using the
\fBpagesize\fR command. See
.BR pagesize (1).
Since the first page of a
swap file is automatically skipped, and a swap file needs to be at least one
page in length, the minimum size should be a multiple of 2 pagesize bytes.
The size of a page of memory is machine-dependent.
.sp
\fIswaplow\fR + \fIswaplen\fR must be less than or equal to the size of the
swap file. If
.I swaplen
is not specified, an area will be added starting
at
.I swaplow
and extending to the end of the designated file. If neither
\fIswaplow\fR nor \fIswaplen\fR are specified, the whole file will be used
except for the first page. Swap areas are normally added automatically
during system startup by the
.B /sbin/swapadd
script. This script adds
all swap areas which have been specified in the \fB/etc/vfstab\fR file; for
the syntax of these specifications, see
.BR vfstab (4).
.sp
To use an
.B NFS
or local file system
.IR swapname ,
you should first
create a file using \fBmkfile\fR(1M). A local file system swap file can now
be added to the running system by just running the
.BR "swap -a"
command. For
.B NFS
mounted swap files, the server needs to export the
file. Do this by performing the following steps:
.RS +4
.TP
1.
Add the following line to
.BR /etc/dfs/dfstab :
.sp
.in +2
.nf
share -F nfs -o \e
rw=\fIclientname\fR,root=\fIclientname path-to-swap-file\fR
.fi
.in -2

.RE
.RS +4
.TP
2.
Run
.BR shareall (1M).
.RE
.RS +4
.TP
3.
Have the client add the following line to
.BR /etc/vfstab :
.sp
.in +2
.nf
\fIserver\fR:\fIpath-to-swap-file\fR -  \fIlocal-path-to-swap-file\fR nfs \e
     -\|-\|- \fIlocal-path-to-swap-file\fR -\|- swap -\|-\|-
.fi
.in -2

.RE
.RS +4
.TP
4.
Have the client run
.BR mount :
.sp
.in +2
.nf
# mount \fIlocal-path-to-swap-file\fR
.fi
.in -2
.sp

.RE
.RS +4
.TP
5.
The client can then run
.B "swap -a"
to add the swap space:
.sp
.in +2
.nf
# swap -a \fIlocal-path-to-swap-file\fR
.fi
.in -2
.sp

.RE
.RE

.sp
.ne 2
.mk
.na
\fB-d\fR \fIswapname\fR
.ad
.sp .6
.RS 4n
Delete the specified swap area. This option can only be used by the
super-user.
.I swapname
is the name of the swap file: for example,
\fB/dev/dsk/c0t0d0s1\fR or a regular file. \fIswaplow\fR is the offset in
512-byte blocks into the swap area to be deleted. If
.I swaplow
is not
specified, the area will be deleted starting at the second page. When the
command completes, swap blocks can no longer be allocated from this area and
all swap blocks previously in use in this swap area have been moved to other
swap areas.
.RE

.sp
.ne 2
.mk
.na
.B -h
.ad
.sp .6
.RS 4n
All sizes are scaled to a human readable format. Scaling is done by
repetitively dividing by 1024.
.RE

.sp
.ne 2
.mk
.na
.B -k
.ad
.sp .6
.RS 4n
Write the files sizes in units of 1024 bytes.
.RE

.sp
.ne 2
.mk
.na
.B -l
.ad
.sp .6
.RS 4n
List the status of all the swap areas. The output has five columns:
.sp
.ne 2
.mk
.na
.B path
.ad
.sp .6
.RS 4n
The path name for the swap area.
.RE

.sp
.ne 2
.mk
.na
.B dev
.ad
.sp .6
.RS 4n
The major/minor device number in decimal if it is a block special device;
zeroes otherwise.
.RE

.sp
.ne 2
.mk
.na
.B swaplo
.ad
.sp .6
.RS 4n
The
.I swaplow
value for the area in 512-byte blocks.
.RE

.sp
.ne 2
.mk
.na
.B blocks
.ad
.sp .6
.RS 4n
The
.I swaplen
value for the area in 512-byte blocks.
.RE

.sp
.ne 2
.mk
.na
\fBfree\fR
.ad
.sp .6
.RS 4n
The number of 512-byte blocks in this area that are not currently
allocated.
.RE

The list does not include swap space in the form of physical memory because
this space is not associated with a particular swap area.
.sp
If
.B "swap -l"
is run while
.I swapname
is in the process of
being deleted (by \fBswap\fB-d\fR), the string \fBINDEL\fR will appear in
a sixth column of the swap stats.
.RE

.sp
.ne 2
.mk
.na
.B -s
.ad
.sp .6
.RS 4n
Print summary information about total swap space usage and availability:
.sp
.ne 2
.mk
.na
.B allocated
.ad
.sp .6
.RS 4n
The total amount of swap space in bytes currently allocated for use as
backing store.
.RE

.sp
.ne 2
.mk
.na
.B reserved
.ad
.sp .6
.RS 4n
The total amount of swap space in bytes not currently allocated, but
claimed by memory mappings for possible future use.
.RE

.sp
.ne 2
.mk
.na
.B used
.ad
.sp .6
.RS 4n
The total amount of swap space in bytes that is either allocated or
reserved.
.RE

.sp
.ne 2
.mk
.na
.B available
.ad
.sp .6
.RS 4n
The total swap space in bytes that is currently available for future
reservation and allocation.
.RE

These numbers include swap space from all configured swap areas as listed
by the
.B -l
option, as well swap space in the form of physical memory.
.RE

.SH USAGE
.sp
.LP
On the 32-bit operating system, only the first 2 Gbytes -1 are used for
swap devices greater than or equal to 2 Gbytes in size. On the 64-bit
operating system, a block device larger than 2 Gbytes can be fully utilized
for swap up to 2^63 \(mi1 bytes.
.SH ENVIRONMENT VARIABLES
.sp
.LP
See
.BR environ (5)
for descriptions of the following environment
variables that affect the execution of
.BR swap :
\fBLC_CTYPE\fR and
.BR LC_MESSAGE .
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.sp
.LP
.BR pagesize (1),
\fBmkfile\fR(1M), \fBshareall\fR(1M),
.BR getpagesize (3C),
\fBvfstab\fR(4), \fBattributes\fR(5),
.BR largefile (5)
.SH NOTES
.sp
.LP
For information about setting up a swap area with
.BR ZFS ,
see the \fIZFS
Administration Guide\fR.
.SH WARNINGS
.sp
.LP
No check is done to determine if a swap area being added overlaps with an
existing file system.
