usr/src/man/man1m/syncinit.1m
'\" te
.\" Copyright (c) 1993, Sun Microsystems, Inc.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH syncinit 1M "9 Mar 1993" "SunOS 5.11" "System Administration Commands"
.SH NAME
syncinit \- set serial line interface operating parameters
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/syncinit\fR \fIdevice\fR
     [ [\fIbaud_rate\fR] | [\fIkeyword\fR=\fIvalue\fR,].\|.\|. | [\fIsingle-word\fR \fIoption\fR]]
.fi

.SH DESCRIPTION
.sp
.LP
The
.B syncinit
utility allows the user to modify some of the hardware
operating modes common to synchronous serial lines. This can be useful in
troubleshooting a link, or necessary to the operation of a communications
package.
.sp
.LP
If run without options,
.B syncinit
reports the options as presently set on
the port. If options are specified, the new settings are reported after they
have
been made.
.SH OPTIONS
.sp
.LP
Options to
.B syncinit
normally take the form of a keyword, followed by an
equal sign and a value. The exception is that a baud rate may be specified as a
decimal integer by itself. Keywords must begin with the value shown in the
options table, but may contain additional letters up to the equal sign. For
example,
.B loop=
and
.B loopback=
are equivalent.
.sp
.LP
The following options are supported:
.sp

.sp
.TS
tab();
lw(.87i) lw(.87i) lw(3.76i)
lw(.87i) lw(.87i) lw(3.76i)
.
\fBKeyword\fR\fBValue\fR\fBEffect\fR
\fBloop\fRyesT{
Set the port to operate in \fBinternal loopback\fR mode. The receiver is electrically disconnected from the DCE receive data input and tied to the outgoing transmit data line. Transmit data is available to the DCE. The Digital Phase-Locked Loop (DPLL) may not be used as a clock source in this mode. If no other clocking options have been specified, perform the equivalent of \fBtxc=baud\fR and \fBrxc=baud\fR.
T}
noT{
Disable internal loopback mode.  If no other clocking options have been specified, perform the equivalent of \fBtxc=txc\fR and \fBrxc=rxc\fR.
T}
\fBecho\fRyesT{
Set the port to operate in \fBauto-echo\fR mode.  The transmit data output is electrically disconnected from the transmitter and tied to the receive data input. Incoming receive data is still visible.  Use of this mode in combination with local loopback mode has no value, and should be rejected by the device driver. The \fBauto-echo\fR mode is useful to make a system become the endpoint of a remote loopback test.
T}
noDisable \fBauto-echo\fR mode.
\fBnrzi\fRyesT{
Set the port to operate with \fBNRZI\fR data encoding.
T}
noT{
Set the port to operate with \fBNRZ\fR data encoding.
T}
\fBtxc\fR\fBtxc\fRT{
Transmit clock source will be the \fBTxC\fR signal (pin 15).
T}
\fBrxc\fRT{
Transmit clock source will be the \fBRxC\fR signal (pin 17).
T}
\fBbaud \fRT{
Transmit clock source will be the internal \fBbaud rate generator\fR.
T}
\fBpll\fRT{
Transmit clock source will be the output of the \fBDPLL\fR circuit.
T}
\fBrxc\fR\fBrxc\fRT{
Receive clock source will be the \fBRxC\fR signal (pin 17).
T}
\fBtxc\fRT{
Receive clock source will be the \fBTxC\fR signal (pin 15).
T}
\fBbaud\fRT{
Receive clock source will be the internal \fBbaud rate generator\fR.
T}
\fBpll\fRT{
Receive clock source will be the output of the \fBDPLL\fR circuit.
T}
\fBspeed\fR\fIinteger\fRT{
Set the baud rate to \fIinteger\fR bits per second.
T}
.TE

.sp
.LP
There are also several single-word options that set one or more paramaters at a
time:
.sp

.sp
.TS
tab();
lw(2.75i) lw(2.75i)
lw(2.75i) lw(2.75i)
.
\fBKeyword\fR\fBEquivalent to Options:\fR
\fBexternal\fR\fBtxc=txc rxc=rxc loop=no\fR
\fBsender\fR\fBtxc=baud rxc=rxc loop=no\fR
\fBinternal\fR\fBtxc=pll rxc=pll loop=no\fR
\fBstop\fR\fBspeed=0\fR
.TE

.SH EXAMPLES
.LP
.B Example 1
Using
.BR syncinit
.sp
.LP
The following command sets the first CPU port to loop internally, using
internal
clocking and operating at 38400 baud:

.sp
.in +2
.nf
example# syncinit zsh0 38400 loop=yes
device: /dev/zsh  ppa: 0
speed=38400, loopback=yes, echo=no, nrzi=no, txc=baud, rxc=baud
.fi
.in -2
.sp

.sp
.LP
The following command sets the same port's clocking, local loopback and baud
rate settings to their default values:

.sp
.in +2
.nf
example# syncinit zsh0 stop loop=no
device: /dev/zsh  ppa: 0
speed=0, loopback=no, echo=no, nrzi=no, txc=txc, rxc=rxc
.fi
.in -2
.sp

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.sp
.LP
.BR syncloop (1M),
.BR syncstat (1M),
.BR intro (2),
.BR ioctl (2),
.BR attributes (5),
.BR " zsh" (7D)
.SH DIAGNOSTICS
.sp
.ne 2
.mk
.na
.IB device " missing minor device number"
.ad
.sp .6
.RS 4n
The name
.I device
does not end in a decimal number that can be used as a
minor device number.
.RE

.sp
.ne 2
.mk
.na
.BI "bad speed: " arg
.ad
.sp .6
.RS 4n
The string
.I arg
that accompanied the
.B speed=
option could not be
interpreted as a decimal integer.
.RE

.sp
.ne 2
.mk
.na
.BI "Bad arg: " arg
.ad
.sp .6
.RS 4n
The string
.I arg
did not make sense as an option.
.RE

.sp
.ne 2
.mk
.na
.BI "ioctl failure code = " errno
.ad
.sp .6
.RS 4n
An
.BR ioctl (2)
system called failed. The meaning of the value of 
.I errno
may be found in
.BR intro (2).
.RE

.SH WARNINGS
.sp
.LP
Do not use
.B syncinit
on an active serial link, unless needed to resolve  an
error condition. Do not use this command casually or without being aware of the
consequences.
