usr/src/man/man1m/syseventconfd.1m
'\" te
.\" Copyright (c) 2004, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH syseventconfd 1M "6 Aug 2004" "SunOS 5.11" "System Administration Commands"
.SH NAME
syseventconfd \- kernel system event command invocation daemon
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/sysevent/syseventconfd\fR [\fB-r\fR \fIrootdir\fR]
.fi

.SH DESCRIPTION
.sp
.LP
.B syseventconfd
is the user-level daemon that invokes user-level
commands in response to kernel system events received from
.BR syseventd (1M).
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -r
.I rootdir
.ad
.RS 14n
.rt
Cause
.B syseventconfd
to use an alternate root path when creating its
door. The root path must match the root path used to invoke
.BR syseventd .
.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/sysevent/syseventconfd_event_service
.ad
.sp .6
.RS 4n
.B syseventconfd
event service door file
.RE

.sp
.ne 2
.mk
.na
.B /usr/lib/sysevent/modules/sysevent_conf_mod.so
.ad
.sp .6
.RS 4n
.B syseventd
loadable module (\fBSLM\fR) managing \fBsysevent.conf\fR
files
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.sp
.LP
.BR svcs (1),
.BR svcadm (1M),
.BR syseventd (1M),
.BR attributes (5),
.BR smf (5)
.SH NOTES
.sp
.LP
The
.B syseventconfd
service is managed by the service management
facility,
.BR smf (5),
under the service identifier:
.sp
.in +2
.nf
svc:/system/sysevent:default
.fi
.in -2
.sp

.sp
.LP
Administrative actions on this service, such as enabling, disabling, or
requesting restart, can be performed using
.BR svcadm (1M).
The service's
status can be queried using the
.BR svcs (1)
command.
