usr/src/man/man1m/syseventadm.1m
'\" te
.\" Copyright (c) 2004, Sun Microsystems, Inc. All Rights Reserved.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH syseventadm 1M "28 Sep 2005" "SunOS 5.11" "System Administration Commands"
.SH NAME
syseventadm \- sysevent event specification administration
.SH SYNOPSIS
.LP
.nf
\fBsyseventadm\fR add [\fB-R\fR \fIrootdir\fR] [\fB-v\fR \fIvendor\fR] [\fB-p\fR \fIpublisher\fR]
     [\fB-c\fR \fIclass\fR] [\fB-s\fR \fIsubclass\fR] [\fB-u\fR \fIusername\fR] \fIpath\fR [\fIargs\fR]
.fi

.LP
.nf
\fBsyseventadm\fR remove [\fB-R\fR \fIrootdir\fR] [\fB-v\fR \fIvendor\fR] [\fB-p\fR \fIpublisher\fR]
     [\fB-c\fR \fIclass\fR] [\fB-s\fR \fIsubclass\fR] [\fB-u\fR \fIusername\fR] [\fIpath\fR [\fIargs\fR]]
.fi

.LP
.nf
\fBsyseventadm\fR list [\fB-R\fR \fIrootdir\fR] [\fB-v\fR \fIvendor\fR] [\fB-p\fR \fIpublisher\fR]
     [\fB-c\fR \fIclass\fR] [\fB-s\fR \fIsubclass\fR] [\fB-u\fR \fIusername\fR] [\fIpath\fR [\fIargs\fR]]
.fi

.LP
.nf
\fBsyseventadm\fR restart
.fi

.SH DESCRIPTION
.sp
.LP
The
.B syseventadm
command is an administrative front-end to add, remove and
list
.B sysevent
event handlers. You can also restart the sysevent daemon by
use of the restart command.
.B syseventadm
can only be run by root.
.sp
.LP
The
.B "syseventadm add"
command adds a handler for a
.BR sysevent
event specified by at least one of vendor, publisher or class. If
.I class
is
specified, it may be qualified with a
.IR sub-class .
Only the values specified
for
.IR vendor ,
.IR publisher ,
\fIclass\fR and \fIsub-class\fR when adding
the handler are matched against
.B sysevent
events to determine if the
specification matches the event and the handler should be run.
.I path
is the
full pathname of the command to be run in response to matching events, with
optional arguments
.RI ( args ).
If username is specified, the command is
invoked as user
.IR username ,
otherwise as root.
.sp
.LP
The
.B "syseventadm remove"
command removes handlers for matching
sysevent event specifications. Event specifications may be matched by specifying
at least one of
.IR vendor ,
.IR publisher ,
.IR class ,
\fIusername\fR or
.IR path .
If
.I class
is specified, it may be qualified with a
.IR sub-class .
Any of
.IR vendor ,
.IR publisher ,
.IR class ,
.IR sub-class ,
.IR username ,
\fIpath\fR or \fIargs\fR not specified match
the corresponding fields of all events. Handlers for all matching specifications
are removed.
.sp
.LP
The
.B "syseventadm list"
command lists the handlers for matching
\fBsysevent\fR event specifications using the same match criteria as the
\fBremove\fR command but without the requirement that at least one of
.IR vendor ,
.IR publisher ,
.IR class ,
\fIusername\fR or \fIpath\fR be
specified. With no match criteria, all specifications are listed. The list
command output format is: [vendor=\fIvendor\fR] [publisher=\fIpublisher\fR]
[class=\fIclass\fR] [subclass=\fIsubclass\fR] [username=\fIusername\fR]
\fIpath\fR [\fIargs\fR] where each of
.IR class ,
.IR sub-class ,
.IR vendor ,
\fIpublisher\fR and \fIusername\fR is listed only if part of the
match criteria for the listed specification.
.sp
.LP
The
.B "syseventadm restart"
command informs the
.B syseventd
daemon
to reread the
.B sysevent
registry after a change has been made by adding or
removing one or more
.B sysevent
handler specifications.
.SS "Argument Macro Substitution"
.sp
.LP
The
.B sysevent
handling facility provides extensive macro capability for
constructing the command line arguments to be executed in response to an event.
Macro expansion applies only to the command line
.I args
specified for an
event handler, with macros expanded with data from the event itself. Pre-defined
macros are provided for the event
.IR class ,
.IR subclass ,
.I publisher
and
.I vendor
information. Macros not matching one of the pre-defined macro
names cause the attribute list attached to the event to be searched for an
attribute of that name, with the value of the matching attribute substituted on
the command line.
.sp
.LP
Macros are introduced by the
.B $
character, with the macro name being the
following token separated by a SPACE or TAB character. If the macro name is
embedded in text, it may be delineated by
.B ${
and
.BR } .
A \fB\e\fR
before the
.B $
causes macro expansion not to occur.
.sp
.ne 2
.mk
.na
\fB$\fIclass\fR
.ad
.RS 14n
.rt
The class string defining the event
.RE

.sp
.ne 2
.mk
.na
\fB$\fIpublisher\fR
.ad
.RS 14n
.rt
The publisher string defining the event
.RE

.sp
.ne 2
.mk
.na
\fB$\fIsequence\fR
.ad
.RS 14n
.rt
The sequence number of the event.
.RE

.sp
.ne 2
.mk
.na
\fB$\fIsubclass\fR
.ad
.RS 14n
.rt
The subclass string defining the event
.RE

.sp
.ne 2
.mk
.na
\fB$\fItimestamp\fR
.ad
.RS 14n
.rt
The timestamp of the event.
.RE

.sp
.ne 2
.mk
.na
\fB$\fIvendor\fR
.ad
.RS 14n
.rt
The vendor string defining the event
.RE

.sp
.LP
Macro names other than those pre-defined are compared against the attribute
list provided with the event. An attribute with name matching the macro name
causes the value of the attribute to be substituted as
.B ASCII
text on the
generated command line.
.sp
.LP
Use of a macro for which no attribute with that name is defined, or for which
multiple attributes with that name are provided, cause an error and the command
is not invoked.
.sp
.LP
Attributes with signed data types (\fBDATA_TYPE_INT16\fR, \fBDATA_TYPE_INT32\fR
and
.BR DATA_TYPE_INT64 )
are expanded as decimal digits.
.sp
.LP
Attributes with unsigned data types (\fBDATA_TYPE_BYTE\fR,
.BR DATA_TYPE_UINT16 ,
.BR DATA_TYPE_UINT32 ,
\fBDATA_TYPE_UINT64\fR and
.BR DATA_TYPE_HTTIME )
are expanded as hexadecimal digits with a
.BR 0x
prefix. 
.sp
.LP
Attributes with string data type (\fBDATA_TYPE_STRING\fR) are expanded with the
string data. The data is not quoted. If if it desired that the quoted strings be
generated on the command line, put quotes around the macro call in the
arguments. 
.sp
.LP
Array types are expanded with each element expanded as defined for that scalar
type, with a space separating each element substitution.
.SH OPTIONS
.sp
.LP
The
.BR add ,
\fBlist\fR and \fBremove\fR subcommands support the following
options:
.sp
.ne 2
.mk
.na
\fB-c\fR \fIclass\fR
.ad
.RS 16n
.rt
Specify the event class, \fIclass\fR.
.RE

.sp
.ne 2
.mk
.na
\fB-p\fR \fIpublisher\fR
.ad
.RS 16n
.rt
Specify the event publisher, \fIpublisher\fR.
.RE

.sp
.ne 2
.mk
.na
\fB-R\fR \fIrootdir\fR
.ad
.RS 16n
.rt
Specify an alternate root path, \fIrootdir\fR.
.LP
Note -
.sp
.RS 2
The root file system of any non-global zones must not be referenced with the
\fB-R\fR option. Doing so might damage the global zone's file system, might
compromise the security of the global zone, and might damage the non-global
zone's file system. See \fBzones\fR(5).
.RE
.RE

.sp
.ne 2
.mk
.na
\fB-s\fR \fIsubclass\fR
.ad
.RS 16n
.rt
Specify the event subclass, \fIsubclass\fR.
.RE

.sp
.ne 2
.mk
.na
\fB-u\fR \fIusername\fR
.ad
.RS 16n
.rt
Specify the username (\fIusername\fR) to invoke the command.
.RE

.sp
.ne 2
.mk
.na
\fB-v\fR \fIvendor\fR
.ad
.RS 16n
.rt
Specify the vendor (\fIvendor\fR) that defines the event. Events defined by
third-party software should specify the company's stock symbol as \fIvendor\fR.
Sun-defined events use \fBSUNW\fR.
.RE

.SH OPERANDS
.sp
.LP
The
.BR add ,
\fBlist\fR and \fBremove\fR subcommands support the following
options:
.sp
.ne 2
.mk
.na
.I args
.ad
.RS 8n
.rt
Command arguments
.RE

.sp
.ne 2
.mk
.na
.I path
.ad
.RS 8n
.rt
Full path of command to be run in response to event
.RE

.SH EXAMPLES
.LP
\fBExample 1\fR Adding an Event Handler
.sp
.LP
The following example adds an event handler for an event defined by vendor
\fBMYCO\fR ("My Company"), class \fBEC_ENV\fR and sub-class \fBESC_ENV_TEMP\fR.
The command to be run is
.BR /opt/MYCOenv/bin/ec_env_temp ,
with arguments
being the class name, sub-class name and pathname derived from the event
attributes. The
.B $
characters are preceded by a backslash to circumvent
shell interpretation. There is no need to restart the service after the change
since the registry is maintained on
.BR $ALTROOT .

.sp
.in +2
.nf
# syseventadm add -R \$ALTROOT -v MYCO -c EC_ENV -s ESC_ENV_TEMP \e
     /opt/MYCOenv/bin/ec_env_temp \e$class \e$subclass \e$pathname
.fi
.in -2
.sp

.sp
.LP
Note the caveat on the use of the
.B -R
option in the description of that
option, above.

.LP
\fBExample 2\fR Removing an Event Handler
.sp
.LP
The following example removes the event handler added in Example 1.

.sp
.in +2
.nf
# syseventadm remove -R \$ALTROOT -v MYCO -c EC_ENV -s ESC_ENV_TEMP \e
     /opt/MYCOenv/bin/ec_env_temp \${class} \${subclass} \${pathname}
.fi
.in -2
.sp

.sp
.LP
Note the caveat on the use of the
.B -R
option in the description of that
option, above.

.LP
\fBExample 3\fR Listing Event Handlers
.sp
.LP
The following example lists all event handlers for events of class
.BR EC_ENV ,
subclass
.BR ESC_ENV_TEMP ,
as defined by vendor
.BR MYCO :

.sp
.in +2
.nf
# syseventadm list -v MYCO -c EC_ENV -s ESC_ENV_TEMP \e
     vendor=MYCO class=EC_ENV subclass=ESC_ENV_TEMP \e
     /opt/MYCOenv/bin/ec_env_temp \e${class} \e${subclass} \e${pathname}
.fi
.in -2
.sp

.LP
\fBExample 4\fR Listing Event Handlers
.sp
.LP
The following example lists all event handlers defined by vendor
.BR VRTS .

.sp
.in +2
.nf
# syseventadm list -v VRTS
.fi
.in -2
.sp

.LP
\fBExample 5\fR Removing Event Handlers
.sp
.LP
The following example removes all event handlers defined by vendor
.BR VRTS ,
and restarts service.

.sp
.in +2
.nf
# syseventadm remove -v VRTS
# syseventadm restart
.fi
.in -2
.sp

.LP
\fBExample 6\fR Listing All Event Handlers Specified to Run a Command
.sp
.LP
The following example lists all event handlers specified to run the command
.BR /opt/MYCOenv/bin/ec_env_temp :

.sp
.in +2
.nf
# syseventadm list /opt/MYCOenv/bin/ec_env_temp
.fi
.in -2
.sp

.LP
\fBExample 7\fR Removing Event Handlers and Restarting Service
.sp
.LP
The following example removes all event handlers specified to run the command
.BR /opt/MYCOenv/bin/ec_env_temp ,
and restarts service:

.sp
.in +2
.nf
# syseventadm remove /opt/MYCOenv/bin/ec_env_temp
# syseventadm restart
.fi
.in -2
.sp

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 5n
.rt
Successful completion.
.RE

.sp
.ne 2
.mk
.na
.B 1
.ad
.RS 5n
.rt
No matching event specification found (remove or list commands only).
.RE

.sp
.ne 2
.mk
.na
.B 2
.ad
.RS 5n
.rt
Incorrect command usage.
.RE

.sp
.ne 2
.mk
.na
.B 3
.ad
.RS 5n
.rt
Permission denied.
.RE

.sp
.ne 2
.mk
.na
.B 4
.ad
.RS 5n
.rt
Command failed.
.RE

.sp
.ne 2
.mk
.na
.B 5
.ad
.RS 5n
.rt
Out of memory.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.sp
.LP
.BR syseventd (1M),
.BR sysevent_post_event (3SYSEVENT),
.BR attributes (5),
.BR ddi_log_sysevent (9F)
.SH NOTES
.sp
.LP
To avoid upgrade problems, packages delivering a sysevent event handler should
install the event handler by running
.B syseventadm
from the package's
postinstall script. The event handler can then be removed by running
\fBsyseventadm\fR from the package's preremove script using the same arguments
as when added.
