usr/src/man/man1m/syseventd.1m
'\" te
.\" Copyright (c) 2004, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH syseventd 1M "6 Aug 2004" "SunOS 5.11" "System Administration Commands"
.SH NAME
syseventd \- kernel system event notification daemon
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/sysevent/syseventd\fR [\fB-d\fR \fIdebug_level\fR] [\fB-r\fR \fIrootdir\fR]
.fi

.SH DESCRIPTION
.sp
.LP
.B syseventd
is a user-level daemon that accepts delivery of system
event buffers from the kernel. Once an event buffer has been delivered to
.BR syseventd ,
it, in turn, attempts to propagate the event to all
interested end event subscribers.
.sp
.LP
Event subscribers take the form of a
.B syseventd
loadable module
.RB ( SLM "). " syseventd " passes the event buffer to each of its"
subscribers and in return expects a notification as to the successful or
unsuccessful delivery attempt.
.sp
.LP
Upon successful delivery of the event buffer to all interested event
subscribers,
.B syseventd
frees the event buffer from the kernel event
queue.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -d
.I debug_level
.ad
.RS 18n
.rt
Enable debug mode. Messages are printed to the invoking user's terminal.
.RE

.sp
.ne 2
.mk
.na
.B -r
.I rootdir
.ad
.RS 18n
.rt
Cause
.B syseventd
to use an alternate root path when creating its door
and lock files. Modules continue to be loaded from the standard module
directories.
.RE

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 12n
.rt
Successful completion.
.RE

.sp
.ne 2
.mk
.na
.B non-zero
.ad
.RS 12n
.rt
An error occurred.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/sysevent/syseventd_daemon.lock
.ad
.sp .6
.RS 4n
daemon lock file
.RE

.sp
.ne 2
.mk
.na
.B /etc/sysevent/sysevent_door
.ad
.sp .6
.RS 4n
kernel to
.B syseventd
door file
.RE

.sp
.ne 2
.mk
.na
.B /usr/lib/sysevent/modules
.ad
.sp .6
.RS 4n
.B SLM
directory repository
.RE

.sp
.ne 2
.mk
.na
\fB/usr/platform/`uname
\(emi\fB`/lib/sysevent/modules\fR
.ad
.sp .6
.RS 4n
.B SLM
directory repository
.RE

.sp
.ne 2
.mk
.na
\fB/usr/platform/`uname
\(emm\fB`/lib/sysevent/modules\fR
.ad
.sp .6
.RS 4n
.B SLM
directory repository
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.sp
.LP
.BR svcs (1),
.BR svcadm (1M),
.BR syseventconfd (1M),
.BR attributes (5),
.BR smf (5)
.SH NOTES
.sp
.LP
The
.B syseventd
service is managed by the service management facility,
.BR smf (5),
under the service identifier:
.sp
.in +2
.nf
svc:/system/sysevent:default
.fi
.in -2
.sp

.sp
.LP
Administrative actions on this service, such as enabling, disabling, or
requesting restart, can be performed using
.BR svcadm (1M).
The service's
status can be queried using the
.BR svcs (1)
command.
