usr/src/man/man1m/sysidtool.1m
'\" te
.\" Copyright (C) 2003, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH sysidtool 1M "28 Nov 2006" "SunOS 5.11" "System Administration Commands"
.SH NAME
sysidtool, sysidnet, sysidns, sysidsys, sysidroot, sysidpm, sysidnfs4,
sysidkbd \- system configuration
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/sysidnet\fR
.fi

.LP
.nf
\fB/usr/sbin/sysidns\fR
.fi

.LP
.nf
\fB/usr/sbin/sysidsys\fR
.fi

.LP
.nf
\fB/usr/sbin/sysidroot\fR
.fi

.LP
.nf
\fB/usr/sbin/sysidpm\fR
.fi

.LP
.nf
\fB/usr/sbin/sysidnfs4\fR
.fi

.LP
.nf
\fB/usr/sbin/sysidkbd\fR
.fi

.SH DESCRIPTION
.sp
.LP
.B sysidtool
is a suite of programs that configure a new system, or one
that has been unconfigured with
.BR sys-unconfig (1M).
The \fBsysidtool\fR
programs run automatically at system installation, or during the first boot
after a machine has been successfully unconfigured.
.sp
.LP
These programs have no effect except at such times, and should never be run
manually.
.sp
.LP
The
.B sysidtool
programs set up the appropriate information in the
machine's configuration files, in the kernel, and on the machine's network
interface. The following list shows the available commands and the
information for which each of the commands lists.
.sp
.ne 2
.mk
.na
.BR sysidnet :
network configuration\fR
.ad
.sp .6
.RS 4n
Machine's default locale. Machine's console type. Machine's host name.
Machine's IP address.
.RE

.sp
.ne 2
.mk
.na
.BR sysidns :
name service configuration\fR
.ad
.sp .6
.RS 4n
Name service choice: NIS, NIS+,
.BR DNS ,
LDAP, or none. Machine's
.B IP
subnet mask (if no NIS/NIS+ server can automatically be located on
the machine's sub-network. Domain name for chosen name service. Hostname and
IP address of name server(s).
.B DNS
search list (\fBDNS\fR name service
only)
.RE

.sp
.ne 2
.mk
.na
.BR sysidsys :
miscellaneous system configuration\fR
.ad
.sp .6
.RS 4n
Machine's
.B IP
subnet mask (if an NIS/NIS+ server was automatically
located on the machine's sub-network). Machine's time zone. Date and time.
.RE

.sp
.ne 2
.mk
.na
.BR sysidroot :
control superuser information\fR
.ad
.sp .6
.RS 4n
Machine's root password.
.RE

.sp
.ne 2
.mk
.na
.BR sysidpm :
power management configuration\fR
.ad
.sp .6
.RS 4n
Auto-shutdown confirmation if the system is Energystar-V2 compliant, that
is, a new system model shipped after October 1, 1995.
.RE

.sp
.ne 2
.mk
.na
.BR sysidnfs4 :
NFSv4 domain configuration\fR
.ad
.sp .6
.RS 4n
Domain name to be used by NFSv4 client(s) and server(s) to transmit user
and group id's as strings of the general form
"[\fIuser\fR|\fIgroup\fR]@\fIdomain\fR".
.RE

.sp
.ne 2
.mk
.na
.BR sysidkbd :
keyboard layout configuration\fR
.ad
.sp .6
.RS 4n
The corresponding keytable is loaded into the kernel according to the
configured keyboard layout.
.RE

.sp
.ne 2
.mk
.na
.BR sysidconfig :
host- or platform-specific configuration\fR
.ad
.sp .6
.RS 4n
This command controls specification and execution of custom configuration
applications that can be specified for a particular host or a particular
platform. See
.BR sysidconfig (1M).
.RE

.sp
.LP
The
.B sysidtool
programs attempt to obtain system configuration
information from various name service databases, for example, NIS, or from
the
.BR sysidcfg (4)
file, and you are prompted to provide the information
if it cannot be found. However, you can avoid one or more of the prompts by
preconfiguring the appropriate configuration information in the name service
databases or in the
.BR sysidcfg (4)
file.
.sp
.LP
To preconfigure the information in the name service databases, you must use
the name service commands or the Solstice AdminSuite tools. See\fR for
more details about how to preconfigure the system configuration
information.
.sp
.LP
The machine's configuration information is set up in its
.B /etc
and
.B /var
files.
.sp
.LP
If a system has more than one network interface, you can use
.B sysidtool
to configure all interfaces on the system.
.sp
.LP
You cannot use the name service databases or the
.BR sysidcfg (4)
file to
suppress the Power Management configuration prompt. However, you can
suppress it by creating either the
.B /autoshutdown
or
.B /noautoshutdown
file before installation reboot. Accordingly, the
auto-shutdown feature is silently configured. The
.B /autoshutdown
or
.B /noautoshutdown
files are removed by
.B sysidpm
before it exits.
.sp
.LP
.B sysidnfs4
installs the
.B /etc/.NFS4inst_state.domain
file upon
the successful configuration of the NFSv4 domain name. If this file is
present during system reboot, the
.B sysidnfs4
program is run but no
prompts are displayed. The suppression of prompts is intended for system
upgrades, in which a system configuration typically stays unchanged. The
stability level of this interface is obsolete
.sp
.LP
.B sysidkbd
prompts for the keyboards with
.B zero-bCountryCode
and
then sets the keyboard layout string in the
.B /etc/default/kbd
file. If
the
.B sysidkbd
gets the valid keyboard layout string, the string will be
set into the entry "LAYOUT=" in the file.
.SH FILES
.br
.in +2
.B /etc/.UNCONFIGURED
.in -2
.br
.in +2
.B /etc/nodename
.in -2
.br
.in +2
.B /etc/hostname.??[0-9]
.in -2
.br
.in +2
.B /etc/default/init
.in -2
.br
.in +2
.B /etc/defaultdomain
.in -2
.sp
.ne 2
.mk
.na
.B /etc/passwd
.ad
.RS 15n
.rt
password file. See
.BR passwd (4).
.RE

.sp
.ne 2
.mk
.na
.B /etc/shadow
.ad
.RS 15n
.rt
shadow password file. See
.BR shadow (4).
.RE

.br
.in +2
.B /etc/inet/hosts
.in -2
.br
.in +2
.B /etc/inet/netmasks
.in -2
.br
.in +2
.B /var/nis/NIS_COLD_START
.in -2
.br
.in +2
.B /var/yp/aliases
.in -2
.br
.in +2
.B /var/yp/binding/*/ypservers
.in -2
.br
.in +2
.B /etc/.sysIDtool.state
.in -2
.sp
.ne 2
.mk
.na
.B /etc/power.conf
.ad
.RS 24n
.rt
Power Management configuration file. See
.BR power.conf (4).
.RE

.sp
.ne 2
.mk
.na
.B /etc/.PM_RECONFIGURE
.ad
.RS 24n
.rt
If this file is present during system reboot, the
.B sysidpm
program is
run. This file is removed by
.BR sysidpm .
.RE

.br
.in +2
.B /etc/.NFS4inst_state.domain
.in -2
.br
.in +2
.B /etc/default/kdb
.in -2
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWadmap, SUNWpmu
.TE

.SH SEE ALSO
.sp
.LP
.BR powerd (1M),
.BR sys-unconfig (1M),
.BR sysidconfig (1M),
.BR passwd (4),
.BR power.conf (4),
.B shadow
(4),
.BR sysidcfg (4),
.BR attributes (5)
.sp
.LP
\fR
.SH NOTES
.sp
.LP
NIS+ might not be supported in future releases of the Solaris Operating
system. Tools to aid the migration from NIS+ to LDAP are available in the
current Solaris release. For more information, visit
http://www.sun.com/directory/nisplus/transition.html.
