usr/src/man/man1m/syslogd.1m
'\" te
.\" Copyright (C) 2008, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH syslogd 1M "31 Oct 2008" "SunOS 5.11" "System Administration Commands"
.SH NAME
syslogd \- log system messages
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/syslogd\fR [\fB-d\fR] [\fB-f\fR \fIconfigfile\fR] [\fB-m\fR \fImarkinterval\fR]
     [\fB-p\fR \fIpath\fR] [\fB-t\fR | \fB-T\fR]
.fi

.SH DESCRIPTION
.sp
.LP
.B syslogd
reads and forwards system messages to the appropriate log
files or users, depending upon the priority of a message and the system
facility from which it originates. The configuration file
.B /etc/syslog.conf
(see
.BR syslog.conf (4))
controls where messages
are forwarded.
.B syslogd
logs a mark (timestamp) message every
.I markinterval
minutes (default
.BR 20 )
at priority
.B LOG_INFO
to
the facility whose name is given as
.B mark
in the
.B syslog.conf
file.
.sp
.LP
A system message consists of a single line of text, which may be prefixed
with a priority code number enclosed in angle-brackets
.RB ( <\|> );
priorities are defined in
.BR <sys/syslog.h> \&.
.sp
.LP
.B syslogd
reads from the
.B STREAMS
log driver,
.BR /dev/log ,
and
from any transport provider specified in
.BR /etc/netconfig ,
.BR /etc/net/transport/hosts ,
and
.BR /etc/net/transport/services .
.sp
.LP
.B syslogd
reads the configuration file when it starts up, and again
whenever it receives a
.B HUP
signal (see
.BR signal.h (3HEAD),
at which
time it also closes all files it has open, re-reads its configuration file,
and then opens only the log files that are listed in that file.
.B syslogd
exits when it receives a
.B TERM
signal.
.sp
.LP
As it starts up,
.B syslogd
creates the file
.BR /var/run/syslog.pid ,
if possible, containing its process identifier
.RB ( PID ).
.sp
.LP
If message
.B ID
generation is enabled (see
.BR log (7D)),
each message
will be preceded by an identifier in the following format:
.B [ID
\fImsgid facility\fB\&.\fIpriority\fB]\fR.
.I msgid
is the
message's numeric identifier described in
.BR msgid (1M).
.I facility
and
.I
priority
are described in
.BR syslog.conf (4).
.B
[ID 123456 kern.notice] \c 
is an example of an identifier when message \fBID\fR
generation is enabled.
.sp
.LP
If the message originated in a loadable kernel module or driver, the kernel
module's name (for example,
.BR ufs )
will be displayed instead of
.BR unix .
See
.B EXAMPLES
for sample output from
.B syslogd
with and
without message
.B ID
generation enabled.
.sp
.LP
In an effort to reduce visual clutter, message
.BR ID s
are not displayed
when writing to the console; message
.BR ID s
are only written to the log
file. See .
.sp
.LP
The
.B /etc/default/syslogd
file contains the following default
parameter settings, which are in effect if neither the
.B -t
nor
.BR -T
option is selected. See
.BR FILES .
.sp
.LP
The recommended way to allow or disallow message logging is through the use
of the service management facility
.RB ( smf (5))
property:
.sp
.in +2
.nf
svc:/system/system-log/config/log_from_remote
.fi
.in -2

.sp
.LP
This property specifies whether remote messages are logged.
.B log_from_remote=true
is equivalent to the
.B -t
command-line option
and
.B false
is equivalent to the
.B -T
command-line option. The
default value for
.B -log_from_remote
is
.BR false .
See NOTES, below.
.sp
.ne 2
.mk
.na
.B LOG_FROM_REMOTE
.ad
.sp .6
.RS 4n
Specifies whether remote messages are logged.
.B LOG_FROM_REMOTE=NO
is
equivalent to the
.B -t
command-line option. The default value for
.B LOG_FROM_REMOTE
is
.BR YES .
.RE

.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -d
.ad
.sp .6
.RS 4n
Turn on debugging. This option should only be used interactively in a root
shell once the system is in multi-user mode. It should
.B not
be used in
the system start-up scripts, as this will cause the system to hang at the
point where
.B syslogd
is started.
.RE

.sp
.ne 2
.mk
.na
.B -f
.I configfile
.ad
.sp .6
.RS 4n
Specify an alternate configuration file.
.RE

.sp
.ne 2
.mk
.na
.B -m
.I markinterval
.ad
.sp .6
.RS 4n
Specify an interval, in minutes, between mark messages.
.RE

.sp
.ne 2
.mk
.na
.B -p
.I path
.ad
.sp .6
.RS 4n
Specify an alternative log device name. The default is
.BR /dev/log .
.RE

.sp
.ne 2
.mk
.na
.B -T
.ad
.sp .6
.RS 4n
Enable the
.B "syslogd UDP"
port to turn on logging of remote
messages. This is the default behavior. See .
.RE

.sp
.ne 2
.mk
.na
.B -t
.ad
.sp .6
.RS 4n
Disable the
.B "syslogd UDP"
port to turn off logging of remote
messages. See .
.RE

.SH EXAMPLES
.LP
.B Example 1 syslogd
Output Without Message ID Generation
Enabled
.sp
.LP
The following example shows the output from
.B syslogd
when message
.B ID
generation
.B "is not"
enabled:

.sp
.in +2
.nf
Sep 29 21:41:18 cathy unix: alloc /: file system full
.fi
.in -2
.sp

.LP
.B Example 2 syslogd
Output with ID generation Enabled
.sp
.LP
The following example shows the output from
.B syslogd
when message
.B ID
generation
.B is
enabled. The message
.B ID
is displayed when
writing to log file\fB/var/adm/messages\fR.

.sp
.in +2
.nf
Sep 29 21:41:18 cathy ufs: [ID 845546 kern.notice]
                                    alloc /: file system full
.fi
.in -2
.sp

.LP
.B Example 3 syslogd
Output with ID Generation Enabled
.sp
.LP
The following example shows the output from
.B syslogd
when message
.B ID
generation
.B is
enabled when writing to the console. Even
though message ID is enabled, the message
.B ID
is not displayed at the
console.

.sp
.in +2
.nf
Sep 29 21:41:18 cathy ufs: alloc /: file system full
.fi
.in -2
.sp

.LP
.B Example 4
Enabling Acceptance of UDP Messages from Remote Systems
.sp
.LP
The following commands enable
.B syslogd
to accept entries from remote
systems.

.sp
.in +2
.nf
# \fBsvccfg -s svc:/system/system-log setprop config/log_from_remote = true\fR
# \fBsvcadm restart svc:/system/system-log\fR
.fi
.in -2
.sp

.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/syslog.conf
.ad
.sp .6
.RS 4n
Configuration file
.RE

.sp
.ne 2
.mk
.na
.B /var/run/syslog.pid
.ad
.sp .6
.RS 4n
Process
.BR ID
.RE

.sp
.ne 2
.mk
.na
.B /etc/default/syslogd
.ad
.sp .6
.RS 4n
Contains default settings. You can override some of the settings by
command-line options.
.RE

.sp
.ne 2
.mk
.na
.B /dev/log
.ad
.sp .6
.RS 4n
.B STREAMS
log driver
.RE

.sp
.ne 2
.mk
.na
.B /etc/netconfig
.ad
.sp .6
.RS 4n
Transport providers available on the system
.RE

.sp
.ne 2
.mk
.na
.B /etc/net/transport/hosts
.ad
.sp .6
.RS 4n
Network hosts for each transport
.RE

.sp
.ne 2
.mk
.na
.B /etc/net/transport/services
.ad
.sp .6
.RS 4n
Network services for each transport
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.sp
.LP
.BR logger (1),
.BR svcs (1),
.BR msgid (1M),
.BR svcadm (1M),
.BR svccfg (1M),
.BR syslog (3C),
.BR syslog.conf (4),
.BR attributes (5),
.BR signal.h (3HEAD),
.BR smf (5),
.BR log (7D)
.SH NOTES
.sp
.LP
The
.B mark
message is a system time stamp, and so it is only defined
for the system on which
.B syslogd
is running. It can not be forwarded to
other systems.
.sp
.LP
When
.B syslogd
receives a
.B HUP
signal, it attempts to complete
outputting pending messages, and close all log files to which it is
currently logging messages. If, for some reason, one (or more) of these
files does not close within a generous grace period,
.B syslogd
discards
the pending messages, forcibly closes these files, and starts
reconfiguration. If this shutdown procedure is disturbed by an unexpected
error and
.B syslogd
cannot complete reconfiguration,
.B syslogd
sends
a mail message to the superuser on the current system stating that it has
shut down, and exits.
.sp
.LP
Care should be taken to ensure that each window displaying messages
forwarded by
.B syslogd
(especially console windows) is run in the system
default locale (which is
.BR syslogd 's
locale). If this advice is not
followed, it is possible for a
.B syslog
message to alter the terminal
settings for that window, possibly even allowing remote execution of
arbitrary commands from that window.
.sp
.LP
The
.B syslogd
service is managed by the service management facility,
.BR smf (5),
under the service identifier:
.sp
.in +2
.nf
 svc:/system/system-log:default
.fi
.in -2
.sp

.sp
.LP
Administrative actions on this service, such as enabling, disabling, or
requesting restart, can be performed using
.BR svcadm (1M).
The service's
status can be queried using the
.BR svcs (1)
command.
.sp
.LP
When
.B syslogd
is started by means of
.BR svcadm (1M),
if a value is
specified for
.B LOG_FROM_REMOTE
in the
.B /etc/defaults/syslogd
file,
the SMF property
.B svc:/system/system-log/config/log_from_remote
is set
to correspond to the
.B LOG_FROM_REMOTE
value and the
.B /etc/default/syslogd
file is modified to replace the
.B LOG_FROM_REMOTE
specification with the following comment:
.sp
.in +2
.nf
# LOG_FROM_REMOTE is now set using svccfg(1m), see syslogd(1m).
.fi
.in -2

.sp
.LP
If neither
.B LOG_FROM_REMOTE
nor
.B svc:/system/system-log/config/log_from_remote
are defined, the default
is to log remote messages.
.sp
.LP
On installation, the initial value of
.B svc:/system/system-log/config/log_from_remote
is
.BR false .
