usr/src/man/man1m/th_manage.1m
'\" te
.\" Copyright (c) 2001 Sun Microsystems, Inc. All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH th_manage 1M "4 Jan 2001" "SunOS 5.11" "System Administration Commands"
.SH NAME
th_manage \- manage the fault injection test harness
.SH SYNOPSIS
.LP
.nf
\fBth_manage\fR \fIname\fR \fIinstance\fR \fIcommand\fR
.fi

.LP
.nf
\fBth_manage\fR \fIpath\fR \fIcommand\fR
.fi

.SH DESCRIPTION
.sp
.LP
.B th_manage
applies the action specified by
.I command
to the
instance specified by
.I instance
of the driver specified by
.IR name
(or the driver instance specified by
.IR path ).
The driver instance must
be running fault injection specifications (errdefs) defined by
.BR th_define (1M).
.sp
.LP
.B th_manage
supports several commands that operate on the driver
instance specified by
.I name
and
.I instance
(or
.IR path ).
The
commands are:
.sp
.ne 2
.mk
.na
.B broadcast
.ad
.RS 18n
.rt
Awaken all
.B th_define
processes, causing them to display their current
status and exit if the errdef is now defunct (that is, if
.IR count ,
.I failcount
, and
.I acc_chk
are all zero).
.RE

.sp
.ne 2
.mk
.na
.B clear_acc_chk
.ad
.RS 18n
.rt
Awaken all \fBth_define\fR processes. If \fIcount\fR and \fIfailcount\fR
are already zero, then set
.I acc_chk
to zero, so that \fBth_define\fR
exits once it has displayed its status.
.RE

.sp
.ne 2
.mk
.na
.B clear_errdefs
.ad
.RS 18n
.rt
Awaken all
.BR "th_define processes" .
.IR count ,
.I failcount
and
.I acc_chk
are all set to zero so that all
.B th_define
commands
exit once they have displayed their status.
.RE

.sp
.ne 2
.mk
.na
.B clear_errors
.ad
.RS 18n
.rt
Awaken all
.B th_define
processes. If
.I count
is already zero, set
.I failcount
and
.I acc_chk
to zero, so that
.B th_define
exits
once it has displayed its status.
.RE

.sp
.ne 2
.mk
.na
.B get_handles
.ad
.RS 18n
.rt
List all the access handles.
.RE

.sp
.ne 2
.mk
.na
.B start
.ad
.RS 18n
.rt
Begin or resume execution of all errdefs.
.RE

.sp
.ne 2
.mk
.na
.B stop
.ad
.RS 18n
.rt
Suspend all errdefs for this
.I name
and
.I instance
.RI (or " path)."

.RE

.SH EXAMPLES
.LP
.B Example 1
Useful Commands
.sp
.LP
To begin the tests, enter:

.sp
.LP
.B # th_manage
.B foo 0
.B start

.sp
.LP
To check the status of the errdefs, enter:

.sp
.LP
.B # th_manage
.B foo 0
.B broadcast

.sp
.LP
This causes each
.B th_define
process to print out its current status.

.sp
.LP
If the driver has reported a fatal error, you can take the driver offline
using
.BR libdevice ,
clear the error condition by entering:

.sp
.LP
.B # th_manage
.B foo 0
.B clear_acc_chk

.sp
.LP
or

.sp
.LP
.B # th_manage
.B foo 0
.B clear_errors

.sp
.LP
and bring the driver online again using
.BR libdevice .

.sp
.LP
To terminate testing, enter:

.sp
.LP
.B # th_manage
.B foo 0
.B clear_errdefs

.SH SEE ALSO
.sp
.LP
.BR th_define (1M)
