usr/src/man/man1m/tic.1m
'\" te
.\" Copyright (c) 1996, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright 1989 AT&T
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH tic 1M "5 Jul 1990" "SunOS 5.11" "System Administration Commands"
.SH NAME
tic \- terminfo compiler
.SH SYNOPSIS
.LP
.nf
\fBtic\fR [\fB-v\fR [\fIn\fR]] [\fB-c\fR] \fIfile\fR
.fi

.SH DESCRIPTION
.sp
.LP
The command
.B tic
translates a
.B terminfo
file from the source
format into the compiled format. The results are placed in the directory
.BR /usr/share/lib/terminfo .
The compiled format is necessary for use with
the library routines in
.BR curses (3CURSES).
.sp
.LP
If the environment variable
.B TERMINFO
is set, the compiled results are
placed there instead of
.BR /usr/share/lib/terminfo .
.sp
.LP
Total compiled entries cannot exceed 4096 bytes. The name field cannot
exceed 128 bytes. Terminal names exceeding 14 characters will be truncated
to 14 characters and a warning message will be printed.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -c
.ad
.RS 9n
.rt
Specifies to check only
.B file
for errors. Errors in
.B use=
links
are not detected.
.RE

.sp
.ne 2
.mk
.na
\fB-v\fR[\fIn\fR]\fR
.ad
.RS 9n
.rt
Specify that (verbose) output be written to standard error trace
information showing
.BR tic "'s progress. The optional integer"
.I n
is a
number from 1 to 10, indicating the desired level of detail of information.
If
.I n
is omitted, the default level is 1. If
.I n
is specified and
greater than 1, the level of detail is increased.
.RE

.SH OPERANDS
.sp
.ne 2
.mk
.na
.B file
.ad
.RS 8n
.rt
Contains one or more
.B terminfo
terminal descriptions in source format
[see \fBterminfo\fR(4)]. Each description in the file describes the
capabilities of a particular terminal. When a \fBuse\fI=entry-name\fR
field is discovered in a terminal entry currently being compiled, \fBtic\fR
reads in the binary from
.B /usr/share/lib/terminfo
to complete the
entry. (Entries created from
.B file
will be used first. If the
environment variable
.B TERMINFO
is set, that directory is
searched instead of
.BR /usr/share/lib/terminfo .)
.B tic
duplicates the
capabilities in
.I entry-name
for the current entry, with the exception
of those capabilities that are explicitly defined in the current entry.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B /usr/share/lib/terminfo/?/*
.ad
.sp .6
.RS 4n
Compiled terminal description database
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.sp
.LP
.BR captoinfo (1M),
.BR infocmp (1M),
.BR curses (3CURSES),
.BR terminfo (4),
.BR attributes (5)
.SH NOTES
.sp
.LP
When an entry, for example,
.BR entry_name_1 ,
contains a
\fBuse=\fIentry_name_2\fR field, any canceled capabilities in
.I entry_name_2
must also appear in
.B entry_name_1
before
.BR use=
for these capabilities to be canceled in
.BR entry_name_1 .
