usr/src/man/man1m/tnchkdb.1m
'\" te
.\" Copyright (c) 2006, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH tnchkdb 1M "20 Jul 2007" "SunOS 5.11" "System Administration Commands"
.SH NAME
tnchkdb \- check file syntax of trusted network databases
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/tnchkdb\fR  [\fB-h\fR \fIpath\fR] [\fB-t\fR \fIpath\fR] [\fB-z\fR \fIpath\fR]
.fi

.SH DESCRIPTION
.sp
.LP
.B tnchkdb
checks the syntax of the
.BR tnrhtp ,
.BR tnrhdb ,
and
.B tnzonecfg
databases. By default, the
.I path
for each file is:
.RS +4
.TP
.ie t \(bu
.el o
.B /etc/security/tsol/tnrhtp
.RE
.RS +4
.TP
.ie t \(bu
.el o
.B /etc/security/tsol/tnrhdb
.RE
.RS +4
.TP
.ie t \(bu
.el o
.B /etc/security/tsol/tnzonecfg
.RE
.sp
.LP
You can specify an alternate path for any or all of the files by specifying
that path on the command line by using the
.BR -h
.RB ( tnrhdb ),
.B -t
.RB ( tnrhtp )
and
.B -z
.RB ( tnzonecfg )
options. The options are useful
when testing a set of modified files before installing the files as new
system databases.
.sp
.LP
All three database files are checked for integrity.
.B tnchkdb
returns an
exit status of
.B 0
if all of the files are syntactically and, to the
extent possible, semantically correct. If one or more files have errors, then
an exit status of
.B 1
is returned. If there are command line problems,
such as an unreadable file, an exit status of
.B 2
is returned. Errors are
written to standard error.
.sp
.LP
To avoid cascading errors, when there are errors in
.BR tnrhtp ,
the
template names in
.B tnrhdb
are not validated.
.sp
.LP
.B tnchkdb
can be run at any label, but the standard
.B /etc/security/tsol
files are visible only in the global zone.
.SH OPTIONS
.sp
.ne 2
.mk
.na
.B -h
[
.IR path " ]"
.ad
.RS 15n
.rt
Check
.I path
for proper
.B tnrhdb
syntax. If
.I path
is not
specified, then check
.BR /etc/security/tsol/tnrhdb .
.RE

.sp
.ne 2
.mk
.na
.B -t
[
.IR path " ]"
.ad
.RS 15n
.rt
Check
.I path
for proper
.B tnrhtp
syntax. If
.I path
is not
specified, then check
.BR /etc/security/tsol/tnrhtp .
.RE

.sp
.ne 2
.mk
.na
.B -z
[
.IR path " ]"
.ad
.RS 15n
.rt
Check
.I path
for proper
.B tnzonecfg
syntax. If
.I path
is not
specified, then check
.BR /etc/security/tsol/tnzonecfg .
.RE

.SH EXAMPLES
.LP
.B Example 1
Sample Error Message
.sp
.LP
The
.B tnchkdb
command checks for CIPSO errors. In this example, the
.B admin_low
template has an incorrect value of
.B ADMIN_HIGH
for its
default label.

.sp
.in +2
.nf
# \fBtnchkdb\fR
checking /etc/security/tsol/tnrhtp ...
tnchkdb: def_label classification 7fff is invalid for cipso labels:
line 14 entry admin_low
tnchkdb: def_label compartments 241-256 must be zero for cipso labels:
line 14 entry admin_low
checking /etc/security/tsol/tnrhdb ...
checking /etc/security/tsol/tnzonecfg ...
.fi
.in -2
.sp

.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/security/tsol/tnrhdb
.ad
.sp .6
.RS 4n
Trusted network remote-host database
.RE

.sp
.ne 2
.mk
.na
.B /etc/security/tsol/tnrhtp
.ad
.sp .6
.RS 4n
Trusted network remote-host templates
.RE

.sp
.ne 2
.mk
.na
.B /etc/security/tsol/tnzonecfg
.ad
.sp .6
.RS 4n
Trusted zone configuration database
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWtsu
_
Interface StabilitySee below.
.TE

.sp
.LP
The command line is Committed. The output is Uncommitted.
.SH SEE ALSO
.sp
.LP
.BR tnd (1M),
.BR tnctl (1M),
.BR attributes (5)
.sp
.LP
.I "How to Check the Syntax of Trusted Network Databases
in \fISolaris Trusted Extensions Administrator\&'s Procedures\fR
.SH NOTES
.sp
.LP
The functionality described on this manual page is available only if the
system is configured with Trusted Extensions.
.sp
.LP
It is possible to have inconsistent but valid configurations of
.BR tnrhtp
and
.B tnrhdb
when
.B LDAP
is used to supply missing templates.
