usr/src/man/man1m/tnctl.1m
'\" te
.\" Copyright (c) 2008, Sun Microsystems, Inc. All Rights Reserved.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH tnctl 1M "6 Mar 2008" "SunOS 5.11" "System Administration Commands"
.SH NAME
tnctl \- configure Trusted Extensions network parameters
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/tnctl\fR [\fB-dfv\fR] [\fB-h\fR \fIhost\fR [/\fIprefix\fR] [:\fItemplate\fR]]
     [\fB-m\fR \fIzone\fR:\fImlp\fR:\fIshared-mlp\fR][\fB-t\fR \fItemplate\fR [:\fIkey=val\fR [;\fIkey=val\fR]]]
     [\fB-HTz\fR] \fIfile\fR]
.fi

.SH DESCRIPTION
.sp
.LP
\fBtnctl\fR provides an interface to manipulate trusted network parameters
in the Solaris kernel.
.sp
.LP
As part of Solaris Trusted Extensions initialization,
.B tnctl
is run in
the global zone by an
.BR smf (5)
script during system boot. The
\fBtnctl\fR command is not intended to be used during normal system
administration. Instead, if a local trusted networking database file is
modified without using the Solaris Management Console, the administrator
first issues \fBtnchkdb\fR(1M) to check the syntax, and then refreshes the
kernel copy with this command:
.sp
.in +2
.nf
# \fBsvcadm restart svc:/network/tnctl\fR
.fi
.in -2
.sp

.sp
.LP
See
.B WARNINGS
about the risks of changing remote host and template
information on a running system.
.SH OPTIONS
.sp
.ne 2
.mk
.na
.B -d
.ad
.sp .6
.RS 4n
Delete matching entries from the kernel. The default is to add new
entries.
.sp
When deleting MLPs, the MLP range must match exactly. MLPs are specified in
the form:
.sp
.in +2
.nf
\fIport\fR[-\fIport\fR]/\fIprotocol\fR
.fi
.in -2
.sp

Where
.I port
can be a number in the range 1 to 65535. or any known
service (see
.BR services (4)),
and protocol can be a number in the range 1
to 255, or any known protocol (see
.BR protocols (4)).
.RE

.sp
.ne 2
.mk
.na
\fB-f\fR
.ad
.sp .6
.RS 4n
Flush all kernel entries before loading the entries that are specified on
the command line. The flush does not take place unless at least one entry
parsed successfully.
.RE

.sp
.ne 2
.mk
.na
.B -v
.ad
.sp .6
.RS 4n
Turn on verbose mode.
.RE

.sp
.ne 2
.mk
.na
\fB-h\fR \fIhost\fR[/\fIprefix\fR][:\fItemplate\fR]\fR
.ad
.sp .6
.RS 4n
Update the kernel remote-host cache on the local host for  the specified
\fIhost\fR or, if a template name is given, change the kernel's cache to use
the specified
.IR template .
If \fIprefix\fR is not specified, then an
implied prefix length is determined according to the rules used for
interpreting the
.BR tnrhdb .
If
.B -d
is specified, then a template
name cannot be specified.
.RE

.sp
.ne 2
.mk
.na
\fB-m\fR \fIzone\fR:\fImlp\fR:\fIshared-mlp\fR
.ad
.sp .6
.RS 4n
Modify the kernel's multilevel port (MLP) configuration cache for the
specified
.IR zone .
\fIzone\fR specifies the zone to be updated. \fImlp\fR
and
.I shared-mlp
specify the MLPs for the zone-specific and shared IP
addresses. The
.I shared-mlp
field is effective in the global zone
only.
.RE

.sp
.ne 2
.mk
.na
\fB-t\fR \fItemplate\fR[\fIkey=val\fR[;\fIkey=val\fR]]\fR
.ad
.sp .6
.RS 4n
Update the kernel template cache for
.I template
or, if a list of
\fIkey=val\fR pairs is given, change the kernel's cache to use the specified
entry. If
.B -d
is specified, then
.I key=val
pairs cannot be
specified.
.RE

.sp
.ne 2
.mk
.na
\fB-T\fR \fIfile\fR
.ad
.sp .6
.RS 4n
Load all template entries in \fIfile\fR into the kernel cache.
.RE

.sp
.ne 2
.mk
.na
\fB-H\fR \fIfile\fR
.ad
.sp .6
.RS 4n
Load all remote host entries in \fIfile\fR into the kernel cache.
.RE

.sp
.ne 2
.mk
.na
\fB-z\fR \fIfile\fR
.ad
.sp .6
.RS 4n
Load just the global zone's MLPs from \fIfile\fR into the kernel cache. To
reload MLPs for a non-global zone, reboot the zone:
.sp
.in +2
.nf
# \fBzoneadm -z\fR \fInon-global zone\fR \fBreboot\fR
.fi
.in -2
.sp

.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWtsu
_
Interface StabilityUncommitted
.TE

.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/security/tsol/tnrhdb
.ad
.sp .6
.RS 4n
Trusted network remote-host database
.RE

.sp
.ne 2
.mk
.na
.B /etc/security/tsol/tnrhtp
.ad
.sp .6
.RS 4n
Trusted network remote-host templates
.RE

.sp
.ne 2
.mk
.na
\fB/etc/security/tsol/tnzonecfg\fR
.ad
.sp .6
.RS 4n
Trusted zone configuration database
.RE

.sp
.ne 2
.mk
.na
\fB/etc/nsswitch.conf\fR
.ad
.sp .6
.RS 4n
Configuration file for the name service switch
.RE

.SH SEE ALSO
.sp
.LP
.BR svcs (1),
.BR svcadm (1M),
.BR tninfo (1M),
.BR tnd (1M),
.BR tnchkdb (1M),
.BR zoneadm (1M),
.BR nsswitch.conf (4),
.BR protocols (4),
.BR services (4),
.BR attributes (5),
.BR smf (5)
.sp
.LP
\fIHow to Synchronize Kernel Cache With Network Databases\fR in \fISolaris
Trusted Extensions Administrator\&'s Procedures\fR
.SH WARNINGS
.sp
.LP
Changing a template while the network is up can change the security view of
an undetermined number of hosts.
.SH NOTES
.sp
.LP
The functionality described on this manual page is available only if the
system is configured with Trusted Extensions.
.sp
.LP
The
.B tnctl
service is managed by the service management facility,
\fBsmf\fR(5), under the service identifier:
.sp
.in +2
.nf
svc:/network/tnctl
.fi
.in -2
.sp

.sp
.LP
The service's status can be queried by using
.BR svcs (1).
Administrative
actions on this service, such as refreshing the kernel cache, can be
performed using
.BR svcadm "(1M), as in:"
.sp
.in +2
.nf
svcadm restart svc:/network/tnctl
.fi
.in -2
.sp

