usr/src/man/man1m/tnd.1m
'\" te
.\" Copyright (c) 2008, Sun Microsystems, Inc. All Rights Reserved.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH tnd 1M "15 May 2008" "SunOS 5.11" "System Administration Commands"
.SH NAME
tnd \- trusted network daemon
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/tnd\fR  [\fB-p\fR \fIpoll-interval\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The
.B tnd
(trusted network daemon) initializes the kernel with trusted
network databases and also reloads the databases on demand from an LDAP
server and local files.
.B tnd
follows the order specified in the
nsswitch.conf file when loading configuration databases.
.B tnd
is
started at the beginning of the boot process.
.sp
.LP
\fBtnd\fR loads two databases into the kernel: the remote host database,
\fBtnrhdb\fR and the remote-host template database,
.BR tnrhtp .
These
databases and their effect on the trusted network are described in their
respective man pages. When the associated
.B LDAP
database or local
databases are changed,
.B tnd
also updates the local kernel cache at the
predetermined interval.
.sp
.LP
If a local trusted networking database file is modified, the administrator
should run
.BR tnchkdb "(1M) to check the syntax, and should also run"
\fBsvcadm refresh svc:/network/tnd\fR to initiate an immediate database scan
by
.BR tnd .
.sp
.LP
\fBtnd\fR is intended to be started from an
.BR smf (5)
script and to run
in the global zone. The following signals cause specific \fBsvcadm\fR
actions:
.sp
.ne 2
.mk
.na
.B SIGHUP
.ad
.RS 11n
.rt
Causes \fBsvcadm refresh svc:/network/tnd\fR to be run.
.sp
Initiates a rescan of the local and LDAP
.B tnrhdb
and
.BR tnrhtp
databases.
.B tnd
updates the kernel database with any changes found.
.RE

.sp
.ne 2
.mk
.na
.B SIGTERM
.ad
.RS 11n
.rt
Causes
.B "svcadm disable svc:/network/tnd"
to be run.
.sp
Terminates the
.B tnd
daemon. No changes are made to the kernel
database.
.RE

.sp
.LP
Running
.B tnd
in debug mode is determined by the value of the following
service management facility (SMF) property:
.sp
.in +2
.nf
tnd/debug_level = 0
.fi
.in -2

.sp
.LP
A value of
.BR 0 ,
as above, prevents debug information from being
collected;
.B 1
turns on debugging. The default value is
.BR 0 .
Debug
output is sent to the
.B /var/tsol/tndlog
log file.
.SH OPTIONS
.sp
.ne 2
.mk
.na
\fB-p\fR \fIpoll-interval\fR
.ad
.RS 20n
.rt
Set poll interval to
.I poll-interval
seconds. The default
\fIpoll-interval\fR is 1800 seconds (30 minutes).
.RE

.SH EXAMPLES
.LP
\fBExample 1\fR Changing the Poll Interval
.sp
.LP
The following command changes the polling interval to one hour, and puts
this interval in the SMF repository. At the next boot, the
.B tnd
poll
interval will be one hour.

.sp
.in +2
.nf
# \fBsvccfg -s network/tnd setprop tnd/poll_interval=3600\fR
.fi
.in -2
.sp

.sp
.LP
The following command changes the polling interval, but does not update the
repository. At the next boot, the
.B tnd
poll interval remains the
default, 30 minutes.

.sp
.in +2
.nf
# tnd -p 3600
.fi
.in -2
.sp

.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/security/tsol/tnrhdb
.ad
.sp .6
.RS 4n
Trusted network remote-host database
.RE

.sp
.ne 2
.mk
.na
.B /etc/security/tsol/tnrhtp
.ad
.sp .6
.RS 4n
Trusted network remote-host templates
.RE

.sp
.ne 2
.mk
.na
\fB/etc/security/tsol/tnzonecfg\fR
.ad
.sp .6
.RS 4n
Trusted zone configuration database
.RE

.sp
.ne 2
.mk
.na
\fB/etc/nsswitch.conf\fR
.ad
.sp .6
.RS 4n
Configuration file for the name service switch
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWtsu
_
Interface StabilitySee below.
.TE

.sp
.LP
The command invocation is Committed. The service is Private.
.SH SEE ALSO
.sp
.LP
.BR svcs (1),
.BR svcadm (1M),
\fBtninfo\fR(1M), \fBtnctl\fR(1M),
.BR tnchkdb (1M),
\fBnsswitch.conf\fR(4), \fBattributes\fR(5),
.BR smf (5)
.sp
.LP
\fIHow to Synchronize Kernel Cache With Network Databases\fR in \fISolaris
Trusted Extensions Administrator\&'s Procedures\fR
.SH NOTES
.sp
.LP
The functionality described on this manual page is available only if the
system is configured with Trusted Extensions.
.sp
.LP
The
.B tnd
service is managed by the service  management facility,
\fBsmf\fR(5), under the service identifier:
.sp
.in +2
.nf
svc:/network/tnd
.fi
.in -2
.sp

.sp
.LP
The  service's status can be queried by using
.BR svcs (1).
Administrative
actions on this service,  such as requests to restart the daemon, can be
performed using
.BR svcadm "(1M), as in:"
.sp
.in +2
.nf
svcadm restart svc:/network/tnd
.fi
.in -2
.sp

