usr/src/man/man1m/tninfo.1m
'\" te
.\" Copyright (c) 2007, Sun Microsystems, Inc. All Rights Reserved.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH tninfo 1M "20 Jul 2007" "SunOS 5.11" "System Administration Commands"
.SH NAME
tninfo \- print kernel-level network information and statistics
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/tninfo\fR [\fB-h\fR \fIhostname\fR] [\fB-m\fR \fIzone-name\fR] [\fB-t\fR \fItemplate\fR]
.fi

.SH DESCRIPTION
.sp
.LP
\fBtninfo\fR provides an interface to retrieve and display kernel-level
network information and statistics.
.SH OPTIONS
.sp
.ne 2
.mk
.na
\fB-h\fR \fIhostname\fR
.ad
.RS 16n
.rt
Display the security structure for the specified host in the remote-host
cache. The output should reflect what is specified in the \fBtnrhdb\fR
database.
.RE

.sp
.ne 2
.mk
.na
\fB-m\fR \fIzone-name\fR
.ad
.RS 16n
.rt
Display the MLP configuration associated with the specified zone. The
output should reflect what is specified in the \fBtnzonecfg\fR database.
.RE

.sp
.ne 2
.mk
.na
\fB-t\fR \fItemplate\fR
.ad
.RS 16n
.rt
Display the structure associated with the specified
.IR template .
The
output should reflect what is specified in the
.B tnrhtp
database.
.RE

.SH EXAMPLES
.LP
\fBExample 1\fR Displaying Remote Host Structures Cached in the Kernel
.sp
.LP
This example shows the remote host structures cached in the kernel. The
output reflects the definition in the
.B tnrhdb
database.

.sp
.in +2
.nf
# \fBtninfo -h machine1\fR
   IP address= 192.168.8.61
   Template = cipso
.fi
.in -2
.sp

.LP
\fBExample 2\fR Displaying Multilevel Ports for the Global Zone
.sp
.LP
This example shows the kernel-cached MLPs for the global zone. The output
reflects the definition in the \fBtnzonecfg\fR database, plus any
dynamically allocated MLPs.
.B private
indicates zone-specific MLPs.

.sp
.in +2
.nf
# \fBtninfo -m global\fR
private:23/tcp;111/tcp;111/udp;515/tcp;2049/tcp;6000-6003/tcp;
        32812/tcp;36698/ip;38634/tcp;64365/ip
shared: 6000-6003/tcp
.fi
.in -2
.sp

.LP
\fBExample 3\fR Displaying the \fBcipso\fR Template Definition
.sp
.LP
This example shows the kernel-cached
.B cipso
template definition. The
output reflects the definition in the
.B tnrhtp
database.

.sp
.in +2
.nf
# \fBtninfo -t cipso\fR
=====================================
   Remote Host Template Table Entries:
   __________________________
   template: cipso
   host_type: CIPSO
   doi: 1
   min_sl: ADMIN_LOW
   hex: ADMIN_LOW
   max_sl: ADMIN_HIGH
   hex: ADMIN_HIGH
.fi
.in -2
.sp

.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/security/tsol/tnrhdb
.ad
.sp .6
.RS 4n
Trusted network remote-host database
.RE

.sp
.ne 2
.mk
.na
.B /etc/security/tsol/tnrhtp
.ad
.sp .6
.RS 4n
Trusted network remote-host templates
.RE

.sp
.ne 2
.mk
.na
\fB/etc/security/tsol/tnzonecfg\fR
.ad
.sp .6
.RS 4n
Trusted zone configuration database
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWtsu
_
Interface StabilitySee below.
.TE

.sp
.LP
The command line is Committed. The output is Uncommitted.
.SH SEE ALSO
.sp
.LP
.BR tnd (1M),
.BR tnctl (1M),
.BR attributes (5)
.sp
.LP
\fIHow to Synchronize Kernel Cache With Network Databases\fR in \fISolaris
Trusted Extensions Administrator\&'s Procedures\fR
.SH NOTES
.sp
.LP
The functionality described on this manual page is available only if the
system is configured with Trusted Extensions.
