usr/src/man/man1m/traceroute.1m
'\" te
.\" Copyright (C) 2003, Sun Microsystems, Inc. All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH traceroute 1M "18 Sep 2008" "SunOS 5.11" "System Administration Commands"
.SH NAME
traceroute \- print the route packets take to network host
.SH SYNOPSIS
.LP
.nf
\fBtraceroute\fR [\fB-adFIlnSvx\fR] [\fB-A\fR \fIaddr_family\fR] [\fB-c\fR \fItraffic_class\fR]
     [\fB-f\fR \fIfirst_hop\fR] [\fB-g\fR \fIgateway\fR [\fB-g\fR \fIgateway\fR.\|.\|.] | \fB-r\fR]
     [\fB-i\fR \fIiface\fR] [\fB-L\fR \fIflow_label\fR] [\fB-m\fR \fImax_hop\fR]
     [\fB-P\fR \fIpause_sec\fR] [\fB-p\fR \fIport\fR] [\fB-Q\fR \fImax_timeout\fR]
     [\fB-q\fR \fInqueries\fR] [\fB-s\fR \fIsrc_addr\fR] [\fB-t\fR \fItos\fR] [\fB-w\fR \fIwait_time\fR] host
     [\fIpacketlen\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The Internet is a large and complex aggregation of network hardware,
connected by gateways. Tracking the route a packet follows can be difficult.
The utility
.B traceroute
traces the route that an
.B IP
packet
follows to another internet host.
.sp
.LP
The
.B traceroute
utility utilizes the both the IPv4 and IPv6 protocols.
Use the
.B -A
option to override the default behavior. \fBtraceroute\fR
uses the IPv4 protocol
.I ttl
(time to live) field or the IPv6 field
.IR "hop limit" .
It attempts to elicit an
.B ICMP
or
.BR ICMP6
.B TIME_EXCEEDED
response from each
.I gateway
along the path, and a
\fBPORT_UNREACHABLE\fR(or \fBECHO_REPLY\fR if \fB-I\fR is used) response
from the destination host. It starts by sending probes with a
.I ttl
or
.I hop limit
of
.B 1
and increases by
.B 1
until it either gets to
the host, or it hits the maximum
.IR max_hop .
The default maximum
.I max_hop
is 30 hops, but this can be set by the
.B -m
option.
.sp
.LP
Three probes are sent at each
.I ttl
(\fIhop limit\fR) setting, and a
line is printed showing the
.IR ttl
.RI ( "hop limit" ),
the hostname and
the address of the gateway, and the
.I rtt
(round trip time) of each
probe. The number of probes may be specifically set using the \fB-q\fR
option. If the probe answers come from different gateways, the hostname and
the address of each responding system will be printed. If there is no
response within a 5 second timeout interval, an asterisk (\fB*\fR) is
displayed for that probe. The
.B -w
option may be used to set the timeout
interval. Other possible annotations that may appear after the time are:
.sp
.ne 2
.mk
.na
.B !
.ad
.sp .6
.RS 4n
the
.I ttl
(\fIhop limit\fR) value in the received packet is \fB<=
1\fR\&.
.RE

.sp
.ne 2
.mk
.na
.B !H
.ad
.sp .6
.RS 4n
host unreachable.
.RE

.sp
.ne 2
.mk
.na
.B !X
.ad
.sp .6
.RS 4n
communication administratively prohibited.
.RE

.sp
.ne 2
.mk
.na
.B <!N>
.ad
.sp .6
.RS 4n
.B ICMP
(\fBICMP6\fR) unreachable code N.
.RE

.sp
.LP
The following annotations appear only for IPv4:
.sp
.ne 2
.mk
.na
.B !F
.ad
.sp .6
.RS 4n
fragmentation needed. This should never occur. If this is seen, the
associated gateway is broken.
.RE

.sp
.ne 2
.mk
.na
.B !N
.ad
.sp .6
.RS 4n
network unreachable.
.RE

.sp
.ne 2
.mk
.na
.B !P
.ad
.sp .6
.RS 4n
protocol unreachable.
.RE

.sp
.ne 2
.mk
.na
.B !S
.ad
.sp .6
.RS 4n
source route failed. It is likely that the gateway does not support source
routing.
.RE

.sp
.ne 2
.mk
.na
.B !T
.ad
.sp .6
.RS 4n
unreachable for the specified tos (type-of-service).
.RE

.sp
.ne 2
.mk
.na
.B !U
.ad
.sp .6
.RS 4n
source host isolated or precedence problem.
.RE

.sp
.LP
The following annotations appear only for IPv6:
.sp
.ne 2
.mk
.na
.B !A
.ad
.sp .6
.RS 4n
host unreachable for a reason other than lack of an entry in the routing
table.
.RE

.sp
.ne 2
.mk
.na
.B !B
.ad
.sp .6
.RS 4n
packet too big.
.RE

.sp
.ne 2
.mk
.na
.B !E
.ad
.sp .6
.RS 4n
destination is not a neighbor.
.RE

.sp
.ne 2
.mk
.na
.B !R
.ad
.sp .6
.RS 4n
unrecognized next header.
.RE

.sp
.LP
If almost all the probes result in some kind of unreachable code, then
.B traceroute
gives up and exits.
.sp
.LP
The destination
.I host
is not supposed to process the
.B UDP
probe
packets, so the destination
.I port
default is set to an unlikely value.
However, if some application on the destination is using that value, the
value of
.I port
can be changed with the
.B -p
option.
.sp
.LP
The only mandatory parameter is the destination
.I host
name or
.BR IP
number. The default probe datagram length is 40 bytes (60 bytes for IPv6),
but this may be increased by specifying a packet length (in bytes) after the
destination
.I host
name.
.sp
.LP
All integer arguments to
.B traceroute
can be specified in either
decimal or hexadecimal notation. For example,
.I packetlen
can be
specified either as
.B 256
or
.BR 0x100 .
.SH OPTIONS
.sp
.ne 2
.mk
.na
\fB-A\fR\ \fIaddr_family\fR
.ad
.sp .6
.RS 4n
Specify the address family of the target host.
.I addr_family
can be
either
.B inet
or
.BR inet6 .
Address family determines which protocol
to use. For an argument of
.BR inet ,
IPv4 is used. For
.BR inet6 ,
IPv6
is used.
.sp
By default, if the name of a host is provided, not the literal \fBIP\fR
address, and a valid IPv6 address exists in the name service database,
.B traceroute
will use this address. Otherwise, if the name service
database contains an IPv4 address, it will try the IPv4 address.
.sp
Specify the address family
.B inet
or
.B inet6
to override the
default behavior. If the argument specified is
.BR inet ,
.B traceroute
will use the IPv4 address associated with the hostname. If none exists,
.B traceroute
will state that the host is unknown and exit. It will not
try to determine if an IPv6 address exists in the name service database.
.sp
If the specified argument is
.BR inet6 ,
.B traceroute
will use the
IPv6 address that is associated with the hostname. If none exists,
.B traceroute
will state that the host is unknown and exit.
.RE

.sp
.ne 2
.mk
.na
.B -a
.ad
.sp .6
.RS 4n
Probe all of the addresses of a multi-homed destination. The output looks
like
.B traceroute
has been run once for each
.B IP
address of the
destination. If this option is used together with
.BR -A ,
.B traceroute
probes only the addresses that are of the specified address family. While
probing one of the addresses of the destination, user can skip to the next
address by sending a
.BR SIGINT ,
or exit
.B traceroute
by sending a
.B SIGQUIT
signal. See
.BR signal (3C)
.RE

.sp
.ne 2
.mk
.na
\fB-c\fR\ \fItraffic_class\fR
.ad
.sp .6
.RS 4n
Specify the traffic class of probe packets. The value must be an integer in
the range from 0 to 255. Gateways along the path may route the probe packet
differently depending upon the value of
.I traffic_class
set in the probe
packet. This option is valid only on IPv6.
.RE

.sp
.ne 2
.mk
.na
.B -d
.ad
.sp .6
.RS 4n
Set the
.B SO_DEBUG
socket option.
.RE

.sp
.ne 2
.mk
.na
.B -F
.ad
.sp .6
.RS 4n
Set the "don't fragment" bit. This option is valid only on IPv4. When
specified from within a shared-IP zone, this option has no effect as the
"don't fragment" bit is always set in this case.
.RE

.sp
.ne 2
.mk
.na
.B -f
.I first_hop
.ad
.sp .6
.RS 4n
Set the starting
.I ttl
(
.IR "hop limit" )
value to
.IR first_hop ,
to
override the default value
.BR 1 .
.B traceroute
skips processing for
those intermediate gateways which are less than
.I first_hop
hops away.

.RE

.sp
.ne 2
.mk
.na
.B -g
.I gateway
.ad
.sp .6
.RS 4n
Specify a loose source route
.IR gateway .
The user can specify more than
one
.I gateway
by using
.B -g
for each gateway. The maximum number of
gateways is 8 for IPv4 and 127 for IPv6. Note that some factors such as the
link
.B MTU
can further limit the number of gateways for IPv6. This
option cannot be used with the
.B -r
option.
.sp
Only users with the
.B {PRIV_NET_RAWACCESS}
privilege can specify a
loose source route with this option.
.RE

.sp
.ne 2
.mk
.na
.B -I
.ad
.sp .6
.RS 4n
Use
.B ICMP
(\fBICMP6\fR) \fBECHO\fR instead of \fBUDP\fR datagrams.
.RE

.sp
.ne 2
.mk
.na
.B -i
.I iface
.ad
.sp .6
.RS 4n
For IPv4, this option specifies a network interface to obtain the source
.B IP
address. This is normally only useful on a multi-homed host. The
.B -s
option is also another way to do this. For IPv6, it specifies the
network interface on which probe packets are transmitted. The argument can
be either an interface index, for example,
.BR 1 ,
.BR 2 ,
or an interface
name, for example,
.BR eri0 ,
.BR hme0 .
.RE

.sp
.ne 2
.mk
.na
\fB-L\fR\ \fIflow_label\fR
.ad
.sp .6
.RS 4n
Specify the flow label of probe packets. The value must be an integer in
the range from 0 to 1048575. This option is valid only on IPv6.
.RE

.sp
.ne 2
.mk
.na
.B -l
.ad
.sp .6
.RS 4n
Print the value of the
.I ttl
(\fIhop limit\fR) field in each packet
received.
.RE

.sp
.ne 2
.mk
.na
.B -m
.I max_hop
.ad
.sp .6
.RS 4n
Set the maximum
.I ttl
(\fIhop limit\fR) used in outgoing probe packets.
The default is 30 hops, which is the same default used for
.B TCP
connections.
.RE

.sp
.ne 2
.mk
.na
.B -n
.ad
.sp .6
.RS 4n
Print hop addresses numerically rather than symbolically and numerically.
This saves a nameserver address-to-name lookup for each gateway found on the
path.
.RE

.sp
.ne 2
.mk
.na
.B -P
.I pause_sec
.ad
.sp .6
.RS 4n
Specify a delay, in seconds, to pause between probe packets. This may be
necessary if the final destination does not accept undeliverable packets in
bursts. By default,
.B traceroute
sends the next probe as soon as it has
received a reply. Note that
.I pause_sec
is a real number.
.RE

.sp
.ne 2
.mk
.na
.B -p
.I port
.ad
.sp .6
.RS 4n
Set the base
.B UDP
.I port
number used in probes.The default is
33434.
.B traceroute
hopes that nothing is listening on
.BR UDP
.I ports
.B (base+(nhops-1)*nqueries)
to
\fB(base+(nhops*nqueries)-1)\fRat the destination host, so that an
.B ICMP
(\fBICMP6\fR) \fBPORT_UNREACHABLE\fR message will be returned to
terminate the route tracing. If something is listening on a
.I port
in
the default range, this option can be used to select an unused \fIport\fR
range.
.B nhops
is defined as the number of hops between the source and
the destination.
.RE

.sp
.ne 2
.mk
.na
.B -Q
.I max_timeout
.ad
.sp .6
.RS 4n
Stop probing this hop after
.I max_timeout
consecutive timeouts are
detected. The default value is 5. Useful in combination with the \fB-q\fR
option if you have specified a large
.I nqueries
probe count.
.RE

.sp
.ne 2
.mk
.na
.B -q
.I nqueries
.ad
.sp .6
.RS 4n
Set the desired number of probe queries. The default is 3.
.RE

.sp
.ne 2
.mk
.na
.B -r
.ad
.sp .6
.RS 4n
Bypass the normal routing tables and send directly to a host on an attached
network. If the host is not on a directly-attached network, an error is
returned. This option can be used to send probes to a local host through an
interface that has been dropped by the router deamon. See
.BR in.routed (1M).
You cannot use this option if the
.B -g
option is
used.
.RE

.sp
.ne 2
.mk
.na
.B -S
.ad
.sp .6
.RS 4n
Display a summary of how many probes were not answered for each hop.
.RE

.sp
.ne 2
.mk
.na
.B -s
.I src_addr
.ad
.sp .6
.RS 4n
Use the following address, which usually is given as a literal \fBIP\fR
address, not a hostname, as the source address in outgoing probe packets. On
multi-homed hosts, those with more than one
.B IP
address, this option
can be used to force the source address to be something other than the
.B IP
address
.B traceroute
picks by default. If the
.B IP
address
is not one of this machine's interface addresses, an error is returned and
nothing is sent. For IPv4, when used together with the
.B -i
option, the
given
.B IP
address should be configured on the specified interface.
Otherwise, an error will be returned. In the case of IPv6, the interface
name and the source address do not have to match.
.RE

.sp
.ne 2
.mk
.na
.B -t
.I tos
.ad
.sp .6
.RS 4n
Set the \fItos\fR(type-of-service) in probe packets to the specified value.
The default is zero. The value must be an integer in the range from 0 to
255. Gateways along the path may route the probe packet differently
depending upon the
.I tos
value set in the probe packet. This option is
valid only on IPv4.
.RE

.sp
.ne 2
.mk
.na
.B -v
.ad
.sp .6
.RS 4n
Verbose output. For each hop, the size and the destination of the response
packets is displayed. Also
.B ICMP
(\fBICMP6\fR) packets received other
than
.B TIME_EXCEEDED
and
.B UNREACHABLE
are listed as well.
.RE

.sp
.ne 2
.mk
.na
.B -w
.I waittime
.ad
.sp .6
.RS 4n
Set the time, in seconds, to wait for a response to a probe. The default is
5 seconds.
.RE

.sp
.ne 2
.mk
.na
.B -x
.ad
.sp .6
.RS 4n
Prevent
.B traceroute
from calculating checksums. Checksums are usually
required for the last hop when using
.B "ICMP ECHO"
probes. This
option is valid only on IPv4. See the
.B -I
option.
.sp
When specified from within a shared-IP zone, this option has no effect as
the checksum is always calculated by the operating 	system in this case.
.RE

.SH OPERANDS
.sp
.LP
The following operands are supported:
.sp
.ne 2
.mk
.na
.I host
.ad
.sp .6
.RS 4n
The network host.
.RE

.SH EXAMPLES
.LP
.B Example 1
Sample Output From the
.B traceroute
Utility
.sp
.LP
Some sample output from the
.B traceroute
utility might be:

.sp
.in +2
.nf
istanbul% \fBtraceroute london\fR
traceroute: Warning: london has multiple addresses;  \e
  using 4::114:a00:20ff:ab3d:83ed
traceroute: Warning: Multiple interfaces found; \e
  using 4::56:a00:20ff:fe93:8dde @ eri0:2
traceroute to london (4::114:a00:20ff:ab3d:83ed), 30 hops max, \e
  60 byte packets
1  frbldg7c-86 (4::56:a00:20ff:fe1f:65a1)  1.786 ms  1.544 ms  1.719 ms
2  frbldg7b-77 (4::255:0:0:c0a8:517)  2.587 ms 3.001 ms  2.988 ms
3  london (4::114:a00:20ff:ab3d:83ed)  3.122 ms  2.744 ms  3.356 ms
.fi
.in -2
.sp

.sp
.LP
The target host, london, has both IPv4 and IPv6 addresses in the name
service database. According to the default behavior,
.B traceroute
uses
IPv6 address of the destination host.

.LP
.B Example 2
Using the
.B traceroute
Utility For a Host Which has
Only IPv4 Addresses
.sp
.LP
In the following examples,
.B traceroute
is tracking the route to host
sanfrancisco, which has only IPv4 addresses in the name service database.
Therefore traceroute uses only IPv4 addresses. The following shows the 7-hop
path that a packet would follow from the host istanbul to the host
sanfrancisco.

.sp
.in +2
.nf
istanbul% \fBtraceroute sanfrancisco\fR
traceroute: Warning: Multiple interfaces found; using 172.31.86.247 @eri0
traceroute to sanfrancisco (172.29.64.39), 30 hops max, 40 byte packets
1  frbldg7c-86 (172.31.86.1)  1.516 ms  1.283 ms  1.362 ms
2  bldg1a-001 (172.31.1.211)  2.277 ms  1.773 ms  2.186 ms
3  bldg4-bldg1 (172.30.4.42)  1.978 ms  1.986 ms  13.996 ms
4  bldg6-bldg4 (172.30.4.49)  2.655 ms  3.042 ms  2.344 ms
5  ferbldg11a-001 (172.29.1.236)  2.636 ms  3.432 ms  3.830 ms
6  frbldg12b-153 (172.29.153.72)  3.452 ms  3.146 ms  2.962 ms
7  sanfrancisco (172.29.64.39)  3.430 ms  3.312 ms  3.451 ms
.fi
.in -2
.sp

.LP
.B Example 3
Using the
.B traceroute
Utility With Source Routing
.sp
.LP
The following example shows the path of a packet that goes from istanbul to
sanfrancisco through the hosts cairo and paris, as specified by the \fB-g\fR
option. The
.B -I
option makes
.B traceroute
send
.BR ICMP
.B ECHO
probes to the host sanfrancisco. The
.B -i
options sets the
source address to the
.B IP
address configured on the interface
.BR qe0 .

.sp
.in +2
.nf
istanbul% \fBtraceroute -g cairo -g paris -i qe0 -q 1 -I sanfrancisco\fR
traceroute to sanfrancisco (172.29.64.39), 30 hops max, 56 byte packets
1  frbldg7c-86 (172.31.86.1)  2.012 ms
2  flrbldg7u (172.31.17.131)  4.960 ms
3  cairo (192.168.163.175) 4.894 ms
4  flrbldg7u (172.31.17.131)  3.475 ms
5  frbldg7c-017 (172.31.17.83)  4.126 ms
6  paris (172.31.86.31) 4.086 ms
7  frbldg7b-82 (172.31.82.1)  6.454 ms
8  bldg1a-001 (172.31.1.211)  6.541 ms
9  bldg6-bldg4 (172.30.4.49)  6.518 ms
10  ferbldg11a-001 (172.29.1.236)  9.108 ms
11  frbldg12b-153 (172.29.153.72)  9.634 ms
12  sanfrancisco (172.29.64.39)  14.631 ms


.fi
.in -2
.sp

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.sp .6
.RS 4n
Successful operation.
.RE

.sp
.ne 2
.mk
.na
.B >0
.ad
.sp .6
.RS 4n
An error occurred.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.sp
.LP
.BR netstat (1M),
.BR signal (3C),
.BR ping (1M),
.BR attributes (5),
.BR privileges (5),
.BR zones (5)
.SH WARNINGS
.sp
.LP
This utility is intended for use in network testing, measurement and
management. It should be used primarily for manual fault isolation. Because
of the load it could impose on the network, it is unwise to use
.BR traceroute (1M)
during normal operations or from automated scripts.
