usr/src/man/man1m/ttyadm.1m
'\" te
.\" Copyright (c) 1996, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright 1989 AT&T
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ttyadm 1M "14 Sep 1992" "SunOS 5.11" "System Administration Commands"
.SH NAME
ttyadm \- format and output port monitor-specific information
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/ttyadm\fR [\fB-b\fR] [\fB-c\fR] [\fB-h\fR] [\fB-I\fR] [\fB-r\fR \fIcount\fR] [\fB-i\fR \fImsg\fR]
     [\fB-m\fR \fImodules\fR] [\fB-p\fR \fIprompt\fR] [\fB-t\fR \fItimeout\fR] [\fB-S\fR y | n]
     [\fB-T\fR \fItermtype\fR] \fB-d\fR \fIdevice\fR \fB-l\fR \fIttylabel\fR \fB-s\fR \fIservice\fR
.fi

.LP
.nf
\fB/usr/sbin/ttyadm\fR \fB-V\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B ttyadm
command is an administrative command that formats
\fBttymon\fR(1M)-specific information and writes it to standard output. The
Service Access Facility (SAF) requires each port monitor to provide such a
command. Note that the port monitor administrative file is updated by the
Service Access Controller's administrative commands,
.BR sacadm (1M)
and
.BR pmadm (1M).
\fBttyadm\fR provides a means of presenting formatted port
monitor-specific (\fBttymon\fR-specific) data to these commands.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -b
.ad
.RS 15n
.rt
Set the ``bi-directional port'' flag. When this flag is set, the line can
be used in both directions.
.B ttymon
will allow users to connect to the
service associated with the port, but if the port is free, \fBuucico\fR(1M),
.BR cu (1C),
or \fBct\fR(1C) can use it for dialing out.
.RE

.sp
.ne 2
.mk
.na
.B -c
.ad
.RS 15n
.rt
Set the connect-on-carrier flag for the port. If the
.B -c
flag is set,
\fBttymon\fR will invoke the port's associated service immediately when a
connect indication is received (that is, no prompt is printed and no
baud-rate searching is done).
.RE

.sp
.ne 2
.mk
.na
.BI -d " device"
.ad
.RS 15n
.rt
\fIdevice\fR is the full pathname of the device file for the TTY port.
.RE

.sp
.ne 2
.mk
.na
.B -h
.ad
.RS 15n
.rt
Set the hangup flag for the port. If the
.B -h
flag is not set,
\fBttymon\fR will force a hangup on the line by setting the speed to \fB0\fR
before setting the speed to the default or specified value.
.RE

.sp
.ne 2
.mk
.na
.BI -i " message"
.ad
.RS 15n
.rt
Specify the inactive (disabled) response message. This message will be sent
to the TTY port if the port is disabled or the
.B ttymon
monitoring the
port is disabled.
.RE

.sp
.ne 2
.mk
.na
.B -I
.ad
.RS 15n
.rt
Initialize only.  If the
.B -I
option is used,
.B ttymon
will invoke
the service only once.  This can be used to configure a particular device
without actually monitoring it, as with software carrier.
.RE

.sp
.ne 2
.mk
.na
.BI -l " ttylabel"
.ad
.RS 15n
.rt
Specify which
.I ttylabel
in the \fB/etc/ttydefs\fR file to use as the
starting point when searching for the proper baud rate.
.RE

.sp
.ne 2
.mk
.na
.BI -m " modules"
.ad
.RS 15n
.rt
Specify a list of pushable STREAMS modules. The modules will be pushed in
the order in which they are specified before the service is invoked.
\fImodules\fR must be a comma-separated list of modules, with no white space
included. Any modules currently on the stream will be popped before these
modules are pushed.
.RE

.sp
.ne 2
.mk
.na
.BI -p " prompt"
.ad
.RS 15n
.rt
Specify the prompt message, for example, ``\fBlogin:\fR''.
.RE

.sp
.ne 2
.mk
.na
.BI -r " count"
.ad
.RS 15n
.rt
When the
.B -r
option is invoked,
.B ttymon
will wait until it
receives data from the port before it displays a prompt. If
.I count
is
.BR 0 ,
\fBttymon\fR will wait until it receives any character. If
\fIcount\fR is greater than
.BR 0 ,
\fBttymon\fR will wait until
\fIcount\fR newlines have been received.
.RE

.sp
.ne 2
.mk
.na
.BI -s " service"
.ad
.RS 15n
.rt
\fIservice\fR is the full pathname of the service to be invoked when a
connection request is received. If arguments are required, the command and
its arguments must be enclosed in double quotes (" ").
.RE

.sp
.ne 2
.mk
.na
.B -S y|n
.ad
.RS 15n
.rt
Set the software carrier value.
.B y
will turn software carrier on.
\fBn\fR will turn software carrier off.
.RE

.sp
.ne 2
.mk
.na
.BI -t " timeout"
.ad
.RS 15n
.rt
Specify that
.B ttymon
should close a port if the open on the port
succeeds, and no input data is received in
.I timeout
seconds.
.RE

.sp
.ne 2
.mk
.na
.BI -T " termtype"
.ad
.RS 15n
.rt
Set the terminal type.  The
.B TERM
environment variable will be set to
.IR termtype .
.RE

.sp
.ne 2
.mk
.na
.B -V
.ad
.RS 15n
.rt
Display the version number of the current \fB/usr/lib/saf/ttymon\fR
command.
.RE

.SH OUTPUT
.sp
.LP
If successful,
.B ttyadm
will generate the requested information, write
it to  standard output, and exit with a status of
.BR 0 .
If
.BR ttyadm
is invoked with an invalid number of arguments or invalid arguments, or if
an incomplete option is specified, an error message will be written to
standard error and
.B ttymon
will exit with a non-zero status.
.SH FILES
.sp
.ne 2
.mk
.na
\fB/etc/ttydefs\fR
.ad
.RS 16n
.rt

.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.sp
.LP
.BR ct (1C),
.BR cu (1C),
.BR pmadm (1M),
.BR sacadm (1M),
.BR ttymon (1M),
.BR uucico (1M),
.BR attributes (5)
.sp
.LP
\fR
