usr/src/man/man1m/ttymon.1m
'\" te
.\" Copyright 1989 AT&T
.\" Copyright (C) 2004, Sun Microsystems, Inc.
.\" All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ttymon 1M "22 Feb 2005" "SunOS 5.11" "System Administration Commands"
.SH NAME
ttymon \- port monitor for terminal ports
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/saf/ttymon\fR
.fi

.LP
.nf
\fB/usr/lib/saf/ttymon\fR \fB-g\fR [\fB-d\fR \fIdevice\fR] [\fB-h\fR] [\fB-t\fR \fItimeout\fR]
     [\fB-l\fR \fIttylabel\fR] [\fB-p\fR \fIprompt\fR] [\fB-m\fR \fImodules\fR] [\fB-T\fR \fItermtype\fR]
.fi

.SH DESCRIPTION
.sp
.LP
.B ttymon
is a STREAMS-based TTY port monitor. Its function is to monitor
ports, to set terminal modes, baud rates, and line disciplines for the ports, and
to connect users or applications to services associated with the ports. Normally,
.B ttymon
is configured to run under the Service Access Controller,
.BR sac (1M),
as part of the Service Access Facility (SAF). It is configured
using the \fBsacadm\fR(1M) command. Each instance of
.B ttymon
can monitor
multiple ports. The ports monitored by an instance of
.B ttymon
are specified
in the port monitor's administrative file. The administrative file is configured
using the \fBpmadm\fR(1M) and \fBttyadm\fR(1M) commands. When an instance of
.B ttymon
is invoked by the
.B sac
command, it starts to monitor its ports.
For each port,
.B ttymon
first initializes the line disciplines, if they are
specified, and the speed and terminal settings. For ports with entries in
.BR /etc/logindevperm ,
device owner, group and permissions are set. (See
.BR logindevperm (4).)
The values used for initialization are taken from the
appropriate entry in the TTY settings file. This file is maintained by the
.BR sttydefs (1M)
command. Default line disciplines on ports are usually set up
by the \fBautopush\fR(1M) command of the Autopush Facility.
.sp
.LP
.B ttymon
then writes the prompt and waits for user input. If the user
.RB "indicates that the speed is inappropriate by pressing the BREAK key," " ttymon"
tries the next speed and writes the prompt again. When valid input is received,
.B ttymon
interprets the per-service configuration file for the port, if one
exists, creates a
.B utmpx
entry if required (see
.BR utmpx (4)),
establishes
the service environment, and then invokes the service associated with the port.
Valid input consists of a string of at least one non-newline character,
terminated by a carriage return. After the service terminates, \fBttymon\fR
cleans up the
.B utmpx
entry, if one exists, and returns the port to its
initial state.
.sp
.LP
If
.I autobaud
is enabled for a port,
.B ttymon
will try to determine the
baud rate on the port automatically. Users must enter a carriage return before
.B ttymon
can recognize the baud rate and print the prompt. Currently, the
baud rates that can be determined by
.I autobaud
are
.BR 110 ,
.BR 1200 ,
.BR 2400 ,
.BR 4800 ,
and
.BR 9600 .
.sp
.LP
If a port is configured as a bidirectional port,
.B ttymon
will allow users
to connect to a service, and, if the port is free, will allow
.BR uucico (1M),
.BR cu (1C),
or \fBct\fR(1C) to use it for dialing out. If a port is
bidirectional,
.B ttymon
will wait to read a character before it prints a
prompt.
.sp
.LP
If the
.I connect-on-carrier
flag is set for a port,
.B ttymon
will
immediately invoke the port's associated service when a connection request is
received. The prompt message will not be sent.
.sp
.LP
If a port is disabled,
.B ttymon
will not start any service on that port. If
a disabled message is specified,
.B ttymon
will send out the disabled message
when a connection request is received. If
.B ttymon
is disabled, all ports
under that instance of
.B ttymon
will also be disabled.
.SS "Service Invocation"
.sp
.LP
The service
.B ttymon
invokes for a port is specified in the
.BR ttymon
administrative file.
.B ttymon
will scan the character string giving the
service to be invoked for this port, looking for a
.B %d
or a
.BR %%
two-character sequence. If
.B %d
is found,
.B ttymon
will modify the
service command to be executed by replacing those two characters by the full path
name of this port (the device name). If
.B %%
is found, they will be replaced
by a single
.BR % .
When the service is invoked, file descriptor
.BR 0 ,
.BR 1 ,
and
.B 2
are opened to the port device for reading and writing. The
service is invoked with the user ID, group ID and current home directory set to
that of the user name under which the service was registered with
.BR ttymon .
Two environment variables,
.B HOME
and
.BR TTYPROMPT ,
are added to the
service's environment by
.BR ttymon .
.B HOME
is set to the home directory of
the user name under which the service is invoked.
.B TTYPROMPT
is set to the
prompt string configured for the service on the port. This is provided so that a
service invoked by
.B ttymon
has a means of determining if a prompt was
actually issued by
.B ttymon
and, if so, what that prompt actually was.
.sp
.LP
See \fBttyadm\fR(1M) for options that can be set for ports monitored by
.B ttymon
under the Service Access Controller.
.SS "System Console Invocation"
.sp
.LP
The invocation of ttymon on the system console is managed under
.BR smf (5)
by
the service
.BR svc:/system/console-login .
It provides a number of properties
within the property group
.B ttymon
to control the invocation, as follows:
.sp
.in +2
.nf
NAME                  TYPE               TTYMON OPTION
----------------------------------------------------------
device                astring            [-d device]
nohangup              boolean            [-h]
label                 astring            [-l label]
modules               astring            [-m module1,module2]
prompt                astring            [-p prompt]
timeout               count              [-t timeout]
terminal_type         astring            [-T termtype]
.fi
.in -2
.sp

.sp
.LP
If any value is the empty string or an integer set to zero, then the option is
not passed to the ttymon invocation. The
.B -g
option is always specified for
this invocation. The
.B -d
option always defaults to
.B /dev/console
if it
is not set.
.sp
.LP
See
.BR EXAMPLES .
.SH SECURITY
.sp
.LP
.B ttymon
uses \fBpam\fR(3PAM) for session management. The \fBPAM\fR
configuration policy, listed through
.BR /etc/pam.conf ,
specifies the modules
to be used for
.BR ttymon .
Here is a partial
.B pam.conf
file with entries
for
.B ttymon
using the UNIX session management module.
.sp
.in +2
.nf
ttymon session  required /usr/lib/security/pam_unix_session.so.1
.fi
.in -2

.sp
.LP
If there are no entries for the
.B ttymon
service, then the entries for the
"other" service will be used.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -g
.ad
.RS 14n
.rt
A special invocation of
.B ttymon
is provided with the
.B -g
option. This
form of the command should only be called by applications that need to set the
correct baud rate and terminal settings on a port and then connect to
.BR login
service, but that cannot be pre-configured under the SAC. The following
combinations of options can be used with
.BR -g :
.RE

.sp
.ne 2
.mk
.na
\fB-d\fIdevice\fR
.ad
.RS 14n
.rt
.I device
is the full path name of the port to which
.B ttymon
is to
attach. If this option is not specified, file descriptor
.B 0
must be set up
by the invoking process to a TTY port.
.RE

.sp
.ne 2
.mk
.na
.B -h
.ad
.RS 14n
.rt
If the -h flag is not set,
.B ttymon
will force a hangup on the line by
setting the speed to zero before setting the speed to the default or specified
speed.
.RE

.sp
.ne 2
.mk
.na
\fB-l\fIttylabel\fR
.ad
.RS 14n
.rt
.I ttylabel
is a link to a speed and TTY definition in the \fBttydefs\fR
file. This definition tells
.B ttymon
at what speed to run initially, what the
initial TTY settings are, and what speed to try next if the user indicates that
the speed is inappropriate by pressing the BREAK key. The default speed is 9600
baud.
.RE

.sp
.ne 2
.mk
.na
\fB-m\fImodules\fR
.ad
.RS 14n
.rt
When initializing the port,
.B ttymon
will pop all modules on the port, and
then push
.I modules
in the order specified.
.I modules
is a
comma-separated list of pushable modules. Default modules on the ports are
usually set up by the Autopush Facility.
.RE

.sp
.ne 2
.mk
.na
\fB-p\fIprompt\fR
.ad
.RS 14n
.rt
Allows the user to specify a prompt string. The default prompt is
.BR Login: .
.RE

.sp
.ne 2
.mk
.na
\fB-t\fItimeout\fR
.ad
.RS 14n
.rt
Specifies that
.B ttymon
should exit if no one types anything in
.I timeout
seconds after the prompt is sent.
.RE

.sp
.ne 2
.mk
.na
\fB-T\fItermtype\fR
.ad
.RS 14n
.rt
Sets the
.B TERM
environment variable to
.IR termtype .
.RE

.SH EXAMPLES
.LP
.B Example 1
Setting the Terminal Type
.sp
.LP
The following example sets the value of the terminal type (\fB-T\fR) option for
the system console
.B ttymon
invocation:

.sp
.in +2
.nf
	svccfg -s svc:/system/console-login setprop \e
	    ttymon/terminal_type = "xterm"
	svcadm refresh svc:/system/console-login:default
.fi
.in -2
.sp

.SH ENVIRONMENT VARIABLES
.sp
.LP
If any of the
.B LC_*
variables (
.BR LC_CTYPE ,
.BR LC_MESSAGES ,
.BR LC_TIME ,
.BR LC_COLLATE ,
.BR LC_NUMERIC ,
and
.B LC_MONETARY
) (see
.BR environ (5))
are not set in the environment, the operational behavior of
.B ttymon
for each corresponding locale category is determined by the value of
the
.B LANG
environment variable. If
.B LC_ALL
is set, its contents are
used to override both the
.B LANG
and the other
.B LC_*
variables. If none
of the above variables is set in the environment, the "C" (U.S. style) locale
determines how
.B ttymon
behaves.
.sp
.ne 2
.mk
.na
.B LC_CTYPE
.ad
.RS 12n
.rt
Determines how
.B ttymon
handles characters. When
.B LC_CTYPE
is set to a
valid value,
.B ttymon
can display and handle text and filenames containing
valid characters for that locale.
.B ttymon
can display and handle Extended
Unix Code (EUC) characters where any individual character can be 1, 2, or 3 bytes
wide.
.B ttymon
can also handle EUC characters of 1, 2, or more column widths.
In the "C" locale, only characters from ISO 8859-1 are valid.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/logindevperm
.ad
.RS 21n
.rt

.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
_
StabilitySee below.
.TE

.sp
.LP
The command-line syntax is Stable. The SMF properties are Evolving.
.SH SEE ALSO
.sp
.LP
.BR ct (1C),
.BR cu (1C),
.BR autopush (1M),
.BR pmadm (1M),
.BR sac (1M),
.BR sacadm (1M),
.BR sttydefs (1M),
.BR ttyadm (1M),
.BR uucico (1M),
.BR pam (3PAM),
.BR logindevperm (4),
.BR pam.conf (4),
.BR utmpx (4),
.BR attributes (5),
.BR environ (5),
.BR pam_authtok_check (5),
.BR pam_authtok_get (5),
.BR pam_authtok_store (5),
.BR pam_dhkeys (5),
.BR pam_passwd_auth (5),
.BR pam_unix_account (5),
.BR pam_unix_auth (5),
.BR pam_unix_session (5),
.BR smf (5)
.sp
.LP
\fR
.SH NOTES
.sp
.LP
If a port is monitored by more than one
.BR ttymon ,
it is possible for the
\fBttymon\fRs to send out prompt messages in such a way that they compete for
input.
.sp
.LP
The
.BR pam_unix (5)
module is no longer supported. Similar functionality is
provided by
.BR pam_authtok_check (5),
.BR pam_authtok_get (5),
.BR pam_authtok_store (5),
.BR pam_dhkeys (5),
.BR pam_passwd_auth (5),
.BR pam_unix_account (5),
.BR pam_unix_auth (5),
and
.BR pam_unix_session (5).
