usr/src/man/man1m/tzreload.1m
'\" te
.\" Copyright (c) 2009, Sun Microsystems, Inc. All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH tzreload 1M "28 Oct 2009" "SunOS 5.11" "System Administration Commands"
.SH NAME
tzreload \- notify timezone update
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/tzreload\fR [\fB-a\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The
.B tzreload
command notifies active (running) processes to reread
timezone information. The timezone information is cached in each process,
absent a
.B tzreload
command, is never reread until a process is
restarted. In response to a
.B tzreload
command, active processes reread
the current timezone information at the next call to
.BR ctime "(3C) and"
.BR mktime (3C).
By default, the
.B tzreload
notification is sent to the
processes within the current zone.
.sp
.LP
In addition to notifying active processes, the
.B tzreload
command also
notifies cron(1M), to reinitialize the job scheduler with the new timezone
information.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -a
.ad
.sp .6
.RS 4n
Notify processes in all zones.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
\fB/usr/share/lib/zoneinfo\fR
.ad
.sp .6
.RS 4n
Standard zone information directory.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
.BR cron (1M),
.BR zdump (1M),
.BR zic (1M),
.BR zoneadm (1M),
.BR ctime (3C),
.BR mktime (3C),
.BR attributes (5)
.sp
.LP
.BR rpc.cmsd(1M) ,
part of the CDE man page set.
.SH NOTES
.sp
.LP
Although
.B tzreload
reinitializes
.BR cron "(1M), applications that are"
affected by timezone changes still need to be restarted or reinitialized if
they do not reread the new timezone information before timezone changes take
place.
