usr/src/man/man1m/tzselect.1m
'\" te
.\" Copyright (c) 2001, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH tzselect 1M "6 Sep 2001" "SunOS 5.11" "System Administration Commands"
.SH NAME
tzselect \- select a time zone
.SH SYNOPSIS
.LP
.nf
\fB/usr/bin/tzselect\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B tzselect
program asks you a series of questions about the current
location and outputs the resulting time zone description to standard output.
The output is suitable as a value for the
.B TZ
environment variable.
.sp
.LP
All user interaction is through standard input and standard error.
.SH OPTIONS
.sp
.LP
The
.B tzselect
command has no options.
.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 6n
.rt
Timezone information was successfully obtained.
.RE

.sp
.ne 2
.mk
.na
.B >0
.ad
.RS 6n
.rt
An error occurred.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B /usr/share/lib/zoneinfo
.ad
.RS 28n
.rt
directory containing timezone data files
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
_
StabilityEvolving
.TE

.SH SEE ALSO
.sp
.LP
.BR zdump (1M),
.BR zic (1M),
.BR ctime (3C),
.BR attributes (5)
