usr/src/man/man1m/ucodeadm.1m
'\" te
.\" Copyright (c) 2007, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ucodeadm 1M "10 Jul 2007" "SunOS 5.11" "System Administration Commands"
.SH NAME
ucodeadm \- update processor microcode
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/ucodeadm\fR \fB-v\fR
.fi

.LP
.nf
\fB/usr/sbin/ucodeadm\fR \fB-u\fImicrocode-text-file\fR
.fi

.LP
.nf
\fB/usr/sbin/ucodeadm\fR \fB-i\fR [\fB-R\fR \fIpath\fR] \fImicrocode-text-file\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B ucodeadm
utility can be used to report running microcode revision
on the processors, update microcode, or install microcode on the target
system to be used during the boot process.
.sp
.LP
The
.I microcode-text-file
can be obtained from processor vendors.
.SH OPTIONS
.sp
.ne 2
.mk
.na
.B -v
.ad
.RS 26n
.rt
Report microcode revision.
.RE

.sp
.ne 2
.mk
.na
.B -u
.I microcode-text-file
.ad
.RS 26n
.rt
Update microcode on all cross-call interrupt ready processors.
.RE

.sp
.ne 2
.mk
.na
.B -i
.I microcode-text-file
.ad
.RS 26n
.rt
Install microcode files on target system to be used during the next boot
cycle. The text file name must have the vendor name prefix, 	such as
"\fBintel\fR" or "\fBamd\fR".
.sp
By default the microcode files will be installed at:
.sp
.in +2
.nf
 /platform/i86pc/ucode/$VENDORSTR/
.fi
.in -2
.sp

where \fBVENDORSTR\fR is either "\fBGenuineIntel\fR" or
"\fBAuthenticAMD\fR".
.RE

.sp
.ne 2
.mk
.na
.B -R
.I alternate path
.ad
.RS 26n
.rt
Install
.I microcode
path in the
.IR "alternate path" .
.RE

.SH EXAMPLES
.LP
.B Example 1
Reporting the Microcode Revision
.sp
.LP
The following example displays the microcode revision that is currently
running:

.sp
.in +2
.nf
# ucodeadm -v
.fi
.in -2
.sp

.LP
.B Example 2
Updating the Processor Microcode
.sp
.LP
The following example updates the processor microcode to
.BR intel-ucode.txt :

.sp
.in +2
.nf
# ucodeadm -u intel-ucode.txt
.fi
.in -2
.sp

.LP
.B Example 3
Installing the Microcode on the Target System
.sp
.LP
The following example installs the microcode on the target system,
.BR /export/ucode-path :

.sp
.in +2
.nf
# ucodeadm -i -R /export/ucode-path intel-ucode.txt
.fi
.in -2
.sp

.sp
.LP
If an alternate path is used when installing the microcode on the target
system, the installed microcode file is not used on the next boot cycle.

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 6n
.rt
Successful completion.
.RE

.sp
.ne 2
.mk
.na
.B >0
.ad
.RS 6n
.rt
An error occurred.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
_
Interface StabilityStable
.TE

.SH SEE ALSO
.sp
.LP
.BR psradm (1M),
.BR psrinfo (1M),
.BR attributes (5)
