usr/src/man/man1m/updatemanager.1m
'\" te
.\" Copyright (c) 2005, Sun Microsystems, Inc. All Rights Reserved.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH updatemanager 1M "11 Oct 2005" "SunOS 5.11" "System Administration Commands"
.SH NAME
updatemanager \- start the Sun Update Manager application
.SH SYNOPSIS
.LP
.nf
\fBupdatemanager\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B updatemanager
command starts the Sun Update Manager application.
The Sun Update Manager is a graphical user interface (GUI) that you can use
to manage updates and patches on your Solaris system.
.sp
.LP
For more information about using this application, see the \fISun Update
Manager 1.0 Administration Guide\fR in the \fISun Update Connection, System
Edition Collection\fR on \fBdocs.sun.com\fR.
.sp
.LP
You can also manage updates and patches on the command line by using the
\fBsmpatch\fR command. See the \fBsmpatch\fR(1M) man page.
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWupdatemgru
_
Interface StabilityUnstable
.TE

.SH SEE ALSO
.sp
.LP
.BR smpatch (1M),
.BR attributes (5)
