usr/src/man/man1m/updatemedia.1m
'\" te
.\" Copyright (c) 2008, Sun Microsystems, Inc. All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH updatemedia 1M "23 Sep 2009" "SunOS 5.11" "System Administration Commands"
.SH NAME
updatemedia \- modify Solaris media with patches and packages
.SH SYNOPSIS
.LP
.nf
\fB/usr/bin/updatemedia\fR  \fB-d\fR \fImedia-root\fR [\fB-v\fR] [\fB-o\fR \fIiso\fR] [\fB-l\fR \fIlabel\fR]
     \fIpkg_or_patch\fR [\fIpkg_or_patch\fR .\|.\|.]
.fi

.SH DESCRIPTION
.sp
.LP
The
.B updatemedia
utility takes a list of patches and packages as input
and updates the install miniroot in
.I media-root
(the root directory of
an on-disk image of a Solaris installation media) to include the specified
patches and packages. These patches and packages are also placed in a
subdirectory called
.B DU
under the Solaris install image. For example:
.sp
.in +2
.nf
\fImedia-root\fR/Solaris_10/DU
.fi
.in -2
.sp

.sp
.LP
When booting a system from the updated media, the patches and packages will
be part of the booted Solaris image. They will also be applied to the target
system being installed at the end of the installation process.
.sp
.LP
If
.B -o
is specified, a bootable ISO image is created in the file
.B media.iso
that contains the Solaris install media. The ISO image can
then be burned onto a CD/DVD with utilities such as
.BR cdrw (1)
or
.BR cdrecord(1) .
(The latter is not a SunOS man page.)
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -d
.I media-root
.ad
.sp .6
.RS 4n
Top-level directory of on-disk image of Solaris installation media. This is
option must be specified.
.RE

.sp
.ne 2
.mk
.na
.B -o
.I iso
.ad
.sp .6
.RS 4n
Create a Solaris ISO image of
.IR media-root .
.RE

.sp
.ne 2
.mk
.na
.B -l
.I label
.ad
.sp .6
.RS 4n
Label/volume name of the ISO image (if
.B -o
option is specified). If
.B -o
is not specified, the name of Solaris directory under
.IR media-root ,
for example,
.BR Solaris_10 ,
will be used.
.RE

.sp
.ne 2
.mk
.na
.B -v
.ad
.sp .6
.RS 4n
Verbose. Multiple
.B -v
options increase verbosity.
.RE

.SH OPERANDS
.sp
.LP
The following operands are supported:
.sp
.ne 2
.mk
.na
.I pkg_or_patch
[\fIpkg_or_patch\fR .\|.\|.]\fR
.ad
.sp .6
.RS 4n
One or more patches or packages (you can have both patches and packages in
.RI "a single command) with which the Solaris installation media" " media-root"
will be updated.
.RE

.SH EXAMPLES
.LP
.B Example 1
Updating a Solaris Install Image with Patch and Package
.sp
.LP
The following command updates the Solaris install image in
.B s10u1
by
adding patch
.B 123456-07
and package
.BR SUNWfoo .

.sp
.in +2
.nf
# \fB/usr/bin/updatemedia -d s10u1 SUNWfoo 123456-07\fR
.fi
.in -2
.sp

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
.BR cdrw (1),
.BR mkbootmedia (1M),
.BR attributes (5)
.sp
.LP
.BR mkisofs(8) ,
(\fB/usr/share/man/man8/mkisofs.8\fR), in the
.B SUNWfsman
package (not a SunOS man page)
