usr/src/man/man1m/updatemanager.1m
'\" te
.\" Copyright (c) 2005, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH updatemanager 1M "11 Oct 2005" "SunOS 5.11" "System Administration Commands"
.SH NAME
updatemanager \- start the Sun Update Manager application
.SH SYNOPSIS
.LP
.nf
\fBupdatemanager\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B updatemanager
command starts the Sun Update Manager application.
The Sun Update Manager is a graphical user interface (GUI) that you can use
to manage updates and patches on your Solaris system.
.sp
.LP
For more information about using this application, see the
.I
Sun Update Manager 1.0 Administration Guide
in the \fISun Update Connection, System
Edition Collection\fR on
.BR docs.sun.com .
.sp
.LP
You can also manage updates and patches on the command line by using the
.B smpatch
command. See the
.BR smpatch (1M)
man page.
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWupdatemgru
_
Interface StabilityUnstable
.TE

.SH SEE ALSO
.sp
.LP
.BR smpatch (1M),
.BR attributes (5)
