usr/src/man/man1m/userdel.1m
'\" te
.\" Copyright 1989 AT&T
.\" Copyright (c) 1999, Sun Microsystems, Inc.  All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH userdel 1M "8 Sep 1999" "SunOS 5.11" "System Administration Commands"
.SH NAME
userdel \- delete a user's login from the system
.SH SYNOPSIS
.LP
.nf
\fBuserdel\fR [\fB-r\fR] \fIlogin\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B userdel
utility deletes a user account from the system and makes
the appropriate account-related changes to the system file and file system.

.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -r
.ad
.RS 6n
.rt
Remove the user's home directory from the system. This directory must
exist. The files and directories under the home directory will no longer be
accessible following successful execution of the command.
.RE

.SH OPERANDS
.sp
.LP
The following operands are supported:
.sp
.ne 2
.mk
.na
.I login
.ad
.RS 9n
.rt
An existing login name to be deleted.
.RE

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 6n
.rt
Successful completion.
.RE

.sp
.ne 2
.mk
.na
.B 2
.ad
.RS 6n
.rt
Invalid command syntax. A usage message for the
.B userdel
command is
displayed.
.RE

.sp
.ne 2
.mk
.na
.B 6
.ad
.RS 6n
.rt
The account to be removed does not exist.
.RE

.sp
.ne 2
.mk
.na
.B 8
.ad
.RS 6n
.rt
The account to be removed is in use.
.RE

.sp
.ne 2
.mk
.na
.B 10
.ad
.RS 6n
.rt
Cannot update the
.B /etc/group
or
.B /etc/user_attr
file but the
login is removed from the
.B /etc/passwd
file.
.RE

.sp
.ne 2
.mk
.na
.B 12
.ad
.RS 6n
.rt
Cannot remove or otherwise modify the home directory.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/passwd
.ad
.RS 18n
.rt
system password file
.RE

.sp
.ne 2
.mk
.na
.B /etc/shadow
.ad
.RS 18n
.rt
system file contain users' encrypted passwords and related information
.RE

.sp
.ne 2
.mk
.na
.B /etc/group
.ad
.RS 18n
.rt
system file containing group definitions
.RE

.sp
.ne 2
.mk
.na
.B /etc/user_attr
.ad
.RS 18n
.rt
system file containing additional user attributes
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.sp
.LP
.BR auths (1),
.BR passwd (1),
.BR profiles (1),
.BR roles (1),
.BR users (1B),
.BR groupadd (1M),
.BR groupdel (1M),
.BR groupmod (1M),
.BR logins (1M),
.BR roleadd (1M),
.BR rolemod (1M),
.BR useradd (1M),
.BR userdel (1M),
.BR usermod (1M),
.BR passwd (4),
.BR prof_attr (4),
.BR user_attr (4),
.BR attributes (5)
.SH NOTES
.sp
.LP
The
.B userdel
utility only deletes an account definition that is in the
local
.BR /etc/group ,
.BR /etc/passwd ,
.BR /etc/shadow ,
and
.B /etc/user_attr
file. file. If a network name service such as
.B NIS
or
.B NIS+
is being used to supplement the local
.B /etc/passwd
file
with additional entries,
.B userdel
cannot change information supplied by
the network name service.
