usr/src/man/man1m/usermod.1m
'\" te
.\" Copyright 1989 AT&T Copyright (c) 2004, 2009, Sun Microsystems, Inc. All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH usermod 1M "22 Feb 2008" "SunOS 5.11" "System Administration Commands"
.SH NAME
usermod \- modify a user's login information on the system
.SH SYNOPSIS
.LP
.nf
\fBusermod\fR [\fB-u\fR \fIuid\fR [\fB-o\fR]] [\fB-g\fR \fIgroup\fR] [\fB-G\fR \fIgroup\fR [, \fIgroup\fR.\|.\|.]]
     [\fB-d\fR \fIdir\fR [\fB-m\fR]] [\fB-s\fR \fIshell\fR] [\fB-c\fR \fIcomment\fR] [\fB-l\fR \fInew_name\fR]
     [\fB-f\fR \fIinactive\fR] [\fB-e\fR \fIexpire\fR]
     [\fB-A\fR \fIauthorization\fR [, \fIauthorization\fR]]
     [\fB-P\fR \fIprofile\fR [, \fIprofile\fR]] [\fB-R\fR \fIrole\fR [, \fIrole\fR]]
     [\fB-K\fR \fIkey=value\fR] \fIlogin\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B usermod
utility modifies a user's login definition on the system.
It changes the definition of the specified login and makes the appropriate
login-related system file and file system changes.
.sp
.LP
The system file entries created with this command have a limit of 512
characters per line. Specifying long arguments to several options might
exceed this limit.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB-A\fR \fIauthorization\fR
.ad
.sp .6
.RS 4n
One or more comma separated authorizations as defined in
.BR auth_attr (4).
Only a user or role who has
.B grant
rights to the
\fBauthorization\fR can assign it to an account. This replaces any existing
authorization setting. If no authorization list is specified, the existing
setting is removed.
.RE

.sp
.ne 2
.mk
.na
\fB-c\fR \fIcomment\fR
.ad
.sp .6
.RS 4n
Specify a comment string.
.I comment
can be any text string. It is
generally a short description of the login, and is currently used as the
field for the user's full name. This information is stored in the user's
\fB/etc/passwd\fR entry.
.RE

.sp
.ne 2
.mk
.na
\fB-d\fR \fIdir\fR
.ad
.sp .6
.RS 4n
Specify the new home directory of the user. It defaults to
.IR base_dir/login ,
where
.I base_dir
is the base directory for new
login home directories, and
.B login
is the new login.
.RE

.sp
.ne 2
.mk
.na
\fB-e\fR \fIexpire\fR
.ad
.sp .6
.RS 4n
Specify the expiration date for a login. After this date, no user will be
able to access this login. The expire option argument is a date entered
using one of the date formats included in the template file
.BR /etc/datemsk .
See
.BR getdate (3C).
.sp
For example, you may enter
.B 10/6/90
or
.BR "October 6, 1990" .
A value
of
.B "`` ''"
defeats the status of the expired date.
.RE

.sp
.ne 2
.mk
.na
\fB-f\fR \fIinactive\fR
.ad
.sp .6
.RS 4n
Specify the maximum number of days allowed between uses of a login
.BR ID
before that login
.B ID
is declared invalid. Normal values are positive
integers. A value of
.B 0
defeats the status.
.RE

.sp
.ne 2
.mk
.na
\fB-g\fR \fIgroup\fR
.ad
.sp .6
.RS 4n
Specify an existing group's integer
.B ID
or character-string name. It
redefines the user's primary group membership.
.RE

.sp
.ne 2
.mk
.na
\fB-G\fR \fIgroup\fR
.ad
.sp .6
.RS 4n
Specify an existing group's integer "ID" "," or character string name. It
redefines the user's supplementary group membership. Duplicates between
\fIgroup\fR with the \fB-g\fR and \fB-G\fR options are ignored. No more than
\fBNGROUPS_UMAX\fR groups may be specified as defined in
.BR <param.h> \&.
.RE

.sp
.ne 2
.mk
.na
\fB-K\fR \fIkey=value\fR
.ad
.sp .6
.RS 4n
Replace existing or add to a user's
.I key=value
pair attributes.
Multiple
.B -K
options can be used to replace or add multiple
\fIkey=value\fR pairs. However, keys must not be repeated. The generic
\fB-K\fR option with the appropriate key can be used instead of the specific
implied key options (\fB-A\fR,
.BR -P ,
.BR -R ,
.BR -p ).
See
.BR user_attr (4)
for a list of valid \fIkey\fRs. Values for these keys are
usually found in man pages or other sources related to those keys. For
example, see
.BR project (4)
for guidance on values for the
.BR project
key. Use the command
.BR ppriv (1)
with the
.B -v
and
.B -l
options
for a list of values for the keys \fBdefaultpriv\fR and \fBlimitpriv\fR.
.sp
The keyword
.B type
can be specified with the value
.B role
or the
value
.BR normal .
When using the value
.BR role ,
the account changes
from a normal user to a role; using the value
.B normal
keeps the account
a normal user.
.sp
As a
.B role
account, no roles (\fB-R\fR or
.IR roles=value )
can be
present.
.RE

.sp
.ne 2
.mk
.na
\fB-l\fR \fInew_logname\fR
.ad
.sp .6
.RS 4n
Specify the new login name for the user. See
.BR passwd (4)
for the
requirements for usernames.
.RE

.sp
.ne 2
.mk
.na
.B -m
.ad
.sp .6
.RS 4n
Move the user's home directory to the new directory specified with the
\fB-d\fR option. If the directory already exists, it must have permissions
read/write/execute by
.IR group ,
where
.I group
is the user's primary
group.
.RE

.sp
.ne 2
.mk
.na
.B -o
.ad
.sp .6
.RS 4n
This option allows the specified
.B UID
to be duplicated (non-unique).
.RE

.sp
.ne 2
.mk
.na
\fB-P\fR \fIprofile\fR
.ad
.sp .6
.RS 4n
One or more comma-separated rights profiles defined in
.BR prof_attr (4).
This replaces any existing profile setting in
.BR user_attr (4).
If an
empty profile list is specified, the existing setting is removed.
.RE

.sp
.ne 2
.mk
.na
\fB-R\fR \fIrole\fR
.ad
.sp .6
.RS 4n
One or more comma-separated roles (see
.BR roleadd (1M)).
This replaces
any existing role setting. If no role list is specified, the existing
setting is removed.
.RE

.sp
.ne 2
.mk
.na
\fB-s\fR \fIshell\fR
.ad
.sp .6
.RS 4n
Specify the full pathname of the program that is used as the user's shell
on login. The value of
.I shell
must be a valid executable file.
.RE

.sp
.ne 2
.mk
.na
\fB-u\fR \fIuid\fR
.ad
.sp .6
.RS 4n
Specify a new
.B UID
for the user. It must be a non-negative decimal
integer less than
.B MAXUID
as defined in
.BR <param.h> \&.
The
\fBUID\fR associated with the user's home directory is not modified with
this option; a user will not have access to their home directory until the
\fBUID\fR is manually reassigned using \fBchown\fR(1).
.RE

.SH OPERANDS
.sp
.LP
The following operands are supported:
.sp
.ne 2
.mk
.na
.B login
.ad
.sp .6
.RS 4n
An existing login name to be modified.
.RE

.SH EXAMPLES
.LP
\fBExample 1\fR Assigning Privileges to a User
.sp
.LP
The following command adds the privilege that affects high resolution times
to a user's initial, inheritable set of privileges.

.sp
.in +2
.nf
# \fBusermod -K defaultpriv=basic,proc_clock_highres jdoe\fR
.fi
.in -2
.sp

.sp
.LP
This command results in the following entry in
.BR user_attr :

.sp
.in +2
.nf
jdoe::::type=normal;defaultpriv=basic,proc_clock_highres
.fi
.in -2

.LP
\fBExample 2\fR Removing a Privilege from a User's Limit Set
.sp
.LP
The following command removes the privilege that allows the specified user
to create hard links to directories and to unlink directories.

.sp
.in +2
.nf
# \fBusermod -K limitpriv=all,!sys_linkdir jdoe\fR
.fi
.in -2
.sp

.sp
.LP
This command results in the following entry in
.BR user_attr :

.sp
.in +2
.nf
jdoe::::type=normal;defaultpriv=basic,limitpriv=all,!sys_linkdir
.fi
.in -2

.LP
\fBExample 3\fR Removing a Privilege from a User's Basic Set
.sp
.LP
The following command removes the privilege that allows the specified user
to examine processes outside the user's session.

.sp
.in +2
.nf
# \fBusermod -K defaultpriv=basic,!proc_session jdoe\fR
.fi
.in -2
.sp

.sp
.LP
This command results in the following entry in
.BR user_attr :

.sp
.in +2
.nf
jdoe::::type=normal;defaultpriv=basic,!proc_session;limitpriv=all
.fi
.in -2

.LP
\fBExample 4\fR Assigning a Role to a User
.sp
.LP
The following command assigns a role to a user. The role must have been
created prior to this command, either through use of the Solaris Management
Console GUI or through
.BR roleadd (1M).

.sp
.in +2
.nf
# \fBusermod -R mailadm jdoe\fR
.fi
.in -2
.sp

.sp
.LP
This command results in the following entry in
.BR user_attr :

.sp
.in +2
.nf
jdoe::::type=normal;roles=mailadm;defaultpriv=basic;limitpriv=all
.fi
.in -2

.LP
\fBExample 5\fR Removing All Profiles from a User
.sp
.LP
The following command removes all profiles that were granted to a user
directly. The user will still have any rights profiles that are granted by
means of the
.B PROFS_GRANTED
key in
.BR policy.conf (4).

.sp
.in +2
.nf
# \fBusermod -P "" jdoe\fR
.fi
.in -2
.sp

.SH EXIT STATUS
.sp
.LP
In case of an error,
.B usermod
prints an error message and exits with
one of the following values:
.sp
.ne 2
.mk
.na
.B 2
.ad
.sp .6
.RS 4n
The command syntax was invalid. A usage message for the \fBusermod\fR
command is displayed.
.RE

.sp
.ne 2
.mk
.na
.B 3
.ad
.sp .6
.RS 4n
An invalid argument was provided to an option.
.RE

.sp
.ne 2
.mk
.na
.B 4
.ad
.sp .6
.RS 4n
The
.I uid
given with the
.B -u
option is already in use.
.RE

.sp
.ne 2
.mk
.na
.B 5
.ad
.sp .6
.RS 4n
The password files contain an error.
.BR pwconv (1M)
can be used to
correct possible errors. See
.BR passwd (4).
.RE

.sp
.ne 2
.mk
.na
.B 6
.ad
.sp .6
.RS 4n
The login to be modified does not exist, the
.I group
does not exist, or
the login shell does not exist.
.RE

.sp
.ne 2
.mk
.na
.B 8
.ad
.sp .6
.RS 4n
The login to be modified is in use.
.RE

.sp
.ne 2
.mk
.na
.B 9
.ad
.sp .6
.RS 4n
The
.I new_logname
is already in use.
.RE

.sp
.ne 2
.mk
.na
.B 10
.ad
.sp .6
.RS 4n
Cannot update the
.B /etc/group
or
.B /etc/user_attr
file. Other
update requests will be implemented.
.RE

.sp
.ne 2
.mk
.na
.B 11
.ad
.sp .6
.RS 4n
Insufficient space to move the home directory (\fB-m\fR option). Other
update requests will be implemented.
.RE

.sp
.ne 2
.mk
.na
.B 12
.ad
.sp .6
.RS 4n
Unable to complete the move of the home directory to the new home
directory.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/group
.ad
.sp .6
.RS 4n
system file containing group definitions
.RE

.sp
.ne 2
.mk
.na
.B /etc/datemsk
.ad
.sp .6
.RS 4n
system file of date formats
.RE

.sp
.ne 2
.mk
.na
.B /etc/passwd
.ad
.sp .6
.RS 4n
system password file
.RE

.sp
.ne 2
.mk
.na
.B /etc/shadow
.ad
.sp .6
.RS 4n
system file containing users' encrypted passwords and related information
.RE

.sp
.ne 2
.mk
.na
.B /etc/user_attr
.ad
.sp .6
.RS 4n
system file containing additional user and role attributes
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
.BR chown (1),
.BR passwd (1),
.BR users (1B),
.BR groupadd (1M),
.BR groupdel (1M),
.BR groupmod (1M),
.BR logins (1M),
.BR pwconv (1M),
.BR roleadd (1M),
.BR roledel (1M),
.BR rolemod (1M),
.BR useradd (1M),
.BR userdel (1M),
.BR getdate (3C),
.BR auth_attr (4),
.BR passwd (4),
.BR policy.conf (4),
.BR prof_attr (4),
.BR user_attr (4),
.BR attributes (5)
.SH NOTES
.sp
.LP
The
.B usermod
utility modifies
.B passwd
definitions only in the
local
.B /etc/passwd
and
.B /etc/shadow
files. If a network
nameservice such as
.B NIS
or
.B NIS+
is being used to supplement the
local files with additional entries,
.B usermod
cannot change information
supplied by the network nameservice. However
.B usermod
will verify the
uniqueness of user name and user
.B ID
against the external
nameservice.
.sp
.LP
The
.B usermod
utility uses the
.B /etc/datemsk
file, available with
SUNWaccr, for date formatting.
