usr/src/man/man1m/useradd.1m
'\" te
.\" Copyright (c) 2008 Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright 1989 AT&T
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH useradd 1M "19 Feb 2008" "SunOS 5.11" "System Administration Commands"
.SH NAME
useradd \- administer a new user login on the system
.SH SYNOPSIS
.LP
.nf
\fBuseradd\fR [\fB-A\fR \fIauthorization\fR [,\fIauthorization.\|.\|.\fR]]
     [\fB-b\fR \fIbase_dir\fR] [\fB-c\fR \fIcomment\fR] [\fB-d\fR \fIdir\fR] [\fB-e\fR \fIexpire\fR]
     [\fB-f\fR \fIinactive\fR] [\fB-g\fR \fIgroup\fR] [\fB-G\fR \fIgroup\fR [,\fIgroup\fR].\|.\|.]
     [\fB-K\fR \fIkey=value\fR] [\fB-m\fR [\fB-k\fR \fIskel_dir\fR]] [\fB-p\fR \fIprojname\fR]
     [\fB-P\fR \fIprofile\fR [,\fIprofile.\|.\|.\fR]] [\fB-R\fR \fIrole\fR [,\fIrole.\|.\|.\fR]]
     [\fB-s\fR \fIshell\fR] [\fB-u\fR \fIuid\fR [\fB-o\fR]] \fIlogin\fR
.fi

.LP
.nf
\fBuseradd\fR \fB-D\fR [\fB-A\fR \fIauthorization\fR [,\fIauthorization.\|.\|.\fR]]
     [\fB-b\fR \fIbase_dir\fR] [\fB-s\fR \fIshell\fR [\fB-k\fR \fIskel_dir\fR]] [\fB-e\fR \fIexpire\fR]
     [\fB-f\fR \fIinactive\fR] [\fB-g\fR \fIgroup\fR] [\fB-K\fR \fIkey=value\fR] [\fB-p\fR \fIprojname\fR]
     [\fB-P\fR \fIprofile\fR [,\fIprofile.\|.\|.\fR]] [\fB-R\fR \fIrole\fR [,\fIrole.\|.\|.\fR]]
.fi

.SH DESCRIPTION
.sp
.LP
\fBuseradd\fR adds a new user to the \fB/etc/passwd\fR and
\fB/etc/shadow\fR and \fB/etc/user_attr\fR files. The \fB-A\fR and \fB-P\fR
options respectively assign authorizations and profiles to the user. The
\fB-R\fR option assigns roles to a user. The \fB-p\fR option associates a
project with a user. The
.B -K
option adds a
.I key=value
pair to
\fB/etc/user_attr\fR for the user. Multiple \fIkey=value\fR pairs may be
added with multiple
.B -K
options.
.sp
.LP
\fBuseradd\fR also creates supplementary group memberships for the user
(\fB-G\fR option) and creates the home directory (\fB-m\fR option) for the
user if requested. The new login remains locked until the \fBpasswd\fR(1)
command is executed.
.sp
.LP
Specifying \fBuseradd -D\fR with the \fB-s\fR, \fB-k\fR,\fB-g\fR,
.BR -b ,
\fB-f\fR,
.BR -e ,
.BR -A ,
.BR -P ,
.BR -p ,
.BR -R ,
or
\fB-K\fR option (or any combination of these options) sets the default
values for the respective fields. See the
.B -D
option, below. Subsequent
\fBuseradd\fR commands without the \fB-D\fR option use these arguments.
.sp
.LP
The system file entries created with this command have a limit of 2048
characters per line. Specifying long arguments to several options can exceed
this limit.
.sp
.LP
\fBuseradd\fR requires that usernames be in the format described in
.BR passwd (4).
A warning message is displayed if these restrictions are
not met. See
.BR passwd (4)
for the requirements for usernames.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB-A\fR \fIauthorization\fR
.ad
.sp .6
.RS 4n
One or more comma separated authorizations defined in
.BR auth_attr (4).
Only a user or role who has
.B grant
rights to the authorization can
assign it to an account.
.RE

.sp
.ne 2
.mk
.na
\fB-b\fR \fIbase_dir\fR
.ad
.sp .6
.RS 4n
The base directory for new login home directories (see the
.B -d
option
below. When a new user account is being created,
.I base_dir
must already
exist unless the
.B -m
option or the
.B -d
option is also specified.
.RE

.sp
.ne 2
.mk
.na
\fB-c\fR \fIcomment\fR
.ad
.sp .6
.RS 4n
Any text string. It is generally a short description of the login, and is
currently used as the field for the user's full name. This information is
stored in the user's
.B /etc/passwd
entry.
.RE

.sp
.ne 2
.mk
.na
\fB-d\fR \fIdir\fR
.ad
.sp .6
.RS 4n
The home directory of the new user. It defaults to
\fIbase_dir\fR/\fIaccount_name\fR, where \fIbase_dir\fR is the base
directory for new login home directories and
.I account_name
is the new
login name.
.RE

.sp
.ne 2
.mk
.na
.B -D
.ad
.sp .6
.RS 4n
Display the default values for
.BR group ,
.BR base_dir ,
.BR skel_dir ,
.BR shell ,
.BR inactive ,
.BR expire ,
.BR proj ,
\fBprojname\fR and
\fBkey=value\fR pairs. When used with the
.BR -g ,
.BR -b ,
\fB-f\fR,
.BR -e ,
.BR -A ,
.BR -P ,
.BR -p ,
.BR -R ,
or
.B -K
options, the
\fB-D\fR option sets the default values for the specified fields. The
default values are:
.sp
.ne 2
.mk
.na
.B group
.ad
.sp .6
.RS 4n
\fBother\fR (\fBGID\fR of 1)
.RE

.sp
.ne 2
.mk
.na
.B base_dir
.ad
.sp .6
.RS 4n
.B /home
.RE

.sp
.ne 2
.mk
.na
.B skel_dir
.ad
.sp .6
.RS 4n
.B /etc/skel
.RE

.sp
.ne 2
.mk
.na
.B shell
.ad
.sp .6
.RS 4n
.B /bin/sh
.RE

.sp
.ne 2
.mk
.na
.B inactive
.ad
.sp .6
.RS 4n
.B 0
.RE

.sp
.ne 2
.mk
.na
.B expire
.ad
.sp .6
.RS 4n
null
.RE

.sp
.ne 2
.mk
.na
.B auths
.ad
.sp .6
.RS 4n
null
.RE

.sp
.ne 2
.mk
.na
\fBprofiles\fR
.ad
.sp .6
.RS 4n
null
.RE

.sp
.ne 2
.mk
.na
.B proj
.ad
.sp .6
.RS 4n
.B 3
.RE

.sp
.ne 2
.mk
.na
.B projname
.ad
.sp .6
.RS 4n
\fBdefault\fR
.RE

.sp
.ne 2
.mk
.na
\fBkey=value (pairs defined in \fBuser_attr\fR(4)\fR
.ad
.sp .6
.RS 4n
not present
.RE

.sp
.ne 2
.mk
.na
.B roles
.ad
.sp .6
.RS 4n
null
.RE

.RE

.sp
.ne 2
.mk
.na
\fB-e\fR \fIexpire\fR
.ad
.sp .6
.RS 4n
Specify the expiration date for a login. After this date, no user will be
able to access this login. The expire option argument is a date entered
using one of the date formats included in the template file
.BR /etc/datemsk .
See
.BR getdate (3C).
.sp
If the date format that you choose includes spaces, it must be quoted. For
example, you can enter
.B 10/6/90
or
.BR "October 6, 1990" .
A null value
(\fB" "\fR) defeats the status of the expired date. This option is useful
for creating temporary logins.
.RE

.sp
.ne 2
.mk
.na
\fB-f\fR \fIinactive\fR
.ad
.sp .6
.RS 4n
The maximum number of days allowed between uses of a login ID before that
\fBID\fR is declared invalid. Normal values are positive integers. A value
of
.B 0
defeats the status.
.RE

.sp
.ne 2
.mk
.na
\fB-g\fR \fIgroup\fR
.ad
.sp .6
.RS 4n
An existing group's integer
.B ID
or character-string name. Without the
\fB-D\fR option, it defines the new user's primary group membership and
defaults to the default group. You can reset this default value by invoking
.B "useradd -D"
.B -g
.IR group .
GIDs 0-99 are reserved for
allocation by the Solaris Operating System.
.RE

.sp
.ne 2
.mk
.na
\fB-G\fR \fIgroup\fR
.ad
.sp .6
.RS 4n
An existing group's integer
.B ID
or character-string name. It defines
the new user's supplementary group membership. Duplicates between
\fIgroup\fR with the \fB-g\fR and \fB-G\fR options are ignored. No more than
\fBNGROUPS_MAX\fR groups can be specified. GIDs 0-99 are reserved for
allocation by the Solaris Operating System.
.RE

.sp
.ne 2
.mk
.na
\fB-K\fR \fIkey=value\fR
.ad
.sp .6
.RS 4n
A
.I key=value
.RB "pair to add to the user's attributes. Multiple" " -K"
options may be used to add multiple
.I key=value
pairs. The generic
\fB-K\fR option with the appropriate key may be used instead of the specific
implied key options (\fB-A\fR,
.BR -P ,
.BR -R ,
.BR -p ).
See
\fBuser_attr\fR(4) for a list of valid \fIkey=value\fR pairs. The "type" key
is not a valid key for this option. Keys may not be repeated.
.RE

.sp
.ne 2
.mk
.na
\fB-k\fR \fIskel_dir\fR
.ad
.sp .6
.RS 4n
A directory that contains skeleton information (such as \fB\&.profile\fR)
that can be copied into a new user's home directory. This directory must
already exist. The system provides the
.B /etc/skel
directory that can be
used for this purpose.
.RE

.sp
.ne 2
.mk
.na
.B -m
.ad
.sp .6
.RS 4n
Create the new user's home directory if it does not already exist. If the
directory already exists, it must have read, write, and execute permissions
by
.IR group ,
where
.I group
is the user's primary group.
.RE

.sp
.ne 2
.mk
.na
.B -o
.ad
.sp .6
.RS 4n
This option allows a
.B UID
to be duplicated (non-unique).
.RE

.sp
.ne 2
.mk
.na
\fB-P\fR \fIprofile\fR
.ad
.sp .6
.RS 4n
One or more comma-separated execution profiles defined in
\fBprof_attr\fR(4).
.RE

.sp
.ne 2
.mk
.na
\fB-p\fR \fIprojname\fR
.ad
.sp .6
.RS 4n
Name of the project with which the added user is associated. See the
\fIprojname\fR field as defined in \fBproject\fR(4).
.RE

.sp
.ne 2
.mk
.na
\fB-R\fR \fIrole\fR
.ad
.sp .6
.RS 4n
One or more comma-separated execution profiles defined in
.BR user_attr (4).
Roles cannot be assigned to other roles.
.RE

.sp
.ne 2
.mk
.na
\fB-s\fR \fIshell\fR
.ad
.sp .6
.RS 4n
Full pathname of the program used as the user's shell on login. It defaults
to an empty field causing the system to use
.B /bin/sh
as the default.
The value of
.I shell
must be a valid executable file.
.RE

.sp
.ne 2
.mk
.na
\fB-u\fR \fIuid\fR
.ad
.sp .6
.RS 4n
The
.B UID
of the new user. This
.B UID
must be a non-negative
decimal integer below
.B MAXUID
as defined in
.BR <sys/param.h> \&.
The
\fBUID\fR defaults to the next available (unique) number above the highest
number currently assigned. For example, if \fBUID\fRs 100, 105, and 200 are
assigned, the next default
.B UID
number will be 201. \fBUID\fRs
\fB0\fR-\fB99\fR are reserved for allocation by the Solaris Operating
System.
.RE

.SH FILES
.sp
.LP
.B /etc/datemsk
.sp
.LP
.B /etc/passwd
.sp
.LP
.B /etc/shadow
.sp
.LP
.B /etc/group
.sp
.LP
.B /etc/skel
.sp
.LP
.B /usr/include/limits.h
.sp
.LP
.B /etc/user_attr
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
.BR passwd (1),
\fBprofiles\fR(1),
.BR roles (1),
.BR users (1B),
.BR groupadd (1M),
.BR groupdel (1M),
.BR groupmod (1M),
.BR grpck (1M),
.BR logins (1M),
.BR pwck (1M),
.BR userdel (1M),
.BR usermod (1M),
.BR getdate (3C),
.BR auth_attr (4),
.BR passwd (4),
\fBprof_attr\fR(4),
.BR project (4),
.BR user_attr (4),
.BR attributes (5)
.SH DIAGNOSTICS
.sp
.LP
In case of an error,
.B useradd
prints an error message and exits with a
non-zero status.
.sp
.LP
The following indicates that
.B login
specified is already in use:
.sp
.in +2
.nf
UX: useradd: ERROR: login is already in use. Choose another.
.fi
.in -2
.sp

.sp
.LP
The following indicates that the
.I uid
specified with the
.BR -u
option is not unique:
.sp
.in +2
.nf
UX: useradd: ERROR: uid \fIuid\fR is already in use. Choose another.
.fi
.in -2
.sp

.sp
.LP
The following indicates that the
.I group
specified with the
.BR -g
option is already in use:
.sp
.in +2
.nf
UX: useradd: ERROR: group \fIgroup\fR does not exist. Choose another.
.fi
.in -2
.sp

.sp
.LP
The following indicates that the
.I uid
specified with the
.BR -u
option is in the range of reserved \fBUID\fRs (from \fB0\fR-\fB99\fR):
.sp
.in +2
.nf
UX: useradd: WARNING: uid \fIuid\fR is reserved.
.fi
.in -2
.sp

.sp
.LP
The following indicates that the
.I uid
specified with the
.BR -u
option exceeds
.B MAXUID
as defined in
.BR <sys/param.h> :
.sp
.in +2
.nf
UX: useradd: ERROR: uid \fIuid\fR is too big. Choose another.
.fi
.in -2
.sp

.sp
.LP
The following indicates that the
.B /etc/passwd
or
.BR /etc/shadow
files do not exist:
.sp
.in +2
.nf
UX: useradd: ERROR: Cannot update system files - login cannot be created.
.fi
.in -2
.sp

.SH NOTES
.sp
.LP
The
.B useradd
utility adds definitions to only the local
.BR /etc/group ,
.BR etc/passwd ,
.BR /etc/passwd ,
.BR /etc/shadow ,
.BR /etc/project ,
and
.B /etc/user_attr
files. If a network name
service such as
.B NIS
or
.B NIS+
is being used to supplement the
local
.B /etc/passwd
file with additional entries,
.B useradd
cannot
change information supplied by the network name service. However
\fBuseradd\fR will verify the uniqueness of the user name (or role) and user
id and the existence of any group names specified against the external name
service.
