usr/src/man/man1m/utmpd.1m
'\" te
.\" Copyright (c) 2004, Sun Microsystems, Inc.  All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" Copyright 1989 AT&T
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH utmpd 1M "4 Jun 2008" "SunOS 5.11" "System Administration Commands"
.SH NAME
utmpd \- utmpx monitoring daemon
.SH SYNOPSIS
.LP
.nf
\fButmpd\fR [\fB-debug\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The
.B utmpd
daemon monitors the
.B /var/adm/utmpx
file. See
.BR utmpx (4)
(and
.BR utmp (4)
for historical information).
.sp
.LP
.B utmpd
receives requests from
.BR pututxline (3C)
by way of a named
pipe. It maintains a table of processes and uses
.BR poll (2)
on
.B /proc
files to detect process termination. When
.B utmpd
detects
that a process has terminated, it checks that the process has removed its
.B utmpx
entry from
.BR /var/adm/utmpx .
If the process'
.B utmpx
entry has not been removed,
.B utmpd
removes the entry. By periodically
scanning the
.B /var/adm/utmpx
file,
.B utmpd
also monitors processes
that are not in its table.
.SH OPTIONS
.sp
.ne 2
.mk
.na
.B -debug
.ad
.sp .6
.RS 4n
Run in debug mode, leaving the process connected to the controlling
terminal. Write debugging information to standard output.
.RE

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.sp .6
.RS 4n
Successful completion.
.RE

.sp
.ne 2
.mk
.na
.B >0
.ad
.sp .6
.RS 4n
An error occurred.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/default/utmpd
.ad
.sp .6
.RS 4n
You can set default values for the flags listed below. For example:
.B SCAN_PERIOD=600
.sp
.ne 2
.mk
.na
.B SCAN_PERIOD
.ad
.sp .6
.RS 4n
The number of seconds that
.B utmpd
sleeps between checks of
.BR /proc
to see if monitored processes are still alive. The default is 300.
.RE

.sp
.ne 2
.mk
.na
.B MAX_FDS
.ad
.sp .6
.RS 4n
The maximum number of processes that
.B utmpd
attempts to monitor. The
default value is 4096.
.RE

.sp
.ne 2
.mk
.na
.B WTMPX_UPDATE_FREQ
.ad
.sp .6
.RS 4n
The number of seconds that
.B utmpd
sleeps between read accesses of the
.B wtmpx
file. The
.B wtmpx
file's last access time is used by
.BR init (1M)
on reboot to determine when the operating system became
unavailable. The default is 60.
.RE

.RE

.sp
.ne 2
.mk
.na
.B /var/adm/utmpx
.ad
.sp .6
.RS 4n
File containing user and accounting information for commands such as
.BR who (1),
.BR write (1),
and
.BR login (1).
.RE

.sp
.ne 2
.mk
.na
.B /proc
.ad
.sp .6
.RS 4n
Directory containing files for processes whose
.B utmpx
entries are
being monitored.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.sp
.LP
.BR svcs (1),
.BR init (1M),
.BR svcadm (1M),
.BR poll (2),
.BR pututxline (3C),
.BR proc (4),
.BR utmp (4),
.BR utmpx (4),
.BR attributes (5),
.BR smf (5)
.SH NOTES
.sp
.LP
If the filesystem holding
.B /var/adm/wtmpx
is mounted with options
which inhibit or defer access time updates, an unknown amount of error will
be introduced into the
.B "utmp DOWN_TIME"
record's timestamp in the
event of an uncontrolled shutdown (for example, a crash or loss of power ).
Controlled shutdowns will update the modify time of
.BR /var/adm/wtmpx ,
which will be used on the next boot to determine when the previous shutdown
ocurred, regardless of access time deferral or inhibition.
.sp
.LP
The
.B utmpd
service is managed by the service management facility,
.BR smf (5),
under the service identifier:
.sp
.in +2
.nf
svc:/system/utmp:default
.fi
.in -2
.sp

.sp
.LP
Administrative actions on this service, such as enabling, disabling, or
requesting restart, can be performed using
.BR svcadm (1M).
The service's
status can be queried using the
.BR svcs (1)
command.
