usr/src/man/man1m/uucico.1m
'\" te
.\" Copyright 1989 AT&T  Copyright (c) 1997 Sun Microsystems, Inc.  All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH uucico 1M "19 May 1993" "SunOS 5.11" "System Administration Commands"
.SH NAME
uucico \- file transport program for the uucp system
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/uucp/uucico\fR [\fB-f\fR] [\fB-c\fR \fItype\fR] [\fB-d\fR \fIspool-directory\fR]
     [\fB-i\fR \fIinterface\fR] [\fB-r\fR \fIrole-number\fR] [\fB-s\fR \fIsystem-name\fR]
     [\fB-x\fR \fIdebug-level\fR]
.fi

.SH DESCRIPTION
.sp
.LP
.B uucico
is the file transport program for
.B uucp
work file
transfers.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -f
.ad
.RS 22n
.rt
This option is used to "force execution" of \fBuucico\fR by ignoring the
limit on the maximum number of uucicos defined in the
.BR /etc/uucp/Limits
file.
.RE

.sp
.ne 2
.mk
.na
.BI -c " type"
.ad
.RS 22n
.rt
The first field in the \fBDevices\fR file is the "Type" field.  The
\fB-c\fR option forces \fBuucico\fR to only use entries in the "Type" field
that match the user specified
.BR type .
The specified
.B type
is
usually the name of a local area network.
.RE

.sp
.ne 2
.mk
.na
.BI -d " spool-directory"
.ad
.RS 22n
.rt
This option specifies the directory
.I spool-directory
that contains the
.B uucp
work files to be transferred.  The default spool directory is
.BR /var/spool/uucp .
.RE

.sp
.ne 2
.mk
.na
.BI -i " interface"
.ad
.RS 22n
.rt
This option defines the
.I interface
used with
.BR uucico .
The
interface only affects slave mode.  Known interfaces are UNIX (default), TLI
(basic Transport Layer Interface), and TLIS (Transport Layer Interface with
Streams modules, read/write).
.RE

.sp
.ne 2
.mk
.na
.BI -r " role-number"
.ad
.RS 22n
.rt
The
.I role-number
.B 1
is used for master mode.
.I role-number
.B 0
is used for slave mode (default).  When
.B uucico
is started by a
program or
.BR cron ,
.I role-number
.B 1
should be used for master
mode.
.RE

.sp
.ne 2
.mk
.na
.BI -s " system-name"
.ad
.RS 22n
.rt
The
.B -s
option defines the remote system
.RI ( system-name )
that
.B uucico
will try to contact.  It is required when the role is master;
.I system-name
must be defined in the
.B Systems
file.
.RE

.sp
.ne 2
.mk
.na
.BI -x " debug-level"
.ad
.RS 22n
.rt
Both
.B uux
and
.B uucp
queue jobs that will be transferred by
.BR uucico .
These jobs are normally started by the
.BR uusched
scheduler, for debugging purposes, and can be started manually. For example,
the shell
.B Uutry
starts
.B uucico
with debugging turned on. The
.I debug-level
is a number between
.B 0
and
.BR 9 .
Higher numbers
give more  detailed debugging information.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/uucp/Devconfig
.ad
.RS 27n
.rt

.RE

.sp
.ne 2
.mk
.na
.B /etc/uucp/Devices
.ad
.RS 27n
.rt

.RE

.sp
.ne 2
.mk
.na
.B /etc/uucp/Limits
.ad
.RS 27n
.rt

.RE

.sp
.ne 2
.mk
.na
.B /etc/uucp/Permissions
.ad
.RS 27n
.rt

.RE

.sp
.ne 2
.mk
.na
.B /etc/uucp/Sysfiles
.ad
.RS 27n
.rt

.RE

.sp
.ne 2
.mk
.na
.B /etc/uucp/Systems
.ad
.RS 27n
.rt

.RE

.sp
.ne 2
.mk
.na
.B /var/spool/locks/*
.ad
.RS 27n
.rt

.RE

.sp
.ne 2
.mk
.na
.B /var/spool/uucp/*
.ad
.RS 27n
.rt

.RE

.sp
.ne 2
.mk
.na
.B /var/spool/uucppublic/*
.ad
.RS 27n
.rt

.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWbnuu
.TE

.SH SEE ALSO
.sp
.LP
.BR uucp (1C),
.BR uustat (1C),
.BR uux (1C),
.BR Uutry (1M),
.BR cron (1M),
.BR uusched (1M),
.BR attributes (5)
