usr/src/man/man1m/uucleanup.1m
'\" te
.\" Copyright (c) 1996, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright 1989 AT&T
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH uucleanup 1M "19 May 1993" "SunOS 5.11" "System Administration Commands"
.SH NAME
uucleanup \- uucp spool directory clean-up
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/uucp/uucleanup\fR [\fB-C\fItime\fR] [\fB-D\fItime\fR] [\fB-m\fIstring\fR]
     [\fB-o\fItime\fR] [\fB-s\fIsystem\fR] [\fB-W\fItime\fR] [\fB-x\fIdebug-level\fR] [\fB-X\fItime\fR]
.fi

.SH DESCRIPTION
.sp
.LP
\fBuucleanup\fR will scan the spool directories for old files and take
appropriate action to remove them in a useful way:
.RS +4
.TP
.ie t \(bu
.el o
Inform the requester of send/receive requests for systems that can not be
reached.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Return undeliverable mail to the sender.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Deliver
.B rnews
files addressed to the local system.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Remove all other files.
.RE
.sp
.LP
In addition, there is a provision to warn users of requests that have been
waiting for a given number of days (default 1 day). Note:
.B uucleanup
will
process as if all option
.B times
were specified to the default values unless
\fBtime\fR is specifically set.
.sp
.LP
This program is typically started by the shell
.BR uudemon.cleanup ,
which
should be started by
.BR cron (1M).
.SH OPTIONS
.sp
.ne 2
.mk
.na
\fB-C\fBtime\fR
.ad
.RS 17n
.rt
Remove any
.B C.
files greater or equal to
.B time
days old and send
appropriate information to the requester (default 7 days).
.RE

.sp
.ne 2
.mk
.na
\fB-D\fBtime\fR
.ad
.RS 17n
.rt
Remove any
.B D.
files greater or equal to
.B time
days old, make an
attempt to deliver mail messages, and execute 
.B rnews
when appropriate
(default 7 days).
.RE

.sp
.ne 2
.mk
.na
\fB-m\fIstring\fR
.ad
.RS 17n
.rt
Include
.I string
in the warning message generated by the
.B -W
option.
The default line is "See your local administrator to locate the problem".
.RE

.sp
.ne 2
.mk
.na
\fB-o\fBtime\fR
.ad
.RS 17n
.rt
Delete other files whose age is more than
.B time
days (default 2 days).
.RE

.sp
.ne 2
.mk
.na
\fB-s\fIsystem\fR
.ad
.RS 17n
.rt
Execute for
.I system
spool directory only.
.RE

.sp
.ne 2
.mk
.na
\fB-W\fBtime\fR
.ad
.RS 17n
.rt
Any
.B C.
files equal to
.B time
days old will cause a mail message to be
sent to the requester warning about the delay in contacting the remote. The
message includes the
.IR JOBID ,
and in the case of mail, the mail message. The
administrator may include a message line telling whom to call to check the
problem (\fB-m\fR option) (default 1 day).
.RE

.sp
.ne 2
.mk
.na
\fB-x\fIdebug-level\fR
.ad
.RS 17n
.rt
Produce debugging output on standard ouput.
.I debug-level
is a single digit
between 0 and 9; higher numbers give more detailed debugging information. (This
option may not be available on all systems.)
.RE

.sp
.ne 2
.mk
.na
\fB-X\fBtime\fR
.ad
.RS 17n
.rt
Any
.B X.
files greater or equal to
.B time
days old will be removed. The
\fBD.\fR files are probably not present (if they were, the \fBX.\fR could get
executed). But if there are
.B D.
files, they will be taken care of by D.
processing (default 2 days).
.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B /usr/lib/uucp
.ad
.RS 19n
.rt
directory with commands used by
.B uucleanup
internally
.RE

.sp
.ne 2
.mk
.na
.B /var/spool/uucp
.ad
.RS 19n
.rt
spool directory
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWbnuu
.TE

.SH SEE ALSO
.sp
.LP
.BR uucp (1C),
.BR uux (1C),
.BR cron (1M),
.BR attributes (5)
