usr/src/man/man1m/uusched.1m
'\" te
.\" Copyright 1989 AT&T  Copyright (c) 1997 Sun Microsystems, Inc.  All Rights Reserved.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH uusched 1M "19 May 1993" "SunOS 5.11" "System Administration Commands"
.SH NAME
uusched \- uucp file transport program scheduler
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/uucp/uusched\fR [\fB-u\fR \fIdebug-level\fR] [\fB-x\fR \fIdebug-level\fR]
.fi

.SH DESCRIPTION
.sp
.LP
.B uusched
is the  \fBuucp\fR(1C) file transport scheduler. It is
usually started by the daemon
.I uudemon.hour
that is started by
.BR cron (1M)
from an entry in user \fBuucp\fR's crontab file:
.sp
.LP
.B "11,41 * * * * /etc/uucp/uucp/uudemon.hour
.SH OPTIONS
.sp
.LP
The options are for debugging purposes only.
.I debug-level
is a number
between
.B 0
and
.BR 9 .
Higher numbers give more detailed debugging
information:
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.BI -u " debug-level"
.ad
.RS 18n
.rt
Passes the \fB-u\fI debug-level\fR option
.BR uucico (1M)
as
.BI -x " debug-level."
.RE

.sp
.ne 2
.mk
.na
.BI -x " debug-level"
.ad
.RS 18n
.rt
Outputs debugging messages from
.BR uusched .
.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/uucp/Devices
.ad
.RS 27n
.rt

.RE

.sp
.ne 2
.mk
.na
.B /etc/uucp/Permissions
.ad
.RS 27n
.rt

.RE

.sp
.ne 2
.mk
.na
.B /etc/uucp/Systems
.ad
.RS 27n
.rt

.RE

.sp
.ne 2
.mk
.na
.B /var/spool/locks/*
.ad
.RS 27n
.rt

.RE

.sp
.ne 2
.mk
.na
.B /var/spool/uucp/*
.ad
.RS 27n
.rt

.RE

.sp
.ne 2
.mk
.na
.B /var/spool/uucppublic/*
.ad
.RS 27n
.rt

.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWbnuu
.TE

.SH SEE ALSO
.sp
.LP
.BR uucp (1C),
.BR uustat (1C),
.BR uux (1C),
.BR cron (1M),
.BR uucico (1M),
.BR attributes (5)
