usr/src/man/man1m/virt-clone.1m
'\" te
.\" Copyright 2005-2006 Red Hat, Inc. Jeremy Katz (katzj@redhat.com) Option handling added by Andrew Puch (apuch@redhat.com).
.\"
.\" This manual page is based in part on material found at fedoraproject.org.
.\" This software may be freely redistributed under the terms of the
.\" GNU general public license.
.\"
.\" You should have received a copy of the GNU General Public License
.\" along with this program; if not, write to the Free Software
.\" Foundation, Inc., 675 Mass Ave, Cambridge, MA 02139, USA.
.\"
.\" Copyright (c) 2009, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH virt-clone 1M "14 Feb 2009" "SunOS 5.11" "System Administration Commands"
.SH NAME
virt-clone \- clone virtual machine images
.SH SYNOPSIS
.LP
.nf
\fB/usr/bin/virt-clone\fR [\fIoption\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The
.B virt-clone
utility is a command line tool for cloning existing
virtual machine images.
.B virt-clone
copies disk images of an existing
virtual machine and defines a new guest with an identical virtual hardware
configuration. Elements that require uniqueness are updated to avoid a clash
between old and new guests.
.sp
.LP
With appropriate command-line arguments,
.B virt-clone
can run
completely unattended, with the guest automatically starting itself as well.
This allows for easy automation of guest installs.
.sp
.LP
If you do not specify options to
.BR virt-clone ,
the command runs
interactively, prompting for input as required.
.sp
.LP
To run
.BR virt-clone ,
you must become superuser or assume the Primary
Administrator role.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB--connect\fR=\fIURI\fR
.ad
.sp .6
.RS 4n
Connect to the hypervisor at
.IR URI .
.RE

.sp
.ne 2
.mk
.na
.BR -d ,
.B --debug
.ad
.sp .6
.RS 4n
Display debugging information when running the install process.
.RE

.sp
.ne 2
.mk
.na
.B -f
.IR disk_image ,
\fB--file\fR=\fIdisk_image\fR
.ad
.sp .6
.RS 4n
Path to the file, disk partition, or logical volume to use as the backing
store for the guest's virtual disk. If the original guest has multiple
disks, this parameter must be repeated multiple times, once per disk in the
original virtual machine.
.RE

.sp
.ne 2
.mk
.na
\fB--force-copy\fR=\fItarget\fR
.ad
.sp .6
.RS 4n
Force to copy devices (for example, if
.B hdc
is a read-only CD-ROM
device, specify \fB--force-copy\fR=\fBhdc\fR)
.RE

.sp
.ne 2
.mk
.na
.BR -h ,
.B --help
.ad
.sp .6
.RS 4n
Display the help message and exit.
.RE

.sp
.ne 2
.mk
.na
\fB-m\fR \fImac_addr\fR, \fB--mac\fR=\fImac_addr\fR
.ad
.sp .6
.RS 4n
Fixed MAC address for the guest. If the keyword
.B random
is specified,
a random address will be used.
.RE

.sp
.ne 2
.mk
.na
\fB-n\fR \fIname\fR, \fB--name\fR=\fIname\fR
.ad
.sp .6
.RS 4n
Name of the new guest virtual machine instance. This must be unique among
all guests known to the hypervisor on this machine, including those not
currently active. To redefine an existing guest, use the
.BR virsh (1M)
tool to shut it down and delete it prior to running
.BR virt-clone .
This
parameter will be prompted for if omitted on the command line.
.RE

.sp
.ne 2
.mk
.na
.B --nonsparse
.ad
.sp .6
.RS 4n
Do not use a sparse file for the clone's disk image.
.RE

.sp
.ne 2
.mk
.na
.B -o
.IR original_guest ,
\fB--original\fR=\fIoriginal_guest\fR
.ad
.sp .6
.RS 4n
Name or UUID for the original guest to be cloned. This guest must be shut
down since it is not possible to safely clone active guests.
.RE

.sp
.ne 2
.mk
.na
\fB--original-xml\fR=\fIfilename\fR
.ad
.sp .6
.RS 4n
The
.B libvirt
guest XML file to use as the original guest. The guest
does not need to be defined on the
.B libvirt
connection.
.RE

.sp
.ne 2
.mk
.na
.B --preserve-data
.ad
.sp .6
.RS 4n
Preserve a new file to use as the disk image for the new guest.
.RE

.sp
.ne 2
.mk
.na
\fB-u\fR \fIUUID\fR, \fB--uuid\fR=\fIUUID\fR
.ad
.sp .6
.RS 4n
UUID for the guest; if none is specified, a random UUID is generated. If
you specify
.IR UUID ,
use a 32-digit hexadecimal number. Keep in mind that
UUIDs are intended to be unique across the entire data center, and indeed,
the world.
.RE

.SH EXAMPLES
.LP
.B Example 1
Cloning a Guest with a Single Disk
.sp
.LP
The following command clones a guest named
.BR demo ,
which has a single
disk to copy.

.sp
.in +2
.nf
# \fBvirt-clone \e
     --original demo \e
     --name newdemo \e
     --file /var/lib/xen/images/newdemo.img\fR
.fi
.in -2
.sp

.LP
.B Example 2
Cloning a Guest with Multiple Disks
.sp
.LP
The following command clones a guest named
.BR demo ,
with has multiple
disks to copy.

.sp
.in +2
.nf
# \fBvirt-clone \e
     --original demo \e
     --name newdemo \e
     --file /var/lib/xen/images/newdemo.img \e
     --file /var/lib/xen/images/newdata.img\fR
.fi
.in -2
.sp

.LP
.B Example 3
Cloning to a Device with Comparable Disk Space
.sp
.LP
The following command clones a guest to a physical device that has at least
as much disk space as had the original guest. . If the destination device is
has more space, the new guest can do a file system resize when it boots.

.sp
.in +2
.nf
# \fBvirt-clone \e
     --name demo \e
     --file /dev/HostVG/DemoVM \e
     --mac 00:16:3e:34:11:54\fR
.fi
.in -2
.sp

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWxvmu
_
Interface StabilityVolatile
.TE

.SH SEE ALSO
.sp
.LP
.BR virsh (1M),
.BR virt-install (1M),
.BR xm (1M),
.BR xVM (5),
.BR attributes (5),
.BR xVM (5)
