usr/src/man/man1m/vntsd.1m
'\" te
.\" Copyright (c) 2009, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH vntsd 1M "31 Mar 2009" "SunOS 5.11" "System Administration Commands"
.SH NAME
vntsd \- virtual network terminal server daemon for Logical Domains
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/ldoms/vntsd\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B vntsd
daemon is a server that supports connections to the Logical
Domains (LDoms) console by using
.BR telnet (1).
When a
.BR telnet
session starts,
.B vntsd
sends
.B telnet
options to the client
indicating a willingness to remotely echo characters and to suppress go
ahead.
.sp
.LP
Consoles are organized into groups by the LDoms Manager. Each console group
is assigned a unique group name and TCP port number.
.B vntsd
uses the
group's port number to export access to the consoles within that group. To
establish a connection with a console or console group, a user starts a
.BR telnet (1)
session with the corresponding group's port number.
Depending on the number of consoles within that group,
.B vntsd
does one
of two things:
.RS +4
.TP
.ie t \(bu
.el o
If there is only one console in the group,
.B vntsd
connects a session
to that LDoms console.
.RE
.RS +4
.TP
.ie t \(bu
.el o
If there are multiple consoles in the group,
.B vntsd
prompts the user
to select the console to which they would like to connect, as shown in
"Multiple-Console Options," below.
.RE
.sp
.LP
For each console,
.B vntsd
provides write access only to the first user
connecting to the console. Subsequent users connecting to the console are
allowed only to read from the console and wait for write access. When the
first user disconnects, write privileges are transferred to the next user
waiting in the queue. If a user who does not have write privileges attempts
to write to a console, the
.B vntsd
displays the following message:
.sp
.in +2
.nf
You do not have write access
.fi
.in -2

.sp
.LP
A user who has no write access can acquire write access forcibly by using
the
.B
~w
special console command, described in "Special Console
Commands," below.
.sp
.LP
.B vntsd
can be invoked only with superuser privileges or by someone in
the Primary Administrator role.
.SH OPTIONS
.sp
.LP
The options for
.B vntsd
are divided into multiple-console options and
console commands.
.SS "Multiple-Console Options"
.sp
.LP
The options listed below are supported when there are multiple LDoms
consoles in a group. The syntax for the use of these options is:
.sp
.in +2
.nf
\fI<hostname>\fR-vnts-\fI<group-name>\fR: \fI<option>\fR
.fi
.in -2

.sp
.LP
For example:
.sp
.in +2
.nf
myhost-vnts-salesgroup: h
.fi
.in -2

.sp
.LP
The
.B h
option invokes help, as described below.
.sp
.ne 2
.mk
.na
.B h
.ad
.sp .6
.RS 4n
Display the following help text:
.sp
.in +2
.nf
h -- this help
l -- list of consoles
q -- quit
c{id}, n{name} -- connect to console of domain {id} or domain name
.fi
.in -2

.RE

.sp
.ne 2
.mk
.na
.B l
.ad
.sp .6
.RS 4n
List all consoles in the group. For example:
.sp
.in +2
.nf
DOMAIN ID       DOMAIN NAME     DOMAIN STATE
0               ldg1            online
1               ldg2            connected
\&.\|.\|.             .\|.\|.             .\|.\|.
.fi
.in -2

The two domain states and their meanings are:
.sp
.ne 2
.mk
.na
.B online
.ad
.sp .6
.RS 4n
No one is connected to the console.
.RE

.sp
.ne 2
.mk
.na
.B connected
.ad
.sp .6
.RS 4n
At least one user is already connected to the console.
.RE

.RE

.sp
.ne 2
.mk
.na
.B q
.ad
.sp .6
.RS 4n
Disconnect from
.BR vntsd .
.RE

.sp
.ne 2
.mk
.na
\fBc\fI{id}\fR, n\fI{name}\fR
.ad
.sp .6
.RS 4n
Connect to specified console. Upon connection, the following message is
displayed:
.sp
.in +2
.nf
Connecting to console \fI<domain-name>\fR in group \fI<group-name>\fR
Press ~? for control options ....
.fi
.in -2

.RE

.SS "Special Console Commands"
.sp
.LP
A tilde
.RB ( ~ )
appearing as the first character of a line is an escape
signal that directs
.B vntsd
to perform a special console command. The
tilde-tilde
.RB ( ~~ )
sequence outputs a tilde. In conjunction with the
initial tilde,
.B vntsd
accepts the following special console commands:
.sp
.ne 2
.mk
.na
.B ~.
.ad
.sp .6
.RS 4n
Disconnect from the console or console group.
.RE

.sp
.ne 2
.mk
.na
.B ~w
.ad
.sp .6
.RS 4n
Force write access to the console.
.RE

.sp
.ne 2
.mk
.na
.B ~p
.ad
.sp .6
.RS 4n
Disconnect from this console, and connect to the console that precedes this
console in the list of consoles.
.RE

.sp
.ne 2
.mk
.na
.B ~n
.ad
.sp .6
.RS 4n
Disconnect from this console, and connect to the console that follows this
console in the list of consoles.
.RE

.sp
.ne 2
.mk
.na
.B ~#
.ad
.sp .6
.RS 4n
Send break.
.RE

.sp
.ne 2
.mk
.na
.B ~^B
.ad
.sp .6
.RS 4n
Send alternate break.
.RE

.sp
.ne 2
.mk
.na
.B ~?
.ad
.sp .6
.RS 4n
Display
.B vntsd
help, as follows:
.sp
.in +2
.nf
~# - Send break
~^B - Send alternate break
~. - Exit from this console
~w - Force write access
~n - Console next
~p - Console previous
~? - Help
.fi
.in -2

.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B /usr/lib/ldoms/vntsd
.ad
.sp .6
.RS 4n
Binary executable
.B vntsd
file.
.RE

.sp
.ne 2
.mk
.na
.B /usr/lib/ldoms/vntsd.xml
.ad
.sp .6
.RS 4n
Service management facility
.RB ( smf (5))
manifest file for
.BR vntsd .
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWldoms
_
Interface StabilityEvolving
.TE

.SH SEE ALSO
.sp
.LP
.BR telnet (1),
.BR svccfg (1M),
.BR usermod (1M),
.BR auth_attr (4),
.BR attributes (5),
.BR smf (5)
.SH NOTES
.sp
.LP
The
.B vntsd
is managed by the service management facility,
.BR smf (5),
under the service identifier:
.sp
.in +2
.nf
svc:/ldoms/vntsd
.fi
.in -2

.sp
.LP
You can change the following properties using the
.BR svccfg (1M)
command:
.sp
.ne 2
.mk
.na
.B vntsd/vcc_device
.ad
.sp .6
.RS 4n
Set an instance of the virtual console concentrator
.RB ( vcc )
driver to
which
.B vntsd
is connected.
.RE

.sp
.ne 2
.mk
.na
.B vntsd/listen_addr
.ad
.sp .6
.RS 4n
Set the IP address to which
.B vntsd
listens, using the following
syntax:
.sp
.in +2
.nf
vntsd/listen_addr:"\fIxxx.xxx.xxx.xxx\fR"
.fi
.in -2

\&.\|.\|.where
.I xxx.xxx.xxx.xxx
is a valid IP address. The default value
of this property is to listen on IP address 127.0.0.1. Users can connect to
a guest console over a network if the value is set to the IP address of the
control domain.
.LP
Note -
.sp
.RS 2
Enabling network access to a console has security implications. Any user
can connect to a console and for this reason it is disabled by default.
.RE
.RE

.sp
.ne 2
.mk
.na
.B vntsd/timeout_minutes
.ad
.sp .6
.RS 4n
Set timeout in minutes.
.B vntsd
.RB "will timeout (close)" " telnet"
connection if there is no activity (input or output) on the console. The
default value is 0, which disables timeout.
.RE

.sp
.ne 2
.mk
.na
.B vntsd/authorization
.ad
.sp .6
.RS 4n
Enable the authorization checking of users and roles for the domain console
or consoles that are being accessed. The default value of this property is
.B false
to maintain backward compatibility. To enable authorization
checking, use the
.BR svccfg (1M)
command to set the property value to
.BR true .
While this option is enabled,
.B vntsd
listens and accepts
connections on
.BR localhost .
If the
.B listen_addr
property specifies
an alternate IP address when this option is enabled,
.B vntsd
ignores the
alternate IP address and continues to listen on
.BR localhost .
Connections
that are initiated from other hosts will also fail. Authorizations are
available to access all consoles or console groups, or to access specific
consoles or console groups. When the
.B vntsd
service is enabled, the
following authorization is added to the authorization description database,
.BR auth_attr (4):
.sp
.in +2
.nf
solaris.vntsd.consoles:::Access All LDoms Guest Consoles::
.fi
.in -2
.sp

Add any fine-grained authorizations based on the name of the console group.
For example, if the name of the console group to be authorized is
.BR ldg1 ,
add the following entry to the
.BR auth_attr (4)
file:
.sp
.in +2
.nf
solaris.vntsd.console-ldg1:::Access Specific LDoms Guest Console::
.fi
.in -2
.sp

By default, the authorization to access all consoles is assigned to the
root user or role. The Primary Administrator (superuser) can use the
.BR usermod (1M)
command to assign the required authorization or
authorizations to other users or roles.
.sp
The following example gives user
.B user1
the authorization to access
all domain consoles:
.sp
.in +2
.nf
# \fBusermod -A "solaris.vntsd.consoles" user1\fR
.fi
.in -2
.sp

The following example gives user
.B user1
the authorization to access
the console group named
.BR ldg1 :
.sp
.in +2
.nf
# \fBusermod -A "solaris.vntsd.console-ldg1" user1\fR
.fi
.in -2
.sp

.RE

