usr/src/man/man1m/volcopy_ufs.1m
'\" te
.\" Copyright 1989 AT&T, Copyright (c) 2003, Sun Microsystems, Inc.  All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH volcopy_ufs 1M "15 Apr 2003" "SunOS 5.11" "System Administration Commands"
.SH NAME
volcopy_ufs \- make an image copy of a ufs file system
.SH SYNOPSIS
.LP
.nf
\fBvolcopy\fR [\fB-F\fR ufs] [\fIgeneric_options\fR] \fIfsname\fR \fIsrcdevice\fR \fIvolname1\fR \fIdestdevice\fR \fIvolname2\fR
.fi

.SH DESCRIPTION
.sp
.LP
.B volcopy
makes a literal copy of the
.B ufs
file system using a
blocksize matched to the device.
.SH OPTIONS
.sp
.LP
The following option is supported:
.sp
.ne 2
.mk
.na
.I generic_options
.ad
.RS 19n
.rt
options supported by the generic
.B volcopy
command. See
.BR volcopy (1M).
.RE

.SH OPERANDS
.sp
.LP
The following operands are supported:
.sp
.ne 2
.mk
.na
.I fsname
.ad
.RS 27n
.rt
represents the mount point (for example,
.BR root ,
.BR u1 ,
etc.) of the
file system being copied.
.RE

.sp
.ne 2
.mk
.na
.I srcdevice
or
.IR destdevice
.ad
.RS 27n
.rt
the disk partition specified using the raw device (for example,
.BR /dev/rdsk/cld0s8 ,
.BR /dev/rdsk/cld1s8 ,
etc.).
.RE

.sp
.ne 2
.mk
.na
.I srcdevice
and
.IR volname1
.ad
.RS 27n
.rt
the device and physical volume from which the copy of the file system is
being extracted.
.RE

.sp
.ne 2
.mk
.na
.I destdevice
and
.IR volname2
.ad
.RS 27n
.rt
the target device and physical volume.
.RE

.sp
.LP
.I fsname
and
.I volname
are limited to six or fewer characters and
recorded in the superblock.
.I volname
may be `\fB\(mi\fR\&' to use the
existing volume name.
.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 12n
.rt
Successful file system copy.
.RE

.sp
.ne 2
.mk
.na
.B non-zero
.ad
.RS 12n
.rt
An error has occurred.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B /var/adm/filesave.log
.ad
.RS 25n
.rt
a record of file systems/volumes copied
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.sp
.LP
.BR cpio (1),
.BR dd (1M),
.BR labelit (1M),
.BR volcopy (1M),
.BR attributes (5),
.BR ufs (7FS)
.SH NOTES
.sp
.LP
.B volcopy
does not support copying to tape devices. Use
.BR dd (1M)
for copying to and from tape devices.
