usr/src/man/man1m/wall.1m
'\" te
.\" Copyright (c) 2000 Sun Microsystems, Inc.  All Rights Reserved.
.\" Copyright 1989 AT&T
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH wall 1M "13 Jul 1994" "SunOS 5.11" "System Administration Commands"
.SH NAME
wall \- write to all users
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/wall\fR [\fB-a\fR] [\fB-g\fR \fIgrpname\fR] [\fIfilename\fR]
.fi

.SH DESCRIPTION
.sp
.LP
\fBwall\fR reads its standard input until an end-of-file. It then sends
this message to all currently logged-in users preceded by:
.sp
.in +2
.nf
Broadcast Message from .\|.\|.
.fi
.in -2

.sp
.LP
If \fIfilename\fR is given, then the message is read in from that file.
Normally, pseudo-terminals that do not correspond to rlogin sessions are
ignored. Thus, when using a window system, the message appears only on the
console window. However,
.B -a
will send the message even to such
pseudo-terminals.
.sp
.LP
It is used to warn all users, typically prior to shutting down the
system.
.sp
.LP
The sender must be superuser to override any protections the users may have
invoked See
.BR mesg (1).
.sp
.LP
\fBwall\fR runs \fBsetgid()\fR to the group
.BR "ID tty" ,
in order
to have write permissions on other user's terminals. See
.BR setuid (2).
.sp
.LP
\fBwall\fR will detect non-printable characters before sending them to the
user's terminal. Control characters will appear as a  "\fB ^\fR " followed
by the appropriate
.B ASCII
character; characters with the high-order bit
set will appear in "meta" notation.  For example, `\fB\e003\fR\&' is
displayed as `\fB^C\fR' and  `\fB\e372\fR\&' as  `\fBM\(miz\fR'.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -a
.ad
.RS 14n
.rt
Broadcast message to the console and pseudo-terminals.
.RE

.sp
.ne 2
.mk
.na
\fB-g\fR \fIgrpname\fR
.ad
.RS 14n
.rt
Broadcast to the users in a specified group only, per the group database
(see
.BR group (4)).
.RE

.SH ENVIRONMENT VARIABLES
.sp
.LP
If the
.B LC_*
variables (\fBLC_CTYPE\fR,
.BR LC_TIME ,
.BR LC_COLLATE ,
.BR LC_NUMERIC ,
and
.BR LC_MONETARY )
are not set in
the environment, the operational behavior of
.B wall
for each
corresponding locale category is determined by  the value of the
.BR LANG
environment variable. See
.BR environ (5).
If
.B LC_ALL
is set, its
contents are used to override both the
.B LANG
and the other
.BR LC_*
variables. If none of the above variables are set in the environment, the
"C" (U.S. style) locale determines how \fBwall\fR behaves.
.SH FILES
.sp
.LP
.B /dev/tty*
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
lw(2.75i) lw(2.75i)
lw(2.75i) lw(2.75i)
.
\fBATTRIBUTE TYPE\fR\fBATTRIBUTE VALUE\fR
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.sp
.LP
.BR mesg (1),
.BR write (1),
.BR setuid (2),
.BR attributes (5),
.BR environ (5)
.SH NOTES
.sp
.LP
\fBwall\fR displays ``Cannot send to \|.\|.\|.'' when the open on a user's
\fBtty\fR file fails.
