usr/src/man/man1m/whodo.1m
'\" te
.\" Copyright (c) 2001 Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" Copyright 1989 AT&T
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH whodo 1M "18 Jun 2003" "SunOS 5.11" "System Administration Commands"
.SH NAME
whodo \- who is doing what
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/whodo\fR [\fB-h\fR] [\fB-l\fR] [\fIuser\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The
.B whodo
command produces formatted and dated output from
information in the
.B /var/adm/utmpx
and
.B /proc/pid
files.
.sp
.LP
The display is headed by the date, time, and machine name. For each user
logged in, device name, user-ID and login time is shown, followed by a list
of active processes associated with the user-ID. The list includes the
device name, process-ID, CPU minutes and seconds used, and process name.
.sp
.LP
If
.I user
is specified, output is restricted to all sessions pertaining
to that user.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -h
.ad
.RS 6n
.rt
Suppress the heading.
.RE

.sp
.ne 2
.mk
.na
.B -l
.ad
.RS 6n
.rt
Produce a long form of output. The fields displayed are: the user's login
name, the name of the tty the user is on, the time of day the user logged in
(in \fIhours\fB:\fIminutes\fR), the idle time \(em that is, the time
since the user last typed anything (in \fIhours\fB:\fIminutes\fR), the
CPU time used by all processes and their children on that terminal (in
\fIminutes\fB:\fIseconds\fR), the CPU time used by the currently
active processes (in \fIminutes\fB:\fIseconds\fR), and the name and
arguments of the current process.
.RE

.SH EXAMPLES
.LP
.B Example 1
Using the whodo Command
.sp
.LP
The command:

.sp
.in +2
.nf
example% whodo
.fi
.in -2
.sp

.sp
.LP
produces a display like this:

.sp
.in +2
.nf
Tue Mar 12 15:48:03 1985
bailey
tty09    mcn       8:51
    tty09   28158    0:29 sh

tty52    bdr      15:23
    tty52   21688    0:05 sh
    tty52   22788    0:01 whodo
    tty52   22017    0:03 vi
    tty52   22549    0:01 sh

xt162    lee      10:20
    tty08    6748    0:01 layers
    xt162    6751    0:01 sh
    xt163    6761    0:05 sh
    tty08    6536    0:05 sh
.fi
.in -2
.sp

.SH ENVIRONMENT VARIABLES
.sp
.LP
If any of the
.B LC_*
variables (
.B LC_CTYPE,
.B LC_MESSAGES,
.B LC_TIME,
.B LC_COLLATE,
.B LC_NUMERIC,
and
.B LC_MONETARY
) (see
.BR environ (5))
are
not set in the environment, the operational behavior of
.BR tar (1)
for
each corresponding locale category is determined by the value of the
.B LANG
environment variable. If
.B LC_ALL
is set, its contents are
used to override both the
.B LANG
and the other
.B LC_*
variables. If
none of the above variables is set in the environment, the "C" (U.S. style)
locale determines how
.B whodo
behaves.
.sp
.ne 2
.mk
.na
.B LC_CTYPE
.ad
.RS 15n
.rt
Determines how
.B whodo
handles characters. When
.B LC_CTYPE
is set
to a valid value,
.B whodo
can display and handle text and filenames
containing valid characters for that locale. The
.B whodo
command can
display and handle Extended Unix code (EUC) characters where any individual
character can be 1, 2, or 3 bytes wide.
.B whodo
can also handle EUC
characters of 1, 2, or more column widths. In the "C" locale, only
characters from ISO 8859-1 are valid.
.RE

.sp
.ne 2
.mk
.na
.B LC_MESSAGES
.ad
.RS 15n
.rt
Determines how diagnostic and informative messages are presented. This
includes the language and style of the messages, and the correct form of
affirmative and negative responses. In the "C" locale, the messages are
presented in the default form found in the program itself (in most cases,
U.S. English).
.RE

.sp
.ne 2
.mk
.na
.B LC_TIME
.ad
.RS 15n
.rt
Determines how \fBwhodo\fR handles date and time formats. In the "C"
locale, date and time handling follow the U.S. rules.
.RE

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 12n
.rt
Successful completion.
.RE

.sp
.ne 2
.mk
.na
.B non-zero
.ad
.RS 12n
.rt
An error occurred.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/passwd
.ad
.RS 18n
.rt
System password file
.RE

.sp
.ne 2
.mk
.na
.B /var/adm/utmpx
.ad
.RS 18n
.rt
User access and administration information
.RE

.sp
.ne 2
.mk
.na
.B /proc/pid
.ad
.RS 18n
.rt
Contains PID
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.sp
.LP
.BR ps (1),
.BR who (1),
.BR attributes (5),
.BR environ (5)
