usr/src/man/man1m/wpad.1m
'\" te
.\" Copyright (c) 2008, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH wpad 1M "11 Mar 2008" "SunOS 5.11" "System Administration Commands"
.SH NAME
wpad \- WPA and WPA2 protocol daemon
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/inet/wpad\fR [\fB-i\fR \fIinterface\fR] [\fB-k\fR \fIpre_shared_key_name\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The
.B wpad
daemon provides common client functionality for the WiFi
Protected Access (WPA) versions 1 and 2, as defined by IEEE802.11i standard.
WPA was created by the WiFi Alliance, an industry trade group. WPA
implements the majority of the IEEE 802.11i standard, and was intended as an
intermediate measure to take the place of Wired Equivalent Privacy (WEP)
while 802.11i was prepared. WPA2 implements the full standard.
.sp
.LP
.B wpad
provides the following WPA/IEEE 802.11i features:
.RS +4
.TP
.ie t \(bu
.el o
WPA-PSK ("WPA-Personal")
.RE
.RS +4
.TP
.ie t \(bu
.el o
Key management for CCMP, TKIP, WEP104, WEP40
.RE
.sp
.LP
Stop and start the
.B wpad
daemon using
.BR dladm "(1M). Use:"
.sp
.in +2
.nf
# \fBdladm connect-wifi\fR
.fi
.in -2
.sp

.sp
.LP
\&.\|.\|.to start the
.B wpad
daemon. Use:
.sp
.in +2
.nf
# \fBdladm disconnect-wifi\fR
.fi
.in -2
.sp

.sp
.LP
\&.\|.\|.to stop the daemon.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -i
.I interface
.ad
.sp .6
.RS 4n
Specify a WiFi Link interface to start the
.B wpad
daemon.
.RE

.sp
.ne 2
.mk
.na
.B -k
.I pre_shared_key_name
.ad
.sp .6
.RS 4n
Specify the pre-shared key used for the WiFi Link.
.RE

.SH EXAMPLES
.LP
.B Example 1
Starting the
.B wpad
Daemon on Specific WiFi Link
.sp
.LP
To create the WPA key
.BR psk ,
enter the  following command:

.sp
.in +2
.nf
# \fBdladm create-secobj -c wpa psk\fR
.fi
.in -2
.sp

.sp
.LP
To use key
.B psk
to connect to ESSID
.B wlan
on link
.BR ath0 ,
enter the following command:

.sp
.in +2
.nf
# \fBdladm connect-wifi -k psk -e wlan ath0\fR
.fi
.in -2
.sp

.LP
.B Example 2
Stopping the
.B wpad
Daemon on Specific WiFi Link
.sp
.LP
To stop the daemon on the link
.BR ath0 ,
enter:

.sp
.in +2
.nf
# \fBdladm disconnect-wifi ath0\fR
.fi
.in -2
.sp

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWwpau, SUNWwpar
_
Interface StabilityUncommitted
.TE

.SH SEE ALSO
.sp
.LP
.BR svcs (1),
.BR dladm (1M),
.BR svcadm (1M),
.BR attributes (5),
.BR smf (5)
.SH NOTES
.sp
.LP
The
.B wpad
service is managed by the service management facility,
.BR smf (5),
under the service identifier:
.sp
.in +2
.nf
svc:/network/wpa:\fI<link>\fR
.fi
.in -2
.sp

.sp
.LP
Administrative actions on this service, such as enabling, disabling, or
requesting restart, can be performed using
.BR svcadm (1M).
The service's
status can be queried using the
.BR svcs (1)
command.
