usr/src/man/man1m/xenstored.1m
'\" te
.\" Copyright (c) 2007, Sun Microsystems, Inc. All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH xenstored 1M "31 Oct 2007" "SunOS 5.11" "System Administration Commands"
.SH NAME
xenstored \- xVM store daemon
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/xenstored\fR
.fi

.SH DESCRIPTION
.sp
.LP
The \fBxenstored\fR daemon provides control of the configuration of Solaris
xVM domains.
.SS "Service Management Facility Support"
.sp
.LP
The \fBxenstored\fR service is managed  by  the  service  management
facility, \fBsmf\fR(5), under the service identifier:
.sp
.in +2
.nf
svc:/system/xvm/store:default
.fi
.in -2
.sp

.sp
.LP
The service's status can be queried using the \fBsvcs\fR(1) command.
.sp
.LP
The service can be enabled successfully only when running under xVM.
.sp
.LP
At this time, attempts to restart the daemon can cause the failure of xVM
management tools as well as running domains. If the daemon needs to be
restarted, a reboot is necessary.
.SH FILES
.sp
.ne 2
.mk
.na
\fB/var/run/xenstored/tdb\fR
.ad
.RS 26n
.rt
Configuration database.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWxvmu
_
Interface StabilityVolatile
.TE

.SH SEE ALSO
.sp
.LP
\fBsvcs\fR(1), \fBsvcadm\fR(1M), \fBxend\fR(1M), \fBxm\fR(1M),
\fBattributes\fR(5), \fBsmf\fR(5), \fBxVM\fR(5)
