usr/src/man/man1m/xenstored.1m
'\" te
.\" Copyright (c) 2007, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH xenstored 1M "31 Oct 2007" "SunOS 5.11" "System Administration Commands"
.SH NAME
xenstored \- xVM store daemon
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/xenstored\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B xenstored
daemon provides control of the configuration of Solaris
xVM domains.
.SS "Service Management Facility Support"
.sp
.LP
The
.B xenstored
service is managed  by  the  service management
facility,
.BR smf (5),
under the service identifier:
.sp
.in +2
.nf
svc:/system/xvm/store:default
.fi
.in -2
.sp

.sp
.LP
The service's status can be queried using the
.BR svcs (1)
command.
.sp
.LP
The service can be enabled successfully only when running under xVM.
.sp
.LP
At this time, attempts to restart the daemon can cause the failure of xVM
management tools as well as running domains. If the daemon needs to be
restarted, a reboot is necessary.
.SH FILES
.sp
.ne 2
.mk
.na
.B /var/run/xenstored/tdb
.ad
.RS 26n
.rt
Configuration database.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWxvmu
_
Interface StabilityVolatile
.TE

.SH SEE ALSO
.sp
.LP
.BR svcs (1),
.BR svcadm (1M),
.BR xend (1M),
.BR xm (1M),
.BR attributes (5),
.BR smf (5),
.BR xVM (5)
