usr/src/man/man1m/xentop.1m
'\" te
.\" Copyright (C) International Business Machines  Corp., 2005 Author: Josh Triplett josht@us.ibm.com
.\"
.\" This program is free software; you can redistribute it and/or modify
.\" it under the terms of the GNU General Public License as published by
.\" the Free Software Foundation; under version 2 of the License.
.\"
.\" This program is distributed in the hope that it will be useful,
.\" but WITHOUT ANY WARRANTY; without even the implied warranty of
.\" MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.   See the
.\" GNU General Public License for more details.
.\"
.\" You should have received a copy of the GNU General Public License
.\" along with this program; if not, write to the Free Software
.\" Foundation, Inc., 59 Temple Place, Suite 330, Boston, MA  02111-1307 USA
.\"
.\" Portions Copyright (c) 2008, Sun Microsystems, Inc. All Rights Reserved
.TH xentop 1M "3 Mar 2008" "SunOS 5.11" "System Administration Commands"
.SH NAME
xentop \- display real-time information about an xVM system and domains
.SH SYNOPSIS
.LP
.nf
\fBxentop\fR [\fB-h\fR] [\fB-V\fR] [\fB-d\fR=\fIseconds\fR] [\fB-n\fR] [\fB-r\fR]  [\fB-v\fR] [\fB-b\fR] [\fB-i\fR=\fIiterations\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The \fBxentop\fR command displays information about the Solaris xVM system
and domains in a continually-updating way. It is analogous to the BSD UNIX
\fBtop\fR command.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB-b\fR, \fB--batch\fR
.ad
.sp .6
.RS 4n
Output data to stdout in batch mode.
.RE

.sp
.ne 2
.mk
.na
\fB-d\fR, \fB--delay\fR=\fIseconds\fR
.ad
.sp .6
.RS 4n
Set seconds between updates. The default is 3 seconds.
.RE

.sp
.ne 2
.mk
.na
\fB-h\fR, \fB--help\fR
.ad
.sp .6
.RS 4n
Display help and exit.
.RE

.sp
.ne 2
.mk
.na
\fB-i\fR, \fB--iterations\fR=\fIiterations\fR
.ad
.sp .6
.RS 4n
Maximum number of iterations \fBxentop\fR should display before
terminating.
.RE

.sp
.ne 2
.mk
.na
\fB-n\fR, \fB--networks\fR
.ad
.sp .6
.RS 4n
Display network information.
.RE

.sp
.ne 2
.mk
.na
\fB-r\fR, \fB--repeat-header\fR
.ad
.sp .6
.RS 4n
Repeat table header before each domain.
.RE

.sp
.ne 2
.mk
.na
\fB-v\fR, \fB--vcpus\fR
.ad
.sp .6
.RS 4n
Display VCPU data.
.RE

.sp
.ne 2
.mk
.na
\fB-V\fR, \fB--version\fR
.ad
.sp .6
.RS 4n
Display version information and exit.
.RE

.sp
.ne 2
.mk
.na
\fB-x\fR, \fB--vbds\fR
.ad
.sp .6
.RS 4n
Display virtual block device data.
.RE

.SH INTERACTIVE COMMANDS
.sp
.LP
The \fBxentop\fR command supports a set of interactive commands. These are
one-letter (case-insensitive) commands that you enter while \fBxentop\fR
output is displayed. They are as follows:
.sp
.ne 2
.mk
.na
\fBd\fR
.ad
.sp .6
.RS 4n
Set delay between updates.
.RE

.sp
.ne 2
.mk
.na
\fBn\fR
.ad
.sp .6
.RS 4n
Toggle display of network information.
.RE

.sp
.ne 2
.mk
.na
\fBq\fR, \fBEsc\fR
.ad
.sp .6
.RS 4n
Quit.
.RE

.sp
.ne 2
.mk
.na
\fBr\fR
.ad
.sp .6
.RS 4n
Toggle table header before each domain.
.RE

.sp
.ne 2
.mk
.na
\fBs\fR
.ad
.sp .6
.RS 4n
Cycle sort order.
.RE

.sp
.ne 2
.mk
.na
\fBv\fR
.ad
.sp .6
.RS 4n
Toggle display of VCPU information.
.RE

.sp
.ne 2
.mk
.na
\fB(arrow keys)\fR
.ad
.sp .6
.RS 4n
Scroll domain display.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWxvmu
_
Interface StabilityVolatile
.TE

.SH SEE ALSO
.sp
.LP
\fBvirsh\fR(1M), \fBxm\fR(1M), \fBattributes\fR(5), \fBxVM\fR(5)
