usr/src/man/man1m/xentop.1m
'\" te
.\" Copyright (C) International Business Machines  Corp., 2005 Author: Josh Triplett josht@us.ibm.com
.\"
.\" This program is free software; you can redistribute it and/or modify
.\" it under the terms of the GNU General Public License as published by
.\" the Free Software Foundation; under version 2 of the License.
.\"
.\" This program is distributed in the hope that it will be useful,
.\" but WITHOUT ANY WARRANTY; without even the implied warranty of
.\" MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.   See the
.\" GNU General Public License for more details.
.\"
.\" You should have received a copy of the GNU General Public License
.\" along with this program; if not, write to the Free Software
.\" Foundation, Inc., 59 Temple Place, Suite 330, Boston, MA  02111-1307 USA
.\"
.\" Portions Copyright (c) 2008, Sun Microsystems, Inc. All Rights Reserved
.TH xentop 1M "3 Mar 2008" "SunOS 5.11" "System Administration Commands"
.SH NAME
xentop \- display real-time information about an xVM system and domains
.SH SYNOPSIS
.LP
.nf
\fBxentop\fR [\fB-h\fR] [\fB-V\fR] [\fB-d\fR=\fIseconds\fR] [\fB-n\fR] [\fB-r\fR]  [\fB-v\fR] [\fB-b\fR] [\fB-i\fR=\fIiterations\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The
.B xentop
command displays information about the Solaris xVM system
and domains in a continually-updating way. It is analogous to the BSD UNIX
.B top
command.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.BR -b ,
.B --batch
.ad
.sp .6
.RS 4n
Output data to stdout in batch mode.
.RE

.sp
.ne 2
.mk
.na
\fB-d\fR, \fB--delay\fR=\fIseconds\fR
.ad
.sp .6
.RS 4n
Set seconds between updates. The default is 3 seconds.
.RE

.sp
.ne 2
.mk
.na
.BR -h ,
.B --help
.ad
.sp .6
.RS 4n
Display help and exit.
.RE

.sp
.ne 2
.mk
.na
\fB-i\fR, \fB--iterations\fR=\fIiterations\fR
.ad
.sp .6
.RS 4n
Maximum number of iterations
.B xentop
should display before
terminating.
.RE

.sp
.ne 2
.mk
.na
.BR -n ,
.B --networks
.ad
.sp .6
.RS 4n
Display network information.
.RE

.sp
.ne 2
.mk
.na
.BR -r ,
.B --repeat-header
.ad
.sp .6
.RS 4n
Repeat table header before each domain.
.RE

.sp
.ne 2
.mk
.na
.BR -v ,
.B --vcpus
.ad
.sp .6
.RS 4n
Display VCPU data.
.RE

.sp
.ne 2
.mk
.na
.BR -V ,
.B --version
.ad
.sp .6
.RS 4n
Display version information and exit.
.RE

.sp
.ne 2
.mk
.na
.BR -x ,
.B --vbds
.ad
.sp .6
.RS 4n
Display virtual block device data.
.RE

.SH INTERACTIVE COMMANDS
.sp
.LP
The
.B xentop
command supports a set of interactive commands. These are
.RB "one-letter (case-insensitive) commands that you enter while" " xentop"
output is displayed. They are as follows:
.sp
.ne 2
.mk
.na
.B d
.ad
.sp .6
.RS 4n
Set delay between updates.
.RE

.sp
.ne 2
.mk
.na
.B n
.ad
.sp .6
.RS 4n
Toggle display of network information.
.RE

.sp
.ne 2
.mk
.na
.BR q ,
.B Esc
.ad
.sp .6
.RS 4n
Quit.
.RE

.sp
.ne 2
.mk
.na
.B r
.ad
.sp .6
.RS 4n
Toggle table header before each domain.
.RE

.sp
.ne 2
.mk
.na
.B s
.ad
.sp .6
.RS 4n
Cycle sort order.
.RE

.sp
.ne 2
.mk
.na
.B v
.ad
.sp .6
.RS 4n
Toggle display of VCPU information.
.RE

.sp
.ne 2
.mk
.na
.B (arrow keys)
.ad
.sp .6
.RS 4n
Scroll domain display.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWxvmu
_
Interface StabilityVolatile
.TE

.SH SEE ALSO
.sp
.LP
.BR virsh (1M),
.BR xm (1M),
.BR attributes (5),
.BR xVM (5)
