usr/src/man/man1m/ypbind.1m
'\" te
.\" Copyright 1989 AT&T
.\" Copyright (C) 2004, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ypbind 1M "20 Dec 2007" "SunOS 5.11" "System Administration Commands"
.SH NAME
ypbind \- NIS binder process
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/netsvc/yp/ypbind\fR [\fB-broadcast\fR | \fB-ypset\fR | \fB-ypsetme\fR]
.fi

.SH DESCRIPTION
.sp
.LP
NIS provides a simple network lookup service consisting of databases and
processes. The databases are stored at the machine that runs an NIS server
process. The programmatic interface to NIS is described in
.BR ypclnt (3NSL).
Administrative tools are described in
.BR ypinit (1M),
.BR ypwhich (1),
and
.BR ypset (1M).
Tools to see the contents of NIS maps
are described in
.BR ypcat (1),
and
.BR ypmatch (1).
.sp
.LP
.B ypbind
is a daemon process that is activated at system startup time
from the
.B svc:/network/nis/client:default
service. By default, it is
invoked as
.BR "ypbind -broadcast" .
.B ypbind
runs on all client
machines that are set up to use
.BR NIS .
See
.BR sysidtool "(1M). The"
function of
.B ypbind
is to remember information that lets all
.BR NIS
client processes on a node communicate with some
.B NIS
server process.
.B ypbind
must run on every machine which has
.B NIS
client processes.
The
.B NIS
server may or may not be running on the same node, but must be
running somewhere on the network. If the
.B NIS
server is a
.BR NIS+
server in
.B NIS
(YP) compatibility mode, see the
.B NOTES
section of
the
.BR ypfiles (4)man
page for more information.
.sp
.LP
The information
.B ypbind
remembers is called a
.I binding
\(em the
association of a domain name with a
.B NIS
server. The process of binding
is driven by client requests.  As a request for  an unbound domain comes in,
if started with the
.B -broadcast
option, the
.B ypbind
process
broadcasts on the net trying to find an
.B NIS
server, either a
.B ypserv
process serving the domain or an
.B rpc.nisd
process in
"YP-compatibility mode" serving
.B NIS+
directory with name the same as
(case sensitive) the domain in the client request. Since the binding is
established by broadcasting,  there must be at least one
.B NIS
server on
the net. If started without the
.B -broadcast
.RB option, " ypbind"
process steps through the list of
.B NIS
servers that was created by
.B ypinit -c
for the requested domain. There must be an
.B NIS
server process on at least one of the hosts in the
.B NIS
servers file.
It is recommended that you list each of these NIS servers by name and
numeric IP address in
.BR /etc/hosts .
Though the practice is not
recommended, NIS allows you to list servers by numeric address only,
bypassing
.BR /etc/hosts .
In such a configuration,
.BR ypwhich (1)
returns a numeric address instead of a name.
.sp
.LP
Once a domain is bound by
.BR ypbind ,
that same binding is given to every
client process on the node. The
.B ypbind
process on the local node or a
remote node may be queried for the binding of a particular domain by using
the
.BR ypwhich (1)
command.
.sp
.LP
If
.B ypbind
is unable to speak to the
.B NIS
server process it is
bound to, it marks the domain as unbound, tells the client process that the
domain is unbound, and tries to bind the domain once again. Requests
received for an unbound domain will wait until the requested domain is
bound. In general, a bound domain is marked as unbound when the node running
the
.B NIS
server crashes or gets overloaded. In such a case,
.B ypbind
will try to bind to another
.B NIS
server using the process
described
.RB above. ypbind
also accepts requests to set its binding for a
particular domain.  The request is usually generated by the
.BR ypset (1M)
command. In order for
.B ypset
to work,
.B ypbind
must have been
invoked with flags
.B -ypset
or
.BR -ypsetme .
.SH OPTIONS
.sp
.ne 2
.mk
.na
.B -broadcast
.ad
.sp .6
.RS 4n
Send a broadcast datagram using
.B UDP/IP
that requests the information
needed to bind to a specific
.B NIS
server. This option is analogous to
.B ypbind
with no options in earlier Sun releases and is recommended for
ease of use.
.RE

.sp
.ne 2
.mk
.na
.B -ypset
.ad
.sp .6
.RS 4n
Allow users from any remote machine to change the binding by means of the
.B ypset
command. By default, no one can change the binding. This option
is insecure.
.RE

.sp
.ne 2
.mk
.na
.B -ypsetme
.ad
.sp .6
.RS 4n
Only allow
.B root
on the local machine to change the binding to a
desired server by means of the
.B ypset
command.
.B ypbind
can verify
the caller is indeed a
.B root
user by accepting such requests only on
the loopback transport. By default, no external process can change the
binding.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
\fB/var/yp/binding/\fIypdomain\fR/ypservers\fR
.ad
.sp .6
.RS 4n
Lists the servers to which the NIS client is allowed to bind.
.RE

.sp
.ne 2
.mk
.na
.B /etc/inet/hosts
.ad
.sp .6
.RS 4n
File in which it is recommended that NIS servers be listed.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWnisu
.TE

.SH SEE ALSO
.sp
.LP
.BR svcs (1),
.BR ypcat (1),
.BR ypmatch (1),
.BR ypwhich (1),
.BR ifconfig (1M),
.BR rpc.nisd (1M),
.BR svcadm (1M),
.BR ypinit (1M),
.BR ypset (1M),
.BR ypclnt (3NSL),
.BR hosts (4),
.BR ypfiles (4),
.BR attributes (5),
.BR smf (5)
.SH NOTES
.sp
.LP
.B ypbind
supports multiple domains. The
.B ypbind
process can
maintain bindings to several domains and their servers, the default domain
is the one specified by the
.BR domainname "(1M) command at startup time."
.sp
.LP
The
.B -broadcast
option works only on the
.B UDP
transport. It is
insecure since it trusts "any" machine on the net that responds to the
broadcast request and poses itself as an
.B NIS
server.
.sp
.LP
The
.B ypbind
service is managed by the service management facility,
.BR smf (5),
under the service identifier:
.sp
.in +2
.nf
svc:/network/nis/client:default
.fi
.in -2
.sp

.sp
.LP
Administrative actions on this service, such as enabling, disabling, or
requesting restart, can be performed using
.BR svcadm (1M).
The service's
status can be queried using the
.BR svcs (1)
command.
