usr/src/man/man1m/ypinit.1m
'\" te
.\" Copyright 1989 AT&T
.\" Copyright (C) 2008, Sun Microsystems, Inc. All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ypinit 1M "20 Dec 2007" "SunOS 5.11" "System Administration Commands"
.SH NAME
ypinit \- set up NIS client
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/ypinit\fR [\fB-c\fR] [\fB-m\fR] [\fB-s\fR \fImaster_server\fR]
.fi

.SH DESCRIPTION
.sp
.LP
.B ypinit
can be used to set up an
.B NIS
client system. You must be
the superuser to run this command. This script need not be used at all if
.BR ypbind (1M)
is started with the
.B -broadcast
option (it is invoked
with this option from the
.BR "svc:/network/nis/client:default service" ).
.sp
.LP
Normally,
.B ypinit
is run only once after installing the system. It may
be run whenever a new
.B NIS
server is added to the network or an
existing one is decommissioned.
.sp
.LP
.B ypinit
prompts for a list of
.B NIS
servers to bind the client to;
this list should be ordered from the closest to the furthest server. It is
recommended that you list each of these NIS servers by name and numeric IP
address in
.BR /etc/hosts .
Though the practice is not recommended, NIS
allows you to list servers by numeric address only, bypassing
.BR /etc/hosts .
In such a configuration,
.BR ypwhich (1)
returns a
numeric address instead of a name.
.sp
.LP
.B ypinit
stores the list of servers to which a client can bind in the
file \fB/var/yp/binding/\fIdomain\fR/ypservers\fR. This file is used by
.B ypbind
when run without the
.B -broadcast
option.
.SH OPTIONS
.sp
.ne 2
.mk
.na
.B -c
.ad
.sp .6
.RS 4n
Set up a
.B ypclient
system.
.RE

.sp
.ne 2
.mk
.na
.B -m
.ad
.sp .6
.RS 4n
Build a master
.B ypserver
data base.
.RE

.sp
.ne 2
.mk
.na
.B -s
.I master_server
.ad
.sp .6
.RS 4n
Slave data base.
.I master_server
must be the same master configured in
the
.B YP
maps and returned by the
.B "ypwhich -m"
command.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/hosts
.ad
.sp .6
.RS 4n
File in which it is recommended that NIS servers be listed.
.RE

.sp
.ne 2
.mk
.na
\fB/var/yp/binding/\fIdomain\fR/ypservers\fR
.ad
.sp .6
.RS 4n
Lists the servers to which the NIS client is allowed to bind.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWnisu
.TE

.SH SEE ALSO
.sp
.LP
.BR svcs (1),
.BR ypwhich (1),
.BR svcadm (1M),
.BR ypbind (1M),
.BR sysinfo (2),
.BR hosts (4),
.BR attributes (5),
.BR smf (5)
.SH NOTES
.sp
.LP
The
.B "NIS client"
service is managed by the service management facility,
.BR smf (5),
under the service identifier:
.sp
.in +2
.nf
svc:/network/nis/client:default
.fi
.in -2
.sp

.sp
.LP
Administrative actions on this service, such as enabling, disabling, or
requesting restart, can be performed using
.BR svcadm (1M).
The service's
status can be queried using the
.BR svcs (1)
command.
.SH BUGS
.sp
.LP
.B ypinit
sets up the list of
.B NIS
servers only for the current
domain on the system when it is run, that is, the domain returned by the
.B SI_SRPC_DOMAIN
command to
.BR sysinfo (2).
Care should be taken to
ensure that this is the same as the desired domain for
.B NIS
client
processes.
