usr/src/man/man1m/ypmap2src.1m
'\" te
.\" Copyright (C) 2003, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ypmap2src 1M "10 Apr 2003" "SunOS 5.11" "System Administration Commands"
.SH NAME
ypmap2src \- convert NIS maps to NIS source files
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/netsvc/yp/ypmap2src\fR [\fB-t\fR]
     [ [\fB-c\fR \fIcustom-map-name\fR]].\|.\|. [\fB-d\fR \fIdomain\fR] \fB-o\fR \fIoutput-directory\fR
     [ [ \fIsource-file\fR]].\|.\|.
.fi

.SH DESCRIPTION
.sp
.LP
Use the
.B ypmap2src
utility to convert standard NIS maps to approximations
of the equivalent NIS source files. This utility functions like the reverse of
.BR ypmake (1M).
.sp
.LP
The primary use for
.B ypmap2src
is to convert from a NIS server that uses
the NIS to LDAP(N2L) transition mechanism, which does not use NIS source files,
to traditional NIS, where source files are required. The
.B ypmap2src
utility
is also used by NIS administrators who wish to discover the contents of NIS
maps
for which the sources are not available.
.sp
.LP
Generally, this operation is not necessary. More often, administrators will
switch from traditional NIS to N2L in anticipation of the eventual transition
to
LDAP naming. When this switch is made, authoritative information is moved into
the LDAP DIT, and the NIS sources have no further role. N2L supports NIS
clients
until such time as they can be converted to LDAP, and the NIS service
suspended.
.sp
.LP
The
.B ypmap2src
utility does not guarantee that the files that are generated
are identical to the original NIS source files. Some information might have
been
thrown away by
.B ypmake
and cannot be recovered. N2L also might have updated
the maps to reflect changes made by LDAP clients. It is essential that the
sources generated are checked to confirm no problems have occurred.
.sp
.LP
Per entry comment fields, from existing source files, are not merged into
source
files generated by
.BR ypmap2src .
If a user wishes N2L to maintain comment
information, then the
.B NISLDAPmapping
configuration file should be modified
so that the comment fields are mapped into  LDAP. This will ensure that the
comments are visible to native LDAP clients and present in the N2L map files.
.sp
.LP
When
.B ypmap2src
is run, it will take up-to-date comments from the map file
and insert them into the NIS source file generated.
.SS "Handling Custom Maps"
.sp
.LP
.B ypmap2src
only knows about the standard NIS maps and standard source to
map conversion. If an advanced user has changed these, that is, the user has
modified the NIS makefile, the equivalent changes must also be made to the
.B ypmap2src
script.
.SH OPTIONS
.sp
.LP
.B ypmap2src
supports the following options:
.sp
.ne 2
.mk
.na
.B -c
.ad
.RS 18n
.rt
Specifies that
.I custom-map-name
should be converted to a source file
by running
.B "makedbm -u"
on it. This is a short cut so that simple
custom maps can be handled without editing
.BR ypmap2src .
.RE

.sp
.ne 2
.mk
.na
.B -d
.I domain-name
.ad
.RS 18n
.rt
 Specifies the domain to convert. The
.I domain-name
can be a fully qualified file path, such as
.BR /var/yp/a.b.c ,
or just a domain  	     name, a.b.c\fR. In the latter case, \fBypmaptosrc\fR looks in
.B /var/yp
for the domain directory.
.RE

.sp
.ne 2
.mk
.na
.B -o
.I dest
.ad
.RS 18n
.rt
 Specifies the destination directory for the converted files. A directory
other than
.B /etc
should be specified. The maps generated are copied to the correct location,
.BR /etc ,
.B /etc/security
or other source directory, as appropriate.
.RE

.sp
.ne 2
.mk
.na
.B -t
.ad
.RS 18n
.rt
Specifies that traditional NIS maps, without N2L's
.B LDAP_
prefix, should be
converted. By default, maps with the
.B LDAP_
prefix are converted.
.RE

.SH OPERANDS
.sp
.LP
.B ypmap2src
supports the following operands:
.sp
.ne 2
.mk
.na
.I source-file
.ad
.RS 15n
.rt
Lists the standard source files to convert. If this option is not given, then
all the standard source files, plus any custom files pecified by the
.B -c
option, are converted.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWypu
_
Interface StabilityObsolete
.TE

.SH SEE ALSO
.sp
.LP
.BR ypmake (1M),
.BR ypserv (1M),
.BR NISLDAPmapping (4),
.BR attributes (5)
.sp
.LP
\fR
