usr/src/man/man1m/ypmake.1m
'\" te
.\" Copyright (C) 2003, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright 1989 AT&T
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ypmake 1M "17 Aug 2006" "SunOS 5.11" "System Administration Commands"
.SH NAME
ypmake \- rebuild NIS database
.SH SYNOPSIS
.LP
.nf
\fBcd\fR \fB/var/yp\fR ; \fBmake\fR [\fImap\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The file called \fBMakefile\fR in
.B /var/yp
is used by
.BR make (1S)
to build the  Network Information Service (\fBNIS\fR) database. With no
arguments,
.B make
creates
.B dbm
databases for any
.B NIS
maps
that are out-of-date, and then executes \fByppush\fR(1M) to notify slave
databases that there has been a change.
.sp
.LP
If you supply a
.I map
on the command line,
.B make
will update that
map only. Typing
.B "make passwd"
will create and
.B yppush
the password
database (assuming it is out of date). Likewise,
.B "make ipnodes"
and
\fBmake networks\fR will create and \fByppush\fR the \fBipnodes\fR and
\fBnetwork\fR files, \fB$(INETDIR)/ipnodes\fR and
.BR $(DIR)/networks .
.sp
.LP
There are four special variables used by
.BR make :
.BR DIR ,
which gives
the directory of the source files;
.BR NOPUSH ,
which when non-null
inhibits doing a
.B yppush
of the new database files;
.BR INETDIR ,
which gives the directory of the
.B ipnodes
source file; and
.BR DOM ,
which is used to construct a domain other than the master's default domain.
The default for
.B DIR
is
.BR /etc ,
and the default for
.BR INETDIR
is
.BR /etc/inet .
The default for
.B NOPUSH
is the null string.
.sp
.LP
Refer to
.BR ypfiles (4)
and \fBypserv\fR(1M) for an overview of the
\fBNIS\fR service.
.sp
.LP
If a
.B NIS
to LDAP (N2L) configuration file,
.BR /var/yp/NISLDAPmapping ,
is present, the
.B NIS
server components
run in N2L mode. In N2L mode, the server components use a new set of map
files with an LDAP-prefix, based on the LDAP DIT. In N2L mode, authoritative
NIS information is obtained from the DIT. The NIS source files and
\fBypmake\fR have no role, and they should not be used. If \fBypmake\fR is
accidentally run, then the server components will detect this, and will log
a warning message. For additional information, see
.BR ypfiles (4).
.SH FILES
.sp
.ne 2
.mk
.na
.B /var/yp
.ad
.RS 19n
.rt
Directory containing
.B NIS
configuration files.
.RE

.sp
.ne 2
.mk
.na
.B /etc/inet/hosts
.ad
.RS 19n
.rt
System hosts file.
.RE

.sp
.ne 2
.mk
.na
.B /etc
.ad
.RS 19n
.rt
Default directory for source files.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWypu
_
Interface StabilityEvolving
.TE

.SH SEE ALSO
.sp
.LP
.BR make (1S),
.BR nis+ (1),
.BR makedbm (1M),
.BR rpc.nisd (1M),
.BR ypbind (1M),
.BR yppush (1M),
.BR ypserv (1M),
.BR ypclnt (3NSL),
.BR NISLDAPmapping (4),
.BR ypfiles (4),
.BR ypserv (4)
.SH NOTES
.sp
.LP
The
.B NIS
makefile is only used when running the
.BR ypserv (1M)
server to provide
.B NIS
services. If these are being provided by the
\fBNIS+\fR server running in \fBNIS\fR compatibility mode, see
.BR rpc.nisd (1M);
this makefile is not relevant.  See
.BR ypfiles (4)
for more details.
.sp
.LP
The Network Information Service (\fBNIS\fR) was formerly known as Sun
Yellow Pages
.RB ( YP ).
The functionality of the two remains the same.
Only the name has changed. The name Yellow Pages is a registered trademark
in the United Kingdom of British Telecommunications plc, and may not be used
without permission.
