usr/src/man/man1m/yppush.1m
'\" te
.\" Copyright (c) 2000, Sun Microsystems, Inc.  All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH yppush 1M "26 Aug 1999" "SunOS 5.11" "System Administration Commands"
.SH NAME
yppush \- force propagation of changed NIS map
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/netsvc/yp/yppush\fR [\fB-v\fR] [\fB-h\fR \fIhost\fR] [\fB-d\fR \fIdomain\fR]
     [\fB-p\fR \fI#parallel-xfrs\fR] \fImapname\fR
.fi

.SH DESCRIPTION
.sp
.LP
.B yppush
copies a new version of a  Network Information Service
(\fBNIS\fR) map from the master \fBNIS\fR server to the slave \fBNIS\fR
servers. It is normally run only on the master
.B NIS
server by the
.B Makefile
in
.B /var/yp
after the master databases are changed. It
first constructs a list of
.B NIS
server hosts by reading the
.BR NIS
.B ypservers
map within the
.IR domain .
Keys within the
.BR ypservers
map are the
.B ASCII
names of the machines on which the
.B NIS
servers
run.
.sp
.LP
A "transfer map" request is sent to the \fBNIS\fR server at each host,
along with the information needed by the transfer agent (the program that
actually moves the map) to call back the
.BR yppush .
When the attempt has
completed (successfully or not), and the transfer agent has sent
.B yppush
a status message, the results can be printed to
.BR stdout .
Messages are also printed when a transfer is not possible, for instance,
when the request message is undeliverable, or when the timeout period on
responses has expired.
.sp
.LP
Refer to
.BR ypfiles (4)
and \fBypserv\fR(1M) for an overview of the
.B NIS
service.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -d
.I domain
.ad
.RS 21n
.rt
Specifies a
.IR domain .
.RE

.sp
.ne 2
.mk
.na
.B -h
.I host
.ad
.RS 21n
.rt
Propagates only to the named
.IR host .
.RE

.sp
.ne 2
.mk
.na
.B -p
.I #parallel-xfrs
.ad
.RS 21n
.rt
Allows the specified number of map transfers to occur in parallel.
.RE

.sp
.ne 2
.mk
.na
.B -v
.ad
.RS 21n
.rt
Verbose.  This prints messages when each server is called, and for each
response. If this flag is omitted, only error messages are printed.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B /var/yp
.ad
.sp .6
.RS 4n
Directory where
.B NIS
configuration files reside.
.RE

.sp
.ne 2
.mk
.na
\fB/var/yp/\fIdomain\fR/ypservers.\|{\fIdir\fR,\fI pag\|\fR}\fR
.ad
.sp .6
.RS 4n
Map containing list of
.B NIS
servers to bind to when running in server
mode.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWypu
.TE

.SH SEE ALSO
.sp
.LP
.BR ypserv (1M),
.BR ypxfr (1M),
.BR ypfiles (4),
.BR attributes (5)
.SH NOTES
.sp
.LP
The Network Information Service (\fBNIS\fR) was formerly known as Sun
Yellow Pages
.RB ( YP ).
The functionality of the two remains the same; only
the name has changed. The name Yellow Pages is a registered trademark in the
United Kingdom of British Telecommunications PLC, and must not be used
without permission.
.SH BUGS
.sp
.LP
In the current implementation (version 2
.B NIS
protocol), the transfer
agent is \fBypxfr\fR(1M), which is started by the \fBypserv\fR program. If
.B yppush
detects that it is speaking to a version 1
.B NIS
protocol
.RB "server, it uses the older protocol, sending a version 1" " YPPROC_GET"
request and issues a message to that effect. Unfortunately, there is no way
of knowing if or when the map transfer is performed for version 1 servers.
\fByppush\fR prints a message saying that an "old-style" message has been
sent. The system administrator should later check to see that the transfer
has actually taken place.
