usr/src/man/man1m/ypserv.1m
'\" te
.\" Copyright (C) 2004, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ypserv 1M "15 Dec 2004" "SunOS 5.11" "System Administration Commands"
.SH NAME
ypserv, ypxfrd \- NIS server and binder processes
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/netsvc/yp/ypserv\fR [\fB-dv\fR] [\fB-i\fR | \fB-I\fR] [\fB-r\fR | \fB-R\fR]
.fi

.LP
.nf
\fB/usr/lib/netsvc/yp/ypxfrd\fR
.fi

.SH DESCRIPTION
.sp
.LP
The Network Information Service
.RB ( NIS )
provides a simple network lookup
service consisting of databases and processes. The databases are
.B ndbm
files
in a directory tree rooted at
.BR /var/yp .
See
.BR ndbm (3C).
These files are
described in
.BR ypfiles (4).
The processes are
.BR /usr/lib/netsvc/yp/ypserv ,
the
.B NIS
database lookup server, and
.BR /usr/lib/netsvc/yp/ypbind ,
the
.B NIS
binder. The programmatic interface to the
.B NIS
service is
described in
.BR ypclnt "(3NSL). Administrative tools are described in"
.BR yppoll (1M),
.BR yppush (1M),
.BR ypset (1M),
.BR ypxfr (1M),
and
.BR ypwhich (1).
Tools to see the contents of
.B NIS
maps are described in
.BR ypcat (1),
and
.BR ypmatch (1).
Database generation and maintenance tools
are described in
.BR ypinit (1M),
.BR ypmake (1M),
and
.BR makedbm (1M).
.sp
.LP
The
.B ypserv
utility is a daemon process typically activated at system
startup from
.BR svc:/network/nis/server:default .
Alternatively, you can, as
the root user, start
.B NIS
services using
.BR ypstart (1M)
from the
command-line.
.B ypserv
runs only on
.B NIS
server machines with a complete
.B NIS
database. You can halt all
.B NIS
services using the
.BR ypstop (1M)
command.
.sp
.LP
The
.BR ypxfrd " utility transfers entire "
.B NIS
maps in an efficient manner.
For systems that use this daemon, map transfers are 10 to 100 times faster,
depending on the map. To use this daemon, be sure
.B ypxfrd
is running on the
master server. See
.BR /usr/lib/netsvc/yp/ypstart .
.B ypxfr
attempts to use
.B ypxfrd
first. If that fails, it prints a warning, then uses the older
transfer method.
.sp
.LP
The
.B ypserv
daemon's primary function is to look up information in its
local database of
.B NIS
maps.
.sp
.LP
The operations performed by
.B ypserv
are defined for the implementor by the
.IR "YP Protocol Specification" ,
and for the programmer by the header file
.RB < rpcsvc/yp_prot.h >.
.sp
.LP
Communication to and from
.B ypserv
is by means of
.B RPC
calls. Lookup
functions are described in
.BR ypclnt "(3NSL), and are supplied as C-callable"
functions in the
.BR libnsl (3LIB)
library. There are four lookup functions, all
of which are performed on a specified map within some
.B NIS
domain:
.BR yp_match (3NSL),
.BR yp_first (3NSL),
.BR yp_next (3NSL),
and
.BR yp_all (3NSL).
The
.B yp_match
operation takes a key, and returns the
associated value. The
.B yp_first
operation returns the first key-value pair
from the map, and
.B yp_next
can be used to enumerate the remainder.
.B yp_all
ships the entire map to the requester as the response to a single
.B RPC
request.
.sp
.LP
A number of special keys in the
.B DBM
files can alter the way in which
.B ypserv
operates. The keys of interest are:
.sp
.ne 2
.mk
.na
.B YP_INTERDOMAIN
.ad
.RS 21n
.rt
The presence of this key causes
.B ypserv
to forward to a
.B DNS
server
host lookups that cannot be satisfied by the
.B DBM
files.
.RE

.sp
.ne 2
.mk
.na
.B YP_SECURE
.ad
.RS 21n
.rt
This key causes
.B ypserv
to answer only questions coming from clients on
reserved ports.
.RE

.sp
.ne 2
.mk
.na
.BI YP_MULTI_ hostname
.ad
.RS 21n
.rt
This is a special key in the form, \fBYP_MULTI_\fIhostname addr1,.\|.\|.,addrN.\fR A client looking for
.I hostname
receives the closest
address.
.RE

.sp
.LP
Two other functions supply information about the map, rather than map entries:
.BR yp_order (3NSL),
and
.BR yp_master (3NSL).
In fact, both order number and
master name exist in the map as key-value pairs, but the server will not return
either through the normal lookup functions. If you examine the map with
.BR makedbm (1M),
however, they are visible. Other functions are used within the
.B NIS
service subsystem itself, and are not of general interest to
.B NIS
clients. These functions include
.BR do_you_serve_this_domain? ,
.BR transfer_map ,
and
.BR reinitialize_internal_state .
.sp
.LP
On start up,
.B ypserv
checks for the existence of the NIS to LDAP (N2L)
configuration file
.BR /var/yp/NISLDAPmapping .
If it is present then a master
server starts in N2L mode. If the file is not present it starts in "traditional"
(non N2L) mode. Slave servers always start in traditional mode.
.sp
.LP
In N2L mode, a new set of map files, with an
.B LDAP_
prefix, are generated,
based on the contents of the LDAP DIT. The old map files, NIS source files and
.BR ypmake (1M)
are not used.
.sp
.LP
It is possible that
.BR ypmake (1M)
can be accidentally run in N2L mode. If the
occurs, the old style map files are overwritten. That the map files are
overwritten is harmless. However, any resulting
.BR yppush (1M)
operation will
push information based on the DIT rather than the source files. The user may
not
expect information based on the DIT.
.B ypserv
keeps track of the last
modification date of the old style map files. If the map files have been
updated,
a warning is logged that suggests that the user call
.B yppush
directly
instead of
.BR ypmake .
.sp
.LP
If a server attempts to run in N2L mode and a LDAP server cannot be contacted,
it behaves as follows:
.RS +4
.TP
1.
When
.B ypserv
is started, a warning will be logged.
.RE
.RS +4
.TP
2.
When a NIS read access is made and the TTL entry has expired, a warning is
logged.Information that is returned from the cache has not been updated.
.RE
.RS +4
.TP
3.
When a NIS write access is made, a warning is logged. The cache will not be
updated, and a NIS failure will be returned.
.RE
.sp
.LP
If
.B ypxfrd
is running in N2L mode and is asked to transfer a map,
.B ypxfrd
first checks whether the map is out of date. If the map is out of
.RB "date, " ypxfrd " initiates an update from the DIT. " ypxfrd " cannot wait for"
.RB "the update to complete. If " ypxfrd " waited, the client end " ypxfr 
operation could time out. To prevent
.B ypxfrd
from timing out, the existing
map is transferred from the cache. The most up to date map will be transferred
on
subsequent
.B ypxfrd
operations.
.SH OPTIONS
.SS "ypserv"
.sp
.ne 2
.mk
.na
.B -d
.ad
.RS 7n
.rt
The
.B NIS
service should go to the
.B DNS
for more host information. This
requires the existence of a correct
.B /etc/resolv.conf
file pointing to a
.B DNS
server. This option turns on
.B DNS
forwarding regardless of whether
or not the
.B YP_INTERDOMAIN
flag is set in the
.B hosts
maps. See
.BR makedbm (1M).
.RB "In the absence of an " /etc/resolv.conf " file, " ypserv 
complains, but ignores the
.B -d
option.
.RE

.sp
.ne 2
.mk
.na
.B -i
.ad
.RS 7n
.rt
If in N2L mode, initialize the NIS related parts of the
.B DIT
based on the
current, non
.B LDAP_
prefixed, map files. The
.B LDAP_
prefixed maps are
not created or updated. If you require that
.B LDAP_
prefixed maps be updated
or created, then use the
.B -ir
option.
.sp
The
.B -i
option does not attempt to create any NIS domain or container
objects. If any NIS domain or container objects have not already been created,
then errors will occur, as entries are written to nonexistent containers.
.RE

.sp
.ne 2
.mk
.na
.B -I
.ad
.RS 7n
.rt
Identical to
.BR -i ,
except that any missing domain and container objects are
created.
.RE

.sp
.ne 2
.mk
.na
.B -r
.ad
.RS 7n
.rt
If in N2L mode, then refresh the
.B LDAP_
prefixed map files based on the
contents of the
.BR DIT .
.RE

.sp
.ne 2
.mk
.na
.B -ir
.ad
.RS 7n
.rt
If both
.B -i
and
.B -r
are specified in N2L mode, then the
.B DIT
will
first be initialized from the current non
.B LDAP_
prefixed map files. A new
set of
.B LDAP_
prefixed maps will then be generated from the contents of the
.BR DIT .
A new set of
.B LDAP_
prefixed maps is required when moving from
traditional NIS to N2L mode NIS.
.RE

.sp
.ne 2
.mk
.na
.B -Ir
.ad
.RS 7n
.rt
Identical to
.BR -ir ,
except that any missing domain and container objects are
created.
.RE

.sp
.ne 2
.mk
.na
.B -v
.ad
.RS 7n
.rt
Operate in the verbose mode, printing diagnostic messages to stderr.
.RE

.sp
.LP
When run with the
.BR -i ,
.BR -r ,
.BR -I ,
.B -ir
or
.B -Ir
options,
the
.B ypserv
command runs in the foreground and exits once map initialization
has been completed. Once the
.B ypserv
command exits, the user knows the maps
are ready and can restart
.B ypserv
and the other
.B yp
daemons by running
.BR ypstart (1M).
.sp
.LP
If there is a requirement to initialize the
.B DIT
from the NIS source files,
which may have been modified since the maps were last remade, run
.B ypmake
before running
.B "ypserv -i"
or
.BR "ypserv -ir" .
.B ypmake
regenerated old style NIS maps. Then
.B "ypserv -ir"
dumps them into the
.BR DIT .
When the
.B -ir
option is used, the
.B LDAP_
prefixe maps are
also generated or updated. Since these maps will be more recent than the old
style maps,
.B ypmake
will not be reported as erroneous when it is run.
.SH FILES
.sp
.ne 2
.mk
.na
.B /var/yp/securenets
.ad
.sp .6
.RS 4n
Defines the hosts and networks that are granted access to information in the
served domain. It is read at startup time by both
.B ypserv
and
.BR ypxfrd .
.RE

.sp
.ne 2
.mk
.na
.B /var/yp/ypserv.log
.ad
.sp .6
.RS 4n
If the
.B /var/yp/ypserv.log
file exists when
.B ypserv
starts up, log
information is written to it when error conditions arise.
.RE

.sp
.ne 2
.mk
.na
.B /var/yp/binding/domainname/ypservers
.ad
.sp .6
.RS 4n
Lists the
.B NIS
server hosts that
.B ypbind
can bind to.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWypu
.TE

.SH SEE ALSO
.sp
.LP
.BR svcs (1),
.BR ypcat (1),
.BR ypmatch (1),
.BR ypwhich (1),
.BR domainname (1M),
.BR makedbm (1M),
.BR svcadm (1M),
.BR ypbind (1M),
.BR ypinit (1M),
.BR ypmake (1M),
.BR yppoll (1M),
.BR yppush (1M),
.BR ypset (1M),
.BR ypstart (1M),
.BR ypstop (1M),
.BR ypxfr (1M),
.BR ndbm (3C),
.BR ypclnt (3NSL),
.BR libnsl (3LIB),
.BR NISLDAPmapping (4),
.BR securenets (4),
.BR ypfiles (4),
.BR ypserv (4),
.BR attributes (5),
.BR smf (5)
.sp
.LP

.sp
.LP
\fR
.SH NOTES
.sp
.LP
.B ypserv
supports multiple domains. The
.B ypserv
process determines the
domains it serves by looking for directories of the same name in the directory
.BR /var/yp .
It replies to all broadcasts requesting yp service for that
domain.
.sp
.LP
The Network Information Service
.RB ( NIS )
was formerly known as Sun Yellow
Pages
.RB ( YP ).
The functionality of the two remains the same; only the name
has changed. The name Yellow Pages is a registered trademark in the United
Kingdom of British Telecommunications PLC, and must not be used without
permission.
.sp
.LP
.B NIS
uses
.B ndbm()
files to store maps. Therefore, it is subject to the
1024 byte limitations described in the USAGE and NOTES sections of the
.BR ndbm (3C)
man page.
.sp
.LP
The NIS server service is managed by the service management facility,
.BR smf (5),
under the service identifier:
.sp
.in +2
.nf
svc:/network/nis/server:default
.fi
.in -2
.sp

.sp
.LP
Administrative actions on this service, such as enabling, disabling, or
requesting restart, can be performed using
.BR svcadm (1M).
The service's status
can be queried using the
.BR svcs (1)
command.
