usr/src/man/man1m/ypset.1m
'\" te
.\" Copyright (c) 2000 Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright 1989 AT&T
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ypset 1M "14 Sep 1992" "SunOS 5.11" "System Administration Commands"
.SH NAME
ypset \- point ypbind at a particular server
.SH SYNOPSIS
.LP
.nf
\fB/usr/sbin/ypset\fR [\fB-d\fR \fIypdomain\fR] [\fB-h\fR \fIhost\fR] \fIserver\fR
.fi

.SH DESCRIPTION
.sp
.LP
In order to run
.BR ypset ,
.B ypbind
must be initiated with the
\fB\(miypset\fR or \fB\(miypsetme\fR options. See
.BR ypbind (1M).
.B ypset
tells
.B ypbind
to get NIS services for the specified
.I ypdomain
from the
.B ypserv
process running on
.IR server .
If
.I server
is down, or is not running
.BR ypserv ,
this might not be
discovered until an NIS client process tries to obtain a binding for the
domain. At this point, the binding set by
.B ypset
is tested by
.BR ypbind .
If the binding is invalid,
.B ypbind
attempts to rebind for
the same domain.
.sp
.LP
.B ypset
is useful for binding a client node that is not on a broadcast
net, or is on a broadcast net that is not running an NIS server host. It is
also useful for debugging NIS client applications, for instance, where an
NIS map exists only at a single NIS server host.
.sp
.LP
Where several hosts on the local net are supplying NIS services,
.B ypbind
can rebind to another host, even while you attempt to find out
if the
.B ypset
operation succeeded.  For example, if you enter the
.B ypset
command below, you might get the subsequent response from
.BR ypwhich :
.sp
.in +2
.nf
example% ypset host1
example% ypwhich
host2
.fi
.in -2
.sp

.sp
.LP
The sequence shown above is a function of the NIS subsystem's attempt to
.RB "load-balance among the available NIS servers, and occurs when" " host1"
does not respond to
.B ypbind
because it is not running
.B ypserv
(or
is overloaded), and
.BR host2 ,
running
.BR ypserv ,
obtains the
binding.
.sp
.LP
.I server
indicates which NIS server to bind to, and must be specified
as a name or an IP address. This works only if the node has a current valid
binding for the domain in question and
.B ypbind
has been set to allow
use of
.BR ypset .
In most cases,
.I server
should be specified as an IP
address.
.sp
.LP
.B ypset
tries to bind over a connectionless transport. The NIS library
call,
.BR yp_all() ,
uses connection-oriented transport and derives the NIS
server's address  based on the connectionless address supplied by
.BR ypset .
.sp
.LP
Refer to
.BR ypfiles (4)
for an overview of the NIS name service.
.SH OPTIONS
.sp
.ne 2
.mk
.na
.BI -d " ypdomain"
.ad
.RS 15n
.rt
Use
.IR ypdomain ,
instead of the default domain.
.RE

.sp
.ne 2
.mk
.na
.BI -h " host"
.ad
.RS 15n
.rt
Set
.BR ypbind "'s binding on"
.IR host ,
instead of locally. Specify
.I host
as a name.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWnisu
.TE

.SH SEE ALSO
.sp
.LP
.BR ypwhich (1),
.BR ypfiles (4),
.BR attributes (5)
