usr/src/man/man1m/ypxfr.1m
'\" te
.\" Copyright (c) 2000 Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright 1989 AT&T
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ypxfr 1M "11 Mar 1998" "SunOS 5.11" "System Administration Commands"
.SH NAME
ypxfr, ypxfr_1perday, ypxfr_1perhour, ypxfr_2perday \- transfer NIS map
from a NIS server to host
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/netsvc/yp/ypxfr\fR [\fB-c\fR] [\fB-f\fR] [\fB-C\fR \fItid\fR \fIprog\fR \fIserver\fR]
     [\fB-d\fR \fIypdomain\fR] [\fB-h\fR \fIhost\fR] [\fB-s\fR \fIypdomain\fR] \fImapname\fR
.fi

.SH DESCRIPTION
.sp
.LP
The \fBypxfr\fR command moves an \fBNIS\fR map in the default domain for
the local host to the local host by making use of normal
.B NIS
services.
It creates a temporary map in the directory \fB/var/yp/\fIypdomain\fR
(this directory must already exist;
.I ypdomain
is the default domain for
the local host), fills it by enumerating the map's entries, fetches the map
parameters (master and order number), and loads them. It then deletes any
old versions of the map and moves the temporary map to the real
.IR name .
.sp
.LP
If run interactively, \fBypxfr\fR writes its output to the terminal.
However, if it is started without a controlling terminal, and if the log
file \fB/var/yp/ypxfr.log\fR exists, it appends all its output to that file.
Since \fBypxfr\fR is most often run from the privileged user's \fBcrontab\fR
file, or by
.BR ypserv ,
the log file can retain a record of what was
attempted, and what the results were.
.sp
.LP
For consistency between servers, \fBypxfr\fR should be run periodically for
every map in the
.B NIS
data base. Different maps change at different
rates: a map might not change for months at a time, for instance, and can
therefore be checked only once a day. Some maps might change several times
per day. In such a case, you might want to check hourly for updates. A
.BR crontab (1)
entry can be used to automatically perform periodic
updates. Rather than having a separate
.B crontab
entry for each map, you
can group commands to update several maps in a shell script. Examples
(mnemonically named) are in
.BR /usr/sbin/yp :
\fBypxfr_1perday\fR,
\fBypxfr_2perday\fR, and \fBypxfr_1perhour\fR.
.sp
.LP
Refer to
.BR ypfiles (4)
for an overview of the NIS name service.
.SH OPTIONS
.sp
.ne 2
.mk
.na
.B -c
.ad
.RS 22n
.rt
Do not send a "Clear current map" request to the local \fBypserv\fR
process. Use this flag if
.B ypserv
is not running locally at the time
you are running
.BR ypxfr .
Otherwise, \fBypxfr\fR complains that it cannot
communicate with the local
.BR ypserv ,
and the transfer fails.
.RE

.sp
.ne 2
.mk
.na
\fB-f\fR
.ad
.RS 22n
.rt
Force the transfer to occur even if the version at the master is not more
recent than the local version.
.RE

.sp
.ne 2
.mk
.na
\fB-C\fI tid prog server\fR
.ad
.RS 22n
.rt
This option is for use
.I only
by
.BR ypserv .
When
.B ypserv
starts
\fBypxfr\fR, it specifies that \fBypxfr\fR should call back a \fByppush\fR
process at the host
.IR server ,
registered as program number
.IR prog ,
and waiting for a response to transaction
.IR tid .
.RE

.sp
.ne 2
.mk
.na
.BI -d " ypdomain"
.ad
.RS 22n
.rt
Specify a domain other than the default domain.
.RE

.sp
.ne 2
.mk
.na
\fB-h\fR \fIhost\fR
.ad
.RS 22n
.rt
Get the map from
.IR host ,
regardless of the master. If
.I host
is not
specified, \fBypxfr\fR asks the \fBNIS\fR service for the name of the
master, and tries to get the map from there.
.I host
must be a valid host
name.
.RE

.sp
.ne 2
.mk
.na
.BI -s " ypdomain"
.ad
.RS 22n
.rt
Specify a source domain from which to transfer a map that should be the
same across domains.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
\fB/var/yp/ypxfr.log\fR
.ad
.sp .6
.RS 4n
Log file
.RE

.sp
.ne 2
.mk
.na
\fB/usr/lib/netsvc/yp/ypxfr_1perday\fR
.ad
.sp .6
.RS 4n
Script to run one transfer per day, for use with \fBcron\fR(1M)
.RE

.sp
.ne 2
.mk
.na
\fB/usr/lib/netsvc/yp/ypxfr_2perday\fR
.ad
.sp .6
.RS 4n
Script to run two transfer per day, for use with \fBcron\fR(1M)
.RE

.sp
.ne 2
.mk
.na
\fB/usr/lib/netsvc/yp/ypxfr_1perhour\fR
.ad
.sp .6
.RS 4n
Script for hourly transfers of volatile maps
.RE

.sp
.ne 2
.mk
.na
\fB/var/yp/\fIypdomain\fR
.ad
.sp .6
.RS 4n
\fBNIS\fR domain
.RE

.sp
.ne 2
.mk
.na
.B /usr/spool/cron/crontabs/root
.ad
.sp .6
.RS 4n
Privileged user's
.B crontab
file
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.SS "ypxfr Only"
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWnisu
.TE

.SS "ypxfr_1perday, ypxfr_1perhour, and ypxfr_2perday"
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWypu
.TE

.SH SEE ALSO
.sp
.LP
.BR crontab (1),
.BR cron (1M),
.BR ypinit (1M),
.BR yppush (1M),
.BR ypserv (1M),
\fBypfiles\fR(4), \fBattributes\fR(5)
