usr/src/man/man1m/zdump.1m
'\" te
.\" Copyright (c) 2000 Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright 1989 AT&T
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH zdump 1M "3 Jan 2006" "SunOS 5.11" "System Administration Commands"
.SH NAME
zdump \- time zone dumper
.SH SYNOPSIS
.LP
.nf
\fBzdump\fR [\fB--\fIversion\fR] [\fB-v\fR] [\fB-c\fR [\fIloyear\fR,]\fIhiyear\fR] [\fIzonename\fR]...
.fi

.SH DESCRIPTION
.sp
.LP
The
.B zdump
command prints the current time for each time zone
(\fIzonename\fR) listed on the command line. Specify \fIzonename\fR as the
name of the time zone database file relative to
.BR /usr/share/lib/zoneinfo .
.sp
.LP
Specifying an invalid time zone (\fIzonename\fR) to
.B zdump
does not
return an error, rather
.B zdump
uses
.B GMTO.
This is consistent with
the behavior of the library calls;
.B zdump
reflects the same behavior of
the time routines in
.BR libc .
See
.BR ctime "(3C) and"
.BR mktime (3C).
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB--\fIversion\fR
.ad
.RS 22n
.rt
Outputs version information and exits.
.RE

.sp
.ne 2
.mk
.na
.B -v
.ad
.RS 22n
.rt
Displays the entire contents of the time zone database file for
.IR zonename .
Prints the time at the lowest possible time value; the time
one day after the lowest possible time value; the times both one second
before and exactly at each time at which the rules for computing local time
change; the time at the highest possible time value; and the time at one day
less than the highest possible time value. See
.BR mktime (3C)
and
.BR ctime (3C)
for information regarding time value
.RB ( time_t ).
Each
line of output ends with
.B isdst=1
if the given time is Daylight Saving
Time, or
.B isdst=0
otherwise.
.RE

.sp
.ne 2
.mk
.na
\fB-c\fR [\fIloyear\fR],\fIhiyear\fR
.ad
.RS 22n
.rt
Cuts off the verbose output near the start of the given year(s) . By
default, the program cuts off verbose output near the start of the years
-500 and 2500.
.RE

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 5n
.rt
Successful completion.
.RE

.sp
.ne 2
.mk
.na
.B 1
.ad
.RS 5n
.rt
An error occurred.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
\fB/usr/share/lib/zoneinfo\fR
.ad
.RS 27n
.rt
Standard zone information directory
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
_
Interface StabilityStable
.TE

.SH SEE ALSO
.sp
.LP
.BR zic (1M),
.BR ctime (3C),
.BR mktime (3C),
.BR attributes (5),
.BR environ (5)
