usr/src/man/man1m/zic.1m
'\" te
.\" Copyright (c) 2000, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" Copyright 1989 AT&T
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH zic 1M "3 Jan 2006" "SunOS 5.11" "System Administration Commands"
.SH NAME
zic \- time zone compiler
.SH SYNOPSIS
.LP
.nf
\fBzic\fR [\fB--\fIversion\fR] [\fB-s\fR] [\fB-v\fR] [\fB-l\fR \fIlocaltime\fR] [\fB-p\fR \fIposixrules\fR]
     [\fB-d\fR \fIdirectory\fR] [\fB-y\fR \fIyearistype\fR] [\fIfilename\fR]...
.fi

.SH DESCRIPTION
.sp
.LP
.B zic
reads text from the file(s) named on the command line and creates
the time conversion information files specified in this input. If a
.I filename
is '\fB\(mi\fR\&', the standard input is read.
.sp
.LP
Input lines are made up of fields. Fields are separated by any number of
white space characters. Leading and trailing white space on input lines is
ignored. A pound sign
.RB ( # )
indicates a comment that extends to the end
of the line. White space characters and pound signs can be enclosed within
double quotes (\fB" "\fR) if they are to be used as part of a field. Any
line that is blank (after comment stripping) is ignored. Non-blank lines are
expected to be of one of three types: rule lines, zone lines, or link
lines.
.SS "Rule"
.sp
.LP
A rule line has the form:
.sp
.LP
For example:
.sp
.in +2
.nf
Rule   NAME  FROM  TO  TYPE  IN   ON     AT   SAVE  LETTER/S
.fi
.in -2
.sp

.sp
.LP
The fields that make up a rule line are:
.sp
.in +2
.nf
Rule   USA   1969  1973   -  Apr lastSun 2:00  1:00   D
.fi
.in -2
.sp

.sp
.ne 2
.mk
.na
.B NAME
.ad
.RS 12n
.rt
Gives the (arbitrary) name of the set of rules this rule is part of.
.RE

.sp
.ne 2
.mk
.na
.B FROM
.ad
.RS 12n
.rt
Gives the first year in which the rule applies. The word
.B minimum
(or
an abbreviation) means the minimum year with a representable time value. The
word
.B maximum
(or an abbreviation) means the maximum year with a
representable time value.
.RE

.sp
.ne 2
.mk
.na
.B TO
.ad
.RS 12n
.rt
Gives the final year in which the rule applies. In addition to
.B minimum
and
.B maximum
(as above), the word
.B only
(or an
abbreviation) can be used to repeat the value of the
.B FROM
field.
.RE

.sp
.ne 2
.mk
.na
.B TYPE
.ad
.RS 12n
.rt
Gives the type of year in which the rule applies. If
.B TYPE
is:
.sp
.ne 2
.mk
.na
\fB\&'\fB\(mi\fR\&'\fR
.ad
.RS 14n
.rt
The rule applies in all years between
.B FROM
and
.BR TO ,
inclusive.
.RE

.sp
.ne 2
.mk
.na
.B uspres
.ad
.RS 14n
.rt
The rule applies in U.S. Presidential election years.
.RE

.sp
.ne 2
.mk
.na
.B nonpres
.ad
.RS 14n
.rt
The rule applies in years other than U.S. Presidential election years.
.RE

.sp
.ne 2
.mk
.na
.B even
.ad
.RS 14n
.rt
The rule applies to even-numbered years.
.RE

.sp
.ne 2
.mk
.na
.B odd
.ad
.RS 14n
.rt
The rule applies to odd-numbered years.
.RE

If
.B TYPE
is something else, then
.B zic
will attempt to execute the
command
.sp
.in +2
.nf
\fByearistype\fR \fIyear\fR \fBtype\fR
.fi
.in -2
.sp

to check the type of a year: an exit status of
.B 0
means that the year
is of the given type; an exit status of
.B 1
means that the year is not
of the given type. The
.B yearistype
command is not currently provided in
the Solaris environment.
.RE

.sp
.ne 2
.mk
.na
.B IN
.ad
.RS 12n
.rt
Names the month in which the rule takes effect. Month names can be
abbreviated.
.RE

.sp
.ne 2
.mk
.na
.B ON
.ad
.RS 12n
.rt
Gives the day on which the rule takes effect. Recognized forms include:
.sp
.ne 2
.mk
.na
.B 5
.ad
.RS 11n
.rt
the fifth day of the month
.RE

.sp
.ne 2
.mk
.na
.B lastSun
.ad
.RS 11n
.rt
The last Sunday in the month
.RE

.sp
.ne 2
.mk
.na
.B lastMon
.ad
.RS 11n
.rt
The last Monday in the month
.RE

.sp
.ne 2
.mk
.na
.B Sun>=8
.ad
.RS 11n
.rt
First Sunday on or after the eighth
.RE

.sp
.ne 2
.mk
.na
.B Sun<=25
.ad
.RS 11n
.rt
Last Sunday on or before the 25th
.RE

Names of days of the week can be abbreviated or spelled out in full. Note:
There cannot be spaces within the
.B ON
field.
.RE

.sp
.ne 2
.mk
.na
.B AT
.ad
.RS 12n
.rt
Gives the time of day at which the rule takes effect. Recognized forms
include:
.sp
.ne 2
.mk
.na
.B 2
.ad
.RS 11n
.rt
Time in hours
.RE

.sp
.ne 2
.mk
.na
.B 2:00
.ad
.RS 11n
.rt
Time in hours and minutes
.RE

.sp
.ne 2
.mk
.na
.B 15:00
.ad
.RS 11n
.rt
24-hour format time (for times after noon)
.RE

.sp
.ne 2
.mk
.na
.B 1:28:14
.ad
.RS 11n
.rt
Time in hours, minutes, and seconds, where hour 0 is midnight at the start
of the day and hour 24 is midnight at the end of the day.
.RE

Any of these forms can be followed by the letter
.B w
if the given time
is local "wall clock" time; \fBs\fR if the given time is local "standard"
time; or
.B u
(or
.B g
or
.BR z )
if the given time is universal
time. In the absence of an indicator, wall clock time is assumed.
.RE

.sp
.ne 2
.mk
.na
.B SAVE
.ad
.RS 12n
.rt
Gives the amount of time to be added to local standard time when the rule
is in effect. This field has the same format as the
.B AT
field (without
the
.B w
and
.B s
suffixes).
.RE

.sp
.ne 2
.mk
.na
.B LETTER/S
.ad
.RS 12n
.rt
Gives the "variable part" (for example, the "S" or "D" in "EST" or "EDT" of
time zone abbreviations to be used when this rule is in effect. If this
field is '\fB\(mi\fR\&', the variable part is null.
.RE

.SS "Zone"
.sp
.LP
A zone line has the form:
.sp
.in +2
.nf
Zone  NAME                 GMTOFF  RULES/SAVE   FORMAT  [UNTIL]
.fi
.in -2
.sp

.sp
.LP
For example:
.sp
.in +2
.nf
Zone Australia/SouthWest   9:30        -         CST    1992 Mar 15 12:00
                           8:30      Aus         CST
.fi
.in -2
.sp

.sp
.LP
The fields that make up a zone line are:
.sp
.ne 2
.mk
.na
.B NAME
.ad
.RS 14n
.rt
The name of the time zone. This is the name used in creating the time
conversion information file for the zone.
.RE

.sp
.ne 2
.mk
.na
.B GMTOFF
.ad
.RS 14n
.rt
The amount of time to add to
.B UTC
to get standard time in this zone.
This field has the same format as the
.B AT
and
.B SAVE
fields of rule
lines; begin the field with a minus sign to subtract time from
.BR UTC .
.RE

.sp
.ne 2
.mk
.na
.B RULES/SAVE
.ad
.RS 14n
.rt
The name of the rule(s) that apply in the time zone or, alternately, an
amount of time to add to local standard time. If this field is
`\fB\(mi\fR\&', then standard time always applies in the time zone.
.RE

.sp
.ne 2
.mk
.na
.B FORMAT
.ad
.RS 14n
.rt
The format for time zone abbreviations in this time zone. The pair of
characters \fB%s\fR is used to show where the "variable part" of the time
zone abbreviation goes. Alternately, a slash (/) separates standard and
daylight abbreviations.
.RE

.sp
.ne 2
.mk
.na
.B UNTIL
.ad
.RS 14n
.rt
The time at which the
.B UTC
offset or the rule(s) change for a
location. It is specified as a year, a month, a day, and a time of day. The
time of day has the same format as the
.B AT
field of rule lines. If this
is specified, the time zone information is generated from the given
.B UTC
offset and rule change until the time specified.
.sp
The month, day, and time of day have the same format as the IN, ON, and AT
columns of a rule; trailing columns can be omitted, and default to the
earliest possible value for the missing columns.
.sp
The next line must be a "continuation" line. This line has the same form as
a zone line except that the string "Zone" and the name are omitted. The
continuation line places information starting at the time specified as the
.B UNTIL
field in the previous line in the file used by the previous
line. Continuation lines can contain an
.B UNTIL
field, just as zone
lines do, indicating that the next line is a further continuation.
.RE

.SS "Link"
.sp
.LP
A link line has the form:
.sp
.in +2
.nf
Link   LINK-FROM   LINK-TO
.fi
.in -2
.sp

.sp
.LP
For example:
.sp
.in +2
.nf
Link   Europe/Istanbul Asia/Istanbul
.fi
.in -2
.sp

.sp
.LP
The
.B LINK-FROM
field should appear as the
.B NAME
field in some
zone line; the
.B LINK-TO
field is used as an alternate name for that
zone.
.sp
.LP
Except for continuation lines, lines can appear in any order in the
input.
.SH OPTIONS
.sp
.ne 2
.mk
.na
.BI -- version
.ad
.RS 17n
.rt
Outputs version information and exits.
.RE

.sp
.ne 2
.mk
.na
.B -d
.I directory
.ad
.RS 17n
.rt
Creates time conversion information files in the directory
.IR directory
rather than in the standard directory
.BR /usr/share/lib/zoneinfo .
.RE

.sp
.ne 2
.mk
.na
.B -l
.I localtime
.ad
.RS 17n
.rt
Uses the given time zone as local time
.IR localtime .
.B zic
acts as
if the file contained a link line of the form:
.sp
.in +2
.nf
Link \fIlocaltime\fR localtime
.fi
.in -2
.sp

.RE

.sp
.ne 2
.mk
.na
.B -p
.I posixrules
.ad
.RS 17n
.rt
Uses the rules of the given time zone
.I posixrules
when handling
POSIX-format time zone environment variables.
.B zic
acts as if the input
contained a link line of the form:
.sp
.in +2
.nf
Link	\fIposixrules\fR posixrules
.fi
.in -2
.sp

This option is not used by
.BR ctime "(3C) and"
.BR mktime (3C)
in the
Solaris environment.
.RE

.sp
.ne 2
.mk
.na
.B -s
.ad
.RS 17n
.rt
Limits time values stored in output files to values that are the same
whether they are taken to be signed or unsigned. You can use this option to
generate SVVS-compatible files.
.sp
This option is obsolete and may be removed in a future release.
.RE

.sp
.ne 2
.mk
.na
.B -v
.ad
.RS 17n
.rt
Complains if a year that appears in a data file is outside the range of
.RB "years representable by system time values (" "0:00:00 a.m." " " UTC, 
.BR "January 1" ,
.BR 1970 ,
to
.B "3:14:07 a.m."
.B UTC,
\fBJanuary
19\fR,
.BR 2038 ).
This option also complains if a time of 24:00  (which
cannot be  handled by pre-1998  versions  of
.BR zic )
appears in the
input.
.RE

.sp
.ne 2
.mk
.na
.B -y
.I yearistype
.ad
.RS 17n
.rt
Uses the given command
.I yearistype
rather than
.B yearistype
when
checking year types (see
.B Rules
under
.BR DESCRIPTION ).
.RE

.SH OPERANDS
.sp
.ne 2
.mk
.na
.I filename
.ad
.RS 12n
.rt
A file containing input lines that specify the time conversion information
files to be created. If a
.I filename
is '\fB\(mi\fR\&', the standard
input is read.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B /usr/share/lib/zoneinfo
.ad
.sp .6
.RS 4n
Standard directory used for created files
.RE

.sp
.ne 2
.mk
.na
.B /usr/share/lib/zoneinfo/src
.ad
.sp .6
.RS 4n
Directory containing source files
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
_
Interface StabilityCommitted*
.TE

.sp
.LP
* The
.B -s
option is obsolete.
.SH SEE ALSO
.sp
.LP
.BR time (1),
.BR zdump (1M),
.BR ctime (3C),
.BR mktime (3C),
.BR attributes (5)
.SH NOTES
.sp
.LP
For areas with more than two types of local time, you might need to use
local standard time in the
.B AT
field of the earliest transition time's
rule to ensure that the earliest transition time recorded in the compiled
file is correct.
.sp
.LP
If the current
.I timezone
file is edited and compiled using the
"\fBzic\fR" command, the changes will only be reflected in any new processes
that are running.  The most accurate way to reflect the changes for the
whole system would be a reboot.
