usr/src/man/man1m/zoneadmd.1m
'\" te
.\" Copyright (c) 2004, Sun Microsystems, Inc.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" All Rights Reserved.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH zoneadmd 1M "1 Nov 2004" "SunOS 5.11" "System Administration Commands"
.SH NAME
zoneadmd \- zone administration daemon
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/zones/zoneadmd\fR
.fi

.SH DESCRIPTION
.sp
.LP
.B zoneadmd
is a system daemon that is started when the system needs to
manage a particular zone. Because each instance of the
.B zoneadmd
daemon
manages a particular zone, it is not unexpected to see multiple
.B zoneadmd
daemons running.
.sp
.LP
This daemon is started automatically by the zone management software and
should not be invoked directly. The daemon shuts down automatically when no
longer in use. It does not constitute a programming interface, but is
classified as a private interface.
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWzoneu
_
Interface StabilityPrivate
.TE

.SH SEE ALSO
.sp
.LP
.BR svcs (1),
.BR zlogin (1),
.BR svcadm (1M),
.BR zoneadm (1M),
.BR attributes (5),
.BR smf (5),
.BR zones (5)
.SH NOTES
.sp
.LP
The
.BR zones (5)
service is managed by the service management facility,
.BR smf (5),
under the service identifier:
.sp
.in +2
.nf
svc:/system/zones:default
.fi
.in -2
.sp

.sp
.LP
Administrative actions on this service, such as enabling, disabling, or
requesting restart, can be performed using
.BR svcadm (1M).
The service's
status can be queried using the
.BR svcs (1)
command.
