usr/src/man/man1/apptrace.1
'\" te
.\" Copyright (c) 2004, Sun Microsystems, Inc.  All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH apptrace 1 "29 Nov 2004" "SunOS 5.11" "User Commands"
.SH NAME
apptrace \- trace application function calls to Solaris shared libraries
.SH SYNOPSIS
.LP
.nf
\fBapptrace\fR [\fB-f\fR] [\fB-F\fR [!] \fItracefromlist\fR] [\fB-T\fR [!] \fItracetolist\fR]
     [\fB-o\fR \fIoutputfile\fR] [ [\fB-tv\fR] [!] \fIcall\fR ,.\|.\|.] \fIcommand\fR
     [\fIcommand\fR \fIarguments\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The
.B apptrace
utility runs the executable program specified by
.I command
and traces all function calls that the
.RI program command
makes to the Solaris shared libraries. For each function call that is
traceable,
.B apptrace
reports the name of the library interface called,
the values of the arguments passed, and the return value.
.sp
.LP
By default,
.B apptrace
traces calls directly from the executable object
to any of the shared objects it depends on. Indirect calls (that is, calls
made between shared objects that the executable depends upon) are not
reported by default.
.sp
.LP
Calls from or to additional shared objects may be traced using the
.BR -F
or
.B -T
options (see below).
.sp
.LP
The default reporting format is a single line per call, with no formatted
printing of arguments passed by reference or of data structures.
.sp
.LP
Formatted printing providing additional argument details is obtained using
the
.B -v
option (see below).
.sp
.LP
By default, every interface provided by a shared object is traced if
called. However, the set of interfaces to be traced can be restricted, using
the
.B -t
and/or
.B -v
options.
.sp
.LP
Since it is generally possible to trace calls between any of the dynamic
objects linked at runtime (the executable object and any of the shared
objects depended upon), the report of each traced call gives the name of the
object from which the call was made.
.sp
.LP
.B apptrace
traces all of the procedure calls that occur between dynamic
objects via the procedure linkage table, so only those procedure calls which
are bound via the table will be traced. See the
.IR "Linker and Libraries Guide" .
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -f
.ad
.RS 24n
.rt
Follows all children created by
.BR fork (2).
This option will also cause
the process id to be printed at the beginning of each line.
.RE

.sp
.ne 2
.mk
.na
.B -F
.BI [!] tracefromlist
.ad
.RS 24n
.rt
Traces calls from a comma-separated list of shared objects. Only calls from
these shared objects will be traced. The default is to trace calls from the
main executable only. Only the basename of the shared object is required.
For example,
.I libc
will match
.IR /usr/lib/libc.so.1 .
Additionally,
shell style wildcard characters are supported as described in
.BR fnmatch (5).
A list preceded by a ``!'' defines a list of objects from
which calls should not be traced. If the tracing of calls from
.I command
is required, then
.I command
must be a member of
.IR tracefromlist .
.RE

.sp
.ne 2
.mk
.na
.B -o
.I outputfile
.ad
.RS 24n
.rt
.B apptrace
output will be directed to the
.IR outputfile .
By default,
.B apptrace
output is placed on the stderr stream of the process being
traced.
.RE

.sp
.ne 2
.mk
.na
\fB-t\fR [\fB!\fR]\fIcall,\|.\|.\|.\fR
.ad
.RS 24n
.rt
Traces or excludes function calls. Those calls specified in the
comma-separated list
.I call
are traced. If the list begins with a !, the
specified function calls are excluded from the trace output. The default is
.BR "-t *" .
The use of shell style wildcards is allowed.
.RE

.sp
.ne 2
.mk
.na
.B -T
.BI [!] tracetolist
.ad
.RS 24n
.rt
Traces calls to a comma-separated list of shared objects. The default is to
trace calls to all shared objects. As above, the basename is all that is
required and wildcarding is allowed. A list preceded by a ``!'' denotes a
list of objects to which calls should not be traced.
.RE

.sp
.ne 2
.mk
.na
\fB-v\fR [\fB!\fR]\fIcall,\|.\|.\|.\fR
.ad
.RS 24n
.rt
Provides verbose, formatted output of the arguments and return values of
the function calls specified (as above in the
.B -t
option). Unlike
.BR truss (1),
calls named by the
.B -v
option do not have to be named
by the
.B -t
option. For example,
.B "apptrace -v"
.B open
is
equivalent to
.B "truss -t"
.B open -v
.BR open .
.RE

.SH EXAMPLES
.LP
.B Example 1
Tracing the date command
.sp
.in +2
.nf
% \fBapptrace date\fR
-> date     -> libc.so.1:atexit(0xff3bf9ac, 0x22000, 0x0) ** NR
-> date     -> libc.so.1:atexit(0x11550, 0xfefeef80, 0xab268) ** NR
-> date     -> libc.so.1:setlocale(0x6, 0x11560, 0x0) ** NR
-> date     -> libc.so.1:textdomain(0x11564, 0xfefce156, 0xff160200) ** NR
-> date     -> libc.so.1:int getopt(int = 0x1,
                        const char * * = 0xffbffa5c,
                        const char * = 0x11574 "a:u")
<- date     -> libc.so.1:getopt() = 0xffffffff
-> date     -> libc.so.1:time_t time(time_t * = 0x225c0)
<- date     -> libc.so.1:time() = 0x41ab6e82
-> date     -> libc.so.1:char * nl_langinfo(nl_item = 0x3a)
<- date     -> libc.so.1:nl_langinfo() = 0xfefd3e10
-> date     -> libc.so.1:struct tm * localtime(const time_t * = 0x225c0)
<- date     -> libc.so.1:localtime() = 0xff160240
-> date     -> libc_psr.so.1:memcpy(0xffbff9cc, 0xff160240, 0x24) ** NR
-> date     -> libc.so.1:size_t strftime(char * = 0x225c4 "",
                        size_t = 0x400,
                        const char * = 0xfefd3e10 "%a %b %e %T %Z %Y",
                        const struct tm * = 0xffbff9cc)
<- date     -> libc.so.1:strftime() = 0x1c
-> date     -> libc.so.1:int puts(const char * = 0x225c4
                        "Mon Nov 29 10:46:26 PST 2004")
                        Mon Nov 29 10:46:26 PST 2004
<- date     -> libc.so.1:puts() = 0x1d
-> date     -> libc.so.1:exit(0x0, 0x22400, 0x0) ** NR
.fi
.in -2
.sp

.LP
.B Example 2
Tracing a specific set of interfaces with verbosity set
.sp
.in +2
.nf
% \fBapptrace -v localtime,strftime,puts date\fR
-> date     -> libc.so.1:struct tm * localtime(const time_t * = 0x225c0)
        arg0 = (const time_t *) 0x225c0
        return = (struct tm *) 0xff160280 (struct tm) {
        tm_sec: (int) 0x4
        tm_min: (int) 0x34
        tm_hour: (int) 0xa
        tm_mday: (int) 0x1d
        tm_mon: (int) 0xa
        tm_year: (int) 0x68
        tm_wday: (int) 0x1
        tm_yday: (int) 0x14d
        tm_isdst: (int) 0
        }
<- date     -> libc.so.1:localtime() = 0xff160280
-> date     -> libc.so.1:size_t strftime(char * = 0x225c4 "",
                        size_t = 0x400,
                        const char * = 0xfefd3e10 "%a %b %e %T %Z %Y",
                        const struct tm * = 0xffbff99c)
        arg0 = (char *) 0x225c4 ""
        arg1 = (size_t) 0x400
        arg2 = (const char *) 0xfefd3e10 "%a %b %e %T %Z %Y"
        arg3 = (const struct tm *) 0xffbff99c (struct tm) {
        tm_sec: (int) 0x4
        tm_min: (int) 0x34
        tm_hour: (int) 0xa
        tm_mday: (int) 0x1d
        tm_mon: (int) 0xa
        tm_year: (int) 0x68
        tm_wday: (int) 0x1
        tm_yday: (int) 0x14d
        tm_isdst: (int) 0
        }
        return = (size_t) 0x1c
<- date     -> libc.so.1:strftime() = 0x1c
-> date     -> libc.so.1:int puts(const char * = 0x225c4
                        "Mon Nov 29 10:52:04 PST 2004")
        arg0 = (const char *) 0x225c4 "Mon Nov 29 10:52:04 PST 2004"
                        Mon Nov 29 10:52:04 PST 2004
        return = (int) 0x1d
<- date     -> libc.so.1:puts() = 0x1d
.fi
.in -2
.sp

.sp
.LP
** NR - The return value of a function call will not be traced.
.SH FILES
.sp
.LP
Basic runtime support for
.B apptrace
is provided by the link auditing
feature of the Solaris runtime linker
.RB ( ld.so.1 (1))
and the
.B apptrace
command's use of this facility relies on an auditing object
.RB ( apptrace.so.1 )
kept in
.BR /usr/lib/abi .
.SH LIMITATIONS
.sp
.LP
In general,
.B apptrace
cannot trace calls to functions accepting
variable argument lists. There has been some clever coding in several
specific cases to work around this limitation, most notably in the
.B printf
and
.B scanf
families.
.sp
.LP
The
.B apptrace
utility can not trace the return value of a function
call whose return type is a
.B struct
or
.BR union .
.sp
.LP
Functions that attempt to probe the stack or otherwise extract information
about the caller cannot be traced. Some examples are
.BR [gs]etcontext() ,
.BR [sig]longjmp() ,
.BR [sig]setjmp() ,
and
.BR vfork() .
.sp
.LP
Functions such as
.BR exit (2)
that do not return will not be traced for
their return values.
.sp
.LP
For security reasons, only those processes with appropriate privileges can
use
.B apptrace
to trace \fBsetuid\fR/\fBsetgid\fR programs.
.sp
.LP
Tracing functions whose usage requires the inclusion of
.RB < varargs.h >,
such as
.BR vwprintw "(3XCURSES) and"
.BR vwscanw (3XCURSES),
will not
provide formatted 	printing of arguments.
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcstl (32-bit)
SUNWcstlx (64-bit)
_
Interface StabilityUnstable
.TE

.SH SEE ALSO
.sp
.LP
.BR ld.so.1 (1),
.BR truss (1),
.BR vwprintw (3XCURSES),
.BR vwscanw (3XCURSES),
.BR attributes (5),
.BR fnmatch (5)
.sp
.LP
.I Linker and Libraries Guide
