usr/src/man/man1/ar.1
'\" te
.\" Copyright 1989 AT&T
.\"  Portions Copyright (c) 1992, X/Open Company Limited  All Rights Reserved
.\" Copyright (c) 2009, Sun Microsystems, Inc.  All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\"
.\" Sun Microsystems, Inc. gratefully acknowledges The Open Group for
.\" permission to reproduce portions of its copyrighted documentation.
.\" Original documentation from The Open Group can be obtained online
.\" at http://www.opengroup.org/bookstore/.
.\"
.\" The Institute of Electrical and Electronics Engineers and The Open Group,
.\" have given us permission to reprint portions of their documentation.
.\"
.\" In the following statement, the phrase "this text" refers to portions
.\" of the system documentation.
.\"
.\" Portions of this text are reprinted and reproduced in electronic form in
.\" the Sun OS Reference Manual, from IEEE Std 1003.1, 2004 Edition, Standard
.\" for Information Technology -- Portable Operating System Interface (POSIX),
.\" The Open Group Base Specifications Issue 6, Copyright (C) 2001-2004 by the
.\" Institute of Electrical and Electronics Engineers, Inc and The Open Group.
.\" In the event of any discrepancy between these versions and the original
.\" IEEE and The Open Group Standard, the original IEEE and The Open Group
.\" Standard is the referee document.
.\"
.\" The original Standard can be obtained online at
.\" http://www.opengroup.org/unix/online.html.
.\"
.\" This notice shall appear on any product containing this material.
.\"
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ar 1 "24 Aug 2009" "SunOS 5.11" "User Commands"
.SH NAME
ar \- maintain portable archive or library
.SH SYNOPSIS
.LP
.nf
\fB/usr/bin/ar\fR \fB-d\fR [\fB-Vv\fR] \fIarchive\fR \fIfile\fR...
.fi

.LP
.nf
\fB/usr/bin/ar\fR \fB-m\fR [\fB-abiVv\fR] [\fIposname\fR] \fIarchive\fR \fIfile\fR...
.fi

.LP
.nf
\fB/usr/bin/ar\fR \fB-p\fR [\fB-sVv\fR] \fIarchive\fR [\fIfile\fR]...
.fi

.LP
.nf
\fB/usr/bin/ar\fR \fB-q\fR [\fB-cVv\fR] \fIarchive\fR \fIfile\fR...
.fi

.LP
.nf
\fB/usr/bin/ar\fR \fB-r\fR [\fB-abciuVv\fR] [\fIposname\fR] \fIarchive\fR \fIfile\fR...
.fi

.LP
.nf
\fB/usr/bin/ar\fR \fB-t\fR [\fB-sVv\fR] \fIarchive\fR [\fIfile\fR]...
.fi

.LP
.nf
\fB/usr/bin/ar\fR \fB-x\fR [\fB-CsTVv\fR] \fIarchive\fR [\fIfile\fR]...
.fi

.LP
.nf
\fB/usr/xpg4/bin/ar\fR \fB-d\fR [\fB-Vv\fR] \fIarchive\fR \fIfile\fR...
.fi

.LP
.nf
\fB/usr/xpg4/bin/ar\fR \fB-m\fR [\fB-abiVv\fR] [\fIposname\fR] \fIarchive\fR \fIfile\fR...
.fi

.LP
.nf
\fB/usr/xpg4/bin/ar\fR \fB-p\fR [\fB-sVv\fR] \fIarchive\fR [\fIfile\fR]...
.fi

.LP
.nf
\fB/usr/xpg4/bin/ar\fR \fB-q\fR [\fB-cVv\fR] \fIarchive\fR \fIfile\fR...
.fi

.LP
.nf
\fB/usr/xpg4/bin/ar\fR \fB-r\fR [\fB-abciuVv\fR] [\fIposname\fR] \fIarchive\fR \fIfile\fR...
.fi

.LP
.nf
\fB/usr/xpg4/bin/ar\fR \fB-t\fR [\fB-sVv\fR] \fIarchive\fR [\fIfile\fR]...
.fi

.LP
.nf
\fB/usr/xpg4/bin/ar\fR \fB-x\fR [\fB-CsTVv\fR] \fIarchive\fR [\fIfile\fR]...
.fi

.SH DESCRIPTION
.sp
.LP
The
.B ar
utility maintains groups of files combined into a single
archive file. Its main use is to create and update library files. However,
it can be used for any similar purpose. The magic string and the file
headers used by
.B ar
consist of printable
.B ASCII
characters. If an
archive is composed of printable files, the entire archive is printable.
.sp
.LP
When
.B ar
creates an archive, it creates headers in a format that is
portable across all machines. The portable archive format and structure are
described in detail in
.BR ar.h "(3HEAD). The archive symbol table described"
there is used by the link editor
.BR ld (1)
to effect multiple passes over
libraries of object files in an efficient manner. An archive symbol table is
only created and maintained by
.B ar
when there is at least one object
file in the archive. The archive symbol table is in a specially named file
that is always the first file in the archive. This file is never mentioned
or accessible to the user. Whenever the
.B ar
command is used to create
or update the contents of such an archive, the symbol table is rebuilt. The
.B -s
option described below forces the symbol table to be rebuilt.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -a
.ad
.RS 6n
.rt
Positions new \fIfile\fRs in \fIarchive\fR after the file named by the
.I posname
operand.
.RE

.sp
.ne 2
.mk
.na
.B -b
.ad
.RS 6n
.rt
Positions new \fIfile\fRs in \fIarchive\fR before the file named by the
.I posname
operand.
.RE

.sp
.ne 2
.mk
.na
.B -c
.ad
.RS 6n
.rt
Suppresses the diagnostic message that is written to standard error by
default when
.I archive
is created.
.RE

.sp
.ne 2
.mk
.na
.B -C
.ad
.RS 6n
.rt
Prevents extracted files from replacing like-named files in the file
system. This option is useful when
.B -T
is also used to prevent
truncated file names from replacing files with the same prefix.
.RE

.sp
.ne 2
.mk
.na
.B -d
.ad
.RS 6n
.rt
Deletes one or more \fIfile\fRs from
.IR archive .
.RE

.sp
.ne 2
.mk
.na
.B -i
.ad
.RS 6n
.rt
Positions new \fIfile\fRs in \fIarchive\fR before the file named by the
.I posname
operand. This option is equivalent to
.BR \-b .
.RE

.sp
.ne 2
.mk
.na
.B -m
.ad
.RS 6n
.rt
Moves \fIfile\fRs. If
.BR -a ,
.BR -b ,
or
.B -i
with the
.I posname
operand are specified, the
.B -m
option moves \fIfile\fRs
to the new position. Otherwise,
.B -m
moves \fIfile\fRs to the end of
.IR archive .
.RE

.sp
.ne 2
.mk
.na
.B -p
.ad
.RS 6n
.rt
Prints the contents of \fIfile\fRs in \fIarchive\fR to standard output. If
no \fIfile\fRs are specified, the contents of all files in
.I archive
are
written in the order of the archive.
.RE

.sp
.ne 2
.mk
.na
.B -q
.ad
.RS 6n
.rt
Quickly appends \fIfile\fRs to the end of
.IR archive .
Positioning
options
.BR -a ,
.BR -b ,
and
.B -i
are invalid. The command does not
check whether the added \fIfile\fRs are already in
.IR archive .
This
option is useful to avoid quadratic behavior when creating a large archive
piece-by-piece.
.RE

.sp
.ne 2
.mk
.na
.B -r
.ad
.RS 6n
.rt
Replaces or adds \fIfile\fRs in
.IR archive .
If
.I archive
does not
exist, a new archive file is created and a diagnostic message is written to
standard error, unless the
.B -c
option is specified. If no \fIfile\fRs
are specified and the
.I archive
exists, the results are undefined. Files
that replace existing files do not change the order of the archive. If the
.B -u
option is used with the
.B -r
option, only those files with
dates of modification later than the archive files are replaced. If the
.BR -a ,
.BR -b ,
or
.B -i
option is used, the
.I posname
argument
must be present and specifies that new files are to be placed after
(\fB-a\fR) or before (\fB-b\fR or
.BR -i )
.IR posname .
Otherwise, the
new files are placed at the end.
.RE

.sp
.ne 2
.mk
.na
.B -s
.ad
.RS 6n
.rt
Forces the regeneration of the archive symbol table even if
.B ar
is not
invoked with an option that will modify the archive contents. This command
is useful to restore the archive symbol table after the
.BR strip (1)
command has been used on the archive.
.RE

.sp
.ne 2
.mk
.na
.B -t
.ad
.RS 6n
.rt
Prints a table of contents of
.IR archive .
The files specified by the
.I file
operands are included in the written list. If no \fIfile\fR
operands are specified, all files in
.I archive
are included in the order
of the archive.
.RE

.sp
.ne 2
.mk
.na
.B -T
.ad
.RS 6n
.rt
Allows file name truncation of extracted files whose archive names are
longer than the file system can support. By default, extracting a file with
a name that is too long is an error. In that case, a diagnostic message is
written and the file is not extracted.
.RE

.sp
.ne 2
.mk
.na
.B -u
.ad
.RS 6n
.rt
Updates older files. When used with the
.B -r
option, files within
.I archive
are replaced only if the corresponding
.I file
has a
modification time that is at least as new as the modification time of the
file within
.IR archive .
.RE

.sp
.ne 2
.mk
.na
.B -v
.ad
.RS 6n
.rt
Gives verbose output. When used with options
.BR -d ,
.BR -r ,
or
.BR -x ,
the
.B -v
option writes a detailed file-by-file description of
the archive creation and the constituent \fIfile\fRs, and maintenance
activity. When used with
.BR -p ,
.B -v
writes the name of the file to
the standard output before writing the file itself to the standard output.
When used with
.BR -t ,
.B -v
includes a long listing of information
about the files within the archive. When used with
.BR -x ,
.B -v
prints
the filename preceding each extraction. When writing to an archive, \fB-v\fR
writes a message to the standard error.
.RE

.sp
.ne 2
.mk
.na
.B -V
.ad
.RS 6n
.rt
Prints its version number on standard error.
.RE

.SS "\fB/usr/xpg4/bin/ar\fR"
.sp
.LP
The following options are supported for
.BR /usr/xpg4/bin/ar :
.sp
.ne 2
.mk
.na
.B -v
.ad
.RS 6n
.rt
Same as the
.B /usr/bin/ar
version, except when writing to an archive,
no message is written to the standard error.
.RE

.sp
.ne 2
.mk
.na
.B -x
.ad
.RS 6n
.rt
Extracts the files named by the
.I file
operands from
.IR archive .
The
contents of
.I archive
are not changed. If no
.I file
operands are
given, all files in
.I archive
are extracted. If the file name of a file
extracted from
.I archive
is longer than that supported in the directory
to which it is being extracted, the results are undefined. The modification
time of each \fIfile\fR extracted is set to the time \fIfile\fR is extracted
from
.IR archive .
.RE

.SH OPERANDS
.sp
.LP
The following operands are supported:
.sp
.ne 2
.mk
.na
.I archive
.ad
.RS 11n
.rt
A path name of the archive file.
.RE

.sp
.ne 2
.mk
.na
.I file
.ad
.RS 11n
.rt
A path name. Only the last component is used when comparing against the
names of files in the archive. If two or more
.I file
operands have the
same last path name component (see
.BR basename (1)),
the results are
unspecified. The implementation's archive format will not truncate valid
file names of files added to or replaced in the archive.
.RE

.sp
.ne 2
.mk
.na
.I posname
.ad
.RS 11n
.rt
The name of a file in the archive file, used for relative positioning. See
options
.B -m
and
.BR -r .
.RE

.SH ENVIRONMENT VARIABLES
.sp
.LP
See
.BR environ (5)
for descriptions of the following environment
variables that affect the execution of
.BR ar :
.BR LANG ,
.BR LC_ALL ,
.BR LC_CTYPE ,
.BR LC_MESSAGES ,
.BR LC_TIME ,
and
.BR NLSPATH .
.sp
.ne 2
.mk
.na
.B TMPDIR
.ad
.RS 10n
.rt
Determine the pathname that overrides the default directory for temporary
files, if any.
.RE

.sp
.ne 2
.mk
.na
.B TZ
.ad
.RS 10n
.rt
Determine the timezone used to calculate date and time strings written by
.BR "ar -tv" .
If
.B TZ
is unset or null, an unspecified default
timezone is used.
.RE

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 6n
.rt
Successful completion.
.RE

.sp
.ne 2
.mk
.na
.B >0
.ad
.RS 6n
.rt
An error occurred.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.SS "\fB/usr/bin/ar\fR"
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWbtool
_
Interface StabilityCommitted
.TE

.SS "\fB/usr/xpg4/bin/ar\fR"
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWxcu4
_
Interface StabilityCommitted
_
StandardSee \fBstandards\fR(5).
.TE

.SH SEE ALSO
.sp
.LP
.BR basename (1),
.BR cpio (1),
.BR ld (1),
.BR lorder (1),
.BR strip (1),
.BR tar (1),
.BR ar.h (3HEAD),
.BR a.out (4),
.BR attributes (5),
.BR environ (5),
.BR standards (5)
.SH NOTES
.sp
.LP
If the same file is mentioned twice in an argument list, it may be put in
the archive twice.
.sp
.LP
By convention, archives are suffixed with "\fB\&.a\fR".
.sp
.LP
When inserting
.B ELF
objects into an archive file,
.B ar
might add
"\fB\en\fR" characters to pad these objects to an 8-byte boundary. Such
padding improves the efficiency with which
.BR ld (1)
can access the
archive. Only
.B ELF
object files are padded in this way. Other archive
members are not altered. When an object with such padding is extracted from
an archive, the padding is not included in the resulting output.
