usr/src/man/man1/at.1
'\" te
.\" Copyright (c) 1992, X/Open Company Limited.  All Rights Reserved.
.\" Copyright 1989 AT&T
.\" Portions Copyright (c) 2005, Sun Microsystems, Inc.  All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\"
.\" Sun Microsystems, Inc. gratefully acknowledges The Open Group for
.\" permission to reproduce portions of its copyrighted documentation.
.\" Original documentation from The Open Group can be obtained online
.\" at http://www.opengroup.org/bookstore/.
.\"
.\" The Institute of Electrical and Electronics Engineers and The Open Group,
.\" have given us permission to reprint portions of their documentation.
.\"
.\" In the following statement, the phrase "this text" refers to portions
.\" of the system documentation.
.\"
.\" Portions of this text are reprinted and reproduced in electronic form in
.\" the Sun OS Reference Manual, from IEEE Std 1003.1, 2004 Edition, Standard
.\" for Information Technology -- Portable Operating System Interface (POSIX),
.\" The Open Group Base Specifications Issue 6, Copyright (C) 2001-2004 by the
.\" Institute of Electrical and Electronics Engineers, Inc and The Open Group.
.\" In the event of any discrepancy between these versions and the original
.\" IEEE and The Open Group Standard, the original IEEE and The Open Group
.\" Standard is the referee document.
.\"
.\" The original Standard can be obtained online at
.\" http://www.opengroup.org/unix/online.html.
.\"
.\" This notice shall appear on any product containing this material.
.\"
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH at 1 "13 Apr 2005" "SunOS 5.11" "User Commands"
.SH NAME
at, batch \- execute commands at a later time
.SH SYNOPSIS
.LP
.nf
\fB/usr/bin/at\fR [\fB-c\fR | \fB-k\fR | \fB-s\fR] [\fB-m\fR] [\fB-f\fR \fIfile\fR] [\fB-p\fR \fIproject\fR]
     [\fB-q\fR \fIqueuename\fR] \fB-t\fR \fItime\fR
.fi

.LP
.nf
\fB/usr/bin/at\fR [\fB-c\fR | \fB-k\fR | \fB-s\fR] [\fB-m\fR] [\fB-f\fR \fIfile\fR] [\fB-p\fR \fIproject\fR]
     [\fB-q\fR \fIqueuename\fR] \fItimespec\fR...
.fi

.LP
.nf
\fB/usr/bin/at\fR \fB-l\fR [\fB-p\fR \fIproject\fR] [\fB-q\fR \fIqueuename\fR] [\fIat_job_id.\fR \fI\&..\fR]
.fi

.LP
.nf
\fB/usr/bin/at\fR \fB-r\fR \fIat_job_id.\fR \fI\&..\fR
.fi

.LP
.nf
\fB/usr/bin/batch\fR [\fB-p\fR \fIproject\fR]
.fi

.LP
.nf
\fB/usr/xpg4/bin/at\fR [\fB-c\fR | \fB-k\fR | \fB-s\fR] [\fB-m\fR] [\fB-f\fR \fIfile\fR] [\fB-p\fR \fIproject\fR]
     [\fB-q\fR \fIqueuename\fR] \fB-t\fR \fItime\fR
.fi

.LP
.nf
\fB/usr/xpg4/bin/at\fR [\fB-c\fR | \fB-k\fR | \fB-s\fR] [\fB-m\fR] [\fB-f\fR \fIfile\fR] [\fB-p\fR \fIproject\fR]
     [\fB-q\fR \fIqueuename\fR] \fItimespec\fR...
.fi

.LP
.nf
\fB/usr/xpg4/bin/at\fR \fB-l\fR [\fB-p\fR \fIproject\fR] [\fB-q\fR \fIqueuename\fR]
     [\fIat_job_id.\fR \fI\&..\fR]
.fi

.LP
.nf
\fB/usr/xpg4/bin/at\fR \fB-r\fR \fIat_job_id.\fR \fI\&..\fR
.fi

.LP
.nf
\fB/usr/xpg4/bin/batch\fR [\fB-p\fR \fIproject\fR]
.fi

.SH DESCRIPTION
.SS "at"
.sp
.LP
The
.B at
utility reads commands from standard input and groups them
together as an
.IR at-job ,
to be executed at a later time.
.sp
.LP
The at-job is executed in a separate invocation of the shell, running in a
separate process group with no controlling terminal, except that the
environment variables, current working directory, file creation mask (see
.BR umask (1)),
and system resource limits (for
.B sh
and
.B ksh
only,
see
.BR ulimit (1))
in effect when the
.B at
utility is executed is
retained and used when the at-job is executed.
.sp
.LP
When the at-job is submitted, the
.I at_job_id
and scheduled time are
written to standard error. The
.I at_job_id
is an identifier that is a
string consisting solely of alphanumeric characters and the period character.
The
.I at_job_id
is assigned by the system when the job is scheduled such
that it uniquely identifies a particular job.
.sp
.LP
User notification and the processing of the job's standard output and
standard error are described under the
.B -m
option.
.sp
.LP
Users are permitted to use
.B at
and
.B batch
(see below) if their name
appears in the file
.BR /usr/lib/cron/at.allow .
If that file does not exist,
the file
.B /usr/lib/cron/at.deny
is checked to determine if the user
should be denied access to
.BR at .
If neither file exists, only a user with
the
.B solaris.jobs.user
authorization is allowed to submit a job. If only
.B at.deny
exists and is empty, global usage is permitted. The
.B at.allow
and
.B at.deny
files consist of one user name per line.
.sp
.LP
.B cron
and
.B at
jobs are not be executed if the user's account is
locked. Only accounts which are not locked as defined in
.BR shadow (4)
will
have their job or process executed.
.SS "batch"
.sp
.LP
The
.B batch
utility reads commands to be executed at a later time.
.sp
.LP
Commands of the forms:
.sp
.in +2
.nf
/usr/bin/batch [-p project]
/usr/xpg4/bin/batch [-p project]
.fi
.in -2
.sp

.sp
.LP
are respectively equivalent to:
.sp
.in +2
.nf
/usr/bin/at -q b [-p project] now
/usr/xpg4/bin/at -q b -m [-p project] now
.fi
.in -2
.sp

.sp
.LP
where queue
.B b
is a special
.B at
queue, specifically for batch jobs.
Batch jobs are submitted to the batch queue for immediate execution. Execution
of submitted jobs can be delayed by limits on the number of jobs allowed to
run concurrently. See
.BR queuedefs (4).
.SH OPTIONS
.sp
.LP
If the
.BR -c ,
.BR -k ,
or
.B -s
options are not specified, the
.B SHELL
environment variable by default determines which shell to use.
.sp
.LP
For
.B /usr/xpg4/bin/at
and
.BR /usr/xpg4/bin/batch ,
if
.B SHELL
is
unset or
.BR NULL ,
.B /usr/xpg4/bin/sh
is used.
.sp
.LP
For
.B usr/bin/at
and
.BR /usr/bin/batch ,
if
.B SHELL
is unset or
.BR NULL ,
.B /bin/sh
is used.
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -c
.ad
.RS 17n
.rt
C shell.
.BR csh (1)
is used to execute the at-job.
.RE

.sp
.ne 2
.mk
.na
.B -k
.ad
.RS 17n
.rt
Korn shell.
.BR ksh (1)
is used to execute the at-job.
.RE

.sp
.ne 2
.mk
.na
.B -s
.ad
.RS 17n
.rt
Bourne shell.
.BR sh (1)
is used to execute the at-job.
.RE

.sp
.ne 2
.mk
.na
.B -f
.I file
.ad
.RS 17n
.rt
Specifies the path of a file to be used as the source of the at-job, instead
of standard input.
.RE

.sp
.ne 2
.mk
.na
.B -l
.ad
.RS 17n
.rt
(The letter ell.) Reports all jobs scheduled for the invoking user if no
.I at_job_id
operands are specified. If
.IR at_job_id s
are specified,
reports only information for these jobs.
.RE

.sp
.ne 2
.mk
.na
.B -m
.ad
.RS 17n
.rt
Sends mail to the invoking user after the at-job has run, announcing its
completion. Standard output and standard error produced by the at-job are
mailed to the user as well, unless redirected elsewhere. Mail is sent even if
the job produces no output.
.sp
If
.B -m
is not used, the job's standard output and standard error is
provided to the user by means of mail, unless they are redirected elsewhere;
if there is no such output to provide, the user is not notified of the job's
completion.
.RE

.sp
.ne 2
.mk
.na
.B -p
.I project
.ad
.RS 17n
.rt
Specifies under which project the
.B at
or
.B batch
job is run. When
used with the
.B -l
option, limits the search to that particular project.
Values for
.I project
is interpreted first as a project name, and then as a
possible project
.BR ID ,
if entirely numeric. By default, the user's current
project is used.
.RE

.sp
.ne 2
.mk
.na
.B -q
.I queuename
.ad
.RS 17n
.rt
Specifies in which queue to schedule a job for submission. When used with the
.B -l
option, limits the search to that particular queue. Values for
.I queuename
are limited to the lower case letters
.B a
through
.BR z .
By default, at-jobs are scheduled in queue
.BR a .
.RB "In contrast, queue" " b"
is reserved for batch jobs. Since queue
.B c
is reserved for cron jobs, it
can not be used with the
.B -q
option.
.RE

.sp
.ne 2
.mk
.na
.B -r
.I at_job_id
.ad
.RS 17n
.rt
Removes the jobs with the specified
.I at_job_id
operands that were
previously scheduled by the
.B at
utility.
.RE

.sp
.ne 2
.mk
.na
.B -t
.I time
.ad
.RS 17n
.rt
Submits the job to be run at the time specified by the
.IR time
option-argument, which must have the format as specified by the
.BR touch (1)
utility.
.RE

.SH OPERANDS
.sp
.LP
The following operands are supported:
.sp
.ne 2
.mk
.na
.I at_job_id
.ad
.RS 14n
.rt
The name reported by a previous invocation of the
.B at
utility at the
time the job was scheduled.
.RE

.sp
.ne 2
.mk
.na
.I timespec
.ad
.RS 14n
.rt
Submit the job to be run at the date and time specified. All of the
.I timespec
operands are interpreted as if they were separated by space
characters and concatenated. The date and time are interpreted as being in the
timezone of the user (as determined by the
.B TZ
variable), unless a
timezone name appears as part of
.I time
below.
.sp
In the "C" locale, the following describes the three parts of the time
specification string. All of the values from the
.B LC_TIME
categories in
the "C" locale are recognized in a case-insensitive manner.
.sp
.ne 2
.mk
.na
.I time
.ad
.RS 14n
.rt
The
.I time
can be specified as one, two or four digits. One- and
two-digit numbers are taken to be hours, four-digit numbers to be hours and
minutes. The time can alternatively be specified as two numbers separated by a
colon, meaning \fIhour\fB:\fIminute\fR. An AM/PM indication (one of the
values from the
.B am_pm
keywords in the
.B LC_TIME
locale category) can
follow the time; otherwise, a 24-hour clock time is understood. A timezone
name of
.BR GMT ,
.BR UCT ,
or
.B ZULU
(case insensitive) can follow to
specify that the time is in Coordinated Universal Time.  Other timezones can
be specified using the
.B TZ
environment variable. The
.I time
field can
also be one of the following tokens in the "C" locale:
.sp
.ne 2
.mk
.na
.B midnight
.ad
.RS 13n
.rt
Indicates the time 12:00 am (00:00).
.RE

.sp
.ne 2
.mk
.na
.B noon
.ad
.RS 13n
.rt
Indicates the time 12:00 pm.
.RE

.sp
.ne 2
.mk
.na
.B now
.ad
.RS 13n
.rt
Indicate the current day and time. Invoking
.B "at now"
submits an
at-job for potentially immediate execution (that is, subject only to
unspecified scheduling delays).
.RE

.RE

.sp
.ne 2
.mk
.na
.I date
.ad
.RS 14n
.rt
An optional
.I date
can be specified as either a month name (one of the
values from the
.B mon
or
.B abmon
keywords in the
.B LC_TIME
locale
category) followed by a day number (and possibly year number preceded by a
comma) or a day of the week (one of the values from the
.B day
or
.B abday
keywords in the
.B LC_TIME
locale category). Two special days
are recognized in the "C" locale:
.sp
.ne 2
.mk
.na
.B today
.ad
.RS 13n
.rt
Indicates the current day.
.RE

.sp
.ne 2
.mk
.na
.B tomorrow
.ad
.RS 13n
.rt
Indicates the day following the current day.
.RE

If no
.I date
is given,
.B today
is assumed if the given time is
greater than the current time, and
.B tomorrow
is assumed if it is less. If
the given month is less than the current month (and no year is given), next
year is assumed.
.RE

.sp
.ne 2
.mk
.na
.I increment
.ad
.RS 14n
.rt
The optional
.I increment
is a number preceded by a plus sign
.RB ( + )
and suffixed by one of the following:
.BR minutes ,
.BR hours ,
.BR days ,
.BR weeks ,
.BR months ,
or
.BR years .
(The singular forms are also
accepted.) The keyword
.B next
is equivalent to an increment number of \fB+ 1\fR. For example, the following are equivalent commands:
.sp
.in +2
.nf
\fBat 2pm + 1 week
at 2pm next week\fR
.fi
.in -2
.sp

.RE

.RE

.SH USAGE
.sp
.LP
The format of the
.B at
command line shown here is guaranteed only for the
"C" locale. Other locales are not supported for \fBmidnight\fR, \fBnoon\fR,
.BR now ,
.BR mon ,
.BR abmon ,
.BR day ,
.BR abday ,
.BR today ,
.BR tomorrow ,
.BR minutes ,
.BR hours ,
.BR days ,
.BR weeks ,
.BR months ,
.BR years ,
and
.BR next .
.sp
.LP
Since the commands run in a separate shell invocation, running in a separate
process group with no controlling terminal, open file descriptors, traps and
priority inherited from the invoking environment are lost.
.SH EXAMPLES
.SS "at"
.LP
.B Example 1
Typical Sequence at a Terminal
.sp
.LP
This sequence can be used at a terminal:

.sp
.in +2
.nf
$ at \(mim 0730 tomorrow
sort < file >outfile
<EOT>
.fi
.in -2
.sp

.LP
.B Example 2
Redirecting Output
.sp
.LP
This sequence, which demonstrates redirecting standard error to a pipe, is
useful in a command procedure (the sequence of output redirection
specifications is significant):

.sp
.in +2
.nf
$ at now + 1 hour <<!
diff file1 file2 2>&1 >outfile | mailx mygroup
.fi
.in -2
.sp

.LP
.B Example 3
Self-rescheduling a Job
.sp
.LP
To have a job reschedule itself,
.B at
can be invoked from within the
at-job. For example, this "daily-processing" script named \fBmy.daily\fR runs
every day (although
.B crontab
is a more appropriate vehicle for such
work):

.sp
.in +2
.nf
# my.daily runs every day
at now tomorrow < my.daily
daily-processing
.fi
.in -2
.sp

.LP
.B Example 4
Various Time and Operand Presentations
.sp
.LP
The spacing of the three portions of the "C" locale \fItimespec\fR is quite
flexible as long as there are no ambiguities. Examples of various times and
operand presentations include:

.sp
.in +2
.nf
at 0815am Jan 24
at 8 :15amjan24
at now "+ 1day"
at 5 pm FRIday
at '17
	utc+
	30minutes'
.fi
.in -2
.sp

.SS "batch"
.LP
.B Example 5
Typical Sequence at a Terminal
.sp
.LP
This sequence can be used at a terminal:

.sp
.in +2
.nf
$ batch
sort <file >outfile
<EOT>
.fi
.in -2
.sp

.LP
.B Example 6
Redirecting Output
.sp
.LP
This sequence, which demonstrates redirecting standard error to a pipe, is
useful in a command procedure (the sequence of output redirection
specifications is significant):

.sp
.in +2
.nf
$ batch <<!
diff file1 file2 2>&1 >outfile | mailx mygroup
!
.fi
.in -2
.sp

.SH ENVIRONMENT VARIABLES
.sp
.LP
See
.BR environ (5)
for descriptions of the following environment variables
that affect the execution of
.B at
and
.BR batch :
.BR LANG ,
.BR LC_ALL ,
.BR LC_CTYPE ,
.BR LC_MESSAGES ,
.BR NLSPATH ,
and
.BR LC_TIME .
.sp
.ne 2
.mk
.na
.B DATEMSK
.ad
.RS 12n
.rt
If the environment variable
.B DATEMSK
is set,
.B at
uses its value as
the full path name of a template file containing format strings. The strings
consist of format specifiers and text characters that are used to provide a
richer set of allowable date formats in different languages by appropriate
settings of the environment variable
.B LANG
or
.BR LC_TIME .
The list of
allowable format specifiers is located in the
.BR getdate "(3C) manual page."
The formats described in the
.B OPERANDS
section for the
.I time
and
.I date
arguments, the special names
.BR noon ,
.BR midnight ,
.BR now ,
.BR next ,
.BR today ,
.BR tomorrow ,
and the
.I increment
argument are
not recognized when
.B DATEMSK
is set.
.RE

.sp
.ne 2
.mk
.na
.B SHELL
.ad
.RS 12n
.rt
Determine a name of a command interpreter to be used to invoke the at-job. If
the variable is unset or
.IR NULL ,
.B sh
is used. If it is set to a value
other than
.BR sh ,
the implementation uses that shell; a warning diagnostic
is printed telling which shell will be used.
.RE

.sp
.ne 2
.mk
.na
.B TZ
.ad
.RS 12n
.rt
Determine the timezone. The job is submitted for execution at the time
specified by
.I timespec
or
.B -t
.I time
relative to the timezone
specified by the
.B TZ
variable. If
.I timespec
specifies a timezone, it
overrides
.BR TZ .
If
.I timespec
does not specify a timezone and
.BR TZ
is unset or
.IR NULL ,
an unspecified default timezone is used.
.RE

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 7n
.rt
The
.B at
utility successfully submitted, removed or listed a job or
jobs.
.RE

.sp
.ne 2
.mk
.na
.B >0
.ad
.RS 7n
.rt
An error occurred, and the job will not be scheduled.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B /usr/lib/cron/at.allow
.ad
.RS 27n
.rt
names of users, one per line, who are authorized access to the
.B at
and
.B batch
utilities
.RE

.sp
.ne 2
.mk
.na
.B /usr/lib/cron/at.deny
.ad
.RS 27n
.rt
names of users, one per line, who are denied access to the
.B at
and
.B batch
utilities
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.SS "/usr/bin/at"
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
_
CSINot enabled
_
Interface StabilityStandard
.TE

.SS "/usr/xpg4/bin/at"
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWxcu4
_
CSINot enabled
_
Interface StabilityStandard
.TE

.SS "/usr/bin/batch"
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWesu
_
CSIEnabled
_
Interface StabilityStandard
.TE

.SS "/usr/xpg4/bin/batch"
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWxcu4
_
CSIEnabled
_
Interface StabilityStandard
.TE

.SH SEE ALSO
.sp
.LP
.BR auths (1),
.BR crontab (1),
.BR csh (1),
.BR date (1),
.BR ksh (1),
.BR sh (1),
.BR touch (1),
.BR ulimit (1),
.BR umask (1),
.BR cron (1M),
.BR getdate (3C),
.BR auth_attr (4),
.BR shadow (4),
.BR queuedefs (4),
.BR attributes (5),
.BR environ (5),
.BR standards (5)
.SH NOTES
.sp
.LP
Regardless of queue used,
.BR cron (1M)
has a limit of 100 jobs in execution
at any time.
.sp
.LP
There can be delays in
.B cron
at job execution. In some cases, these
delays can compound to the point that
.B cron
job processing appears to be
hung. All jobs are executed eventually. When the delays are excessive, the
only workaround is to kill and restart
.BR cron .
