usr/src/man/man1/auths.1
'\" te
.\" Copyright (c) 2004, Sun Microsystems, Inc.  All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH auths 1 "25 Mar 2004" "SunOS 5.11" "User Commands"
.SH NAME
auths \- print authorizations granted to a user
.SH SYNOPSIS
.LP
.nf
\fBauths\fR [ \fIuser\fR ]...
.fi

.SH DESCRIPTION
.sp
.LP
The \fBauths\fR command prints on standard output the authorizations that
you or the optionally-specified user or role have been granted.
Authorizations are rights that are checked by certain privileged programs to
determine whether a user may execute restricted functionality.
.sp
.LP
Each user may have zero or more authorizations. Authorizations are
represented by fully-qualified names, which identify the organization that
created the authorization and the functionality that it controls. Following
the Java convention, the hierarchical components of an authorization are
separated by dots (\fB\&.\fR), starting with the reverse order Internet
domain name of the creating organization, and ending with the specific
function within a class of authorizations.
.sp
.LP
An asterisk (\fB*\fR) indicates all authorizations in a class.
.sp
.LP
A user's authorizations are looked up in \fBuser_attr\fR(4) and in the
\fB/etc/security/policy.conf\fR file (see \fBpolicy.conf\fR(4)).
Authorizations may be specified directly in \fBuser_attr\fR(4) or indirectly
through \fBprof_attr\fR(4). Authorizations may also be assigned to every
user in the system directly as default authorizations or indirectly as
default profiles in the \fB/etc/security/policy.conf\fR file.
.SH EXAMPLES
.LP
\fBExample 1 \fRSample output
.sp
.LP
The \fBauths\fR output has the following form:

.sp
.in +2
.nf
example% \fBauths tester01 tester02\fR
tester01 : solaris.system.date,solaris.jobs.admin
tester02 : solaris.system.*
example%
.fi
.in -2
.sp

.sp
.LP
Notice that there is no space after the comma separating the authorization
names in \fBtester01\fR.

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
\fB0\fR
.ad
.RS 5n
.rt
Successful completion.
.RE

.sp
.ne 2
.mk
.na
\fB1\fR
.ad
.RS 5n
.rt
An error occurred.
.RE

.SH FILES
.sp
.LP
\fB/etc/user_attr\fR
.sp
.LP
\fB/etc/security/auth_attr\fR
.sp
.LP
\fB/etc/security/policy.conf\fR
.sp
.LP
\fB/etc/security/prof_attr\fR
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.sp
.LP
\fBprofiles\fR(1), \fBroles\fR(1), \fBgetauthattr\fR(3SECDB),
\fBauth_attr\fR(4), \fBpolicy.conf\fR(4), \fBprof_attr\fR(4),
\fBuser_attr\fR(4), \fBattributes\fR(5)
