usr/src/man/man1/auths.1
'\" te
.\" Copyright (c) 2004, Sun Microsystems, Inc.  All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH auths 1 "25 Mar 2004" "SunOS 5.11" "User Commands"
.SH NAME
auths \- print authorizations granted to a user
.SH SYNOPSIS
.LP
.nf
\fBauths\fR [ \fIuser\fR ]...
.fi

.SH DESCRIPTION
.sp
.LP
The
.B auths
command prints on standard output the authorizations that
you or the optionally-specified user or role have been granted.
Authorizations are rights that are checked by certain privileged programs to
determine whether a user may execute restricted functionality.
.sp
.LP
Each user may have zero or more authorizations. Authorizations are
represented by fully-qualified names, which identify the organization that
created the authorization and the functionality that it controls. Following
the Java convention, the hierarchical components of an authorization are
separated by dots (\fB\&.\fR), starting with the reverse order Internet
domain name of the creating organization, and ending with the specific
function within a class of authorizations.
.sp
.LP
An asterisk
.RB ( * )
indicates all authorizations in a class.
.sp
.LP
A user's authorizations are looked up in
.BR user_attr (4)
and in the
.B /etc/security/policy.conf
file (see
.BR policy.conf (4)).
Authorizations may be specified directly in
.BR user_attr (4)
or indirectly
through
.BR prof_attr (4).
Authorizations may also be assigned to every
user in the system directly as default authorizations or indirectly as
default profiles in the
.B /etc/security/policy.conf
file.
.SH EXAMPLES
.LP
.B Example 1
Sample output
.sp
.LP
The
.B auths
output has the following form:

.sp
.in +2
.nf
example% \fBauths tester01 tester02\fR
tester01 : solaris.system.date,solaris.jobs.admin
tester02 : solaris.system.*
example%
.fi
.in -2
.sp

.sp
.LP
Notice that there is no space after the comma separating the authorization
names in
.BR tester01 .

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 5n
.rt
Successful completion.
.RE

.sp
.ne 2
.mk
.na
.B 1
.ad
.RS 5n
.rt
An error occurred.
.RE

.SH FILES
.sp
.LP
.B /etc/user_attr
.sp
.LP
.B /etc/security/auth_attr
.sp
.LP
.B /etc/security/policy.conf
.sp
.LP
.B /etc/security/prof_attr
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.sp
.LP
.BR profiles (1),
.BR roles (1),
.BR getauthattr (3SECDB),
.BR auth_attr (4),
.BR policy.conf (4),
.BR prof_attr (4),
.BR user_attr (4),
.BR attributes (5)
