usr/src/man/man1/basename.1
'\" te
.\" Copyright 1989 AT&T
.\" Copyright (c) 2001, Sun Microsystems, Inc.  All Rights Reserved
.\" Portions Copyright (c) 1992, X/Open Company Limited  All Rights Reserved
.\"
.\" Sun Microsystems, Inc. gratefully acknowledges The Open Group for
.\" permission to reproduce portions of its copyrighted documentation.
.\" Original documentation from The Open Group can be obtained online
.\" at http://www.opengroup.org/bookstore/.
.\"
.\" The Institute of Electrical and Electronics Engineers and The Open Group,
.\" have given us permission to reprint portions of their documentation.
.\"
.\" In the following statement, the phrase "this text" refers to portions
.\" of the system documentation.
.\"
.\" Portions of this text are reprinted and reproduced in electronic form in
.\" the Sun OS Reference Manual, from IEEE Std 1003.1, 2004 Edition, Standard
.\" for Information Technology -- Portable Operating System Interface (POSIX),
.\" The Open Group Base Specifications Issue 6, Copyright (C) 2001-2004 by the
.\" Institute of Electrical and Electronics Engineers, Inc and The Open Group.
.\" In the event of any discrepancy between these versions and the original
.\" IEEE and The Open Group Standard, the original IEEE and The Open Group
.\" Standard is the referee document.
.\"
.\" The original Standard can be obtained online at
.\" http://www.opengroup.org/unix/online.html.
.\"
.\" This notice shall appear on any product containing this material.
.\"
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH basename 1 "18 Mar 1997" "SunOS 5.11" "User Commands"
.SH NAME
basename, dirname \- deliver portions of path names
.SH SYNOPSIS
.LP
.nf
\fB/usr/bin/basename\fR \fIstring\fR [\fIsuffix\fR]
.fi

.LP
.nf
\fB/usr/xpg4/bin/basename\fR \fIstring\fR [\fIsuffix\fR]
.fi

.LP
.nf
\fBdirname\fR \fIstring\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B basename
utility deletes any prefix ending in
.B /
and the
.I suffix
(if present in
.IR string )
from
.IR string ,
and prints the
result on the standard output. It is normally used inside substitution marks
(\fB`\|`\fR) within shell procedures.
.SS "/usr/bin"
.sp
.LP
The
.I suffix
is a pattern defined on the
.BR expr (1)
manual page.
.SS "/usr/xpg4/bin"
.sp
.LP
The
.I suffix
is a string with no special significance attached to any
of the characters it contains.
.sp
.LP
The
.B dirname
utility delivers all but the last level of the path name
in
.IR string .
.SH EXAMPLES
.LP
.B Example 1
Setting environment variables
.sp
.LP
The following example, invoked with the argument
.B /home/sms/personal/mail
sets the environment variable
.B NAME
to
the file named
.B mail
and the environment variable
.B MYMAILPATH
to
the string
.BR /home/sms/personal :

.sp
.in +2
.nf
example% \fBNAME=`basename \|$HOME/personal/mail`\fR
example% \fBMYMAILPATH=`dirname \|$HOME/personal/mail`\fR
.fi
.in -2
.sp

.LP
.B Example 2
Compiling a file and moving the output
.sp
.LP
This shell procedure, invoked with the argument
.BR /usr/src/bin/cat.c ,
compiles the named file and moves the output to
.B cat
in the current
directory:

.sp
.in +2
.nf
example% \fBcc $1\fR
example% \fBmv a.out `basename $1 .c`\fR
.fi
.in -2
.sp

.SH ENVIRONMENT VARIABLES
.sp
.LP
See
.BR environ (5)
for descriptions of the following environment
variables that affect  the execution of
.B basename
and
.BR dirname :
.BR LANG ,
.BR LC_ALL ,
.BR LC_CTYPE ,
.BR LC_MESSAGES ,
and
.BR NLSPATH .
.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 6n
.rt
Successful completion.
.RE

.sp
.ne 2
.mk
.na
.B >0
.ad
.RS 6n
.rt
An error occurred.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.SS "/usr/bin"
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SS "/usr/xpg4/bin"
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWxcu4
_
Interface StabilityStandard
.TE

.SH SEE ALSO
.sp
.LP
.BR expr (1),
.BR basename (3C),
.BR attributes (5),
.BR environ (5),
.BR standards (5)
