usr/src/man/man1/chgrp.1
'\" te
.\" Copyright 1989 AT&T
.\" Copyright (c) 1983 Regents of the University of California.  All rights reserved.
.\" The Berkeley software License Agreement  specifies the terms and conditions for redistribution.
.\" Copyright (c) 2003, Sun Microsystems, Inc.  All Rights Reserved
.\" Portions Copyright (c) 1992, X/Open Company Limited  All Rights Reserved
.\"
.\" Sun Microsystems, Inc. gratefully acknowledges The Open Group for
.\" permission to reproduce portions of its copyrighted documentation.
.\" Original documentation from The Open Group can be obtained online
.\" at http://www.opengroup.org/bookstore/.
.\"
.\" The Institute of Electrical and Electronics Engineers and The Open Group,
.\" have given us permission to reprint portions of their documentation.
.\"
.\" In the following statement, the phrase "this text" refers to portions
.\" of the system documentation.
.\"
.\" Portions of this text are reprinted and reproduced in electronic form in
.\" the Sun OS Reference Manual, from IEEE Std 1003.1, 2004 Edition, Standard
.\" for Information Technology -- Portable Operating System Interface (POSIX),
.\" The Open Group Base Specifications Issue 6, Copyright (C) 2001-2004 by the
.\" Institute of Electrical and Electronics Engineers, Inc and The Open Group.
.\" In the event of any discrepancy between these versions and the original
.\" IEEE and The Open Group Standard, the original IEEE and The Open Group
.\" Standard is the referee document.
.\"
.\" The original Standard can be obtained online at
.\" http://www.opengroup.org/unix/online.html.
.\"
.\" This notice shall appear on any product containing this material.
.\"
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH chgrp 1 "11 Jul 2008" "SunOS 5.11" "User Commands"
.SH NAME
chgrp \- change file group ownership
.SH SYNOPSIS
.LP
.nf
\fBchgrp\fR [\fB-fhR\fR] \fIgroup\fR \fIfile\fR...
.fi

.LP
.nf
\fBchgrp\fR \fB-s\fR [\fB-fhR\fR] \fIgroupsid\fR \fIfile\fR...
.fi

.LP
.nf
\fBchgrp\fR \fB-R\fR [f] [\fB-H\fR | \fB-L\fR | \fB-P\fR] \fIgroup\fR \fIfile\fR...
.fi

.LP
.nf
\fBchgrp\fR \fB-s\fR \fB-R\fR [f] [\fB-H\fR | \fB-L\fR | \fB-P\fR] \fIgroupsid\fR \fIfile\fR...
.fi

.SH DESCRIPTION
.sp
.LP
The
.B chgrp
utility will set the group ID of the file named by each
\fIfile\fR operand to the group ID specified by the \fIgroup\fR operand.
.sp
.LP
For each \fIfile\fR operand, it will perform actions equivalent to the
.BR chown (2)
function, called with the following arguments:
.RS +4
.TP
.ie t \(bu
.el o
The \fIfile\fR operand will be used as the
.I path
argument.
.RE
.RS +4
.TP
.ie t \(bu
.el o
The user ID of the file will be used as the
.I owner
argument.
.RE
.RS +4
.TP
.ie t \(bu
.el o
The specified group ID will be used as the
.I group
argument.
.RE
.sp
.LP
Unless
.B chgrp
is invoked by a process with appropriate privileges, the
set-user-ID and set-group-ID bits of a regular file will be cleared upon
successful completion; the set-user-ID and set-group-ID bits of other file
types may be cleared.
.sp
.LP
The operating system has a configuration option
.BR _POSIX_CHOWN_RESTRICTED ,
to restrict ownership changes. When this
option is in effect, the owner of the file may change the group of the file
only to a group to which the owner belongs. Only the super-user can
arbitrarily change owner IDs, whether or not this option is in effect. To
set this configuration option, include the following line in
.BR /etc/system :
.sp
.in +2
.nf
set rstchown = 1
.fi
.in -2

.sp
.LP
To disable this option, include the following line in
.BR /etc/system :
.sp
.in +2
.nf
set rstchown = 0
.fi
.in -2

.sp
.LP
\fB_POSIX_CHOWN_RESTRICTED\fR is enabled by default. See
.BR system (4)
and
.BR fpathconf (2).
.SH OPTIONS
.sp
.LP
The following options are supported.
.SS "/usr/bin/chgrp and /usr/xpg4/bin/chgrp"
.sp
.ne 2
.mk
.na
\fB-f\fR
.ad
.RS 6n
.rt
Force. Does not report errors.
.RE

.sp
.ne 2
.mk
.na
.B -h
.ad
.RS 6n
.rt
If the file is a symbolic link, this option changes the group of the
symbolic link. Without this option, the group of the file referenced by the
symbolic link is changed.
.RE

.sp
.ne 2
.mk
.na
.B -H
.ad
.RS 6n
.rt
If the file specified on the command line is a symbolic link referencing a
file of type directory, this option changes the group of the directory
referenced by the symbolic link and all the files in the file hierarchy
below it. If a symbolic link is encountered when traversing a file
hierarchy, the group of the target file is changed, but no recursion takes
place.
.RE

.sp
.ne 2
.mk
.na
.B -L
.ad
.RS 6n
.rt
If the file is a symbolic link, this option changes the group of the file
referenced by the symbolic link. If the file specified on the command line,
or encountered during the traversal of the file hierarchy, is a symbolic
link referencing a file of type directory, then this option changes the
group of the directory referenced by the symbolic link and all files in the
file hierarchy below it.
.RE

.sp
.ne 2
.mk
.na
.B -P
.ad
.RS 6n
.rt
If the file specified on the command line or encountered during the
traversal of a file hierarchy is a symbolic link, this option changes the
group of the symbolic link. This option does not follow the symbolic link to
any other part of the file hierarchy.
.RE

.sp
.ne 2
.mk
.na
.B -s
.ad
.RS 6n
.rt
The specified group is Windows SID. This option requires a file system that
supports storing SIDs, such as ZFS.
.RE

.sp
.LP
Specifying more than one of the mutually-exclusive options
.BR -H ,
.BR -L ,
or
.B -P
is not considered an error. The last option specified
determines the behavior of
.BR chgrp .
.SS "/usr/bin/chgrp"
.sp
.ne 2
.mk
.na
.B -R
.ad
.RS 6n
.rt
Recursive.
.B chgrp
descends through the directory, and any
subdirectories, setting the specified group
.B ID
as it proceeds. When a
symbolic link is encountered, the group of the target file is changed,
unless the
.B -h
or
.B -P
option is specified. However, no recursion
takes place, unless the
.B -H
or
.B -L
option is specified.
.RE

.SS "/usr/xpg4/bin/chgrp"
.sp
.ne 2
.mk
.na
.B -R
.ad
.RS 6n
.rt
Recursive.
.B chgrp
descends through the directory, and any
subdirectories, setting the specified group
.B ID
as it proceeds. When a
symbolic link is encountered, the group of the target file is changed,
unless the
.B -h
or
.B -P
option is specified. Unless the
.BR -H ,
.BR -L ,
or
.B -P
option is specified, the
.B -L
option is used as
the default mode.
.RE

.SH OPERANDS
.sp
.LP
The following operands are supported:
.sp
.ne 2
.mk
.na
.I group
.ad
.RS 9n
.rt
A group name from the group database or a numeric group ID. Either
specifies a group ID to be given to each file named by one of the \fIfile\fR
operands. If a numeric
.I group
operand exists in the group database as a
group name, the group ID number associated with that group name is used as
the group ID.
.RE

.sp
.ne 2
.mk
.na
\fIfile\fR
.ad
.RS 9n
.rt
A path name of a file whose group ID is to be modified.
.RE

.SH USAGE
.sp
.LP
See
.BR largefile (5)
for the description of the behavior of
.BR chgrp
when encountering files greater than or equal to 2 Gbyte (2^31 bytes).
.SH ENVIRONMENT VARIABLES
.sp
.LP
See
.BR environ (5)
for descriptions of the following environment
variables that affect the execution of
.BR chgrp :
.BR LANG ,
.BR LC_ALL ,
.BR LC_CTYPE ,
.BR LC_MESSAGES ,
and
.BR NLSPATH .
.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 6n
.rt
The utility executed successfully and all requested changes were made.
.RE

.sp
.ne 2
.mk
.na
.B >0
.ad
.RS 6n
.rt
An error occurred.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/group
.ad
.RS 14n
.rt
group file
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.SS "/usr/bin/chgrp"
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
_
CSIEnabled. See NOTES.
_
Interface StabilityCommitted
_
StandardSee \fBstandards\fR(5).
.TE

.SS "/usr/xpg4/bin/chgrp"
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWxcu4
_
CSIEnabled. See NOTES.
_
Interface StabilityCommitted
_
StandardSee \fBstandards\fR(5).
.TE

.SH SEE ALSO
.sp
.LP
.BR chmod (1),
.BR chown (1),
.BR id (1M),
.BR chown (2),
.BR fpathconf (2),
.BR group (4),
.BR passwd (4),
.BR system (4),
.BR attributes (5),
.BR environ (5),
.BR largefile (5),
.BR standards (5)
.SH NOTES
.sp
.LP
\fBchgrp\fR is CSI-enabled except for the \fIgroup\fR name.
