usr/src/man/man1/chown.1
'\" te
.\" Copyright 1989 AT&T
.\" Copyright (c) 2008, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" Portions Copyright (c) 1992, X/Open Company Limited All Rights Reserved
.\" Portions Copyright (c) 1982-2007 AT&T Knowledge Ventures
.\"
.\" Sun Microsystems, Inc. gratefully acknowledges The Open Group for
.\" permission to reproduce portions of its copyrighted documentation.
.\" Original documentation from The Open Group can be obtained online
.\" at http://www.opengroup.org/bookstore/.
.\"
.\" The Institute of Electrical and Electronics Engineers and The Open Group,
.\" have given us permission to reprint portions of their documentation.
.\"
.\" In the following statement, the phrase "this text" refers to portions
.\" of the system documentation.
.\"
.\" Portions of this text are reprinted and reproduced in electronic form in
.\" the Sun OS Reference Manual, from IEEE Std 1003.1, 2004 Edition, Standard
.\" for Information Technology -- Portable Operating System Interface (POSIX),
.\" The Open Group Base Specifications Issue 6, Copyright (C) 2001-2004 by the
.\" Institute of Electrical and Electronics Engineers, Inc and The Open Group.
.\" In the event of any discrepancy between these versions and the original
.\" IEEE and The Open Group Standard, the original IEEE and The Open Group
.\" Standard is the referee document.
.\"
.\" The original Standard can be obtained online at
.\" http://www.opengroup.org/unix/online.html.
.\"
.\" This notice shall appear on any product containing this material.
.\"
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH chown 1 "11 Jul 2008" "SunOS 5.11" "User Commands"
.SH NAME
chown \- change file ownership
.SH SYNOPSIS
.SS "/usr/bin/chown"
.LP
.nf
\fB/usr/bin/chown\fR [\fB-fhR\fR] \fIowner\fR[:\fIgroup\fR] \fIfile\fR.\|.\|.
.fi

.LP
.nf
\fB/usr/bin/chown\fR \fB-s\fR [\fB-fhR\fR] \fIownersid\fR[:\fIgroupsid\fR] \fIfile\fR.\|.\|.
.fi

.LP
.nf
\fB/usr/bin/chown\fR \fB-R\fR [\fB-f\fR] [\fB-H\fR | \fB-L\fR | \fB-P\fR] \fIowner\fR[:\fIgroup\fR] \fIfile\fR.\|.\|.
.fi

.LP
.nf
\fB/usr/bin/chown\fR \fB-s\fR \fB-R\fR [\fB-f\fR] [\fB-H\fR | \fB-L\fR | \fB-P\fR] \fIownersid\fR[:\fIgroupsid\fR] \fIfile\fR.\|.\|.
.fi

.SS "/usr/xpg4/bin/chown"
.LP
.nf
\fB/usr/xpg4/bin/chown\fR [\fB-fhR\fR] \fIowner\fR[:\fIgroup\fR] \fIfile\fR.\|.\|.
.fi

.LP
.nf
\fB/usr/xpg4/bin/chown\fR \fB-s\fR [\fB-fhR\fR] \fIownersid\fR[:\fIgroupsid\fR] \fIfile\fR.\|.\|.
.fi

.LP
.nf
\fB/usr/xpg4/bin/chown\fR \fB-R\fR [\fB-f\fR] [\fB-H\fR | \fB-L\fR | \fB-P\fR] \fIowner\fR[:\fIgroup\fR] \fIfile\fR.\|.\|.
.fi

.LP
.nf
\fB/usr/xpg4/bin/chown\fR \fB-s\fR \fB-R\fR [\fB-f\fR] [\fB-H\fR | \fB-L\fR | \fB-P\fR] \fIownersid\fR[:\fIgroupsid\fR] \fIfile\fR.\|.\|.
.fi

.SS "ksh93"
.LP
.nf
\fBchown\fR [\fB-cflhmnvHLPRX\fR] [\fB-r\fR \fIfile\fR] \fIowner\fR[:\fIgroup\fR] \fIfile\fR.\|.\|.
.fi

.SH DESCRIPTION
.SS "/usr/bin/chown and /usr/xpg4/bin/chown"
.sp
.LP
The
.B chown
utility sets the user
.B ID
of the file named by each
.B file
to the user
.B ID
specified by
.IR owner ,
and, optionally,
sets the group
.B ID
to that specified by
.IR group .
.sp
.LP
If
.B chown
is invoked by other than the super-user, the
.RB set-user- ID
bit is cleared.
.sp
.LP
Only the owner of a file (or the super-user) can change the owner of that
file.
.sp
.LP
The operating system has a configuration option
.BR {_POSIX_CHOWN_RESTRICTED} ,
to restrict ownership changes. When this
option is in effect the owner of the file is prevented from changing the owner
.B ID
of the file. Only the super-user can arbitrarily change owner
.BR ID s
whether or not this option is in effect. To set this configuration
option, include the following line in
.BR /etc/system :
.sp
.in +2
.nf
\fBset rstchown = 1\fR
.fi
.in -2
.sp

.sp
.LP
To disable this option, include the following line in
.BR /etc/system :
.sp
.in +2
.nf
\fBset rstchown = 0\fR
.fi
.in -2
.sp

.sp
.LP
.B {_POSIX_CHOWN_RESTRICTED}
is enabled by default. See
.BR system (4)
and
.BR fpathconf (2).
.SS "ksh93"
.sp
.LP
The
.B chown
built-in in
.B ksh93
is associated with the
.B /bin
and
.B /usr/bin
paths. It is invoked when
.B chown
is executed without a
pathname prefix and the pathname search finds a
.B /bin/chown
or
/usr/bin/chown executable.
.sp
.LP
.B chown
changes the ownership of each file to
.IR owner .
.I owner
can be specified as either a user name or a numeric user id. The group
ownership of each file can also be changed to
.I group
by appending
.I :group
to the user name.
.SH OPTIONS
.SS "/usr/bin/chown and /usr/xpg4/bin/chown"
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -f
.ad
.RS 6n
.rt
Force. Does not report errors.
.RE

.sp
.ne 2
.mk
.na
.B -h
.ad
.RS 6n
.rt
If the file is a symbolic link, this option changes the owner of the symbolic
link. Without this option, the owner of the file referenced by the symbolic
link is changed.
.RE

.sp
.ne 2
.mk
.na
.B -H
.ad
.RS 6n
.rt
If the file specified on the command line is a symbolic link referencing a
file of type directory, this option changes the owner of the directory
referenced by the symbolic link and all the files in the file hierarchy below
it. If a symbolic link is encountered when traversing a file hierarchy, the
owner of the target file is changed, but no recursion takes place.
.RE

.sp
.ne 2
.mk
.na
.B -L
.ad
.RS 6n
.rt
If the file is a symbolic link, this option changes the owner of the file
referenced by the symbolic link. If the file specified on the command line, or
encountered during the traversal of the file hierarchy, is a symbolic link
referencing a file of type directory, then this option changes the owner of
the directory referenced by the symbolic link and all files in the file
hierarchy below it.
.RE

.sp
.ne 2
.mk
.na
.B -P
.ad
.RS 6n
.rt
If the file specified on the command line or encountered during the traversal
of a file hierarchy is a symbolic link, this option changes the owner of the
symbolic link. This option does not follow the symbolic link to any other part
of the file hierarchy.
.RE

.sp
.ne 2
.mk
.na
.B -s
.ad
.RS 6n
.rt
The owner and/or group arguments are Windows SID strings. This option
requires a file system that supports storing SIDs, such as ZFS.
.RE

.sp
.LP
Specifying more than one of the mutually-exclusive options
.BR -H ,
.BR -L ,
or
.B -P
is not considered an error. The last option specified
determines the behavior of
.BR chown .
.SS "/usr/bin/chown"
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -R
.ad
.RS 6n
.rt
Recursive.
.B chown
descends through the directory, and any
subdirectories, setting the specified ownership
.B ID
as it proceeds. When
a symbolic link is encountered, the owner of the target file is changed,
unless the
.B -h
or
.B -P
option is specified. However, no recursion
takes place, unless the
.B -H
or
.B -L
option is specified.
.RE

.SS "/usr/xpg4/bin/chown"
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -R
.ad
.RS 6n
.rt
Recursive.
.B chown
descends through the directory, and any
subdirectories, setting the specified ownership
.B ID
as it proceeds. When
a symbolic link is encountered, the owner of the target file is changed,
unless the
.B -h
or
.B -P
option is specified. Unless the
.BR -H ,
.BR -L ,
or
.B -P
option is specified, the
.B -L
option is used as the
default mode.
.RE

.SS "ksh93"
.sp
.LP
The following options are supported by the
.B ksh93
.RB built-in " chown"
command:
.sp
.ne 2
.mk
.na
.B -c
.ad
.br
.na
.B --changes
.ad
.sp .6
.RS 4n
Describe only files whose ownership actually changes.
.RE

.sp
.ne 2
.mk
.na
.B -f
.ad
.br
.na
.B --quiet | silent
.ad
.sp .6
.RS 4n
Do not report files whose ownership fails to change.
.RE

.sp
.ne 2
.mk
.na
.B -l | h
.ad
.br
.na
.B --symlink
.ad
.sp .6
.RS 4n
Change the ownership of the symbolic links on systems that support this
option.
.RE

.sp
.ne 2
.mk
.na
.B -m
.ad
.br
.na
.B --map
.ad
.sp .6
.RS 4n
Interpret the first operand as a file that contains a map of:
.sp
.in +2
.nf
\fIfrom_uid\fR:\fIfrom_gid  to_uid:to_gid\fR
.fi
.in -2
.sp

pairs. Ownership of files matching the
.I from
part of any pair is changed
to the corresponding
.I to
part of the pair. The process stops at the first
match for each file. Unmatched files are silently ignored.
.RE

.sp
.ne 2
.mk
.na
.B -n
.ad
.br
.na
.B --show
.ad
.sp .6
.RS 4n
Show actions but do not execute.
.RE

.sp
.ne 2
.mk
.na
.B -r
.ad
.br
.na
.B --reference=file
.ad
.sp .6
.RS 4n
Omit the explicit ownership operand and use the ownership of the file
instead.
.RE

.sp
.ne 2
.mk
.na
.B -v
.ad
.br
.na
.B --verbose
.ad
.sp .6
.RS 4n
Describe the changed permissions of all files.
.RE

.sp
.ne 2
.mk
.na
.B -H
.ad
.br
.na
.B --metaphysical
.ad
.sp .6
.RS 4n
Follow symbolic links for command arguments. Otherwise do not follow symbolic
links when traversing directories.
.RE

.sp
.ne 2
.mk
.na
.B -L
.ad
.br
.na
.B --logical | follow
.ad
.sp .6
.RS 4n
Follow symbolic links when traversing directories.
.RE

.sp
.ne 2
.mk
.na
.B -P
.ad
.br
.na
.B --physical | nofollow
.ad
.sp .6
.RS 4n
Do not follow symbolic links when traversing directories.
.RE

.sp
.ne 2
.mk
.na
.B -R
.ad
.br
.na
.B --recursive
.ad
.sp .6
.RS 4n
Recursively change ownership of directories and their contents.
.RE

.sp
.ne 2
.mk
.na
.B -X
.ad
.br
.na
.B --test
.ad
.sp .6
.RS 4n
Canonicalize output for testing.
.RE

.SH OPERANDS
.sp
.LP
The following operands are supported:
.sp
.ne 2
.mk
.na
\fIowner\fR[\fB:\fIgroup\fR]\fR
.ad
.RS 17n
.rt
A user
.B ID
and optional group
.B ID
to be assigned to
.BR file .
The
.I owner
portion of this operand must be a user name from the user database
or a numeric user
.BR ID .
Either specifies a user
.B ID
to be given to
each file named by
.IR file .
If a numeric
.I owner
exists in the user
database as a user name, the user
.B ID
number associated with that user
name is used as the user
.BR ID .
Similarly, if the
.I group
portion of
this operand is present, it must be a group name from the group database or a
numeric group
.BR ID .
Either specifies a group
.B ID
to be given to each
file. If a numeric group operand exists in the group database as a group name,
the group
.B ID
number associated with that group name is used as the group
.BR ID .
.RE

.sp
.ne 2
.mk
.na
.I file
.ad
.RS 17n
.rt
A path name of a file whose user
.B ID
is to be modified.
.RE

.SH USAGE
.sp
.LP
See
.BR largefile (5)
for the description of the behavior of
.BR chown
when encountering files greater than or equal to 2 Gbyte ( 2^31 bytes).
.SH EXAMPLES
.LP
.B Example 1
Changing Ownership of All Files in the Hierarchy
.sp
.LP
The following command changes ownership of all files in the hierarchy,
including symbolic links, but not the targets of the links:

.sp
.in +2
.nf
example% \fBchown \(miR \(mih \fIowner\fR[:group] \fIfile\fR.\|.\|.\fR
.fi
.in -2
.sp

.SH ENVIRONMENT VARIABLES
.sp
.LP
See
.BR environ (5)
for descriptions of the following environment variables
that affect the execution of
.BR chown :
.BR LANG ,
.BR LC_ALL ,
.BR LC_CTYPE ,
.BR LC_MESSAGES ,
and
.BR NLSPATH .
.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 6n
.rt
The utility executed successfully and all requested changes were made.
.RE

.sp
.ne 2
.mk
.na
.B >0
.ad
.RS 6n
.rt
An error occurred.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/passwd
.ad
.RS 15n
.rt
System password file
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.SS "/usr/bin/chown"
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
_
CSIEnabled. See NOTES.
_
Interface StabilityCommitted
_
StandardSee \fBstandards\fR(5).
.TE

.SS "/usr/xpg4/bin/chown"
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWxcu4
_
CSIEnabled. See \fBNOTES\fR.
_
Interface StabilityCommitted
_
StandardSee \fBstandards\fR(5).
.TE

.SS "ksh93"
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
_
Interface StabilitySee below.
.TE

.sp
.LP
The
.B ksh93
built-in binding to
.B /bin
and
.B /usr/bin
is
Volatile. The built-in interfaces are Uncommitted.
.SH SEE ALSO
.sp
.LP
.BR chgrp (1),
\fBchmod\fR(1),\fBksh93\fR(1),  \fBchown\fR(2),
.BR fpathconf (2),
.BR passwd (4),
.BR system (4),
.BR attributes (5),
.BR environ (5),
.BR largefile (5),
.BR standards (5)
.SH NOTES
.sp
.LP
.B chown
is
.BR CSI -enabled
except for the \fIowner\fR and \fIgroup\fR
names.
