usr/src/man/man1/cp.1
'\" te
.\" Copyright (c) 1992, X/Open Company Limited All Rights Reserved
.\" Copyright 1989 AT&T
.\" Portions Copyright (c) 2007, Sun Microsystems, Inc. All Rights Reserved
.\"
.\" Sun Microsystems, Inc. gratefully acknowledges The Open Group for
.\" permission to reproduce portions of its copyrighted documentation.
.\" Original documentation from The Open Group can be obtained online
.\" at http://www.opengroup.org/bookstore/.
.\"
.\" The Institute of Electrical and Electronics Engineers and The Open Group,
.\" have given us permission to reprint portions of their documentation.
.\"
.\" In the following statement, the phrase "this text" refers to portions
.\" of the system documentation.
.\"
.\" Portions of this text are reprinted and reproduced in electronic form in
.\" the Sun OS Reference Manual, from IEEE Std 1003.1, 2004 Edition, Standard
.\" for Information Technology -- Portable Operating System Interface (POSIX),
.\" The Open Group Base Specifications Issue 6, Copyright (C) 2001-2004 by the
.\" Institute of Electrical and Electronics Engineers, Inc and The Open Group.
.\" In the event of any discrepancy between these versions and the original
.\" IEEE and The Open Group Standard, the original IEEE and The Open Group
.\" Standard is the referee document.
.\"
.\" The original Standard can be obtained online at
.\" http://www.opengroup.org/unix/online.html.
.\"
.\" This notice shall appear on any product containing this material.
.\"
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH cp 1 "30 Oct 2007" "SunOS 5.11" "User Commands"
.SH NAME
cp \- copy files
.SH SYNOPSIS
.LP
.nf
\fB/usr/bin/cp\fR [\fB-fip@/\fR] \fIsource_file\fR \fItarget_file\fR
.fi

.LP
.nf
\fB/usr/bin/cp\fR [\fB-fip@/\fR] \fIsource_file\fR.\|.\|. \fItarget\fR
.fi

.LP
.nf
\fB/usr/bin/cp\fR \fB-r\fR | \fB-R\fR [\fB-H\fR | \fB-L\fR | \fB-P\fR] [\fB-fip@/\fR] \fIsource_dir\fR.\|.\|. \fItarget\fR
.fi

.LP
.nf
\fB/usr/bin/cp\fR \fB-R\fR | \fB-R\fR [\fB-H\fR | \fB-L\fR | \fB-P\fR] [\fB-fip@/\fR] \fIsource_dir\fR.\|.\|. \fItarget\fR
.fi

.LP
.nf
\fB/usr/xpg4/bin/cp\fR [\fB-fip@/\fR] \fIsource_file\fR \fItarget_file\fR
.fi

.LP
.nf
\fB/usr/xpg4/bin/cp\fR [\fB-fip@/\fR] \fIsource_file\fR.\|.\|. \fItarget\fR
.fi

.LP
.nf
\fB/usr/xpg4/bin/cp\fR \fB-r\fR | \fB-R\fR [\fB-H\fR | \fB-L\fR | \fB-P\fR] [\fB-fip@/\fR] \fIsource_dir\fR.\|.\|. \fItarget\fR
.fi

.LP
.nf
\fB/usr/xpg4/bin/cp\fR \fB-R\fR | \fB-R\fR [\fB-H\fR | \fB-L\fR | \fB-P\fR] [\fB-fip@/\fR] \fIsource_dir\fR.\|.\|. \fItarget\fR
.fi

.SH DESCRIPTION
.sp
.LP
In the first synopsis form, neither \fIsource_file\fR nor \fItarget_file\fR
are directory files, nor can they have the same name. The
.B cp
utility
copies the contents of \fIsource_file\fR to the destination path named by
\fItarget_file\fR. If \fItarget_file\fR exists, \fBcp\fR overwrites its
contents, but the mode (and
.B ACL
if applicable), owner, and group
associated with it are not changed. The last modification time of
\fItarget_file\fR and the last access time of \fIsource_file\fR are set to
the time the copy was made. If \fItarget_file\fR does not exist, \fBcp\fR
creates a new file named \fItarget_file\fR that has the same mode as
\fIsource_file\fR except that the sticky bit is not set unless the user is
super-user. In this case, the owner and group of \fItarget_file\fR are those
of the user, unless the setgid bit is set on the directory containing the
newly created file. If the directory's setgid bit is set, the newly created
file has the group of the containing directory rather than of the creating
user. If \fItarget_file\fR is a link to another file,
.B cp
overwrites
the link destination with the contents of
.IR source_file ;
the link(s)
from \fItarget_file\fR remains.
.sp
.LP
In the second synopsis form, one or more \fIsource_file\fRs are copied to
the directory specified by
.IR target .
It is an error if any
\fIsource_file\fR is a file of type directory, if \fItarget\fR either does
not exist or is not a directory.
.sp
.LP
In the third or fourth synopsis forms, one or more directories specified by
\fIsource_dir\fR are copied to the directory specified by
.IR target .
Either the
.B -r
or
.B -R
must be specified. For each
.IR source_dir ,
\fBcp\fR copies all files and subdirectories.
.SH OPTIONS
.sp
.LP
The following options are supported for both
.B /usr/bin/cp
and
.BR /usr/xpg4/bin/cp :
.sp
.ne 2
.mk
.na
\fB-f\fR
.ad
.RS 6n
.rt
Unlink. If a file descriptor for a destination file cannot be obtained,
this option attempts to unlink the destination file and proceed.
.RE

.sp
.ne 2
.mk
.na
.B -H
.ad
.RS 6n
.rt
Takes actions based on the type and contents of the file referenced by any
symbolic link specified as a \fIsource_file\fR operand.
.sp
If the \fIsource_file\fR operand is a symbolic link, then
.B cp
copies
the file referenced by the symbolic link for the \fIsource_file\fR operand.
All other symbolic links encountered during traversal of a file hierarchy
are preserved.
.RE

.sp
.ne 2
.mk
.na
.B -i
.ad
.RS 6n
.rt
Interactive.
.B cp
prompts for confirmation whenever the copy would
overwrite an existing
.IR target .
An affirmative response means that the
copy should proceed. Any other answer prevents
.B cp
from overwriting
.IR target .
.RE

.sp
.ne 2
.mk
.na
.B -L
.ad
.RS 6n
.rt
Takes actions based on the type and contents of the file referenced by any
symbolic link specified as a \fIsource_file\fR operand or any symbolic links
encountered during traversal of a file hierarchy.
.sp
Copies files referenced by symbolic links. Symbolic links encountered
during traversal of a file hierarchy are not preserved.
.RE

.sp
.ne 2
.mk
.na
.B -p
.ad
.RS 6n
.rt
Preserve. The
.B cp
utility duplicates not only the contents of
\fIsource_file\fR, but also attempts to preserve its ACL, access and
modification times, extended attributes, extended system attributes, file
mode, and owner and group ids.
.sp
If
.B cp
is unable to preserve the access and modification times,
extended attributes, or the file mode,
.B cp
does not consider it a
failure. If
.B cp
is unable to preserve the owner and group id, the copy
does not fail, but
.B cp
silently clears the
.B S_ISUID
and
\fBS_ISGID\fR bits from the file mode of the target. The copy fails if
\fBcp\fR is unable to clear these bits. If \fBcp\fR is unable to preserve
the ACL or extended system attributes, the copy fails. If the copy fails,
then a diagnostic message is written to
.B stderr
and (after processing
any remaining operands)
.B cp
exits with a
.B non-zero
exit status.
.RE

.sp
.ne 2
.mk
.na
.B -P
.ad
.RS 6n
.rt
Takes actions on any symbolic link specified as a \fIsource_file\fR operand
or any symbolic link encountered during traversal of a file hierarchy.
.sp
Copies symbolic links. Symbolic links encountered during traversal of a
file hierarchy are preserved.
.RE

.sp
.ne 2
.mk
.na
.B -r
.ad
.RS 6n
.rt
Recursive.
.B cp
copies the directory and all its files, including any
subdirectories and their files to
.IR target .
Unless the
.BR -H ,
.BR -L ,
or
.B -P
option is specified, the
.B -L
option is used as
the default mode.
.RE

.sp
.ne 2
.mk
.na
.B -R
.ad
.RS 6n
.rt
Same as
.BR -r ,
except pipes are replicated, not read from.
.RE

.sp
.ne 2
.mk
.na
.B -@
.ad
.RS 6n
.rt
Preserves extended attributes.
.B cp
attempts to copy all of the source
file's extended attributes along with the file data to the destination
file.
.RE

.sp
.ne 2
.mk
.na
.B -/
.ad
.RS 6n
.rt
Preserves extended attributes and extended system attributes. Along with
the file's data, the
.B cp
utility attempts to copy extended attributes
and extended system attributes from each source file, and extended system
attributes associated with extended attributes to the destination file. If
\fBcp\fR is unable to copy extended attributes or extended system
attributes, then a diagnostic message is written to
.B stderr
and (after
processing any remaining operands) exits with a
.B non-zero
exit status.

.RE

.sp
.LP
Specifying more than one of the mutually-exclusive options
.BR -H ,
.BR -L ,
and
.B -P
is not considered an error. The last option specified
determines the behavior of the utility.
.SS "/usr/bin/cp"
.sp
.LP
If the
.B -p
option is specified with either the
.B -@
option or the
\fB-/\fR option, \fB/usr/bin/cp\fR behaves as follows
.RS +4
.TP
.ie t \(bu
.el o
When both
.B -p
and
.B -@
are specified in any order, the copy fails
if extended attributes cannot be copied.
.RE
.RS +4
.TP
.ie t \(bu
.el o
When both
.B -p
and
.B -/
are specified in any order, the copy fails
if extended system attributes cannot be copied.
.RE
.SS "/usr/xpg4/bin/cp"
.sp
.LP
If the
.B -p
option is specified with either the
.B -@
option or the
\fB-/\fR option, /\fBusr/xpg4/bin/cp\fR behaves as follows:
.RS +4
.TP
.ie t \(bu
.el o
When both
.B -p
and
.B -@
are specified, the last option specified
determines whether the copy fails if extended attributes cannot be
preserved.
.RE
.RS +4
.TP
.ie t \(bu
.el o
When both
.B -p
and
.B -/
are specified, the last option specified
determines whether the copy fails if extended system attributes cannot be
preserved.
.RE
.SH OPERANDS
.sp
.LP
The following operands are supported:
.sp
.ne 2
.mk
.na
\fIsource_file\fR
.ad
.RS 15n
.rt
A pathname of a regular file to be copied.
.RE

.sp
.ne 2
.mk
.na
.I source_dir
.ad
.RS 15n
.rt
A pathname of a directory to be copied.
.RE

.sp
.ne 2
.mk
.na
\fItarget_file\fR
.ad
.RS 15n
.rt
A pathname of an existing or non-existing file, used for the output when a
single file is copied.
.RE

.sp
.ne 2
.mk
.na
.I target
.ad
.RS 15n
.rt
A pathname of a directory to contain the copied files.
.RE

.SH USAGE
.sp
.LP
See
.BR largefile (5)
for the description of the behavior of
.B cp
when
encountering files greater than or equal to 2 Gbyte ( 2^31 bytes).
.SH EXAMPLES
.LP
\fBExample 1\fR Copying a File
.sp
.LP
The following example copies a file:

.sp
.in +2
.nf
example% cp goodies goodies.old

example% ls goodies*
goodies goodies.old
.fi
.in -2
.sp

.LP
\fBExample 2\fR Copying a List of Files
.sp
.LP
The following example copies a list of files to a destination directory:

.sp
.in +2
.nf
example% cp ~/src/* /tmp
.fi
.in -2
.sp

.LP
\fBExample 3\fR Copying a Directory
.sp
.LP
The following example copies a directory, first to a new, and then to an
existing destination directory

.sp
.in +2
.nf
example% ls ~/bkup
/usr/example/fred/bkup not found

example% cp \fB-r\fR ~/src ~/bkup

example% ls \fB-R\fR ~/bkup
x.c y.c z.sh

example% cp \fB-r\fR ~/src ~/bkup

example% ls \fB-R\fR ~/bkup
src x.c y.c z.sh
src:
x.c y.c z.s
.fi
.in -2
.sp

.LP
\fBExample 4\fR Copying Extended File System Attributes
.sp
.LP
The following example copies extended file system attributes:

.sp
.in +2
.nf
$ ls -/ c file1
-rw-r--r--   1 foo   staff          0 Oct 29 20:04 file1
                {AH-----m--}

$ cp -/ file1 file2
$ ls -/c file2
-rw-r--r--   1 foo  staff          0 Oct 29 20:17 file2
                {AH-----m--}
.fi
.in -2
.sp

.LP
\fBExample 5\fR Failing to Copy Extended System Attributes
.sp
.LP
The following example fails to copy extended system attributes:

.sp
.in +2
.nf
$ ls -/c file1
-rw-r--r--   1 foo    staff          0 Oct 29 20:04 file1
                {AH-----m--}

$ cp -/ file1 /tmp
cp: Failed to copy extended system attributes from file1 to /tmp/file1


$ ls -/c /tmp/file1
-rw-r--r--   1 foo    staff          0 Oct 29 20:09 /tmp/file1
                {}
.fi
.in -2
.sp

.SH ENVIRONMENT VARIABLES
.sp
.LP
See
.BR environ (5)
for descriptions of the following environment
variables that affect the execution of
.BR cp :
.BR LANG ,
.BR LC_ALL ,
.BR LC_COLLATE ,
.BR LC_CTYPE ,
.BR LC_MESSAGES ,
and
.BR NLSPATH .
.sp
.LP
Affirmative responses are processed using the extended regular expression
defined for the
.B yesexpr
keyword in the
.B LC_MESSAGES
category of
the user's locale. The locale specified in the
.B LC_COLLATE
category
defines the behavior of ranges, equivalence classes, and multi-character
collating elements used in the expression defined for
.BR yesexpr .
The
locale specified in
.B LC_CTYPE
determines the locale for interpretation
of sequences of bytes of text data a characters, the behavior of character
classes used in the expression defined for the
.BR yesexpr .
See
.BR locale (5).
.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 6n
.rt
All files were copied successfully.
.RE

.sp
.ne 2
.mk
.na
.B >0
.ad
.RS 6n
.rt
An error occurred.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.SS "/usr/bin/cp"
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
_
CSIEnabled
_
Interface StabilityCommitted
.TE

.SS "/usr/xpg4/bin/cp"
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWxcu4
_
CSIEnabled
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
.BR chmod (1),
.BR chown (1),
.BR setfacl (1),
.BR utime (2),
.BR fgetattr (3C),
.BR attributes (5),
.BR environ (5),
.BR fsattr (5),
.BR largefile (5),
.BR locale (5),
.BR standards (5)
.SH NOTES
.sp
.LP
The permission modes of the source file are preserved in the copy.
.sp
.LP
A
.B --
permits the user to mark the end of any command line options
explicitly, thus allowing
.B cp
to recognize filename arguments that
begin with a
.BR - .
