usr/src/man/man1/egrep.1
'\" te
.\" Copyright 1989 AT&T
.\" Copyright (c) 2006, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" Portions Copyright (c) 1992, X/Open Company Limited All Rights Reserved
.\"
.\" Sun Microsystems, Inc. gratefully acknowledges The Open Group for
.\" permission to reproduce portions of its copyrighted documentation.
.\" Original documentation from The Open Group can be obtained online
.\" at http://www.opengroup.org/bookstore/.
.\"
.\" The Institute of Electrical and Electronics Engineers and The Open Group,
.\" have given us permission to reprint portions of their documentation.
.\"
.\" In the following statement, the phrase "this text" refers to portions
.\" of the system documentation.
.\"
.\" Portions of this text are reprinted and reproduced in electronic form in
.\" the Sun OS Reference Manual, from IEEE Std 1003.1, 2004 Edition, Standard
.\" for Information Technology -- Portable Operating System Interface (POSIX),
.\" The Open Group Base Specifications Issue 6, Copyright (C) 2001-2004 by the
.\" Institute of Electrical and Electronics Engineers, Inc and The Open Group.
.\" In the event of any discrepancy between these versions and the original
.\" IEEE and The Open Group Standard, the original IEEE and The Open Group
.\" Standard is the referee document.
.\"
.\" The original Standard can be obtained online at
.\" http://www.opengroup.org/unix/online.html.
.\"
.\" This notice shall appear on any product containing this material.
.\"
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH egrep 1 "24 Mar 2006" "SunOS 5.11" "User Commands"
.SH NAME
egrep \- search a file for a pattern using full regular expressions
.SH SYNOPSIS
.LP
.nf
\fB/usr/bin/egrep\fR [\fB-bchilnsv\fR] \fB-e\fR \fIpattern_list\fR [\fIfile.\|.\|.\fR]
.fi

.LP
.nf
\fB/usr/bin/egrep\fR [\fB-bchilnsv\fR] \fB-f\fR \fIfile\fR [\fIfile.\|.\|.\fR]
.fi

.LP
.nf
\fB/usr/bin/egrep\fR [\fB-bchilnsv\fR] \fIpattern\fR [\fIfile.\|.\|.\fR]
.fi

.LP
.nf
\fB/usr/xpg4/bin/egrep\fR [\fB-bchilnqsvx\fR] \fB-e\fR \fIpattern_list\fR [\fB-f\fR \fIfile\fR]
     [\fIfile.\|.\|.\fR]
.fi

.LP
.nf
\fB/usr/xpg4/bin/egrep\fR [\fB-bchilnqsvx\fR] [\fB-e\fR \fIpattern_list\fR] \fB-f\fR \fIfile\fR
     [\fIfile.\|.\|.\fR]
.fi

.LP
.nf
\fB/usr/xpg4/bin/egrep\fR [\fB-bchilnqsvx\fR] \fIpattern\fR [\fIfile.\|.\|.\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The
.B egrep
.RI ( "expression grep" )
utility searches files for a
pattern of characters and prints all lines that contain that pattern.
.B egrep
uses full regular expressions (expressions that have string
values that use the full set of alphanumeric and special characters) to
match the patterns. It uses a fast deterministic algorithm that sometimes
needs exponential space.
.sp
.LP
If no files are specified,
.B egrep
assumes standard input. Normally,
each line found is copied to the standard output. The file name is printed
before each line found if there is more than one input file.
.SS "/usr/bin/egrep"
.sp
.LP
The
.B /usr/bin/egrep
utility accepts full regular expressions as
described on the
.BR regexp (5)
manual page, except for
.B \e(
and
.BR \e) ,
.B
\e( \c 
and \fB\e)\fR, \fB\e{\fR and \fB\e}\fR,
.B \e<
and
.BR \e> ,
and
.BR \en ,
and with the addition of:
.RS +4
.TP
1.
A full regular expression followed by
.B +
that matches one or more
occurrences of the full regular expression.
.RE
.RS +4
.TP
2.
A full regular expression followed by
.B ?
that matches 0 or 1
occurrences of the full regular expression.
.RE
.RS +4
.TP
3.
Full regular expressions separated by | or by a
.B NEWLINE
that match
strings that are matched by any of the expressions.
.RE
.RS +4
.TP
4.
A full regular expression that can be enclosed in parentheses
.BR () for
grouping.
.RE
.sp
.LP
Be careful using the characters
.BR $ ,
.BR * ,
.BR [ ,
.BR ^ ,
|,
.BR ( ,
.BR ) ,
and
.B \e
in
.IR "full regular expression" ,
because
they are also meaningful to the shell. It is safest to enclose the entire
.I full regular expression
in single quotes
.RB ( '' ).
.sp
.LP
.RB "The order of precedence of operators is " [\|] ,
then
.BR *\|?\|+ ,
then concatenation, then | and NEWLINE.
.SS "/usr/xpg4/bin/egrep"
.sp
.LP
The
.B /usr/xpg4/bin/egrep
utility uses the regular expressions
described in the
.B "EXTENDED REGULAR EXPRESSIONS"
section of the
.BR regex (5)
manual page.
.SH OPTIONS
.sp
.LP
The following options are supported for both
.B /usr/bin/egrep
and
.BR /usr/xpg4/bin/egrep :
.sp
.ne 2
.mk
.na
.B -b
.ad
.RS 19n
.rt
Precede each line by the block number on which it was found. This can be
useful in locating block numbers by context (first block is 0).
.RE

.sp
.ne 2
.mk
.na
.B -c
.ad
.RS 19n
.rt
Print only a count of the lines that contain the pattern.
.RE

.sp
.ne 2
.mk
.na
.B -e
.I pattern_list
.ad
.RS 19n
.rt
Search for a
.I pattern_list
(\fIfull regular expression\fR that begins
with a
.BR \(mi ).
.RE

.sp
.ne 2
.mk
.na
.B -f
.I file
.ad
.RS 19n
.rt
Take the list of
.IR "full regular" " "
.I expressions
from
.IR file .
.RE

.sp
.ne 2
.mk
.na
.B -h
.ad
.RS 19n
.rt
Suppress printing of filenames when searching multiple files.
.RE

.sp
.ne 2
.mk
.na
.B -i
.ad
.RS 19n
.rt
Ignore upper/lower case distinction during comparisons.
.RE

.sp
.ne 2
.mk
.na
.B -l
.ad
.RS 19n
.rt
Print the names of files with matching lines once, separated by NEWLINEs.
Does not repeat the names of files when the pattern is found more than
once.
.RE

.sp
.ne 2
.mk
.na
.B -n
.ad
.RS 19n
.rt
Precede each line by its line number in the file (first line is 1).
.RE

.sp
.ne 2
.mk
.na
.B -s
.ad
.RS 19n
.rt
Work silently, that is, display nothing except error messages. This is
useful for checking the error status.
.RE

.sp
.ne 2
.mk
.na
.B -v
.ad
.RS 19n
.rt
Print all lines except those that contain the pattern.
.RE

.SS "/usr/xpg4/bin/egrep"
.sp
.LP
The following options are supported for
.B /usr/xpg4/bin/egrep
only:
.sp
.ne 2
.mk
.na
.B -q
.ad
.RS 6n
.rt
Quiet. Does not write anything to the standard output, regardless of
matching lines. Exits with zero status if an input line is selected.
.RE

.sp
.ne 2
.mk
.na
.B -x
.ad
.RS 6n
.rt
Consider only input lines that use all characters in the line to match an
entire fixed string or regular expression to be matching lines.
.RE

.SH OPERANDS
.sp
.LP
The following operands are supported:
.sp
.ne 2
.mk
.na
.I file
.ad
.RS 8n
.rt
A path name of a file to be searched for the patterns. If no
.I file
operands are specified, the standard input is used.
.RE

.SS "/usr/bin/egrep"
.sp
.ne 2
.mk
.na
.I pattern
.ad
.RS 11n
.rt
Specify a pattern to be used during the search for input.
.RE

.SS "/usr/xpg4/bin/egrep"
.sp
.ne 2
.mk
.na
.I pattern
.ad
.RS 11n
.rt
Specify one or more patterns to be used during the search for input. This
operand is treated as if it were specified as \fB-e\fIpattern_list.\fR.
.RE

.SH USAGE
.sp
.LP
See
.BR largefile (5)
for the description of the behavior of
.BR egrep
when encountering files greater than or equal to 2 Gbyte ( 2^31 bytes).
.SH ENVIRONMENT VARIABLES
.sp
.LP
See
.BR environ (5)
for descriptions of the following environment
variables that affect the execution of
.BR egrep :
.BR LC_COLLATE ,
.BR LC_CTYPE ,
.BR LC_MESSAGES ,
and
.BR NLSPATH .
.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 5n
.rt
If any matches are found.
.RE

.sp
.ne 2
.mk
.na
.B 1
.ad
.RS 5n
.rt
If no matches are found.
.RE

.sp
.ne 2
.mk
.na
.B 2
.ad
.RS 5n
.rt
For syntax errors or inaccessible files (even if matches were found).
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.SS "/usr/bin/egrep"
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
_
CSINot Enabled
.TE

.SS "/usr/xpg4/bin/egrep"
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWxcu4
_
CSIEnabled
.TE

.SH SEE ALSO
.sp
.LP
.BR fgrep (1),
.BR grep (1),
.BR sed (1),
.BR sh (1),
.BR attributes (5),
.BR environ (5),
.BR largefile (5),
.BR regex (5),
.BR regexp (5),
.BR XPG4 (5)
.SH NOTES
.sp
.LP
Ideally there should be only one
.B grep
command, but there is not a
single algorithm that spans a wide enough range of space-time trade-offs.
.sp
.LP
Lines are limited only by the size of the available virtual memory.
.SS "/usr/xpg4/bin/egrep"
.sp
.LP
The
.B /usr/xpg4/bin/egrep
utility is identical to
.BR "/usr/xpg4/bin/grep -E" .
See
.BR grep (1).
Portable applications
should use
.BR "/usr/xpg4/bin/grep -E" .
