usr/src/man/man1/env.1
'\" te
.\" Copyright 1989 AT&T
.\" Copyright (c) 1992, X/Open Company Limited  All Rights Reserved
.\" Portions Copyright (c) 2002, Sun Microsystems, Inc.  All Rights Reserved
.\"
.\" Sun Microsystems, Inc. gratefully acknowledges The Open Group for
.\" permission to reproduce portions of its copyrighted documentation.
.\" Original documentation from The Open Group can be obtained online
.\" at http://www.opengroup.org/bookstore/.
.\"
.\" The Institute of Electrical and Electronics Engineers and The Open Group,
.\" have given us permission to reprint portions of their documentation.
.\"
.\" In the following statement, the phrase "this text" refers to portions
.\" of the system documentation.
.\"
.\" Portions of this text are reprinted and reproduced in electronic form in
.\" the Sun OS Reference Manual, from IEEE Std 1003.1, 2004 Edition, Standard
.\" for Information Technology -- Portable Operating System Interface (POSIX),
.\" The Open Group Base Specifications Issue 6, Copyright (C) 2001-2004 by the
.\" Institute of Electrical and Electronics Engineers, Inc and The Open Group.
.\" In the event of any discrepancy between these versions and the original
.\" IEEE and The Open Group Standard, the original IEEE and The Open Group
.\" Standard is the referee document.
.\"
.\" The original Standard can be obtained online at
.\" http://www.opengroup.org/unix/online.html.
.\"
.\" This notice shall appear on any product containing this material.
.\"
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH env 1 "2 Jan 2002" "SunOS 5.11" "User Commands"
.SH NAME
env \- set environment for command invocation
.SH SYNOPSIS
.LP
.nf
\fB/usr/bin/env\fR [\fB-i\fR | \fB-\fR] [\fIname=value\fR].\|.\|. [\fIutility\fR [\fIarg\fR.\|.\|. ]]
.fi

.LP
.nf
\fB/usr/xpg4/bin/env\fR [\fB-i\fR | \fB-\fR] [\fIname=value\fR].\|.\|.
     [\fIutility\fR [\fIarg\fR.\|.\|. ]]
.fi

.SH DESCRIPTION
.sp
.LP
The
.B env
utility obtains the current environment, modifies it
according to its arguments, then invokes the utility named by the
.I utility
operand with the modified environment.
.sp
.LP
Optional arguments are passed to
.IR utility .
If no
.I utility
operand
is specified, the resulting environment is written to the standard output,
with one \fIname\fB=\fIvalue\fR pair per line.
.SS "\fB/usr/bin\fR"
.sp
.LP
If
.B env
executes commands with arguments, it uses the default shell
.B /usr/bin/sh
(see
.BR sh (1)).
.SS "\fB/usr/xpg4/bin\fR"
.sp
.LP
If
.B env
executes commands with arguments, it uses
.B /usr/xpg4/bin/sh
(see
.BR ksh (1)).
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -i
| \fB\(mi\fR
.ad
.RS 14n
.rt
Ignores the environment that would otherwise be inherited from the current
shell. Restricts the environment for
.I utility
to that specified by the
arguments.
.RE

.SH OPERANDS
.sp
.LP
The following operands are supported:
.sp
.ne 2
.mk
.na
\fIname\fB=\fIvalue\fR
.ad
.RS 15n
.rt
Arguments of the form \fIname\fB=\fIvalue\fR modify the execution
environment, and are placed into the inherited environment before
.I utility
is invoked.
.RE

.sp
.ne 2
.mk
.na
.I utility
.ad
.RS 15n
.rt
The name of the utility to be invoked.  If
.I utility
names any of the
special shell built-in utilities, the results are undefined.
.RE

.sp
.ne 2
.mk
.na
.I arg
.ad
.RS 15n
.rt
A string to pass as an argument for the invoked utility.
.RE

.SH EXAMPLES
.LP
.B Example 1
Invoking utilities with new PATH values
.sp
.LP
The following utility:

.sp
.in +2
.nf
example% \fBenv -i PATH=/mybin mygrep xyz myfile \fR
.fi
.in -2
.sp

.sp
.LP
invokes the utility
.B mygrep
with a new
.B PATH
value as the only
entry in its environment. In this case,
.B PATH
is used to locate
.BR mygrep ,
which then must reside in
.BR /mybin .

.SH ENVIRONMENT VARIABLES
.sp
.LP
See
.BR environ (5)
for descriptions of the following environment
variables that affect the execution of
.BR env :
.BR LANG ,
.BR LC_ALL ,
.BR LC_CTYPE ,
.BR LC_MESSAGES ,
and
.BR NLSPATH .
.sp
.ne 2
.mk
.na
.B PATH
.ad
.RS 8n
.rt
Determine the location of the
.IR utility .
If
.B PATH
is specified as
a \fIname\fR=\fIvalue\fR operand to \fBenv\fR, the value given shall be used
in the search for
.IR utility .
.RE

.SH EXIT STATUS
.sp
.LP
If
.I utility
is invoked, the exit status of
.B env
is the exit
status of
.IR utility .
Otherwise, the
.B env
utility returns one of the
following exit values:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 10n
.rt
Successful completion.
.RE

.sp
.ne 2
.mk
.na
.B 1-125
.ad
.RS 10n
.rt
An error occurred.
.RE

.sp
.ne 2
.mk
.na
.B 126
.ad
.RS 10n
.rt
.I utility
was found but could not be invoked.
.RE

.sp
.ne 2
.mk
.na
.B 127
.ad
.RS 10n
.rt
.I utility
could not be found.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.SS "/usr/bin"
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
_
CSIenabled
.TE

.SS "/usr/xpg4/bin"
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWxcu4
_
CSIenabled
_
Interface StabilityStandard
.TE

.SH SEE ALSO
.sp
.LP
.BR ksh (1),
.BR sh (1),
.BR exec (2),
.BR profile (4),
.BR attributes (5),
.BR environ (5),
.BR standards (5)
