usr/src/man/man1/fdformat.1
'\" te
.\" Copyright 2001, Sun Microsystems, Inc All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH fdformat 1 "28 Feb 2007" "SunOS 5.11" "User Commands"
.SH NAME
fdformat \- format floppy diskette or PCMCIA memory card
.SH SYNOPSIS
.LP
.nf
\fBfdformat\fR [\fB-dDeEfHlLmMUqvx\fR] [\fB-b\fR \fIlabel\fR] [\fB-B\fR \fIfilename\fR]
     [\fB-t\fR \fIdostype\fR] [\fIdevname\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The \fBfdformat\fR utility has been superseded by
.BR rmformat (1),
which
provides most but not all of \fBfdformat\fR's functionality.
.sp
.LP
\fBfdformat\fR is used to format diskettes and \fBPCMCIA\fR memory cards. All
new blank diskettes or
.B PCMCIA
memory cards must be formatted before they
can be used.
.sp
.LP
\fBfdformat\fR formats and verifies the media and indicates whether any bad
.RB "sectors were encountered. All existing data on the diskette or" " PCMCIA"
memory card, if any, is destroyed by formatting. If no device name is given,
\fBfdformat\fR uses the diskette as a default.
.sp
.LP
By default, \fBfdformat\fR uses the configured capacity of the drive to
format the diskette. A
.B 3.5
inch high-density drive uses diskettes with a
formatted capacity of
.BR 1.44MB .
A
.B 5.25
inch high-density drive uses
diskettes with a formatted capacity of
.BR 1.2MB .
In either case, a density
option does not have to be specified to
.BR fdformat .
However, a density
option must be specified when using a diskette with a lower capacity than the
drive's default. Use the
.B -H
option to format high-density diskettes
(\fB1.44MB\fR capacity) in an extra-high-density (\fBED\fR) drive. Use the
\fB-D\fR option, the \fB-l\fR option, or the \fB-L\fR option to format double-
density (or low-density) diskettes (\fB720KB\fR capacity) in an
.B HD
or
\fBED\fR drive. To format medium-density diskettes (\fB1.2MB\fR capacity), use
the
.B -M
option with
.B "-t nec"
(this is the same as using the
\fB-m\fR option with
.BR "-t nec" ).
.sp
.LP
Extended density uses double-sided, extended-density or extra-high-density
(\fBDS\fR/\fBED\fR) diskettes. Medium and high densities use the same media:
double-sided, high-density (\fBDS\fR/\fBHD\fR) diskettes. Double (low) density
uses double-sided, double-density (\fBDS\fR/\fBDD\fR
.sp
.LP
.BR D )
diskettes. Substituting diskettes of one density for diskettes of
either a higher or lower density generally does not work. Data integrity
cannot be assured whenever a diskette is formatted to a capacity not matching
its density.
.sp
.LP
A
.B PCMCIA
memory card with densities from
.B 512KB
to
.B 64MB
may
be formatted.
.sp
.LP
\fBfdformat\fR writes new identification and data fields for each sector on
all tracks unless the
.B -x
option is specified. For diskettes, each sector
is verified if the
.B -v
option is specified.
.sp
.LP
After formatting and verifying, \fBfdformat\fR writes an operating-system
label on block
.BR 0 .
Use the
.B "-t dos"
option (same as the
\fB-d\fR option) to put an \fBMS-DOS\fR file system on the diskette or
\fBPCMCIA\fR memory card after the format is done. Use the \fB-t nec\fR
option with the
.B -M
option (same as the
.B -m
option) to put an
\fBNEC-DOS\fR file system on a diskette. Otherwise, \fBfdformat\fR writes a
\fBSunOS\fR label in block \fB0\fR.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB-b\fR \fIlabel\fR
.ad
.RS 15n
.rt
Labels the media with volume label. A SunOS volume label is restricted to 8
characters. A
.B DOS
volume label is restricted to 11 upper-case
characters.
.RE

.sp
.ne 2
.mk
.na
\fB-B\fR \fIfilename\fR
.ad
.RS 15n
.rt
Installs special boot loader in filename on an
.B MS-DOS
diskette. This
option is only meaningful when the
.B -d
option (or
.BR "-t dos" )
is
also specified.
.RE

.sp
.ne 2
.mk
.na
.B -D
.ad
.RS 15n
.rt
Formats a
.B 720KB
(3.5 inch) or
.B 360KB
(5.25 inch) double-density
diskette (same as the
.B -l
or
.B -L
options). This is the default for
double-density type drives. It is needed if the drive is a high- or
extended-density type.
.RE

.sp
.ne 2
.mk
.na
.B -e
.ad
.RS 15n
.rt
Ejects the diskette when done. This feature is not available on all
systems.
.RE

.sp
.ne 2
.mk
.na
.B -E
.ad
.RS 15n
.rt
Formats a
.B 2.88MB
(3.5 inch) extended-density diskette. This is the
default for extended-density type drives.
.RE

.sp
.ne 2
.mk
.na
\fB-f\fR
.ad
.RS 15n
.rt
Forces formatting, that is, this option does not ask for confirmation before
starting format.
.RE

.sp
.ne 2
.mk
.na
.B -H
.ad
.RS 15n
.rt
Formats a
.B 1.44MB
(3.5 inch) or
.B 1.2MB
(5.25 inch) high-density
diskette. This is the default for high-density type drives; it is needed if
the drive is the extended-density type.
.RE

.sp
.ne 2
.mk
.na
.B -M
.ad
.RS 15n
.rt
Writes a
.B 1.2MB
(3.5 inch) medium-density format on a high-density
diskette (use only with the -t nec option). This is the same as using
.BR -m .
.sp
This feature is not available on all systems.
.RE

.sp
.ne 2
.mk
.na
.B -q
.ad
.RS 15n
.rt
Quiet; does not print status messages.
.RE

.sp
.ne 2
.mk
.na
.B -t dos
.ad
.RS 15n
.rt
Installs an
.B MS-DOS
file system and boot sector formatting. This is
equivalent to the
.B DOS
format command or the
.B -d
option.
.RE

.sp
.ne 2
.mk
.na
.B -t nec
.ad
.RS 15n
.rt
Installs an
.B NEC-DOS
file system and boot sector on the disk after
formatting. This should be used only with the
.B -M
option. This feature is
not available on all systems.
.RE

.sp
.ne 2
.mk
.na
.B -U
.ad
.RS 15n
.rt
Performs
.B umount
on any file systems and then formats. See
.BR mount (1M).
.RE

.sp
.ne 2
.mk
.na
.B -v
.ad
.RS 15n
.rt
Verifies each block of the diskette after the format.
.RE

.sp
.ne 2
.mk
.na
.B -x
.ad
.RS 15n
.rt
Skips the format and only writes a SunOS label or an
.B MS-DOS
file
system.
.RE

.SH OPERANDS
.sp
.LP
The following operands are supported:
.sp
.ne 2
.mk
.na
.I devname
.ad
.RS 11n
.rt
Replaces
.I devname
with
.B rdiskette0
(systems without volume
management) or \fBfloppy0\fR (systems with volume management) to use the first
drive or rdiskette1 (systems without volume management) or \fBfloppy1\fR
(systems with volume management) to use the second drive. If
.I devname
is
omitted, the first drive, if one exists, is used. For
.B PCMCIA
memory
cards, replace
.I devname
with the device name for the
.B PCMCIA
memory
card which resides in \fB/dev/rdsk/c\fIN\fRt\fIN\fRd\fIN\fRs\fIN\fR or
/dev/dsk/c\fIN\fRt\fIN\fRd\fIN\fRs\fIN\fR. If \fIdevname\fR is omitted, the
default diskette drive, if one exists, is used.
.sp
If devname is omitted, the default diskette drive, if one exists, will be
used.
.I N
represents a decimal number and can be specified as follows:
.sp
.ne 2
.mk
.na
\fBc\fIN\fR
.ad
.RS 6n
.rt
Controller
.IR N
.RE

.sp
.ne 2
.mk
.na
\fBt\fIN\fR
.ad
.RS 6n
.rt
Technology type
.IR N :
.sp
.in +2
.nf

0x1       ROM
0x2       OTPROM
0x3       EPROM
0x4       EEPROM
0x5       FLASH
0x6       SRAM
0x7       DRAM
.fi
.in -2
.sp

.RE

.sp
.ne 2
.mk
.na
\fBd\fIN\fR
.ad
.RS 6n
.rt
Technology region in type
.IR N .
.RE

.sp
.ne 2
.mk
.na
\fBs\fIN\fR
.ad
.RS 6n
.rt
Slice
.IR N .
.RE

The following options are provided for compatibility with previous versions
of
.BR fdformat .
Their use is discouraged.
.sp
.ne 2
.mk
.na
.B -d
.ad
.RS 6n
.rt
Formats an
.B MS-DOS
floppy diskette or
.B PCMCIA
memory card (same as
.BR "-t dos" ).
This is equivalent to the
.B "MS-DOS FORMAT"
command.
.RE

.sp
.ne 2
.mk
.na
.B -l
.ad
.RS 6n
.rt
Formats a
.B 720KB
(3.5 inch) or
.B 360KB
(5.25 inch) double-density
diskette (same as
.B -D
or
.BR -L ).
This is the default for
double-density type drives; it is needed if the drive is the high- or
extended-density type.
.RE

.sp
.ne 2
.mk
.na
.B -L
.ad
.RS 6n
.rt
Formats a
.B 720KB
(3.5 inch) or
.B 360KB
(5.25 inch) double-density
diskette (same as
.B -l
or
.BR -D ).
This is the default for
double-density type drives.
.RE

.sp
.ne 2
.mk
.na
.B -m
.ad
.RS 6n
.rt
Writes a
.B "1.2 MB"
(3.5 inch) medium- density format on a high-density
diskette (use only with the
.B "-t nec"
option). This is the same as
using
.BR -M .
This feature is not available on all systems.
.RE

.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B /dev/diskette0
.ad
.RS 24n
.rt
Directory providing block device access for the media in floppy drive
.BR 0 .
.RE

.sp
.ne 2
.mk
.na
.B /dev/diskette0
.ad
.RS 24n
.rt
Directory providing character device access for the media in floppy drive
.BR 0 .
.RE

.sp
.ne 2
.mk
.na
\fB/dev/aliases/floppy0\fR
.ad
.RS 24n
.rt
Symbolic link to the character device for the media in floppy drive
.BR 0 .
.RE

.sp
.ne 2
.mk
.na
.B /dev/rdiskette
.ad
.RS 24n
.rt
Directory providing character device access for the media in the primary
floppy drive, usually drive
.BR 0 .
.RE

.sp
.ne 2
.mk
.na
\fB/dev/dsk/c\fIN\fRt\fIN\fRd\fIN\fRs\fIN\fR
.ad
.RS 24n
.rt
Directory providing block device access for the
.B PCMCIA
memory card. See
OPERANDS for a description of
.IR N .
.RE

.sp
.ne 2
.mk
.na
\fB/dev/rdsk/c\fIN\fRt\fIN\fRd\fIN\fRs\fIN\fR
.ad
.RS 24n
.rt
Directory providing character device access for the
.B PCMCIA
memory card.
See OPERANDS for a description of
.IR N .
.RE

.sp
.ne 2
.mk
.na
\fB/dev/aliases/pcmem\fIS\fR
.ad
.RS 24n
.rt
Symbolic link to the character device for the
.B PCMCIA
memory card in
socket
.I S
where
.I S
represents a
.B PCMCIA
socket number.
.RE

.sp
.ne 2
.mk
.na
\fB/dev/rdsk/c\fIN\fRt\fIN\fRd\fIN\fRs\fIN\fR
.ad
.RS 24n
.rt
Directory providing character device access for the
.B PCMCIA
memory card.
See OPERANDS for a description of
.IR N .
.RE

.sp
.ne 2
.mk
.na
\fB/dev/dsk/c\fIN\fRt\fIN\fRd\fIN\fRs\fIN\fR
.ad
.RS 24n
.rt
Directory providing block device access for the
.B PCMCIA
memory card. See
OPERANDS for a description of
.IR N .
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.sp
.LP
.BR cpio (1),
.BR eject (1),
\fBrmformat\fR(1), \fBtar\fR(1),
.BR volcheck (1),
.BR volrmmount (1),
.BR mount (1M),
.BR newfs (1M),
.BR prtvtoc (1M),
.BR attributes (5),
.BR pcfs (7FS)
.SS "x86 Only"
.sp
.LP
.BR fd (7D)
.SH NOTES
.sp
.LP
A diskette or
.B PCMCIA
memory card containing a \fBufs\fR file system
created on a SPARC based system (by using \fBfdformat\fR and \fBnewfs\fR(1M)),
is not identical to a diskette or
.B PCMCIA
memory card containing a ufs
file system created on an x86 based system. Do not interchange ufs diskettes
or memory cards between these platforms. Use
.BR cpio (1)
or
.BR tar (1)
to
transfer files on diskettes or memory cards between them. A diskette or
\fBPCMCIA\fR memory card formatted using the \fB-t dos\fR option (or
.BR -d )
for
.B MS-DOS
does not have the necessary system files, and is
therefore not bootable. Trying to boot from it on a
.B PC
produces the
following message:
.sp
.in +2
.nf
Non-System disk or disk error.
Replace and strike any key when ready
.fi
.in -2
.sp

.SH BUGS
.sp
.LP
Currently, bad sector mapping is not supported on floppy diskettes or
\fBPCMCIA\fR memory cards. Therefore, a diskette or memory card is unusable if
\fBfdformat\fR finds an error (bad sector).
