usr/src/man/man1/fgrep.1
'\" te
.\" Copyright 1989 AT&T
.\" Copyright (c) 2006, Sun Microsystems, Inc.  All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" Portions Copyright (c) 1992, X/Open Company Limited  All Rights Reserved
.\"
.\" Sun Microsystems, Inc. gratefully acknowledges The Open Group for
.\" permission to reproduce portions of its copyrighted documentation.
.\" Original documentation from The Open Group can be obtained online
.\" at http://www.opengroup.org/bookstore/.
.\"
.\" The Institute of Electrical and Electronics Engineers and The Open Group,
.\" have given us permission to reprint portions of their documentation.
.\"
.\" In the following statement, the phrase "this text" refers to portions
.\" of the system documentation.
.\"
.\" Portions of this text are reprinted and reproduced in electronic form in
.\" the Sun OS Reference Manual, from IEEE Std 1003.1, 2004 Edition, Standard
.\" for Information Technology -- Portable Operating System Interface (POSIX),
.\" The Open Group Base Specifications Issue 6, Copyright (C) 2001-2004 by the
.\" Institute of Electrical and Electronics Engineers, Inc and The Open Group.
.\" In the event of any discrepancy between these versions and the original
.\" IEEE and The Open Group Standard, the original IEEE and The Open Group
.\" Standard is the referee document.
.\"
.\" The original Standard can be obtained online at
.\" http://www.opengroup.org/unix/online.html.
.\"
.\" This notice shall appear on any product containing this material.
.\"
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH fgrep 1 "24 Mar 2006" "SunOS 5.11" "User Commands"
.SH NAME
fgrep \- search a file for a fixed-character string
.SH SYNOPSIS
.LP
.nf
\fB/usr/bin/fgrep\fR [\fB-bchilnsvx\fR] \fB-e\fR \fIpattern_list\fR [\fIfile.\|.\|.\fR]
.fi

.LP
.nf
\fB/usr/bin/fgrep\fR [\fB-bchilnsvx\fR] \fB-f\fR \fIfile\fR [\fIfile.\|.\|.\fR]
.fi

.LP
.nf
\fB/usr/bin/fgrep\fR [\fB-bchilnsvx\fR] \fIpattern\fR [\fIfile.\|.\|.\fR]
.fi

.LP
.nf
\fB/usr/xpg4/bin/fgrep\fR [\fB-bchilnqsvx\fR] \fB-e\fR \fIpattern_list\fR [\fB-f\fR \fIfile\fR]
     [\fIfile.\|.\|.\fR]
.fi

.LP
.nf
\fB/usr/xpg4/bin/fgrep\fR [\fB-bchilnqsvx\fR] [\fB-e\fR \fIpattern_list\fR] \fB-f\fR \fIfile\fR
     [\fIfile.\|.\|.\fR]
.fi

.LP
.nf
\fB/usr/xpg4/bin/fgrep\fR [\fB-bchilnqsvx\fR] \fIpattern\fR [\fIfile.\|.\|.\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The
.B fgrep
(fast
.BR grep )
utility searches files for a character
string and prints all lines that contain that string.
.B fgrep
is
different from
.BR grep (1)
and from
.BR egrep (1)
because it searches for
a string, instead of searching for a pattern that matches an expression.
.B fgrep
uses a fast and compact algorithm.
.sp
.LP
The characters
.BR $ ,
.BR * ,
.BR [ ,
.BR ^ ,
|,
.BR ( ,
.BR ) ,
and
.B
\e \c
are interpreted literally by
.BR fgrep ,
that is,
.B fgrep
does
not recognize full regular expressions as does
.BR egrep .
These characters
have special meaning to the shell. Therefore, to be safe, enclose the entire
.I string
within single quotes
.RB ( ' ).
.sp
.LP
If no files are specified,
.B fgrep
assumes standard input. Normally,
each line that is found is copied to the standard output. The file name is
printed before each line that is found if there is more than one input
file.
.SH OPTIONS
.sp
.LP
The following options are supported for both
.B /usr/bin/fgrep
and
.BR /usr/xpg4/bin/fgrep :
.sp
.ne 2
.mk
.na
.B -b
.ad
.RS 19n
.rt
Precedes each line by the block number on which the line was found. This
can be useful in locating block numbers by context. The first block is 0.
.RE

.sp
.ne 2
.mk
.na
.B -c
.ad
.RS 19n
.rt
Prints only a count of the lines that contain the pattern.
.RE

.sp
.ne 2
.mk
.na
.B -e
.I pattern_list
.ad
.RS 19n
.rt
Searches for a
.I string
in
.IR pattern-list .
This is useful when the
.I string
begins with a \fB\(mi\fR\&.
.RE

.sp
.ne 2
.mk
.na
.B -f
.I pattern-file
.ad
.RS 19n
.rt
Takes the list of patterns from
.IR pattern-file .
.RE

.sp
.ne 2
.mk
.na
.B -h
.ad
.RS 19n
.rt
Suppresses printing of files when searching multiple files.
.RE

.sp
.ne 2
.mk
.na
.B -i
.ad
.RS 19n
.rt
Ignores upper/lower case distinction during comparisons.
.RE

.sp
.ne 2
.mk
.na
.B -l
.ad
.RS 19n
.rt
Prints the names of files with matching lines once, separated by new-lines.
Does not repeat the names of files when the pattern is found more than
once.
.RE

.sp
.ne 2
.mk
.na
.B -n
.ad
.RS 19n
.rt
Precedes each line by its line number in the file. The first line is 1.
.RE

.sp
.ne 2
.mk
.na
.B -s
.ad
.RS 19n
.rt
Works silently, that is, displays nothing except error messages. This is
useful for checking the error status.
.RE

.sp
.ne 2
.mk
.na
.B -v
.ad
.RS 19n
.rt
Prints all lines except those that contain the pattern.
.RE

.sp
.ne 2
.mk
.na
.B -x
.ad
.RS 19n
.rt
Prints only lines that are matched entirely.
.RE

.SS "/usr/xpg4/bin/fgrep"
.sp
.LP
The following options are supported for
.B /usr/xpg4/bin/fgrep
only:
.sp
.ne 2
.mk
.na
.B -q
.ad
.RS 6n
.rt
Quiet. Does not write anything to the standard output, regardless of
matching lines. Exits with zero status if an input line is selected.
.RE

.SH OPERANDS
.sp
.LP
The following operands are supported:
.sp
.ne 2
.mk
.na
.I file
.ad
.RS 8n
.rt
Specifies a path name of a file to be searched for the patterns. If no
.I file
operands are specified, the standard input will be used.
.RE

.SS "/usr/bin/fgrep"
.sp
.ne 2
.mk
.na
.I pattern
.ad
.RS 11n
.rt
Specifies a pattern to be used during the search for input.
.RE

.SS "/usr/xpg4/bin/fgrep"
.sp
.ne 2
.mk
.na
.I pattern
.ad
.RS 11n
.rt
Specifies one or more patterns to be used during the search for input. This
operand is treated as if it were specified as
.B -e
.IR pattern_list .
.RE

.SH USAGE
.sp
.LP
See
.BR largefile (5)
for the description of the behavior of
.B fgrep
when encountering files greater than or equal to 2 Gbyte ( 2^31 bytes).
.SH ENVIRONMENT VARIABLES
.sp
.LP
See
.BR environ (5)
for descriptions of the following environment
variables that affect the execution of
.BR fgrep :
.BR LC_COLLATE ,
.BR LC_CTYPE ,
.BR LC_MESSAGES ,
and
.BR NLSPATH .
.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 5n
.rt
If any matches are found
.RE

.sp
.ne 2
.mk
.na
.B 1
.ad
.RS 5n
.rt
If no matches are found
.RE

.sp
.ne 2
.mk
.na
.B 2
.ad
.RS 5n
.rt
For syntax errors or inaccessible files, even if matches were found.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.SS "/usr/bin/fgrep"
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SS "/usr/xpg4/bin/fgrep"
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWxcu4
_
CSIEnabled
.TE

.SH SEE ALSO
.sp
.LP
.BR ed (1),
.BR egrep (1),
.BR grep (1),
.BR sed (1),
.BR sh (1),
.BR attributes (5),
.BR environ (5),
.BR largefile (5),
.BR XPG4 (5)
.SH NOTES
.sp
.LP
Ideally, there should be only one
.B grep
command, but there is not a
single algorithm that spans a wide enough range of space-time tradeoffs.
.sp
.LP
Lines are limited only by the size of the available virtual memory.
.SS "/usr/xpg4/bin/fgrep"
.sp
.LP
The
.B /usr/xpg4/bin/fgrep
utility is identical to
.B /usr/xpg4/bin/grep -F
(see
.BR grep (1)).
Portable applications
should use
.BR "/usr/xpg4/bin/grep -F" .
