usr/src/man/man1/file.1
'\" te
.\" Copyright 1989 AT&T
.\" Copyright (c) 1992, X/Open Company Limited All Rights Reserved
.\" Portions Copyright (c) 2006, Sun Microsystems, Inc. All Rights Reserved
.\"
.\" Sun Microsystems, Inc. gratefully acknowledges The Open Group for
.\" permission to reproduce portions of its copyrighted documentation.
.\" Original documentation from The Open Group can be obtained online
.\" at http://www.opengroup.org/bookstore/.
.\"
.\" The Institute of Electrical and Electronics Engineers and The Open Group,
.\" have given us permission to reprint portions of their documentation.
.\"
.\" In the following statement, the phrase "this text" refers to portions
.\" of the system documentation.
.\"
.\" Portions of this text are reprinted and reproduced in electronic form in
.\" the Sun OS Reference Manual, from IEEE Std 1003.1, 2004 Edition, Standard
.\" for Information Technology -- Portable Operating System Interface (POSIX),
.\" The Open Group Base Specifications Issue 6, Copyright (C) 2001-2004 by the
.\" Institute of Electrical and Electronics Engineers, Inc and The Open Group.
.\" In the event of any discrepancy between these versions and the original
.\" IEEE and The Open Group Standard, the original IEEE and The Open Group
.\" Standard is the referee document.
.\"
.\" The original Standard can be obtained online at
.\" http://www.opengroup.org/unix/online.html.
.\"
.\" This notice shall appear on any product containing this material.
.\"
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH file 1 "15 May 2006" "SunOS 5.11" "User Commands"
.SH NAME
file \- determine file type
.SH SYNOPSIS
.LP
.nf
\fB/usr/bin/file\fR [\fB-dh\fR] [\fB-m\fR \fImfile\fR] [\fB-M\fR \fIMfile\fR] [\fB-f\fR \fIffile\fR] \fIfile\fR...
.fi

.LP
.nf
\fB/usr/bin/file\fR [\fB-dh\fR] [\fB-m\fR \fImfile\fR] [\fB-M\fR \fIMfile\fR] \fB-f\fR \fIffile\fR
.fi

.LP
.nf
\fB/usr/bin/file\fR \fB-i\fR [\fB-h\fR] [\fB-f\fR \fIffile\fR] \fIfile\fR...
.fi

.LP
.nf
\fB/usr/bin/file\fR \fB-i\fR [\fB-h\fR] \fB-f\fR \fIffile\fR
.fi

.LP
.nf
\fB/usr/bin/file\fR \fB-c\fR [\fB-d\fR] [\fB-m\fR \fImfile\fR] [\fB-M\fR \fIMfile\fR]
.fi

.LP
.nf
\fB/usr/xpg4/bin/file\fR [\fB-dh\fR] [\fB-m\fR \fImfile\fR] [\fB-M\fR \fIMfile\fR] [\fB-f\fR \fIffile\fR] \fIfile\fR...
.fi

.LP
.nf
\fB/usr/xpg4/bin/file\fR [\fB-dh\fR] [\fB-m\fR \fImfile\fR] [\fB-M\fR \fIMfile\fR] \fB-f\fR \fIffile\fR
.fi

.LP
.nf
\fB/usr/xpg4/bin/file\fR \fB-i\fR [\fB-h\fR] [\fB-f\fR \fIffile\fR] \fIfile\fR...
.fi

.LP
.nf
\fB/usr/xpg4/bin/file\fR \fB-i\fR [\fB-h\fR] \fB-f\fR \fIffile\fR
.fi

.LP
.nf
\fB/usr/xpg4/bin/file\fR \fB-c\fR [\fB-d\fR] [\fB-m\fR \fImfile\fR] [\fB-M\fR \fIMfile\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The
.B file
utility performs a series of tests on each file supplied by
.I file
and, optionally, on each file listed in
.I ffile
in an attempt
to classify it. If the file is not a regular file, its file type is
identified. The file types directory,
.BR FIFO ,
block special, and
character special are identified as such. If the file is a regular file and
the file is zero-length, it is identified as an empty file.
.sp
.LP
If \fIfile\fR appears to be a text file, \fBfile\fR examines the first 512
bytes and tries to determine its programming language. If
.I file
is a
symbolic link, by default the link is followed and
.B file
tests the file
to which the symbolic link refers.
.sp
.LP
If
.I file
is a relocatable object, executable, or shared object,
.B file
prints out information about the file's execution requirements.
This information includes the machine class, byte-ordering, static/dynamic
linkage, and any software or hardware capability requirements. If \fIfile\fR
is a runtime linking configuration file,
.B file
prints information about
the target platform, including the machine class and byte-ordering.
.sp
.LP
By default,
.B file
will try to use the localized magic file
\fB/usr/lib/locale/\fIlocale\fR/LC_MESSAGES/magic\fR, if it exists, to
identify files that have a magic number. For example, in the Japanese
locale,
.B file
will try to use
.BR /usr/lib/locale/ja/LC_MESSAGES/magic .
If a localized magic file does
not exist,
.B file
will utilize
.BR /etc/magic .
A magic number is a
numeric or string constant that indicates the file type. See
.BR magic (4)
for an explanation of the format of
.BR /etc/magic .
.sp
.LP
If
.I file
does not exist, cannot be read, or its file status could not
be determined, it is not considered an error that affects the exit status.
The output will indicate that the file was processed, but that its type
could not be determined.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -c
.ad
.RS 12n
.rt
Checks the magic file for format errors. For reasons of efficiency, this
validation is normally not carried out.
.RE

.sp
.ne 2
.mk
.na
.B -d
.ad
.RS 12n
.rt
Applies any position-sensitive and context-sensitive default system tests
to the file.
.RE

.sp
.ne 2
.mk
.na
.B -f
.I ffile
.ad
.RS 12n
.rt
.I ffile
contains a list of the files to be examined.
.RE

.sp
.ne 2
.mk
.na
.B -h
.ad
.RS 12n
.rt
When a symbolic link is encountered, this option identifies the file as a
symbolic link. If
.B -h
is not specified and
.I file
is a symbolic
link that refers to a non-existent file, the
.B file
utility identifies
the file as a symbolic link, as if
.B -h
had been specified.
.RE

.sp
.ne 2
.mk
.na
.B -i
.ad
.RS 12n
.rt
If a file is a regular file, this option does not attempt to classify the
type of file further, but identifies the file as a "regular file".
.RE

.sp
.ne 2
.mk
.na
.B -m
.I mfile
.ad
.RS 12n
.rt
.sp
.ne 2
.mk
.na
.B /usr/bin/file
.ad
.RS 22n
.rt
Uses
.I mfile
as an alternate magic file, instead of
.BR /etc/magic .
.RE

.sp
.ne 2
.mk
.na
.B /usr/xpg4/bin/file
.ad
.RS 22n
.rt
Specifies the name of a file containing position-sensitive tests that are
applied to a file in order to classify it (see
.BR magic (4)).
If the
.B -m
option is specified without specifying the
.B -d
option or the
.B -M
option, position-sensitive default system tests are applied after
the position-sensitive tests specified by the
.B -m
option.
.RE

.RE

.sp
.ne 2
.mk
.na
.B -M
.I Mfile
.ad
.RS 12n
.rt
Specifies the name of a file containing position-sensitive tests that are
applied to a file in order to classify it (see
.BR magic (4)).
No
position-sensitive default system tests nor context-sensitive default system
tests are applied unless the
.B -d
option is also specified.
.RE

.sp
.LP
If the
.B -M
option is specified with the
.B -d
.RB "option, the" " -m"
option, or both, or if the
.B -m
option is specified with the
.BR -d
option, the concatenation of the position-sensitive tests specified by these
options is applied in the order specified by the appearance of these
options.
.SH OPERANDS
.sp
.LP
The following operands are supported:
.sp
.ne 2
.mk
.na
.I file
.ad
.RS 8n
.rt
A path name of a file to be tested.
.RE

.SH USAGE
.sp
.LP
See
.BR largefile (5)
for the description of the behavior of \fBfile\fR
when encountering files greater than or equal to 2 Gbyte ( 2^31 bytes).
.SH EXAMPLES
.LP
.B Example 1
Determining if an Argument is a Binary Executable Files
.sp
.LP
The following example determine if an argument is a binary executable
file:

.sp
.in +2
.nf
file "$1" | grep \(miFq executable &&
          printf "%s is executable.\en" "$1"
.fi
.in -2
.sp

.SH ENVIRONMENT VARIABLES
.sp
.LP
See
.BR environ (5)
for descriptions of the following environment
variables that affect the execution of
.BR file :
.BR LANG ,
.BR LC_ALL ,
.BR LC_CTYPE ,
.BR LC_MESSAGES ,
and
.BR NLSPATH .
.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 6n
.rt
Successful completion.
.RE

.sp
.ne 2
.mk
.na
.B >0
.ad
.RS 6n
.rt
An error occurred.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/magic
.ad
.RS 14n
.rt
\fBfile\fR's magic number file
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
_
CSIEnabled
_
Interface StabilityStandard
.TE

.SH SEE ALSO
.sp
.LP
.BR crle (1),
.BR elfdump (1),
.BR ls (1),
.BR magic (4),
.BR attributes (5),
.BR environ (5),
.BR largefile (5),
.BR standards (5)
