usr/src/man/man1/getconf.1
'\" te
.\" Copyright (c) 1992, X/Open Company Limited All Rights Reserved
.\" Portions Copyright (c) 2009, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" Portions Copyright (c) 1982-2007 AT&T Knowledge Ventures
.\"
.\" Sun Microsystems, Inc. gratefully acknowledges The Open Group for
.\" permission to reproduce portions of its copyrighted documentation.
.\" Original documentation from The Open Group can be obtained online
.\" at http://www.opengroup.org/bookstore/.
.\"
.\" The Institute of Electrical and Electronics Engineers and The Open Group,
.\" have given us permission to reprint portions of their documentation.
.\"
.\" In the following statement, the phrase "this text" refers to portions
.\" of the system documentation.
.\"
.\" Portions of this text are reprinted and reproduced in electronic form in
.\" the Sun OS Reference Manual, from IEEE Std 1003.1, 2004 Edition, Standard
.\" for Information Technology -- Portable Operating System Interface (POSIX),
.\" The Open Group Base Specifications Issue 6, Copyright (C) 2001-2004 by the
.\" Institute of Electrical and Electronics Engineers, Inc and The Open Group.
.\" In the event of any discrepancy between these versions and the original
.\" IEEE and The Open Group Standard, the original IEEE and The Open Group
.\" Standard is the referee document.
.\"
.\" The original Standard can be obtained online at
.\" http://www.opengroup.org/unix/online.html.
.\"
.\" This notice shall appear on any product containing this material.
.\"
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH getconf 1 "1 Sep 2009" "SunOS 5.11" "User Commands"
.SH NAME
getconf \- get configuration values
.SH SYNOPSIS
.SS "/usr/bin/getconf, /usr/xpg4/bin/getconf, /usr/xpg6/bin/getconf"
.LP
.nf
\fB/usr/bin/getconf\fR [\fB-v\fR \fIspecification\fR] \fIsystem_var\fR
.fi

.LP
.nf
\fB/usr/bin/getconf\fR [\fB-v\fR \fIspecification\fR] \fIpath_var\fR \fIpathname\fR
.fi

.LP
.nf
\fB/usr/bin/getconf\fR \fB-a\fR
.fi

.LP
.nf
\fB/usr/xpg4/bin/getconf\fR [\fB-v\fR \fIspecification\fR] \fIsystem_var\fR
.fi

.LP
.nf
\fB/usr/xpg4/bin/getconf\fR [\fB-v\fR \fIspecification\fR] \fIpath_var\fR \fIpathname\fR
.fi

.LP
.nf
\fB/usr/xpg4/bin/getconf\fR \fB-a\fR
.fi

.LP
.nf
\fB/usr/xpg6/bin/getconf\fR [\fB-v\fR \fIspecification\fR] \fIsystem_var\fR
.fi

.LP
.nf
\fB/usr/xpg6/bin/getconf\fR [\fB-v\fR \fIspecification\fR] \fIpath_var\fR \fIpathname\fR
.fi

.LP
.nf
\fB/usr/xpg6/bin/getconf\fR \fB-a\fR
.fi

.SS "ksh93"
.LP
.nf
\fBgetconf\fR [\fB-abdlpqrtw\fR] [\fB-c\fR RE] [\fB-n\fR RE] [\fB-s\fR RE] [\fB-v\fR \fIname\fR][\fIname\fR [\fIpath\fR [\fIvalue\fR]] .\|.\|.]
.fi

.SH DESCRIPTION
.SS "/usr/bin/getconf, /usr/xpg4/bin/getconf, /usr/xpg6/bin/getconf"
.sp
.LP
In the first synopsis form, the
.B getconf
utility writes to the standard
output the value of the variable specified by
.IR system_var ,
in accordance
with
.I specification
if the
.B -v
option is used.
.sp
.LP
In the second synopsis form,
.B getconf
writes to the standard output the
value of the variable specified by
.I path_var
for the path specified by
.IR pathname ,
in accordance with
.I specification
if the
.B -v
option
is used.
.sp
.LP
In the third synopsis form,
.B config
writes to the standard output the
names of the current system configuration variables.
.sp
.LP
The value of each configuration variable is determined as if it were obtained
by calling the function from which it is defined to be available. The value
reflects conditions in the current operating environment.
.SS "ksh93"
.sp
.LP
The \fBgetconf\fR built-in in \fBksh93\fR is associated with the \fB/bin\fR
and
.B /usr/bin
paths. It is invoked when
.B getconf
is executed without
a pathname prefix and the pathname search finds a
.B /bin/getconf
or
.B /usr/bin/getconf
executable.
.sp
.LP
.B getconf
displays the system configuration value for
.IR name .
If
.I name
is a filesystem specific variable, the value is determined relative
to path, or, the current directory, if path is omitted. If
.I value
is
specified,
.B getconf
attempts to change the process local value to
.IR value .
.B -
can be used in place of path when it is not relevant.
Only writable variables can be set.
.B readonly
variables cannot be
changed.
.sp
.LP
The current value for
.I name
is written to the standard output. If
.I name
is valid but undefined,
.B undefined
is written to the standard
output. If
.I name
is invalid or an error occurs in determining its value,
a diagnostic is written to standard error and
.B getconf
exits with a
.B non-zero
exit status.
.sp
.LP
More than one variable can be set or queried by providing the \fIname path
value\fR 3-tuple for each variable, specifying \fB-\fR for value when
querying.
.sp
.LP
If no operands are specified, all known variables are written in
\fIname\fB=\fIvalue\fR form to the standard output, one per line. Only
one of
.BR --call ,
.B --name
or
.B --standard
can be specified.
.SH OPTIONS
.SS "/usr/bin/getconf, /usr/xpg4/bin/getconf, /usr/xpg6/bin/getconf"
.sp
.LP
The following options are supported by
.BR /usr/bin/getconf ,
.BR /usr/xpg4/bin/getconf ,
and \fB/usr/xpg6/bin/getconf\fR
.sp
.ne 2
.mk
.na
.B -a
.ad
.RS 19n
.rt
Writes the names of the current system configuration variables to the
standard output.
.RE

.sp
.ne 2
.mk
.na
\fB-v\fIspecification\fR
.ad
.RS 19n
.rt
Gives the specification which governs the selection of values for
configuration variables.
.RE

.SS "ksh93"
.sp
.LP
The following options are supported by the
.B getconf
built-in command in
.BR ksh93 :
.sp
.ne 2
.mk
.na
.B -a
.ad
.br
.na
.B --all
.ad
.RS 24n
.rt
Call the native
.BR "getconf -a" .
.RE

.sp
.ne 2
.mk
.na
.B -b
.ad
.br
.na
.B --base
.ad
.RS 24n
.rt
List base variable name without
.B call
and standard prefixes.
.RE

.sp
.ne 2
.mk
.na
.B -c
.ad
.br
.na
\fB--call=\fIRE\fR
.ad
.RS 24n
.rt
Display variables with
.B call
prefix that matches
.IR RE .
The
.B call
prefixes are:
.RS +4
.TP
.ie t \(bu
.el o
.B CS
.sp
.BR confstr (3C),
.RE
.RS +4
.TP
.ie t \(bu
.el o
.B PC
.sp
.BR pathconf (2)
.RE
.RS +4
.TP
.ie t \(bu
.el o
.B SC
.sp
.BR sysconf (3C)
.RE
.RS +4
.TP
.ie t \(bu
.el o
.B SI
.sp
.BR sysinfo (2)
.RE
.RS +4
.TP
.ie t \(bu
.el o
.B XX
.sp
Constant value
.RE
.RE

.sp
.ne 2
.mk
.na
.B -d
.ad
.br
.na
.B --defined
.ad
.RS 24n
.rt
Only display defined values when no operands are specified.
.RE

.sp
.ne 2
.mk
.na
.B -l
.ad
.br
.na
.B --lowercase
.ad
.RS 24n
.rt
List variable names in lower case.
.RE

.sp
.ne 2
.mk
.na
.B -n
.ad
.br
.na
\fB--name=\fIRE\fR
.ad
.RS 24n
.rt
Display variables with names that match
.IR RE .
.RE

.sp
.ne 2
.mk
.na
.B -p
.ad
.br
.na
.B --portable
.ad
.RS 24n
.rt
Display the named writable variables and values in a form that can be
directly executed by
.BR ksh93 (1)
to set the values. If
.I name
is
omitted, lists all writable variables.
.RE

.sp
.ne 2
.mk
.na
.B -q
.ad
.br
.na
.B --quote
.ad
.RS 24n
.rt
Quote values (\fB".\|.\|."\fR).
.RE

.sp
.ne 2
.mk
.na
.B -r
.ad
.br
.na
.B --readonly
.ad
.RS 24n
.rt
Display the named \fBreadonly\fR variables in \fIname\fB=\fIvalue\fR
form. If
.I name
is omitted, lists all
.B readonly
variables.
.RE

.sp
.ne 2
.mk
.na
.B -s
.ad
.br
.na
\fB--standard=\fIRE\fR
.ad
.RS 24n
.rt
Display variables with standard prefix that matches
.IR RE .
Use the
.B --table
option to view all standard prefixes, including local additions.

.sp
The standard prefixes available on all systems are:
.sp
.in +2
.nf

AES
AST
C
GNU
POSIX
SVID
XBS5
XOPEN
XPG
.fi
.in -2
.sp

.RE

.sp
.ne 2
.mk
.na
.B -t
.ad
.br
.na
.B --table
.ad
.RS 24n
.rt
Display the internal table that contains the name, standard, standard
section, and system call symbol prefix for each variable.
.RE

.sp
.ne 2
.mk
.na
.B -w
.ad
.br
.na
.B --writable
.ad
.RS 24n
.rt
Display the named writable variables in \fIname\fB=\fIvalue\fR form. If
.I name
is omitted, lists all writable variables.
.RE

.sp
.ne 2
.mk
.na
.B -v
.ad
.br
.na
.B --specification=name
.ad
.RS 24n
.rt
Call the native \fBgetconf -v\fR
.IR name .
.RE

.SH OPERANDS
.SS "/usr/bin/getconf, /usr/xpg4/bin/getconf, /usr/xpg6/bin/getconf"
.sp
.LP
The following operands are supported by
.BR /usr/bin/getconf ,
.BR /usr/xpg4/bin/getconf ,
and \fB/usr/xpg6/bin/getconf\fR:
.sp
.ne 2
.mk
.na
.I path_var
.ad
.RS 12n
.rt
A name of a configuration variable whose value is available from the
.BR pathconf (2)
function. All of the values in the following table are
supported:
.RE

.sp

.sp
.TS
tab();
lw(1.83i) lw(1.83i) lw(1.83i)
lw(1.83i) lw(1.83i) lw(1.83i)
.
LINK_MAXNAME_MAX_POSIX_CHOWN_RESTRICTED
MAX_CANONPATH_MAX_POSIX_NO_TRUNC
MAX_INPUTPIPE_BUF_POSIX_VDISABLE
.TE

.sp
.ne 2
.mk
.na
.I pathname
.ad
.RS 14n
.rt
A path name for which the variable specified by
.I path_var
is to be
determined.
.RE

.sp
.ne 2
.mk
.na
.I system_var
.ad
.RS 14n
.rt
A name of a configuration variable whose value is available from
.BR confstr (3C)
or \fBsysconf\fR(3C). All of the values in the following
table are supported:
.RE

.sp

.sp
.TS
tab();
lw(2.75i) lw(2.75i)
lw(2.75i) lw(2.75i)
.
ARG_MAXBC_BASE_MAX
BC_DIM_MAXBC_SCALE_MAX
BC_STRING_MAXCHAR_BIT
CHARCLASS_NAME_MAXCHAR_MAX
CHAR_MINCHILD_MAX
CLK_TCKCOLL_WEIGHTS_MAX
CS_PATHEXPR_NEST_MAX
HOST_NAME_MAXINT_MAX
INT_MINLFS64_CFLAGS
LFS64_LDFLAGSLFS64_LIBS
LFS64_LINTFLAGSLFS_CFLAGS
LFS_LDFLAGSLFS_LIBS
LFS_LINTFLAGSLINE_MAX
LONG_BITLONG_MAX
LONG_MINMB_LEN_MAX
NGROUPS_MAXNL_ARGMAX
NL_LANGMAXNL_MSGMAX
NL_NMAXNL_SETMAX
NL_TEXTMAXNZERO
OPEN_MAXPOSIX2_BC_BASE_MAX
POSIX2_BC_DIM_MAXPOSIX2_BC_SCALE_MAX
POSIX2_BC_STRING_MAXPOSIX2_C_BIND
POSIX2_C_DEVPOSIX2_CHAR_TERM
POSIX2_COLL_WEIGHTS_MAXPOSIX2_C_VERSION
POSIX2_EXPR_NEST_MAXPOSIX2_FORT_DEV
POSIX2_FORT_RUNPOSIX2_LINE_MAX
POSIX2_LOCALEDEFPOSIX2_RE_DUP_MAX
POSIX2_SW_DEVPOSIX2_SYMLINKS
POSIX2_UPEPOSIX2_VERSION
POSIX_ALLOC_SIZE_MINPOSIX_REC_INCR_XFER_SIZE
POSIX_REC_MAX_XFER_SIZEPOSIX_REC_MIN_XFER_SIZE
POSIX_REC_XFER_ALIGNPOSIX_V6_ILP32_OFF32
POSIX_V6_ILP32_OFF32_CFLAGSPOSIX_V6_ILP32_OFF32_LDFLAGS
POSIX_V6_ILP32_OFF32_LIBSPOSIX_V6_ILP32_OFFBIG
POSIX_V6_ILP32_OFFBIG_CFLAGSPOSIX_V6_ILP32_OFFBIG_LDFLAGS
POSIX_V6_ILP32_OFFBIG_LIBSPOSIX_V6_LP64_OFF64
POSIX_V6_LP64_OFF64_CFLAGSPOSIX_V6_LP64_OFF64_LDFLAGS
POSIX_V6_LP64_OFF64_LIBSPOSIX_V6_LPBIG_OFFBIG
POSIX_V6_LPBIG_OFFBIG_CFLAGSPOSIX_V6_LPBIG_OFFBIG_LDFLAGS
POSIX_V6_LPBIG_OFFBIG_LIBSPOSIX_V6_WIDTH_RESTRICTED_ENVS
SYMLINK_MAXSYMLOOP_MAX
_POSIX2_BC_BASE_MAX_POSIX2_BC_DIM_MAX
_POSIX2_BC_SCALE_MAX_POSIX2_BC_STRING_MAX
_POSIX2_CHARCLASS_NAME_MAX_POSIX2_CHAR_TERM
_POSIX2_COLL_WEIGHTS_MAX_POSIX2_C_BIND
_POSIX2_C_DEV_POSIX2_C_VERSION
_POSIX2_EXPR_NEST_MAX_POSIX2_FORT_DEV
_POSIX2_FORT_RUN_POSIX2_LINE_MAX
_POSIX2_LOCALEDEF_POSIX2_PBS
_POSIX2_PBS_ACCOUNTING_POSIX2_PBS_CHECKPOINT
_POSIX2_PBS_LOCATE_POSIX2_PBS_MESSAGE
_POSIX2_PBS_TRACK_POSIX2_RE_DUP_MAX
_POSIX2_SW_DEV_POSIX2_UPE
_POSIX2_VERSION_POSIX_ADVISORY_INFO
_POSIX_AIO_LISTIO_MAX_POSIX_AIO_MAX
_POSIX_ARG_MAX_POSIX_ASYNC_IO
_POSIX_BARRIERS_POSIX_CHILD_MAX
_POSIX_CLOCKRES_MIN_POSIX_CLOCK_SELECTION
_POSIX_CPUTIME_POSIX_DELAYTIMER_MAX
_POSIX_HOST_NAME_MAX_POSIX_IPV6
_POSIX_JOB_CONTROL_POSIX_LINK_MAX
_POSIX_LOGIN_NAME_MAX_POSIX_MAX_CANON
_POSIX_MAX_INPUT_POSIX_MONOTONIC_CLOCK
_POSIX_MQ_OPEN_MAX_POSIX_MQ_PRIO_MAX
_POSIX_NAME_MAX_POSIX_NGROUPS_MAX
_POSIX_OPEN_MAX_POSIX_PATH_MAX
_POSIX_PIPE_BUF_POSIX_PRIO_IO
_POSIX_RAW_SOCKETS_POSIX_READER_WRITER_LOCKS
_POSIX_REGEXP_POSIX_RE_DUP_MAX
_POSIX_RTSIG_MAX_POSIX_SAVED_IDS
_POSIX_SEM_NSEMS_MAX_POSIX_SEM_VALUE_MAX
_POSIX_SHELL_POSIX_SIGQUEUE_MAX
_POSIX_SPAWN_POSIX_SPIN_LOCKS
_POSIX_SPORADIC_SERVER_POSIX_SSIZE_MAX
_POSIX_SS_REPL_MAX_POSIX_STREAM_MAX
_POSIX_SYMLINK_MAX_POSIX_SYMLOOP_MAX
_POSIX_SYNC_IO_POSIX_THREAD_ATTR_STACKADDR
_POSIX_THREAD_ATTR_STACKSIZE_POSIX_THREAD_CPUTIME
_POSIX_THREAD_DESTRUCTOR_ITERATIONS_POSIX_THREAD_KEYS_MAX
_POSIX_THREAD_PRIORITY_SCHEDULING_POSIX_THREAD_PRIO_INHERIT
_POSIX_THREAD_PRIO_PROTECT_POSIX_THREAD_PROCESS_SHARED
_POSIX_THREAD_SAFE_FUNCTIONS_POSIX_THREAD_SPORADIC_SERVER
_POSIX_THREAD_THREADS_MAX_POSIX_TIMEOUTS
_POSIX_TIMER_MAX_POSIX_TRA_POSIX_TIMER_MAXCE
_POSIX_TIMESTAMP_RESOLUTION
_POSIX_TRACE_EVENT_FILTER_POSIX_TRACE_EVENT_NAME_MAX
_POSIX_TRACE_INHERIT_POSIX_TRACE_LOG
_POSIX_TRACE_NAME_MAX_POSIX_TRACE_SYS_MAX
_POSIX_TRACE_USER_EVENT_MAX_POSIX_TTY_NAME_MAX
_POSIX_TYPED_MEMORY_OBJECTS_POSIX_TZNAME_MAX
_POSIX_VERSION_POSIX_V6_ILP32_OFF32
_POSIX_V6_ILP32_OFFBIG_POSIX_V6_LP64_OFF64
_POSIX_V6_LPBIG_OFFBIG_V6_ILP32_OFF32
_V6_ILP32_OFFBIG_V6_LP64_OFF64
_V6_LPBIG_OFFBIGRE_DUP_MAX
SCHAR_MAXSCHAR_MIN
SHRT_MAXSHRT_MIN
SSIZE_MAXSTREAM_MAX
TMP_MAXTZNAME_MAX
UCHAR_MAXUINT_MAX
ULONG_MAXUSHRT_MAX
WORD_BITXBS5_ILP32_OFF32
XBS5_ILP32_OFF32_CFLAGSXBS5_ILP32_OFF32_LDFLAGS
XBS5_ILP32_OFF32_LIBSXBS5_ILP32_OFF32_LINTFLAGS
XBS5_ILP32_OFFBIGXBS5_ILP32_OFFBIG_CFLAGS
XBS5_ILP32_OFFBIG_LDFLAGSXBS5_ILP32_OFFBIG_LIBS
XBS5_ILP32_OFFBIG_LINTFLAGSXBS5_LP64_OFF64
XBS5_LP64_OFF64_CFLAGSXBS5_LP64_OFF64_LDFLAGS
XBS5_LP64_OFF64_LIBSXBS5_LP64_OFF64_LINTFLAGS
XBS5_LPBIG_OFFBIGXBS5_LPBIG_OFFBIG_CFLAGS
XBS5_LPBIG_OFFBIG_LDFLAGSXBS5_LPBIG_OFFBIG_LIBS
XBS5_LPBIG_OFFBIG_LINTFLAGS_XOPEN_CRYPT
_XOPEN_ENH_I18N_XOPEN_IOV_MAX
_XOPEN_LEGACY_XOPEN_NAME_MAX
_XOPEN_PATH_MAX_XOPEN_SHM
_XOPEN_STREAMS_XOPEN_VERSION
_XOPEN_XCU_VERSION_XOPEN_XPG2
_XOPEN_XPG3_XOPEN_XPG4
.TE

.sp
.LP
The symbol
.B PATH
also is recognized, yielding the same value as the
.B confstr()
name value
.BR CS_PATH .
.SH USAGE
.sp
.LP
See
.BR largefile (5)
for the description of the behavior of
.B /usr/bin/getconf
when encountering files greater than or equal to 2
Gbyte ( 2^31 bytes).
.SH EXAMPLES
.LP
.B Example 1
Writing the Value of a Variable
.sp
.LP
This example illustrates the value of
.BR {NGROUPS_MAX}:

.sp
.in +2
.nf
example% \fBgetconf NGROUPS_MAX\fR
.fi
.in -2
.sp

.LP
.B Example 2
Writing the Value of a Variable for a Specific Directory
.sp
.LP
This example illustrates the value of
.B NAME_MAX
for a specific
directory:

.sp
.in +2
.nf
example% \fBgetconf NAME_MAX /usr\fR
.fi
.in -2
.sp

.LP
.B Example 3
Dealing with Unspecified Results
.sp
.LP
This example shows how to deal more carefully with results that might be
unspecified:

.sp
.in +2
.nf
\fBif value=$(getconf PATH_MAX /usr); then
if [ "$value" = "undefined" ]; then
echo PATH_MAX in /usr is infinite.
else
echo PATH_MAX in /usr is $value.
fi
else
echo Error in getconf.
fi\fR
.fi
.in -2

.sp
.LP
For example:

.sp
.in +2
.nf
\fBsysconf(_SC_POSIX_C_BIND);\fR
.fi
.in -2

.sp
.LP
and

.sp
.in +2
.nf
\fBsystem("getconf POSIX2_C_BIND");\fR
.fi
.in -2

.sp
.LP
in a C program could give different answers. The
.B sysconf
call supplies
a value that corresponds to the conditions when the program was either
compiled or executed, depending on the implementation. The
.B system
call
to
.B getconf
always supplies a value corresponding to conditions when the
program is executed.

.SH ENVIRONMENT VARIABLES
.sp
.LP
See
.BR environ (5)
for descriptions of the following environment variables
that affect the execution of
.BR getconf :
.BR LANG ,
.BR LC_ALL ,
.BR LC_CTYPE ,
.BR LC_MESSAGES ,
and
.BR NLSPATH .
.sp
.LP
The following environment variable is supported by the
.B ksh93
built-in
.B getconf
command:
.sp
.ne 2
.mk
.na
.B _AST_FEATURES
.ad
.RS 17n
.rt
Local writable values that are different from the default are stored in the
.B _AST_FEATURES
environment variable. The
.B _AST_FEATURES
value is a
space-separated list of
.I "name path value"
3-tuples, where
.I name
is
the system configuration name,
.I path
.RB "is the corresponding path," " -"
if no path is applicable, and
.I value
is the system configuration value.
.RE

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 6n
.rt
The specified variable is valid and information about its current state was
written successfully.
.RE

.sp
.ne 2
.mk
.na
.B >0
.ad
.RS 6n
.rt
An error occurred.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.SS "/usr/bin/getconf, /usr/xpg4/bin/getconf, /usr/xpg6/bin/getconf"
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
_
Interface StabilityCommitted
_
StandardSee \fBstandards\fR(5).
.TE

.SS "ksh93"
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
_
Interface StabilitySee below.
.TE

.sp
.LP
The
.B ksh93
built-in binding to
.B /bin
and
.B /usr/bin
is
Volatile. The built-in command-line interface is Committed.
.SH SEE ALSO
.sp
.LP
.BR ksh93 (1),
.BR sh (1),
.BR pathconf (2),
.BR sysinfo (2),
.BR confstr (3C),
.BR sysconf (3C),
.BR attributes (5),
.BR environ (5),
.BR largefile (5),
.BR standards (5)
