usr/src/man/man1/ln.1
'\" te
.\" Copyright 1989 AT&T
.\" Copyright (c) 2004, Sun Microsystems, Inc.  All Rights Reserved
.\" Portions Copyright (c) 1992, X/Open Company Limited  All Rights Reserved
.\"
.\" Sun Microsystems, Inc. gratefully acknowledges The Open Group for
.\" permission to reproduce portions of its copyrighted documentation.
.\" Original documentation from The Open Group can be obtained online
.\" at http://www.opengroup.org/bookstore/.
.\"
.\" The Institute of Electrical and Electronics Engineers and The Open Group,
.\" have given us permission to reprint portions of their documentation.
.\"
.\" In the following statement, the phrase "this text" refers to portions
.\" of the system documentation.
.\"
.\" Portions of this text are reprinted and reproduced in electronic form in
.\" the Sun OS Reference Manual, from IEEE Std 1003.1, 2004 Edition, Standard
.\" for Information Technology -- Portable Operating System Interface (POSIX),
.\" The Open Group Base Specifications Issue 6, Copyright (C) 2001-2004 by the
.\" Institute of Electrical and Electronics Engineers, Inc and The Open Group.
.\" In the event of any discrepancy between these versions and the original
.\" IEEE and The Open Group Standard, the original IEEE and The Open Group
.\" Standard is the referee document.
.\"
.\" The original Standard can be obtained online at
.\" http://www.opengroup.org/unix/online.html.
.\"
.\" This notice shall appear on any product containing this material.
.\"
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ln 1 "25 Mar 2004" "SunOS 5.11" "User Commands"
.SH NAME
ln \- make hard or symbolic links to files
.SH SYNOPSIS
.LP
.nf
\fB/usr/bin/ln\fR [\fB-fns\fR] \fIsource_file\fR [\fItarget\fR]
.fi

.LP
.nf
\fB/usr/bin/ln\fR [\fB-fns\fR] \fIsource_file\fR.\|.\|. \fItarget\fR
.fi

.LP
.nf
\fB/usr/xpg4/bin/ln\fR [\fB-fs\fR] \fIsource_file\fR [\fItarget\fR]
.fi

.LP
.nf
\fB/usr/xpg4/bin/ln\fR [\fB-fs\fR] \fIsource_file\fR.\|.\|. \fItarget\fR
.fi

.SH DESCRIPTION
.sp
.LP
In the first synopsis form, the
.B ln
utility creates a new directory
entry (link) for the file specified by
.IR source_file ,
at the destination
path specified by
.IR target .
If
.I target
is not specified, the link
is made in the current directory. This first synopsis form is assumed when
the final operand does not name an existing directory; if more than two
operands are specified and the final is not an existing directory, an error
will result.
.sp
.LP
In the second synopsis form, the
.B ln
utility creates a new directory
entry for each file specified by a
.I source_file
operand, at a
destination path in the existing directory named by
.IR target .
.sp
.LP
The
.B ln
utility may be used to create both hard links and symbolic
links. A hard link is a pointer to a file and is indistinguishable from the
original directory entry. Any changes to a file are effective independent of
the name used to reference the file. Hard links may not span file systems
and may not refer to directories.
.sp
.LP
.B ln
by default creates hard links.
.I source_file
is linked to
.IR target .
If
.I target
is a directory, another file named
.I source_file
is created in
.I target
and linked to the original
.IR source_file .
.sp
.LP
If
.I target
is an existing file and the
.B -f
option is not
specified,
.B ln
will write a diagnostic message to standard error, do
nothing more with the current
.IR source_file ,
and go on to any remaining
.IR source_file s.
.sp
.LP
A symbolic link is an indirect pointer to a file; its directory entry
contains the name of the file to which it is linked. Symbolic links may span
file systems and may refer to directories.
.sp
.LP
File permissions for
.I target
may be different from those displayed
with an
.B -l
listing of the
.BR ls (1)
command. To display the
permissions of
.IR target ,
use
.BR "ls -lL" .
See
.BR stat (2)
for
more information.
.SS "/usr/bin/ln"
.sp
.LP
If
.B /usr/bin/ln
determines that the mode of
.I target
forbids
writing, it prints the mode (see
.BR chmod (1)),
asks for a response, and
reads the standard input for one line. If the response is affirmative, the
link occurs, if permissible. Otherwise, the command exits.
.SS "/usr/xpg4/bin/ln"
.sp
.LP
When creating a hard link, and the source file is itself a symbolic link,
the target will be a hard link to the file referenced by the symbolic link,
not to the symbolic link object itself (\fIsource_file\fR).
.SH OPTIONS
.sp
.LP
The following options are supported for both
.B /usr/bin/ln
and
.BR /usr/xpg4/bin/ln :
.sp
.ne 2
.mk
.na
.B -f
.ad
.RS 6n
.rt
Links files without questioning the user, even if the mode of \fItarget\fR
forbids writing. This is the default if the standard input is not a
terminal.
.RE

.sp
.ne 2
.mk
.na
.B -s
.ad
.RS 6n
.rt
Creates a symbolic link.
.sp
If the
.B -s
option is used with two arguments,
.I target
may be an
existing directory or a non-existent file. If
.I target
already exists
and is not a directory, an error is returned.
.I source_file
may be any
path name and need not exist. If it exists, it may be a file or directory
and may reside on a different file system from
.IR target .
If
.IR target
is an existing directory, a file is created in directory
.I target
whose
name is
.I source_file
or the last component of
.IR source_file .
This
file is a symbolic link that references
.IR source_file .
If
.IR target
does not exist, a file with name
.I target
is created and it is a
symbolic link that references
.IR source_file .
.sp
If the
.B -s
.RI "option is used with more than two arguments," " target"
must be an existing directory or an error will be returned. For each
.IR source_file ,
a link is created in
.I target
whose name is the last
component of
.IR source_file .
Each new
.I source_file
is a symbolic
link to the original
.IR source_file .
The files and
.I target
may
reside on different file systems.
.RE

.SS "/usr/bin/ln"
.sp
.LP
The following option is supported for
.B /usr/bin/ln
only:
.sp
.ne 2
.mk
.na
.B -n
.ad
.RS 6n
.rt
If
.I target
is an existing file, writes a diagnostic message to stderr
and goes on to any remaining \fIsource_file\fRs. The \fB-f\fR option
overrides this option. This is the default behavior for \fB/usr/bin/ln\fR
and
.BR /usr/xpg4/bin/ln ,
and is silently ignored.
.RE

.SH OPERANDS
.sp
.LP
The following operands are supported:
.sp
.ne 2
.mk
.na
.I source_file
.ad
.RS 15n
.rt
A path name of a file to be linked. This can be either a regular or special
file. If the
.B -s
option is specified,
.I source_file
can also be a
directory.
.RE

.sp
.ne 2
.mk
.na
.I target
.ad
.RS 15n
.rt
The path name of the new directory entry to be created, or of an existing
directory in which the new directory entries are to be created.
.RE

.SH USAGE
.sp
.LP
See
.BR largefile (5)
for the description of the behavior of
.B ln
when
encountering files greater than or equal to 2 Gbyte ( 2^31 bytes).
.SH ENVIRONMENT VARIABLES
.sp
.LP
See
.BR environ (5)
for descriptions of the following environment
variables that affect the execution of
.BR ln :
.BR LANG ,
.BR LC_ALL ,
.BR LC_CTYPE ,
.BR LC_MESSAGES ,
and
.BR NLSPATH .
.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 6n
.rt
All the specified files were linked successfully
.RE

.sp
.ne 2
.mk
.na
.B >0
.ad
.RS 6n
.rt
An error occurred.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.SS "/usr/bin/ln"
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
_
CSIEnabled
.TE

.SS "/usr/xpg4/bin/ln"
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWxcu4
_
CSIEnabled
_
Interface StabilityStandard
.TE

.SH SEE ALSO
.sp
.LP
.BR chmod (1),
.BR ls (1),
.BR stat (2),
.BR attributes (5),
.BR environ (5),
.BR largefile (5),
.BR standards (5)
.SH NOTES
.sp
.LP
A symbolic link to a directory behaves differently than you might expect in
certain cases. While an
.BR ls (1)
command on such a link displays the
files in the pointed-to directory, entering
.B "ls -l"
displays
information about the link itself:
.sp
.in +2
.nf
example% \fBln -s dir link\fR
example% \fBls link\fR
file1 file2 file3 file4
example% \fBls -l link\fR
lrwxrwxrwx  1 user            7 Jan 11 23:27 link -> dir
.fi
.in -2
.sp

.sp
.LP
When you change to a directory (see
.BR cd (1))
through a symbolic link,
using
.B /usr/bin/sh
or
.BR /usr/bin/csh ,
you wind up in the pointed-to
location within the file system. This means that the parent of the new
working directory is not the parent of the symbolic link, but rather, the
parent of the pointed-to directory. This will also happen when using
.B cd
with the
.B -P
option from
.B /usr/bin/ksh
or
.BR /usr/xpg4/bin/sh .
For instance, in the following case, the final
working directory is
.B /usr
and not
.BR /home/user/linktest .
.sp
.in +2
.nf
example% \fBpwd\fR
/home/user/linktest
example% \fBln -s /usr/tmp symlink\fR
example% \fBcd symlink\fR
example% \fBcd .\|.\fR
example% \fBpwd\fR
/usr
.fi
.in -2
.sp

.sp
.LP
C shell users can avoid any resulting navigation problems by using the
.B pushd
and
.B popd
built-in commands instead of
.BR cd .
