usr/src/man/man1/locale.1
'\" te
.\" Copyright (c) 1992, X/Open Company Limited  All Rights Reserved
.\" Portions Copyright (c) 1995, Sun Microsystems, Inc.  All Rights Reserved
.\"
.\" Sun Microsystems, Inc. gratefully acknowledges The Open Group for
.\" permission to reproduce portions of its copyrighted documentation.
.\" Original documentation from The Open Group can be obtained online
.\" at http://www.opengroup.org/bookstore/.
.\"
.\" The Institute of Electrical and Electronics Engineers and The Open Group,
.\" have given us permission to reprint portions of their documentation.
.\"
.\" In the following statement, the phrase "this text" refers to portions
.\" of the system documentation.
.\"
.\" Portions of this text are reprinted and reproduced in electronic form in
.\" the Sun OS Reference Manual, from IEEE Std 1003.1, 2004 Edition, Standard
.\" for Information Technology -- Portable Operating System Interface (POSIX),
.\" The Open Group Base Specifications Issue 6, Copyright (C) 2001-2004 by the
.\" Institute of Electrical and Electronics Engineers, Inc and The Open Group.
.\" In the event of any discrepancy between these versions and the original
.\" IEEE and The Open Group Standard, the original IEEE and The Open Group
.\" Standard is the referee document.
.\"
.\" The original Standard can be obtained online at
.\" http://www.opengroup.org/unix/online.html.
.\"
.\" This notice shall appear on any product containing this material.
.\"
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH locale 1 "20 Dec 1996" "SunOS 5.11" "User Commands"
.SH NAME
locale \- get locale-specific information
.SH SYNOPSIS
.LP
.nf
\fBlocale\fR [\fB-a\fR | \fB-m\fR]
.fi

.LP
.nf
\fBlocale\fR [\fB-ck\fR] \fIname\fR...
.fi

.SH DESCRIPTION
.sp
.LP
The
.B locale
utility writes information about the current locale
environment, or all public locales, to the standard output. For the purposes
of this section, a
.I "public locale"
is one provided by the implementation
that is accessible to the application.
.sp
.LP
When
.B locale
is invoked without any arguments, it summarizes the
current locale environment for each locale category as determined by the
settings of the environment variables.
.sp
.LP
When invoked with operands, it writes values that have been assigned to the
keywords in the locale categories, as follows:
.RS +4
.TP
.ie t \(bu
.el o
Specifying a keyword name selects the named keyword and the category
containing that keyword.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Specifying a category name selects the named category and all keywords in
that category.
.RE
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -a
.ad
.RS 6n
.rt
Writes information about all available public locales. The available
locales include
.BR POSIX ,
representing the POSIX locale.
.RE

.sp
.ne 2
.mk
.na
.B -c
.ad
.RS 6n
.rt
Writes the names of selected locale categories. The
.B -c
option
increases readability when more than one category is selected (for example,
via more than one keyword name or via a category name). It is valid both
with and without the
.B -k
option.
.RE

.sp
.ne 2
.mk
.na
.B -k
.ad
.RS 6n
.rt
Writes the names and values of selected keywords. The implementation may
omit values for some keywords; see OPERANDS.
.RE

.sp
.ne 2
.mk
.na
.B -m
.ad
.RS 6n
.rt
Writes names of available charmaps; see 
.BR localedef (1).
.RE

.SH OPERANDS
.sp
.LP
The following operand is supported:
.sp
.ne 2
.mk
.na
.I name
.ad
.RS 8n
.rt
The name of a locale category, the name of a keyword in a locale category,
or the reserved name
.BR charmap .
The named category or keyword will be
selected for output. If a single
.I name
represents both a locale
category name and a keyword name in the current locale, the results are
unspecified; otherwise, both category and keyword names can be specified as
\fIname\fR operands, in any sequence.
.RE

.SH EXAMPLES
.LP
\fBExample 1\fR Examples of the locale utility
.sp
.LP
In the following examples, the assumption is that locale environment
variables are set as follows:

.sp
.in +2
.nf
LANG=locale_x LC_COLLATE=locale_y
.fi
.in -2
.sp

.sp
.LP
The command
.B locale
would result in the following output:

.sp
.in +2
.nf
LANG=locale_x
LC_CTYPE="locale_x"
LC_NUMERIC="locale_x"
LC_TIME="locale_x"
LC_COLLATE=locale_y
LC_MONETARY="locale_x"
LC_MESSAGES="locale_x"
LC_ALL=
.fi
.in -2
.sp

.sp
.LP
The command

.sp
.in +2
.nf
\fBLC_ALL=POSIX locale -ck decimal_point\fR
.fi
.in -2
.sp

.sp
.LP
would produce:

.sp
.in +2
.nf
LC_NUMERIC
decimal_point="."
.fi
.in -2
.sp

.sp
.LP
The following command shows an application of
.B locale
to determine
whether a user-supplied response is affirmative:

.sp
.in +2
.nf
\fBif printf "%s\en" "$response" | /usr/xpg4/bin/grep -Eq\e
        "$(locale yesexpr)"
then
    affirmative processing goes here
else
    non-affirmative processing goes here
fi\fR
.fi
.in -2
.sp

.SH ENVIRONMENT VARIABLES
.sp
.LP
See
.BR environ (5)
for the descriptions of
.BR LANG ,
.BR LC_ALL ,
.BR LC_CTYPE ,
.BR LC_MESSAGES ,
and
.BR NLSPATH .
.sp
.LP
The
.BR LANG ,
.BR LC_* ,
and
.B NLSPATH
environment variables must
specify the current locale environment to be written out. These environment
variables will be used if the
.B -a
option is not specified.
.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 6n
.rt
All the requested information was found and output successfully.
.RE

.sp
.ne 2
.mk
.na
.B >0
.ad
.RS 6n
.rt
An error occurred.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWloc
_
CSIEnabled
_
Interface StabilityStandard
.TE

.SH SEE ALSO
.sp
.LP
.BR localedef (1),
.BR attributes (5),
.BR charmap (5),
.BR environ (5),
.BR locale (5),
.BR standards (5)
.SH NOTES
.sp
.LP
If
.B LC_CTYPE
or keywords in the category
.B LC_CTYPE
are specified,
only the values in the range \fB0x00\fR-\fB0x7f\fR are written out.
.sp
.LP
If
.B LC_COLLATE
or keywords in the category
.B LC_COLLATE
are
specified, no actual values are written out.
