usr/src/man/man1/login.1
'\" te
.\" Copyright (C) 2008, Sun Microsystems, Inc. All Rights Reserved
.\" Portions Copyright (c) 1982-2007 AT&T Knowledge Ventures
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH login 1 "7 Jan 2008" "SunOS 5.11" "User Commands"
.SH NAME
login \- sign on to the system
.SH SYNOPSIS
.LP
.nf
\fBlogin\fR [\fB-p\fR] [\fB-d\fR \fIdevice\fR] [\fB-R\fR \fIrepository\fR] [\fB-s\fR \fIservice\fR]
     [\fB-t\fR \fIterminal\fR] [\fB-u\fR \fIidentity\fR] [\fB-U\fR \fIruser\fR]
     [\fB-h\fR \fIhostname\fR \fI[terminal]\fR | \fB-r\fR \fIhostname\fR]
     [\fIname\fR [\fIenviron\fR].\|.\|.]
.fi

.SH DESCRIPTION
.sp
.LP
The
.B login
command is used at the beginning of each terminal session to
identify oneself to the system.
.B login
is invoked by the system when a
connection is first established, after the previous user has terminated the
login shell by issuing the
.B exit
command.
.sp
.LP
If
.B login
is invoked as a command, it must replace the initial command
interpreter. To invoke
.B login
in this fashion, type:
.sp
.in +2
.nf
\fBexec login\fR
.fi
.in -2
.sp

.sp
.LP
from the initial shell. The C shell and Korn shell have their own built-ins
of
.BR login .
See
.BR ksh (1),
.BR ksh93 (1),
and
.BR csh (1)
for
descriptions of login built-ins and usage.
.sp
.LP
.B login
asks for your user name, if it is not supplied as an argument,
and your password, if appropriate. Where possible, echoing is turned off while
you type your password, so it does not appear on the written record of the
session.
.sp
.LP
If you make any mistake in the login procedure, the message:
.sp
.in +2
.nf
Login incorrect
.fi
.in -2
.sp

.sp
.LP
is printed and a new login prompt appears. If you make five incorrect login
attempts, all five can be logged in
.BR /var/adm/loginlog ,
if it exists. The
.B TTY
line is dropped.
.sp
.LP
If password aging is turned on and the password has aged (see
.BR passwd (1)
for more information), the user is forced to changed the password. In this
case the
.B /etc/nsswitch.conf
file is consulted to determine password
repositories (see
.BR nsswitch.conf (4)).
The password update configurations
supported are limited to the following five cases.
.RS +4
.TP
.ie t \(bu
.el o
.B passwd: files
.RE
.RS +4
.TP
.ie t \(bu
.el o
.B passwd: files nis
.RE
.RS +4
.TP
.ie t \(bu
.el o
.B passwd: files nisplus
.RE
.RS +4
.TP
.ie t \(bu
.el o
.B passwd: compat
(==> files nis)
.RE
.RS +4
.TP
.ie t \(bu
.el o
.B passwd: compat
(==> files nisplus)
.sp
.B passwd_compat: nisplus
.RE
.sp
.LP
Failure to comply with the configurations prevents the user from logging onto
the system because
.BR passwd (1)
fails. If you do not complete the login
successfully within a certain period of time, it is likely that you are
silently disconnected.
.sp
.LP
After a successful login, accounting files are updated. Device owner, group,
and permissions are set according to the contents of the
.B /etc/logindevperm
file, and the time you last logged in is printed (see
.BR logindevperm (4)).
.sp
.LP
The user-ID, group-ID, supplementary group list, and working directory are
initialized, and the command interpreter
.RB "(usually " ksh )
is started.
.sp
.LP
The basic
.I environment
is initialized to:
.sp
.in +2
.nf
HOME=\fIyour-login-directory\fR
LOGNAME=\fIyour-login-name\fR
PATH=/usr/bin:
SHELL=\fIlast-field-of-passwd-entry\fR
MAIL=/var/mail/
TZ=\fItimezone-specification\fR
.fi
.in -2

.sp
.LP
For Bourne shell and Korn shell logins, the shell executes \fB/etc/profile\fR
and
.BR $HOME/.profile ,
if it exists.
.sp
.LP
For the
.B ksh93
Korn shell, an interactive shell then executes
.BR /etc/ksh.kshrc ,
followed by the file specified by the
.BR ENV
environment variable. If
.B $ENV
is not set, this defaults to
.BR $HOME/.kshrc .
For the
.B ksh
and
.B /usr/xpg4/bin/sh
Korn Shell,
an interactive shell executes the file named by
.B $ENV
(no default).
.sp
.LP
For C shell logins, the shell executes
.BR /etc/.login ,
.BR $HOME/.cshrc ,
and
.BR $HOME/.login .
The default \fB/etc/profile\fR and \fB/etc/.login\fR
files check quotas (see
.BR quota (1M)),
print
.BR /etc/motd ,
and check for
mail. None of the messages are printed if the file \fB$HOME/.hushlogin\fR
exists. The name of the command interpreter is set to \fB\(mi\fR (dash),
followed by the last component of the interpreter's path name, for example,
.BR \(mish \&.
.sp
.LP
If the
.I login-shell
field in the password file (see
.BR passwd (4))
is
empty, then the default command interpreter,
.BR /usr/bin/sh ,
is used. If
this field is * (asterisk), then the named directory becomes the root
directory. At that point,
.B login
is re-executed at the new level, which
must have its own root structure.
.sp
.LP
The environment can be expanded or modified by supplying additional arguments
to
.BR login ,
either at execution time or when
.B login
requests your
login name. The arguments can take either the form
.I xxx
or
.IR xxx=yyy .
Arguments without an
.B =
(equal sign) are placed in the environment as:
.sp
.in +2
.nf
L\fIn=xxx\fR
.fi
.in -2
.sp

.sp
.LP
where
.I n
is a number starting at
.B 0
and is incremented each time a
new variable name is required. Variables containing an
.B =
(equal sign)
are placed in the environment without modification. If they already appear in
the environment, then they replace the older values.
.sp
.LP
There are two exceptions: The variables
.B PATH
and
.B SHELL
cannot be
changed. This prevents people logged into restricted shell environments from
spawning secondary shells that are not restricted.
.B login
understands
simple single-character quoting conventions. Typing a \fB\e\fR\| (backslash)
in front of a character quotes it and allows the inclusion of such characters
as spaces and tabs.
.sp
.LP
.RB "Alternatively, you can pass the current environment by supplying the" " -p"
flag to
.BR login .
This flag indicates that all currently defined
environment variables should be passed, if possible, to the new environment.
This option does not bypass any environment variable restrictions mentioned
above. Environment variables specified on the login line take precedence, if a
variable is passed by both methods.
.sp
.LP
To enable remote logins by root, edit the
.B /etc/default/login
file by
inserting a
.B #
(pound sign) before the
.B CONSOLE=/dev/console
entry.
See FILES.
.SH SECURITY
.sp
.LP
For accounts in name services which support automatic account locking, the
account can be configured to be automatically locked (see
.BR user_attr (4)
and
.BR policy.conf (4))
if successive failed login attempts equals or
exceeds
.BR RETRIES .
Currently, only the files repository (see
.BR passwd (4)
and
.BR shadow (4))
supports automatic account locking. See
also
.BR pam_unix_auth (5).
.sp
.LP
The
.B login
command uses \fBpam\fR(3PAM) for authentication, account
.RB "management, session management, and password management. The" " PAM"
configuration policy, listed through
.BR /etc/pam.conf ,
specifies the
modules to be used for
.BR login .
Here is a partial
.B pam.conf
file with
entries for the
.B login
command using the UNIX authentication, account
management, and session management modules:
.sp
.in +2
.nf
login  auth       required  pam_authtok_get.so.1
login  auth       required  pam_dhkeys.so.1
login  auth       required  pam_unix_auth.so.1
login  auth       required  pam_dial_auth.so.1

login  account    requisite pam_roles.so.1
login  account    required  pam_unix_account.so.1

login  session    required  pam_unix_session.so.1
.fi
.in -2

.sp
.LP
The Password Management stack looks like the following:
.sp
.in +2
.nf
other  password   required   pam_dhkeys.so.1
other  password   requisite  pam_authtok_get.so.1
other  password   requisite  pam_authtok_check.so.1
other  password   required   pam_authtok_store.so.1
.fi
.in -2

.sp
.LP
If there are no entries for the service, then the entries for the \fBother\fR
service is used. If multiple authentication modules are listed, then the user
can be prompted for multiple passwords.
.sp
.LP
When
.B login
is invoked through
.B rlogind
or
.BR telnetd ,
the
service name used by
.B PAM
is
.B rlogin
or
.BR telnet ,
respectively.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -d
.I device
.ad
.RS 26n
.rt
.B login
accepts a device option,
.IR device .
.I device
is taken to
be the path name of the
.B TTY
port
.B login
is to operate on. The use
of the device option can be expected to improve
.B login
performance, since
.B login
does not need to call
.BR ttyname "(3C). The"
.B -d
option is
available only to users whose
.B UID
and effective
.B UID
are root. Any
other attempt to use
.B -d
causes
.B login
to quietly exit.
.RE

.sp
.ne 2
.mk
.na
\fB-h\fR \fIhostname\fR [\fIterminal\fR]\fR
.ad
.RS 26n
.rt
Used by \fBin.telnetd\fR(1M) to pass information about the remote host and
terminal type.
.sp
Terminal type as a second argument to the
.B -h
option should not start
with a hyphen
.RB ( - ).
.RE

.sp
.ne 2
.mk
.na
.B -p
.ad
.RS 26n
.rt
Used to pass environment variables to the login shell.
.RE

.sp
.ne 2
.mk
.na
.B -r
.I hostname
.ad
.RS 26n
.rt
Used by \fBin.rlogind\fR(1M) to pass information about the remote host.
.RE

.sp
.ne 2
.mk
.na
.B -R
.I repository
.ad
.RS 26n
.rt
Used to specify the
.B PAM
repository that should be used to tell
\fBPAM\fR about the "\fBidentity\fR" (see option \fB-u\fR below). If no
"\fBidentity\fR" information is passed, the repository is not used.
.RE

.sp
.ne 2
.mk
.na
.B -s
.I service
.ad
.RS 26n
.rt
Indicates the
.B PAM
service name that should be used. Normally, this
argument is not necessary and is used only for specifying alternative
\fBPAM\fR service names. For example: "\fBktelnet\fR" for the Kerberized
telnet process.
.RE

.sp
.ne 2
.mk
.na
.B -u
.I identity
.ad
.RS 26n
.rt
Specifies the "\fBidentity\fR" string associated with the user who is being
authenticated. This usually is
.B not
be the same as that user's Unix login
name. For Kerberized login sessions, this is the Kerberos principal name
associated with the user.
.RE

.sp
.ne 2
.mk
.na
.B -U
.I ruser
.ad
.RS 26n
.rt
Indicates the name of the person attempting to login on the remote side of
the rlogin connection. When
.BR in.rlogind (1M)
is operating in Kerberized
mode, that daemon processes the terminal and remote user name information
prior to invoking \fBlogin\fR, so the "\fBruser\fR" data is indicated using
this command line parameter. Normally (non-Kerberos authenticated
.BR rlogin ),
the
.B login
daemon reads the remote user information from
the client.
.RE

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 12n
.rt
Successful operation.
.RE

.sp
.ne 2
.mk
.na
.B non-zero
.ad
.RS 12n
.rt
Error.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B $HOME/.cshrc
.ad
.RS 23n
.rt
Initial commands for each
.BR csh .
.RE

.sp
.ne 2
.mk
.na
.B $HOME/.hushlogin
.ad
.RS 23n
.rt
Suppresses login messages.
.RE

.sp
.ne 2
.mk
.na
.B $HOME/.kshrc
.ad
.RS 23n
.rt
User's commands for interactive
.BR ksh93 ,
if
.B $ENV
is unset; executes
after
.BR /etc/ksh.kshrc .
.RE

.sp
.ne 2
.mk
.na
.B $HOME/.login
.ad
.RS 23n
.rt
User's login commands for
.BR csh .
.RE

.sp
.ne 2
.mk
.na
.B $HOME/.profile
.ad
.RS 23n
.rt
User's login commands for
.BR sh ,
.BR ksh ,
and
.BR ksh93 .
.RE

.sp
.ne 2
.mk
.na
.B $HOME/.rhosts
.ad
.RS 23n
.rt
Private list of trusted hostname/username combinations.
.RE

.sp
.ne 2
.mk
.na
.B /etc/.login
.ad
.RS 23n
.rt
System-wide
.B csh
login commands.
.RE

.sp
.ne 2
.mk
.na
.B /etc/issue
.ad
.RS 23n
.rt
Issue or project identification.
.RE

.sp
.ne 2
.mk
.na
.B /etc/ksh.kshrc
.ad
.RS 23n
.rt
System-wide commands for interactive
.BR ksh93 .
.RE

.sp
.ne 2
.mk
.na
.B /etc/logindevperm
.ad
.RS 23n
.rt
Login-based device permissions.
.RE

.sp
.ne 2
.mk
.na
.B /etc/motd
.ad
.RS 23n
.rt
Message-of-the-day.
.RE

.sp
.ne 2
.mk
.na
.B /etc/nologin
.ad
.RS 23n
.rt
Message displayed to users attempting to login during machine shutdown.
.RE

.sp
.ne 2
.mk
.na
.B /etc/passwd
.ad
.RS 23n
.rt
Password file.
.RE

.sp
.ne 2
.mk
.na
.B /etc/profile
.ad
.RS 23n
.rt
System-wide
.BR sh ,
.BR ksh ,
and
.B ksh93
login commands.
.RE

.sp
.ne 2
.mk
.na
.B /etc/shadow
.ad
.RS 23n
.rt
List of users' encrypted passwords.
.RE

.sp
.ne 2
.mk
.na
.B /usr/bin/sh
.ad
.RS 23n
.rt
User's default command interpreter.
.RE

.sp
.ne 2
.mk
.na
.B /var/adm/lastlog
.ad
.RS 23n
.rt
Time of last login.
.RE

.sp
.ne 2
.mk
.na
.B /var/adm/loginlog
.ad
.RS 23n
.rt
Record of failed login attempts.
.RE

.sp
.ne 2
.mk
.na
.B /var/adm/utmpx
.ad
.RS 23n
.rt
Accounting.
.RE

.sp
.ne 2
.mk
.na
.B /var/adm/wtmpx
.ad
.RS 23n
.rt
Accounting.
.RE

.sp
.ne 2
.mk
.na
\fB/var/mail/\fIyour-name\fR
.ad
.RS 23n
.rt
Mailbox for user
.IR your-name .
.RE

.sp
.ne 2
.mk
.na
.B /etc/default/login
.ad
.RS 23n
.rt
Default value can be set for the following flags in
.BR /etc/default/login .
Default values are specified as comments in the
.B /etc/default/login
file,
for example,
.BR TIMEZONE=EST5EDT .
.sp
.ne 2
.mk
.na
.B TIMEZONE
.ad
.RS 24n
.rt
Sets the
.B TZ
environment variable of the shell (see
.BR environ (5)).
.RE

.sp
.ne 2
.mk
.na
.B HZ
.ad
.RS 24n
.rt
Sets the
.B HZ
environment variable of the shell.
.RE

.sp
.ne 2
.mk
.na
.B ULIMIT
.ad
.RS 24n
.rt
Sets the file size limit for the login. Units are disk blocks. Default is
zero (no limit).
.RE

.sp
.ne 2
.mk
.na
.B CONSOLE
.ad
.RS 24n
.rt
If set, root can login on that device only. This does not prevent execution
of remote commands with
.BR rsh (1).
Comment out this line to allow login by
root.
.RE

.sp
.ne 2
.mk
.na
.B PASSREQ
.ad
.RS 24n
.rt
Determines if login requires a non-null password.
.RE

.sp
.ne 2
.mk
.na
.B ALTSHELL
.ad
.RS 24n
.rt
Determines if login should set the
.B SHELL
environment variable.
.RE

.sp
.ne 2
.mk
.na
.B PATH
.ad
.RS 24n
.rt
Sets the initial shell
.B PATH
variable.
.RE

.sp
.ne 2
.mk
.na
.B SUPATH
.ad
.RS 24n
.rt
Sets the initial shell
.B PATH
variable for root.
.RE

.sp
.ne 2
.mk
.na
.B TIMEOUT
.ad
.RS 24n
.rt
Sets the number of seconds (between
.B 0
and
.BR 900 )
to wait before
abandoning a login session.
.RE

.sp
.ne 2
.mk
.na
.B UMASK
.ad
.RS 24n
.rt
Sets the initial shell file creation mode mask. See
.BR umask (1).
.RE

.sp
.ne 2
.mk
.na
.B SYSLOG
.ad
.RS 24n
.rt
Determines whether the \fBsyslog\fR(3C) \fBLOG_AUTH\fR facility should be
used to log all root logins at level
.B LOG_NOTICE
and multiple failed
login attempts at\fBLOG_CRIT\fR.
.RE

.sp
.ne 2
.mk
.na
.B DISABLETIME
.ad
.RS 24n
.rt
If present, and greater than zero, the number of seconds that \fBlogin\fR
waits after
.B RETRIES
failed attempts or the
.B PAM
framework returns
.BR PAM_ABORT .
Default is
.B 20
seconds. Minimum is
.B 0
seconds. No
maximum is imposed.
.RE

.sp
.ne 2
.mk
.na
.B SLEEPTIME
.ad
.RS 24n
.rt
If present, sets the number of seconds to wait before the login failure
message is printed to the screen. This is for any login failure other than
.BR PAM_ABORT .
Another login attempt is allowed, providing
.B RETRIES
has
not been reached or the
.B PAM
framework is returned
.BR PAM_MAXTRIES .
Default is
.B 4
seconds. Minimum is
.B 0
.RB "seconds. Maximum is" " 5"
seconds.
.sp
Both \fBsu\fR(1M) and \fBsulogin\fR(1M) are affected by the value of
.BR SLEEPTIME .
.RE

.sp
.ne 2
.mk
.na
.B RETRIES
.ad
.RS 24n
.rt
Sets the number of retries for logging in (see \fBpam\fR(3PAM)). The default
is 5. The maximum number of retries is 15. For accounts configured with
automatic locking (see
.B SECURITY
above), the account is locked and
.B login
exits. If automatic locking has not been configured, \fBlogin\fR
exits without locking the account.
.RE

.sp
.ne 2
.mk
.na
.B SYSLOG_FAILED_LOGINS
.ad
.RS 24n
.rt
Used to determine how many failed login attempts are allowed by the system
before a failed login message is logged, using the
.BR syslog (3C)
.B LOG_NOTICE
facility. For example, if the variable is set to
.BR 0 ,
.B login
logs
.I all
failed login attempts.
.RE

.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
.BR csh (1),
.BR exit (1),
.BR ksh (1),
.BR ksh93 (1),
.BR mail (1),
.BR mailx (1),
.BR newgrp (1),
.BR passwd (1),
.BR rlogin (1),
.BR rsh (1),
.BR sh (1),
.BR shell_builtins (1),
.BR telnet (1),
.BR umask (1),
.BR in.rlogind (1M),
.BR in.telnetd (1M),
.BR logins (1M),
.BR quota (1M),
.BR su (1M),
.BR sulogin (1M),
.BR syslogd (1M),
.BR useradd (1M),
.BR userdel (1M),
.BR pam (3PAM),
.BR rcmd (3SOCKET),
.BR syslog (3C),
.BR ttyname (3C),
.BR auth_attr (4),
.BR exec_attr (4),
.BR hosts.equiv (4),
.BR issue (4),
.BR logindevperm (4),
.BR loginlog (4),
.BR nologin (4),
.BR nsswitch.conf (4),
.BR pam.conf (4),
.BR passwd (4),
.BR policy.conf (4),
.BR profile (4),
.BR shadow (4),
.BR user_attr (4),
.BR utmpx (4),
.BR wtmpx (4),
.BR attributes (5),
.BR environ (5),
.BR pam_unix_account (5),
.BR pam_unix_auth (5),
.BR pam_unix_session (5),
.BR pam_authtok_check (5),
.BR pam_authtok_get (5),
.BR pam_authtok_store (5),
.BR pam_dhkeys (5),
.BR pam_passwd_auth (5),
.BR termio (7I)
.SH DIAGNOSTICS
.sp
.ne 2
.mk
.na
.B Login incorrect
.ad
.sp .6
.RS 4n
The user name or the password cannot be matched.
.RE

.sp
.ne 2
.mk
.na
.B Not on system console
.ad
.sp .6
.RS 4n
Root login denied. Check the
.B CONSOLE
setting in
.BR /etc/default/login .
.RE

.sp
.ne 2
.mk
.na
.B "No directory! Logging in with home=/
.ad
.sp .6
.RS 4n
The user's home directory named in the
.BR passwd (4)
database cannot be
found or has the wrong permissions. Contact your system administrator.
.RE

.sp
.ne 2
.mk
.na
.B No shell
.ad
.sp .6
.RS 4n
Cannot execute the shell named in the
.BR passwd (4)
database. Contact your
system administrator.
.RE

.sp
.ne 2
.mk
.na
.B "NO LOGINS: System going down in"
.I N
.B minutes
.ad
.sp .6
.RS 4n
The machine is in the process of being shut down and logins have been
disabled.
.RE

.SH WARNINGS
.sp
.LP
Users with a
.B UID
greater than 76695844 are not subject to password
aging, and the system does not record their last login time.
.sp
.LP
If you use the
.B CONSOLE
setting to disable root logins, you should
arrange that remote command execution by root is also disabled. See
.BR rsh (1),
.BR rcmd (3SOCKET),
and
.BR hosts.equiv (4)
for further
details.
.SH NOTES
.sp
.LP
The
.BR pam_unix (5)
module is no longer supported. Similar functionality is
provided by
.BR pam_unix_account (5),
.BR pam_unix_auth (5),
.BR pam_unix_session (5),
.BR pam_authtok_check (5),
.BR pam_authtok_get (5),
.BR pam_authtok_store (5),
.BR pam_dhkeys (5),
and
.BR pam_passwd_auth (5).
