usr/src/man/man1/mailx.1
'\" te
.\" Copyright 1989 AT&T
.\" Copyright (c) 2001, Sun Microsystems, Inc.  All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" Portions Copyright (c) 1992, X/Open Company Limited  All Rights Reserved
.\"
.\" Sun Microsystems, Inc. gratefully acknowledges The Open Group for
.\" permission to reproduce portions of its copyrighted documentation.
.\" Original documentation from The Open Group can be obtained online
.\" at http://www.opengroup.org/bookstore/.
.\"
.\" The Institute of Electrical and Electronics Engineers and The Open Group,
.\" have given us permission to reprint portions of their documentation.
.\"
.\" In the following statement, the phrase "this text" refers to portions
.\" of the system documentation.
.\"
.\" Portions of this text are reprinted and reproduced in electronic form in
.\" the Sun OS Reference Manual, from IEEE Std 1003.1, 2004 Edition, Standard
.\" for Information Technology -- Portable Operating System Interface (POSIX),
.\" The Open Group Base Specifications Issue 6, Copyright (C) 2001-2004 by the
.\" Institute of Electrical and Electronics Engineers, Inc and The Open Group.
.\" In the event of any discrepancy between these versions and the original
.\" IEEE and The Open Group Standard, the original IEEE and The Open Group
.\" Standard is the referee document.
.\"
.\" The original Standard can be obtained online at
.\" http://www.opengroup.org/unix/online.html.
.\"
.\" This notice shall appear on any product containing this material.
.\"
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH mailx 1 "19 Sep 2001" "SunOS 5.11" "User Commands"
.SH NAME
mailx \- interactive message processing system
.SH SYNOPSIS
.LP
.nf
\fBmailx\fR [\fB-BdeHiInNURvV~\fR] [\fB-f\fR [\fIfile\fR | \fI+folder\fR]] [\fB-T\fR \fIfile\fR]
     [\fB-u\fR \fIuser\fR]
.fi

.LP
.nf
\fBmailx\fR [\fB-BdFintUv~\fR] [\fB-b\fR \fIbcc\fR] [\fB-c\fR \fIcc\fR] [\fB-h\fR \fInumber\fR]
     [\fB-r\fR \fIaddress\fR] [\fB-s\fR \fIsubject\fR] \fIrecipient\fR...
.fi

.LP
.nf
\fB/usr/ucb/mail\fR ...
.fi

.LP
.nf
\fB/usr/ucb/Mail\fR ...
.fi

.SH DESCRIPTION
.sp
.LP
The mail utilities listed above provide a comfortable, flexible environment
for sending and receiving mail messages electronically.
.sp
.LP
When reading mail, the mail utilities provide commands to facilitate
saving, deleting, and responding to messages. When sending mail, the mail
utilities allow editing, reviewing and other modification of the message as
it is entered.
.sp
.LP
Incoming mail is stored in a standard file for each user, called the
.B mailbox
for that user. When the mail utilities are called to read
messages, the
.B mailbox
is the default place to find them. As messages
are read, they are marked to be moved to a secondary file for storage,
unless specific action is taken, so that the messages need not be seen
again.This secondary file is called the
.B mbox
and is normally located
in the user's
.B HOME
directory (see
.B MBOX
in ENVIRONMENT VARIABLES
for a description of this file). Messages can be saved in other secondary
files named by the user. Messages remain in a secondary file until forcibly
removed.
.sp
.LP
The user can access a secondary file by using the
.B -f
option. Messages
in the secondary file can then be read or otherwise processed using the same
.B Commands
as in the primary
.BR mailbox .
This gives rise within these
pages to the notion of a current
.BR mailbox .
.SH OPTIONS
.sp
.LP
On the command line options start with a dash (\(mi). Any other arguments
are taken to be destinations (recipients). If no recipients are specified,
.B mailx
attempts to read messages from the
.BR mailbox .
.sp
.ne 2
.mk
.na
.B -B
.ad
.RS 17n
.rt
Do not buffer standard input or standard output.
.RE

.sp
.ne 2
.mk
.na
.B -b
.I bcc
.ad
.RS 17n
.rt
Set the blind carbon copy list to
.IR bcc .
.I bcc
should be enclosed
in quotes if it contains more than one name.
.RE

.sp
.ne 2
.mk
.na
.B -c
.I cc
.ad
.RS 17n
.rt
Set the carbon copy list to
.IR cc .
.I cc
should be enclosed in quotes
if it contains more than one name.
.RE

.sp
.ne 2
.mk
.na
.B -d
.ad
.RS 17n
.rt
Turn on debugging output. (Neither particularly interesting nor
recommended.)
.RE

.sp
.ne 2
.mk
.na
.B -e
.ad
.RS 17n
.rt
Test for the presence of mail.
.B mailx
prints nothing and exits with a
successful return code if there is mail to read.
.RE

.sp
.ne 2
.mk
.na
.B -F
.ad
.RS 17n
.rt
Record the message in a file named after the first recipient. Overrides the
.B record
variable, if set (see
.BR "Internal Variables" ).
.RE

.sp
.ne 2
.mk
.na
\fB-f\fB [\fIfile\fB]\fR
.ad
.RS 17n
.rt
Read messages from
.I file
instead of
.BR mailbox .
If no
.IR file " is"
specified, the
.B mbox
is used.
.RE

.sp
.ne 2
.mk
.na
\fB-f\fB [ +\fIfolder\fB]\fR
.ad
.RS 17n
.rt
Use the file \fIfolder\fR in the folder directory (same as the \fBfold\fRer
command). The name of this directory is listed in the \fBfolder\fR
variable.
.RE

.sp
.ne 2
.mk
.na
.B -H
.ad
.RS 17n
.rt
Print header summary only.
.RE

.sp
.ne 2
.mk
.na
.B -h
.I number
.ad
.RS 17n
.rt
The number of network "hops" made so far. This is provided for network
software to avoid infinite delivery loops. This option and its argument are
passed to the delivery program.
.RE

.sp
.ne 2
.mk
.na
.B -I
.ad
.RS 17n
.rt
Include the newsgroup and article-id header lines when printing mail
messages. This option requires the
.B -f
option to be specified.
.RE

.sp
.ne 2
.mk
.na
.B -i
.ad
.RS 17n
.rt
Ignore interrupts. See also
.B ignore
in
.BR "Internal Variables" .
.RE

.sp
.ne 2
.mk
.na
.B -N
.ad
.RS 17n
.rt
Do not print initial header summary.
.RE

.sp
.ne 2
.mk
.na
.B -n
.ad
.RS 17n
.rt
Do not initialize from the system default
.B mailx.rc
or
.BR Mail.rc
file. See USAGE.
.RE

.sp
.ne 2
.mk
.na
.B -r
.I address
.ad
.RS 17n
.rt
Use
.I address
as the return address when invoking the delivery program.
All tilde commands are disabled. This option and its argument is passed to
the delivery program.
.RE

.sp
.ne 2
.mk
.na
.B -s
.I subject
.ad
.RS 17n
.rt
Set the Subject header field to
.IR subject .
.I subject
should be
enclosed in quotes if it contains embedded white space.
.RE

.sp
.ne 2
.mk
.na
.B -T
.I file
.ad
.RS 17n
.rt
Message-id and article-id header lines are recorded in
.I file
after the
message is read. This option also sets the
.B -I
option.
.RE

.sp
.ne 2
.mk
.na
.B -t
.ad
.RS 17n
.rt
Scan the input for
.BR To: ,
.BR Cc: ,
and
.B Bcc:
fields. Any
recipients on the command line will be ignored.
.RE

.sp
.ne 2
.mk
.na
.B -U
.ad
.RS 17n
.rt
Convert
.B UUCP-style
addresses to internet standards.  Overrides the
.B conv
environment variable.
.RE

.sp
.ne 2
.mk
.na
.B -u
.I user
.ad
.RS 17n
.rt
Read
.IR user 's
.BR mailbox .
This is only effective if
.IR user 's
.B mailbox
is not read protected.
.RE

.sp
.ne 2
.mk
.na
.B -V
.ad
.RS 17n
.rt
Print the
.B mailx
version number and exit.
.RE

.sp
.ne 2
.mk
.na
.B -v
.ad
.RS 17n
.rt
Pass the
.B -v
flag to
.BR sendmail (1M).
.RE

.sp
.ne 2
.mk
.na
.B -~
.ad
.RS 17n
.rt
Interpret tilde escapes in the input even if not reading from a tty.
.RE

.SH OPERANDS
.sp
.LP
The following operands are supported:
.sp
.ne 2
.mk
.na
.I recipient
.ad
.RS 13n
.rt
Addressee of message.
.RE

.SH USAGE
.SS "Starting Mail"
.sp
.LP
At startup time,
.B mailx
executes the system startup file
.BR /etc/mail/mailx.rc .
If invoked as
.B mail
or
.BR Mail ,
the system
startup file
.B /etc/mail/Mail.rc
is used instead.
.sp
.LP
The system startup file sets  up initial display options and alias lists
and assigns values to some internal variables. These variables are flags and
valued parameters which are set and cleared using the
.BR se "t and"
\fBuns\fRet commands. See
.BR "Internal Variables" .
.sp
.LP
With the following exceptions, regular commands are legal inside startup
files:
.BR ! ,
\fBC\fRopy, \fBe\fRdit, \fBfo\fRllowup, \fBF\fRollowup,
\fBho\fRld, \fBm\fRail, \fBpre\fRserve, \fBr\fReply, \fBR\fReply,
\fBsh\fRell, and \fBv\fRisual. An error in the startup file causes the
remaining lines in the file to be ignored.
.sp
.LP
After executing the system startup file,  the mail utilities execute the
optional personal startup file
.BR $HOME/.mailrc ,
wherein the user can
override the values of the internal variables as set by the system startup
file.
.sp
.LP
If the
.B -n
option is specified, however, the mail utilities do not
execute the system startup file.
.sp
.LP
Many system administrators include the commands
.sp
.in +2
.nf
set appenddeadletter
unset replyall
unset pipeignore
.fi
.in -2
.sp

.sp
.LP
in the system startup files (to be compatible with past Solaris behavior),
but this does not meet standards requirements for
.BR mailx .
To get
standard behavior for
.BR mailx ,
users should use the
.B -n
option or
include the following commands in a personal startup file:
.sp
.in +2
.nf
unset appenddeadletter
set replyall
set pipeignore
.fi
.in -2
.sp

.sp
.LP
When reading mail, the mail utilities are in
.IR "command mode" .
A header
summary of the first several messages is displayed, followed by a prompt
indicating the mail utilities can accept regular commands (see
.B Commands
below). When sending mail, the mail utilities are in \fIinput
mode\fR. If no subject is specified on the command line, and the
.B asksub
variable is set, a prompt for the subject is printed.
.sp
.LP
As the message is typed, the mail utilities read the message and store it
in a temporary file. Commands may be entered by beginning a line with the
tilde (~) escape character followed by a single command letter and optional
arguments. See
.B "Tilde Escapes"
for a summary of these commands.
.SS "Reading Mail"
.sp
.LP
Each message is assigned a sequential number, and there is at any time the
notion of a current message, marked by a right angle bracket (>) in the
header summary. Many commands take an optional list of messages
(\fImessage-list\fR) to operate on.  In most cases, the current message is
set to the highest-numbered message in the list after the command is
finished executing.
.sp
.LP
The default for
.I message-list
is the current message. A
.I message-list
is a list of message identifiers separated by spaces,
which may include:
.sp
.ne 2
.mk
.na
.I n
.ad
.RS 11n
.rt
Message number
.IR n .
.RE

.sp
.ne 2
.mk
.na
\fB\&.\fR
.ad
.RS 11n
.rt
The current message.
.RE

.sp
.ne 2
.mk
.na
.B ^
.ad
.RS 11n
.rt
The first undeleted message.
.RE

.sp
.ne 2
.mk
.na
.B $
.ad
.RS 11n
.rt
The last message.
.RE

.sp
.ne 2
.mk
.na
.B *
.ad
.RS 11n
.rt
All messages.
.RE

.sp
.ne 2
.mk
.na
.B +
.ad
.RS 11n
.rt
The next undeleted message.
.RE

.sp
.ne 2
.mk
.na
\fB\(mi\fR
.ad
.RS 11n
.rt
The previous undeleted message.
.RE

.sp
.ne 2
.mk
.na
\fIn\fB\(mi\fIm\fR
.ad
.RS 11n
.rt
An inclusive range of message numbers.
.RE

.sp
.ne 2
.mk
.na
.I user
.ad
.RS 11n
.rt
All messages from
.IR user .
.RE

.sp
.ne 2
.mk
.na
.I /string
.ad
.RS 11n
.rt
All messages with
.I string
in the Subject line (case ignored).
.RE

.sp
.ne 2
.mk
.na
\fB:\fIc\fR
.ad
.RS 11n
.rt
All messages of type
.IR c ,
where
.I c
is one of:
.sp
.ne 2
.mk
.na
.B d
.ad
.RS 5n
.rt
deleted messages
.RE

.sp
.ne 2
.mk
.na
.B n
.ad
.RS 5n
.rt
new messages
.RE

.sp
.ne 2
.mk
.na
.B o
.ad
.RS 5n
.rt
old messages
.RE

.sp
.ne 2
.mk
.na
.B r
.ad
.RS 5n
.rt
read messages
.RE

.sp
.ne 2
.mk
.na
.B u
.ad
.RS 5n
.rt
unread messages
.RE

Notice that the context of the command determines whether this type of
message specification makes sense.
.RE

.sp
.LP
Other arguments are usually arbitrary strings whose usage depends on the
command involved. Filenames, where expected, are expanded using the normal
shell conventions (see
.BR sh (1)).
Special characters are recognized by
certain commands and are documented with the commands below.
.SS "Sending Mail"
.sp
.LP
Recipients listed on the command line may be of three types: login names,
shell commands, or alias groups. Login names may be any network address,
including mixed network addressing. If mail is found to be undeliverable, an
attempt is made to return it to the sender's
.BR mailbox .
If the recipient
name begins with a pipe symbol ( | ), the rest of the name is taken to be a
shell command to pipe the message through. This provides an automatic
interface with any program that reads the standard input, such as
.BR lp (1)
for recording outgoing mail on paper. Alias groups are set by
the
.BR a "lias command (see"
.B Commands
below) or in a system startup
file (for example,
.BR $HOME/.mailrc ).
Aliases are lists of recipients of
any type.
.SS "Forwarding Mail"
.sp
.LP
To forward a specific message, include it in a message to the desired
recipients with the \fB~f\fR or \fB~m\fR tilde escapes. See \fBTilde\fR
.B Escapes
below. To forward mail automatically, add a comma-separated
list of addresses for additional recipients to the \fB\&.forward\fR file in
your home directory. This is different from the format of the \fBalias\fR
command, which takes a space-separated list instead.
.B Note:
Forwarding
addresses must be valid, or the messages will "bounce." You cannot, for
instance, reroute your mail to a new host by forwarding it to your new
address if it is not yet listed in the
.B NIS
aliases domain.
.SS "Commands"
.sp
.LP
Regular commands are of the form
.sp
.in +2
.nf
[ \fIcommand\fR ] [ \fImessage-list\fR ] [ \fIarguments\fR ]
.fi
.in -2
.sp

.sp
.LP
In
.IR "input mode" ,
commands are recognized by the escape character,
.BR tilde(~) ,
and lines not treated as commands are taken as input for the
message. If no command is specified in
.IR "command mode" ,
\fBn\fRext is
assumed. The following is a complete list of
.B mailx
commands:
.sp
.ne 2
.mk
.na
\fB!\fIshell-command\fR
.ad
.sp .6
.RS 4n
Escape to the shell. See
.B SHELL
in ENVIRONMENT VARIABLES.
.RE

.sp
.ne 2
.mk
.na
.B #
.I comment
.ad
.sp .6
.RS 4n
.I NULL
command (comment). Useful in
.B mailrc
files.
.RE

.sp
.ne 2
.mk
.na
.B =
.ad
.sp .6
.RS 4n
Print the current message number.
.RE

.sp
.ne 2
.mk
.na
.B ?
.ad
.sp .6
.RS 4n
Prints a summary of commands.
.RE

.sp
.ne 2
.mk
.na
\fBa\fRlias \fIalias name\fR .\|.\|.\fR
.ad
.br
.na
\fBg\fRroup \fIalias name\fR .\|.\|.\fR
.ad
.sp .6
.RS 4n
Declare an alias for the given names. The names are substituted when
.B alias
is used as a recipient. Useful in the
.B mailrc
file. With no
arguments, the command displays the list of defined aliases.
.RE

.sp
.ne 2
.mk
.na
\fBalt\fRernates \fIname .\|.\|.\fR
.ad
.sp .6
.RS 4n
Declare a list of alternate names for your login. When responding to a
message, these names are removed from the list of recipients for the
response. With no arguments, print the current list of alternate names. See
also
.B allnet
in
.BR "Internal Variables" .
.RE

.sp
.ne 2
.mk
.na
\fBcd\fR [\fIdirectory\fR]\fR
.ad
.br
.na
\fBch\fRdir [\fIdirectory\fR]\fR
.ad
.sp .6
.RS 4n
Change directory. If
.I directory
is not specified,
.B $HOME
is
used.
.RE

.sp
.ne 2
.mk
.na
\fBc\fRopy [\fIfile\fR]\fR
.ad
.br
.na
\fBc\fRopy [\fImessage-list\fR] \fIfile\fR
.ad
.sp .6
.RS 4n
Copy messages to the file without marking the messages as saved. Otherwise
equivalent to the
.BR s "ave command."
.RE

.sp
.ne 2
.mk
.na
\fBC\fRopy [\fImessage-list\fR]\fR
.ad
.sp .6
.RS 4n
Save the specified messages in a file whose name is derived from the author
of the message to be saved, without marking the messages as saved. Otherwise
equivalent to the
.BR S "ave command."
.RE

.sp
.ne 2
.mk
.na
\fBd\fRelete [\fImessage-list\fR]\fR
.ad
.sp .6
.RS 4n
Delete messages from the
.BR mailbox .
If
.B autoprint
is set, the next
message after the last one deleted is printed (see \fBInternal
Variables\fR).
.RE

.sp
.ne 2
.mk
.na
\fBdi\fRscard [\fIheader-field\fR.\|.\|.\|]\fR
.ad
.br
.na
\fBig\fRnore [\fIheader-field\fR.\|.\|.\|]\fR
.ad
.sp .6
.RS 4n
Suppress printing of the specified header fields when displaying messages
on the screen. Examples of header fields to ignore are
.B Status
and
.BR Received .
The fields are included when the message is saved, unless
the
.B alwaysignore
variable is set. The \fBMo\fRre, \fBPa\fRge,
\fBP\fRrint, and \fBT\fRype commands override this command. If no header is
specified, the current list of header fields being ignored is printed. See
also the \fBundi\fRscard and \fBunig\fRnore commands.
.RE

.sp
.ne 2
.mk
.na
\fBdp\fR [\fImessage-list\fR]\fR
.ad
.br
.na
\fBdt\fR [\fImessage-list\fR]\fR
.ad
.sp .6
.RS 4n
Delete the specified messages from the
.B mailbox
and print the next
message after the last one deleted. Roughly equivalent to a \fBd\fRelete
command followed by a
.BR p "rint command."
.RE

.sp
.ne 2
.mk
.na
\fBec\fRho \fIstring\fR .\|.\|.\fR
.ad
.sp .6
.RS 4n
Echo the given strings (like
.BR echo (1)).
.RE

.sp
.ne 2
.mk
.na
\fBe\fRdit [\fImessage-list\fR]\fR
.ad
.sp .6
.RS 4n
Edit the given messages. Each message is placed in a temporary file and the
program named by the
.B EDITOR
variable is invoked to edit it (see
ENVIRONMENT VARIABLES). Default editor is
.BR ed (1).
.RE

.sp
.ne 2
.mk
.na
\fBex\fRit\fR
.ad
.br
.na
\fBx\fRit\fR
.ad
.sp .6
.RS 4n
Exit from
.BR mailx ,
without changing the
.BR mailbox .
No messages are
saved in the
.B mbox
(see also \fBq\fRuit).
.RE

.sp
.ne 2
.mk
.na
\fBfie\fRld [\fImessage-list\fR] header-file\fR
.ad
.sp .6
.RS 4n
Display the value of the header field in the specified message.
.RE

.sp
.ne 2
.mk
.na
\fBfi\fRle [\fIfile\fR]\fR
.ad
.br
.na
\fBfold\fRer [\fIfile\fR]\fR
.ad
.sp .6
.RS 4n
Quit from the current file of messages and read in the specified file.
Several special characters are recognized when used as file names:
.sp
.ne 2
.mk
.na
.B %
.ad
.RS 9n
.rt
the current
.BR mailbox .
.RE

.sp
.ne 2
.mk
.na
\fB%\fIuser\fR
.ad
.RS 9n
.rt
the
.B mailbox
for
.IR user .
.RE

.sp
.ne 2
.mk
.na
.B #
.ad
.RS 9n
.rt
the previous mail file.
.RE

.sp
.ne 2
.mk
.na
.B &
.ad
.RS 9n
.rt
the current
.BR mbox .
.RE

.sp
.ne 2
.mk
.na
\fB+\fIfile\fR
.ad
.RS 9n
.rt
The named file in the \fIfolder\fR directory (listed in the \fBfolder\fR
variable).
.RE

With no arguments, print the name of the current mail file, and the number
of messages and characters it contains.
.RE

.sp
.ne 2
.mk
.na
.B folders
.ad
.sp .6
.RS 4n
Print the names of the files in the directory set by the \fBfolder\fR
variable  (see
.BR "Internal Variables" ).
.RE

.sp
.ne 2
.mk
.na
\fBFo\fRllowup [\fImessage\fR]\fR
.ad
.sp .6
.RS 4n
Respond to a message, recording the response in a file whose name is
derived from the author of the message. Overrides the
.B record
variable,
if set. If the
.B replyall
variable is set, the actions of \fBFo\fRllowup
and \fBfo\fRllowup are reversed. See also the \fBf\fRollowup, \fBS\fRave,
and \fBC\fRopy commands and \fBoutfolder\fR in
.BR "Internal Variables" ,
and
the
.B "Starting Mail"
section in USAGE above.
.RE

.sp
.ne 2
.mk
.na
\fBf\fRollowup [\fImessage-list\fR]\fR
.ad
.sp .6
.RS 4n
Respond to the first message in the
.IR message-list ,
sending the message
to the author of each message in the
.IR message-list .
The subject line is
taken from the first message and the response is recorded in a file whose
name is derived from the author of the first message. If the \fBreplyall\fR
variable is set, the actions of \fBfo\fRllowup and \fBFo\fRllowup are
reversed. See also the \fBFo\fRllowup, \fBS\fRave, and \fBC\fRopy commands
and
.B outfolder
in
.BR "Internal Variables" ,
and the
.BR "Starting Mail"
section in USAGE above.
.RE

.sp
.ne 2
.mk
.na
\fBf\fRrom [\fImessage-list\fR]\fR
.ad
.sp .6
.RS 4n
Print the header summary for the specified messages. If no messages are
specified, print the header summary for the current message.
.RE

.sp
.ne 2
.mk
.na
\fBg\fRroup \fIalias name\fR .\|.\|.\fR
.ad
.br
.na
\fBa\fRlias \fIalias name\fR .\|.\|.\fR
.ad
.sp .6
.RS 4n
Declare an alias for the given names. The names are substituted when
.B alias
is used as a recipient. Useful in the
.B mailrc
file.
.RE

.sp
.ne 2
.mk
.na
\fBh\fReaders [\fImessage\fR]\fR
.ad
.sp .6
.RS 4n
Print the page of headers which includes the message specified. The
.B screen
variable sets the number of headers per page (see \fBInternal
Variables\fR). See also the
.B z
command.
.RE

.sp
.ne 2
.mk
.na
\fBhel\fRp\fR
.ad
.sp .6
.RS 4n
Print a summary of commands.
.RE

.sp
.ne 2
.mk
.na
\fBho\fRld [\fImessage-list\fR]\fR
.ad
.br
.na
\fBpre\fRserve [\fImessage-list\fR]\fR
.ad
.sp .6
.RS 4n
Hold the specified messages in the
.BR mailbox .
.RE

.sp
.ne 2
.mk
.na
\fBi\fRf \fBs\fR | \fBr\fR | \fBt\fR
.ad
.br
.na
.I mail-commands
.ad
.br
.na
\fR
.ad
.br
.na
\fBel\fRse\fR
.ad
.br
.na
.I mail-commands
.ad
.br
.na
\fR
.ad
.br
.na
.BR en dif\fR
.ad
.sp .6
.RS 4n
Conditional execution, where
.I s
executes following
.IR mail-commands ,
up to an \fBel\fRse or \fBen\fRdif, if the program is
in
.I send
mode,
.I r
causes the
.I mail-commands
to be executed
only in
.I receive
mode, and
.B t
causes the
.I mail-commands
to be
executed only if
.B mailx
is being run from a terminal. Useful in the
.B mailrc
file.
.RE

.sp
.ne 2
.mk
.na
.B inc
.ad
.sp .6
.RS 4n
Incorporate messages that arrive while you are reading the system mailbox.
The new messages are added to the message list in the current
.BR mail
session. This command does not commit changes made during the session, and
prior messages are not renumbered.
.RE

.sp
.ne 2
.mk
.na
\fBig\fRnore [\fIheader-field\fR .\|.\|.\|]\fR
.ad
.br
.na
\fBdi\fRscard [\fIheader-field\fR .\|.\|.\|]\fR
.ad
.sp .6
.RS 4n
Suppress printing of the specified header fields when displaying messages
on the screen. Examples of header fields to ignore are
.B Status
and
.BR Cc .
All fields are included when the message is saved. The \fBMo\fRre,
\fBPa\fRge, \fBP\fRrint and \fBT\fRype commands override this command. If no
header is specified, the current list of header fields being ignored is
printed. See also the \fBundi\fRscard and \fBunig\fRnore commands.
.RE

.sp
.ne 2
.mk
.na
\fBl\fRist\fR
.ad
.sp .6
.RS 4n
Print all commands available. No explanation is given.
.RE

.sp
.ne 2
.mk
.na
\fBlo\fRad\fR
.ad
.sp .6
.RS 4n
[\fImessage\fR] \fBfile\fR The specified message is replaced by the message
in the named file.
.B file
should contain a single mail message including
mail headers (as saved by the \fBs\fRave command).
.RE

.sp
.ne 2
.mk
.na
\fBm\fRail \fIrecipient\fR .\|.\|.\fR
.ad
.sp .6
.RS 4n
Mail a message to the specified recipients.
.RE

.sp
.ne 2
.mk
.na
\fBM\fRail \fIrecipient\fR
.ad
.sp .6
.RS 4n
Mail a message to the specified recipients, and record it in a file whose
name is derived from the author of the message. Overrides the \fBrecord\fR
variable, if set. See also the
.B Save
and
.B Copy
commands and
.B outfolder
in
.BR "Internal Variables" .
.RE

.sp
.ne 2
.mk
.na
\fBmb\fRox [\fImessage-list\fR]\fR
.ad
.sp .6
.RS 4n
Arrange for the given messages to end up in the standard
.B mbox
save
file when
.B mailx
terminates normally. See
.B MBOX
in ENVIRONMENT
VARIABLES for a description of this file. See also the \fBex\fRit and
\fBq\fRuit commands.
.RE

.sp
.ne 2
.mk
.na
\fBmo\fRre [\fImessage-list\fR]\fR
.ad
.br
.na
\fBpa\fRge [\fImessage-list\fR]\fR
.ad
.sp .6
.RS 4n
Print the specified messages. If
.B crt
is set, the messages longer than
the number of lines specified by the
.B crt
variable are paged through
the command specified by the
.B PAGER
variable. The default command is
.BR pg (1)
or if the
.B bsdcompat
variable is set, the default is
.BR more (1).
See ENVIRONMENT VARIABLES. Same as the \fBp\fRrint and
\fBt\fRype commands.
.RE

.sp
.ne 2
.mk
.na
\fBMo\fRre [\fImessage-list\fR]\fR
.ad
.br
.na
\fBPa\fRge [\fImessage-list\fR]\fR
.ad
.sp .6
.RS 4n
Print the specified messages on the screen, including all header fields.
Overrides suppression of fields by the
.BR ig "nore command. Same as the"
\fBP\fRrint and \fBT\fRype commands.
.RE

.sp
.ne 2
.mk
.na
\fBne\fRw [\fImessage-list\fR]\fR
.ad
.br
.na
\fBN\fRew [\fImessage-list\fR]\fR
.ad
.br
.na
\fBunr\fRead [\fImessage-list\fR]\fR
.ad
.br
.na
\fBU\fRnread\fR
.ad
.sp .6
.RS 4n
[\fImessage-list\fR] Take a message list and mark each message as \fInot\fR
having been read.
.RE

.sp
.ne 2
.mk
.na
\fBn\fRext [\fImessage\fR]\fR
.ad
.sp .6
.RS 4n
Go to the next message matching
.IR message .
If message is not supplied,
this command finds the next message that was not deleted or saved. A
.I message-list
may be specified, but in this case the first valid
message in the list is the only one used. This is useful for jumping to the
next message from a specific user, since the name would be taken as a
command in the absence of a real command. See the discussion of
.I message-list
above for a description of possible message
specifications.
.RE

.sp
.ne 2
.mk
.na
\fBpi\fRpe [\fImessage-list\fR] [\fIshell-command\fR]\fR
.ad
.br
.na
\fB|\fR [\fImessage-list\fR] [\fIshell-command\fR]\fR
.ad
.sp .6
.RS 4n
Pipe the message through the given
.IR shell-command .
The message is
treated as if it were read. If no arguments are given, the current message
is piped through the command specified by the value of the
.BR cmd
variable. If the
.B page
variable is set, a form feed character is
inserted after each message (see
.BR "Internal Variables" ).
.RE

.sp
.ne 2
.mk
.na
\fBpre\fRserve [\fImessage-list\fR]\fR
.ad
.br
.na
\fBho\fRld [\fImessage-list\fR]\fR
.ad
.sp .6
.RS 4n
Preserve the specified messages in the
.BR mailbox .
.RE

.sp
.ne 2
.mk
.na
\fBp\fRrint [\fImessage-list\fR]\fR
.ad
.br
.na
\fBt\fRype [\fImessage-list\fR]\fR
.ad
.sp .6
.RS 4n
Print the specified messages. If
.B crt
is set, the messages longer than
the number of lines specified by the
.B crt
variable are paged through
the command specified by the
.B PAGER
variable. The default command is
.BR pg (1)
or if the
.B bsdcompat
variable is set, the default is
.BR more (1).
See ENVIRONMENT VARIABLES. Same as the \fBmo\fRre and
\fBpa\fRge commands.
.RE

.sp
.ne 2
.mk
.na
\fBP\fRrint [\fImessage-list\fR]\fR
.ad
.br
.na
\fBT\fRype [\fImessage-list\fR]\fR
.ad
.sp .6
.RS 4n
Print the specified messages on the screen, including all header fields.
Overrides suppression of fields by the
.BR ig "nore command.  Same as the"
\fBMo\fRre and \fBPa\fRge commands.
.RE

.sp
.ne 2
.mk
.na
\fBpu\fRt [\fIfile\fR]\fR
.ad
.br
.na
\fBpu\fRt [\fImessage-list\fR] \fIfile\fR
.ad
.sp .6
.RS 4n
Save the specified message in the given file. Use the same conventions as
the \fBp\fRrint command for which header fields are ignored.
.RE

.sp
.ne 2
.mk
.na
\fBPu\fRt [\fIfile\fR]\fR
.ad
.br
.na
\fBPu\fRt [\fImessage-list\fR] \fIfile\fR
.ad
.sp .6
.RS 4n
Save the specified message in the given file. Overrides suppression of
fields by the
.BR ig "nore command."
.RE

.sp
.ne 2
.mk
.na
\fBq\fRuit\fR
.ad
.sp .6
.RS 4n
Exit from
.BR mailx ,
storing messages that were read in
.B mbox
and
unread messages in the
.BR mailbox .
Messages that have been explicitly
saved in a file are deleted unless the
.B keepsave
variable is set.
.RE

.sp
.ne 2
.mk
.na
\fBr\fReply [\fImessage-list\fR]\fR
.ad
.br
.na
\fBr\fRespond [\fImessage-list\fR]\fR
.ad
.br
.na
\fBreplys\fRender [\fImessage-list\fR]\fR
.ad
.sp .6
.RS 4n
Send a response to the author of each message in the
.IR message-list .
The subject line is taken from the first message.  If
.B record
is set to
a file, a copy of the reply is added to that file. If the \fBreplyall\fR
variable is set, the actions of \fBR\fReply/\fBR\fRespond and
\fBr\fReply/\fBr\fRespond are reversed. The \fBreplys\fRender command is not
affected by the
.B replyall
variable, but sends each reply only to the
sender of each message. See the
.B "Starting Mail"
section in USAGE
above.
.RE

.sp
.ne 2
.mk
.na
\fBR\fReply [\fImessage\fR]\fR
.ad
.br
.na
\fBR\fRespond [\fImessage\fR]\fR
.ad
.br
.na
\fBreplya\fRll [\fImessage\fR]\fR
.ad
.sp .6
.RS 4n
Reply to the specified message, including all other recipients of that
message. If the variable
.B record
is set to a file, a copy of the reply
added to that file. If the
.B replyall
variable is set, the actions of
\fBR\fReply/\fBR\fRespond and \fBr\fReply/\fBr\fRespond are reversed. The
\fBreplya\fRll command is not affected by the \fBreplyall\fR variable, but
always sends the reply to all recipients of the message. See the \fBStarting
Mail\fR section in USAGE above.
.RE

.sp
.ne 2
.mk
.na
\fBret\fRain\fR
.ad
.sp .6
.RS 4n
Add the list of header fields named to the
.IR "retained list" .
Only the
header fields in the retain list are shown on your terminal when you print a
message. All other header fields are suppressed.  The set of retained fields
specified by the \fBret\fRain command overrides any list of ignored fields
specified by the \fBig\fRnore command. The \fBT\fRype and \fBP\fRrint
commands can be used to print a message in its entirety. If \fBret\fRain is
executed with no arguments, it lists the current set of retained fields.
.RE

.sp
.ne 2
.mk
.na
\fBS\fRave [\fImessage-list\fR]\fR
.ad
.sp .6
.RS 4n
Save the specified messages in a file whose name is derived from the author
of the first message. The name of the file is taken to be the author's name
with all network addressing stripped off. See also the \fBC\fRopy,
\fBfo\fRllowup, and \fBF\fRollowup commands and \fBoutfolder\fR in
.BR "Internal Variables" .
.RE

.sp
.ne 2
.mk
.na
\fBs\fRave [\fIfile\fR]\fR
.ad
.br
.na
\fBs\fRave [\fImessage-list\fR] \fIfile\fR
.ad
.sp .6
.RS 4n
Save the specified messages in the given file. The file is created if it
does not exist. The file defaults to
.BR mbox .
The message is deleted from
the
.B mailbox
when
.B mailx
terminates unless
.B keepsave
is set
(see also
.B "Internal Variables"
and the \fBex\fRit and \fBq\fRuit
commands).
.RE

.sp
.ne 2
.mk
.na
\fBse\fRt\fR
.ad
.br
.na
\fBse\fRt \fIvariable\fR
.ad
.br
.na
\fBse\fRt \fIvariable\fB=\fIstring\fR
.ad
.br
.na
\fBse\fRt \fIvariable\fB=\fInumber\fR
.ad
.sp .6
.RS 4n
Define a
.IR variable .
To assign a
.I value
to
.IR variable ,
separate the variable name from the value by an `\fB=\fR' (there must be no
space before or after the `\fB=\fR'). A variable may be given a null,
string, or numeric
.IR value .
To embed SPACE characters within a
.IR value ,
enclose it in quotes.
.sp
With no arguments, \fBse\fRt displays all defined variables and any values
they might have. See
.B "Internal Variables"
for a description of all
predefined
.B mail
variables.
.RE

.sp
.ne 2
.mk
.na
\fBsh\fRell\fR
.ad
.sp .6
.RS 4n
Invoke an interactive shell. See also
.B SHELL
in ENVIRONMENT VARIABLES.

.RE

.sp
.ne 2
.mk
.na
\fBsi\fRze [\fImessage-list\fR]\fR
.ad
.sp .6
.RS 4n
Print the size in characters of the specified messages.
.RE

.sp
.ne 2
.mk
.na
\fBso\fRurce \fIfile\fR
.ad
.sp .6
.RS 4n
Read commands from the given file and return to command mode.
.RE

.sp
.ne 2
.mk
.na
\fBto\fRp [\fImessage-list\fR]\fR
.ad
.sp .6
.RS 4n
Print the top few lines of the specified messages. If the \fBtoplines\fR
variable is set, it is taken as the number of lines to print (see
.BR "Internal Variables" ).
The default is 5.
.RE

.sp
.ne 2
.mk
.na
\fBtou\fRch [\fImessage-list\fR]\fR
.ad
.sp .6
.RS 4n
Touch the specified messages. If any message in
.I message-list
is not
specifically saved in a file, it is placed in the
.BR mbox ,
or the file
specified in the
.B MBOX
environment variable, upon normal termination.
See \fBex\fRit and \fBq\fRuit.
.RE

.sp
.ne 2
.mk
.na
\fBT\fRype [\fImessage-list\fR]\fR
.ad
.br
.na
\fBP\fRrint [\fImessage-list\fR]\fR
.ad
.sp .6
.RS 4n
Print the specified messages on the screen, including all header fields.
Overrides suppression of fields by the
.BR ig "nore command."
.RE

.sp
.ne 2
.mk
.na
\fBt\fRype [\fImessage-list\fR]\fR
.ad
.br
.na
\fBp\fRrint [\fImessage-list\fR]\fR
.ad
.sp .6
.RS 4n
Print the specified messages. If
.B crt
is set, the messages longer than
the number of lines specified by the
.B crt
variable are paged through
the command specified by the
.B PAGER
variable. The default command is
.BR pg (1).
See ENVIRONMENT VARIABLES.
.RE

.sp
.ne 2
.mk
.na
\fBuna\fRlias [\fBalias\fR] .\|.\|.\fR
.ad
.br
.na
\fBung\fRroup [\fBalias\fR] .\|.\|.\fR
.ad
.sp .6
.RS 4n
Remove the definitions of the specified aliases.
.RE

.sp
.ne 2
.mk
.na
\fBu\fRndelete [\fImessage-list\fR]\fR
.ad
.sp .6
.RS 4n
Restore the specified deleted messages. Will only restore messages deleted
in the current mail session. If
.B autoprint
is set, the last message of
those restored is printed  (see
.BR "Internal Variables" ).
.RE

.sp
.ne 2
.mk
.na
\fBundi\fRscard [\fIheader-field\fR\|.\|.\|.]\fR
.ad
.br
.na
\fBunig\fRnore [\fIheader-field\fR\|.\|.\|.]\fR
.ad
.sp .6
.RS 4n
Remove the specified header fields from the list being ignored. If no
header fields are specified, all header fields are removed from the list
being ignored.
.RE

.sp
.ne 2
.mk
.na
\fBunret\fRain [\fIheader-field\fR\|.\|.\|.]\fR
.ad
.sp .6
.RS 4n
Remove the specified header fields from the list being retained. If no
header fields are specified, all header fields are removed from the list
being retained.
.RE

.sp
.ne 2
.mk
.na
\fBunr\fRead [\fImessage-list\fR]\fR
.ad
.br
.na
\fBU\fRnread [\fImessage-list\fR] Same as the \fBne\fRw command.\fR
.ad
.sp .6
.RS 4n

.RE

.sp
.ne 2
.mk
.na
\fBuns\fRet \fIvariable\fR\|.\|.\|.\fR
.ad
.sp .6
.RS 4n
Erase the specified variables. If the variable was imported from the
environment (that is, an environment variable or exported shell variable),
it cannot be unset from within
.BR mailx .
.RE

.sp
.ne 2
.mk
.na
\fBve\fRrsion\fR
.ad
.sp .6
.RS 4n
Print the current version and release date of the
.B mailx
utility.
.RE

.sp
.ne 2
.mk
.na
\fBv\fRisual [\fImessage-list\fR]\fR
.ad
.sp .6
.RS 4n
Edit the given messages with a screen editor. Each messages is placed in a
temporary file and the program named by the
.B VISUAL
variable is invoked
to edit it (see ENVIRONMENT VARIABLES). Notice that the default visual
editor is
.BR vi .
.RE

.sp
.ne 2
.mk
.na
\fBw\fRrite [\fImessage-list\fR] \fBfile\fR
.ad
.sp .6
.RS 4n
Write the given messages on the specified file, minus the header and
trailing blank line. Otherwise equivalent to the \fBs\fRave command.
.RE

.sp
.ne 2
.mk
.na
\fBx\fRit\fR
.ad
.br
.na
\fBex\fRit\fR
.ad
.sp .6
.RS 4n
Exit from
.BR mailx ,
without changing the
.BR mailbox .
No messages are
saved in the
.B mbox
(see also \fBq\fRuit).
.RE

.sp
.ne 2
.mk
.na
\fBz\fR[\fB+\fR\||\|\fB\(mi\fR]\fR
.ad
.sp .6
.RS 4n
Scroll the header display forward or backward one screen\(mifull. The
number of headers displayed is set by the
.B screen
variable (see
.BR "Internal Variables" ).
.RE

.SS "Tilde Escapes"
.sp
.LP
The following tilde escape commands can be used when composing mail to
send. These may be entered only from
.IR "input mode" ,
by beginning a line
with the tilde escape character (~). See
.B escape
in \fBInternal
Variables\fR for changing this special character. The escape character can
be entered as text by typing it twice.
.sp
.ne 2
.mk
.na
\fB~\|!\fIshell-command\fR
.ad
.RS 23n
.rt
Escape to the shell. If present, run
.IR shell-command .
.RE

.sp
.ne 2
.mk
.na
.B ~.
.ad
.RS 23n
.rt
Simulate end of file (terminate message input).
.RE

.sp
.ne 2
.mk
.na
\fB~\|:\fImail-command\fR
.ad
.br
.na
\fB~_\|\fImail-command\fR
.ad
.RS 23n
.rt
Perform the command-level request. Valid only when sending a message while
reading mail.
.RE

.sp
.ne 2
.mk
.na
.B ~?
.ad
.RS 23n
.rt
Print a summary of tilde escapes.
.RE

.sp
.ne 2
.mk
.na
.B ~A
.ad
.RS 23n
.rt
Insert the autograph string
.B Sign
into the message (see \fBInternal
Variables\fR).
.RE

.sp
.ne 2
.mk
.na
.B ~a
.ad
.RS 23n
.rt
Insert the autograph string
.B sign
into the message (see \fBInternal
Variables\fR).
.RE

.sp
.ne 2
.mk
.na
\fB~b\fI name \|.\|.\|.\fR
.ad
.RS 23n
.rt
Add the \fIname\fRs to the blind carbon copy (\fBBcc\fR) list. This is like
the carbon copy (\fBCc\fR) list, except that the names in the
.B Bcc
list
are not shown in the header of the mail message.
.RE

.sp
.ne 2
.mk
.na
\fB~c\fI name \|.\|.\|.\fR
.ad
.RS 23n
.rt
Add the \fIname\fRs to the carbon copy (\fBCc\fR) list.
.RE

.sp
.ne 2
.mk
.na
.B ~d
.ad
.RS 23n
.rt
Read in the
.B dead-letter
file. See
.B DEAD
in ENVIRONMENT VARIABLES
for a description of this file.
.RE

.sp
.ne 2
.mk
.na
.B ~e
.ad
.RS 23n
.rt
Invoke the editor on the partial message. See also
.B EDITOR
in
ENVIRONMENT VARIABLES.
.RE

.sp
.ne 2
.mk
.na
\fB~f\fR [\fImessage-list\fR]\fR
.ad
.RS 23n
.rt
Forward the specified message, or the current message being read. Valid
only when sending a message while reading mail. The messages are inserted
into the message without alteration (as opposed to the
.B ~m
escape).
.RE

.sp
.ne 2
.mk
.na
\fB~F\fR [\fImessage-list\fR]\fR
.ad
.RS 23n
.rt
Forward the specified message, or the current message being read, including
all header fields. Overrides the suppression of fields by the \fBig\fRnore
command.
.RE

.sp
.ne 2
.mk
.na
.B ~h
.ad
.RS 23n
.rt
Prompt for
.B Subject
line and
.BR To ,
.BR Cc ,
and
.B Bcc
lists.
If the field is displayed with an initial value, it may be edited as if you
had just typed it.
.RE

.sp
.ne 2
.mk
.na
.B ~i
.I variable
.ad
.RS 23n
.rt
Insert the value of the named variable into the text of the message. For
example,
.B ~A
is equivalent to `\fB~i Sign\fR.' Environment variables
set and exported in the shell are also accessible by
.BR ~i .
.RE

.sp
.ne 2
.mk
.na
\fB~m\fR [\fImessage-list\fR]\fR
.ad
.RS 23n
.rt
Insert the listed messages, or the current message being read into the
letter. Valid only when sending a message while reading mail. The text of
the message is shifted to the right, and the string contained in the
.B indentprefix
variable is inserted as the leftmost characters of each
line. If
.B indentprefix
is not set, a TAB character is inserted into
each line.
.RE

.sp
.ne 2
.mk
.na
\fB~M\fR [\fImessage-list\fR]\fR
.ad
.RS 23n
.rt
Insert the listed messages, or the current message being read, including
the header fields, into the letter. Valid only when sending a message while
reading mail. The text of the message is shifted to the right, and the
string contained in the
.B indentprefix
variable is inserted as the
leftmost characters of each line. If
.B indentprefix
is not set, a TAB
character is inserted into each line. Overrides the suppression of fields by
the
.BR ig "nore command."
.RE

.sp
.ne 2
.mk
.na
.B ~p
.ad
.RS 23n
.rt
Print the message being entered.
.RE

.sp
.ne 2
.mk
.na
.B ~q
.ad
.RS 23n
.rt
Quit from input mode by simulating an interrupt. If the body of the message
is not null, the partial message is saved in
.BR dead-letter .
See
.B DEAD
in ENVIRONMENT VARIABLES for a description of this file.
.RE

.sp
.ne 2
.mk
.na
.B ~R
.ad
.RS 23n
.rt
Mark message for return receipt.
.RE

.sp
.ne 2
.mk
.na
.B ~r
.I file
.ad
.br
.na
.B ~<
.I file
.ad
.br
.na
.BI "~< ! " shell-command
.ad
.RS 23n
.rt
Read in the specified file. If the argument begins with an exclamation
point (!), the rest of the string is taken as an arbitrary shell command and
is executed, with the standard output inserted into the message.
.RE

.sp
.ne 2
.mk
.na
.B ~s
\fIstring \|.\|.\|.\fR
.ad
.RS 23n
.rt
Set the subject line to
.IR string .
.RE

.sp
.ne 2
.mk
.na
.B ~t
\fIname \|.\|.\|.\fR
.ad
.RS 23n
.rt
Add the given
.IR name "s to the To list."
.RE

.sp
.ne 2
.mk
.na
.B ~v
.ad
.RS 23n
.rt
Invoke a preferred screen editor on the partial message. The default visual
editor is
.BR vi (1).
See also
.B VISUAL
in ENVIRONMENT VARIABLES.
.RE

.sp
.ne 2
.mk
.na
.B ~w
.I file
.ad
.RS 23n
.rt
Write the message into the given file, without the header.
.RE

.sp
.ne 2
.mk
.na
.B ~x
.ad
.RS 23n
.rt
Exit as with
.B ~q
except the message is not saved in
.BR dead-letter .
.RE

.sp
.ne 2
.mk
.na
.B ~|
.I shell-command
.ad
.RS 23n
.rt
Pipe the body of the message through the given
.IR shell-command .
If the
.I shell-command
returns a successful exit status, the output of the
command replaces the message.
.RE

.SS "Internal Variables"
.sp
.LP
The following variables are internal variables. They may be imported from
the execution environment or set using the
.BR se "t command at any time."
The
.BR uns "et command may be used to erase variables."
.sp
.ne 2
.mk
.na
.B allnet
.ad
.RS 26n
.rt
All network names whose last component (login name) match are treated as
identical. This causes the
.I message-list
message specifications to
behave similarly. Disabled by default. See also the \fBalt\fRernates command
and the
.B metoo
and
.B fuzzymatch
variables.
.RE

.sp
.ne 2
.mk
.na
.B alwaysignore
.ad
.RS 26n
.rt
Ignore header fields with
.BR ig "nore everywhere, not just during"
\fBp\fRrint or \fBt\fRype. Affects the \fBs\fRave, \fBS\fRave, \fBc\fRopy,
\fBC\fRopy, \fBto\fRp, \fBpi\fRpe, and \fBw\fRrite commands, and the
.B ~m
and
.B ~f
tilde escapes. Enabled by default.
.RE

.sp
.ne 2
.mk
.na
.B append
.ad
.RS 26n
.rt
Upon termination, append messages to the end of the
.B mbox
file instead
of prepending them. Although disabled by default,
.B append
is set in the
system startup file (which can be suppressed with the
.B -n
command line
option).
.RE

.sp
.ne 2
.mk
.na
.B appenddeadletter
.ad
.RS 26n
.rt
Append to the deadletter file rather than overwrite it. Although disabled
by default,
.B appenddeadletter
is frequently set in the system startup
file. See
.B "Starting Mail"
in USAGE above.
.RE

.sp
.ne 2
.mk
.na
.B askbcc
.ad
.RS 26n
.rt
Prompt for the
.B Bcc
list after the
.B Subject
is entered if it is
not specified on the command line with the
.B -b
option. Disabled by
default.
.RE

.sp
.ne 2
.mk
.na
.B askcc
.ad
.RS 26n
.rt
Prompt for the
.B Cc
list after the
.B Subject
is entered if it is
not specified on the command line with the
.B -c
option. Disabled by
default.
.RE

.sp
.ne 2
.mk
.na
.B asksub
.ad
.RS 26n
.rt
Prompt for subject if it is not specified on the command line with the
.B -s
option. Enabled by default.
.RE

.sp
.ne 2
.mk
.na
.B autoinc
.ad
.RS 26n
.rt
Automatically incorporate new messages into the current session as they
arrive. This has an affect similar to issuing the
.B inc
command every
time the command prompt is displayed. Disabled by default, but \fBautoinc\fR
is set in the default system startup file for
.BR mailx ;
it is not set for
.B /usr/ucb/mail
or
.BR /usr/ucb/Mail .
.RE

.sp
.ne 2
.mk
.na
.B autoprint
.ad
.RS 26n
.rt
Enable automatic printing of messages after \fBd\fRelete and \fBu\fRndelete
commands. Disabled by default.
.RE

.sp
.ne 2
.mk
.na
.B bang
.ad
.RS 26n
.rt
Enable the special-casing of exclamation points (!) in shell escape command
lines as in
.BR vi (1).
Disabled by default.
.RE

.sp
.ne 2
.mk
.na
.B bsdcompat
.ad
.RS 26n
.rt
Set automatically if
.B mailx
is invoked as
.B mail
or
.BR Mail .
Causes
.B mailx
to use
.B /etc/mail/Mail.rc
as the system startup
file. Changes the default pager to
.BR more (1).
.RE

.sp
.ne 2
.mk
.na
\fBcmd=\fIshell-command\fR
.ad
.RS 26n
.rt
Set the default command for the \fBpi\fRpe command.  No default value.
.RE

.sp
.ne 2
.mk
.na
\fBconv=\fIconversion\fR
.ad
.RS 26n
.rt
Convert
.B uucp
addresses to the specified address style, which can be
either:
.sp
.ne 2
.mk
.na
.B internet
.ad
.RS 12n
.rt
This requires a mail delivery program conforming to the
.BR RFC822
standard for electronic mail addressing.
.RE

.sp
.ne 2
.mk
.na
.B optimize
.ad
.RS 12n
.rt
Remove loops in
.BR uucp "(1C) address paths (typically generated by the"
\fBr\fReply command).  No rerouting is performed; \fBmail\fR has no
knowledge of
.B UUCP
routes or connections.
.RE

Conversion is disabled by default. See also
.BR sendmail (1M)
and the
.B -U
command-line option.
.RE

.sp
.ne 2
.mk
.na
\fBcrt\fR[\fB=\fInumber\fR]\fR
.ad
.RS 26n
.rt
Pipe messages having more than
.I number
lines through the command
specified by the value of the
.B PAGER
variable (
.BR pg (1)
or
.BR more (1)
by default). If
.I number
is not specified, the current
window size is used. Disabled by default.
.RE

.sp
.ne 2
.mk
.na
.B debug
.ad
.RS 26n
.rt
Enable verbose diagnostics for debugging. Messages are not delivered.
Disabled by default.
.RE

.sp
.ne 2
.mk
.na
.B dot
.ad
.RS 26n
.rt
Take a period on a line by itself, or
.B EOF
during input from a
terminal as end-of-file. Disabled by default, but
.B dot
is set in the
system startup file (which can be suppressed with the
.B -n
command line
option).
.RE

.sp
.ne 2
.mk
.na
.B fcc
.ad
.RS 26n
.rt
By default, \fBmailx\fR will treat any address containing a slash ("/")
character as a local "send to file" address. By unsetting this option, this
behavior is disabled. Enabled by default.
.RE

.sp
.ne 2
.mk
.na
.B flipr
.ad
.RS 26n
.rt
Reverse the effect of the \fBfo\fRllowup/\fBFo\fRllowup and
\fBr\fReply/\fBR\fReply command pairs.  If both \fBflipr\fR and
.B replyall
are set, the effect is as if neither was set.
.RE

.sp
.ne 2
.mk
.na
.B from
.ad
.RS 26n
.rt
Extract the author listed in the header summary from the
.B From:
header
instead of the UNIX
.B From
line. Enabled by default.
.RE

.sp
.ne 2
.mk
.na
.B fuzzymatch
.ad
.RS 26n
.rt
The
.B from
command searches for messages from the indicated sender. By
default, the full sender address must be specified. By setting this option,
only a sub-string of the sender address need be specified. Disabled by
default.
.RE

.sp
.ne 2
.mk
.na
\fBescape=\fIc\fR
.ad
.RS 26n
.rt
Substitute
.I c
for the ~ escape character. Takes effect with next
message sent.
.RE

.sp
.ne 2
.mk
.na
\fBfolder=\fIdirectory\fR
.ad
.RS 26n
.rt
The directory for saving standard mail files. User-specified file names
beginning with a plus (+) are expanded by preceding the file name with this
directory name to obtain the real file name. If
.I directory
does not
start with a slash (/),
.B $HOME
is prepended to it.  There is no default
for the \fBfolder\fR variable. See also \fBoutfolder\fR below.
.RE

.sp
.ne 2
.mk
.na
.B header
.ad
.RS 26n
.rt
Enable printing of the header summary when entering
.BR mailx .
Enabled by
default.
.RE

.sp
.ne 2
.mk
.na
.B hold
.ad
.RS 26n
.rt
Preserve all messages that are read in the
.B mailbox
instead of putting
them in the standard
.B mbox
save file. Disabled by default.
.RE

.sp
.ne 2
.mk
.na
.B ignore
.ad
.RS 26n
.rt
Ignore interrupts while entering messages. Handy for noisy dial-up lines.
Disabled by default.
.RE

.sp
.ne 2
.mk
.na
.B ignoreeof
.ad
.RS 26n
.rt
Ignore end-of-file during message input. Input must be terminated by a
period (.) on a line by itself or by the
.B ~.
command. See also
.B dot
above. Disabled by default.
.RE

.sp
.ne 2
.mk
.na
\fBindentprefix=\fIstring\fR
.ad
.RS 26n
.rt
When
.B indentprefix
is set,
.I string
is used to mark indented lines
from messages included with
.BR ~m .
The default is a TAB character.
.RE

.sp
.ne 2
.mk
.na
.B keep
.ad
.RS 26n
.rt
When the
.B mailbox
is empty, truncate it to zero length instead of
removing it. Disabled by default.
.RE

.sp
.ne 2
.mk
.na
\fBiprompt=\fIstring\fR
.ad
.RS 26n
.rt
The specified prompt string is displayed before each line on input is
requested when sending a message.
.RE

.sp
.ne 2
.mk
.na
.B keepsave
.ad
.RS 26n
.rt
Keep messages that have been saved in other files in the
.BR mailbox
instead of deleting them. Disabled by default.
.RE

.sp
.ne 2
.mk
.na
.B makeremote
.ad
.RS 26n
.rt
When replying to all recipients of a message, if an address does not
include a machine name, it is assumed to be relative to the sender of the
message. Normally not needed when dealing with hosts that support RFC822.
.RE

.sp
.ne 2
.mk
.na
.B metoo
.ad
.RS 26n
.rt
If your login appears as a recipient, do not delete it from the list.
Disabled by default.
.RE

.sp
.ne 2
.mk
.na
.B mustbang
.ad
.RS 26n
.rt
Force all mail addresses to be in bang format.
.RE

.sp
.ne 2
.mk
.na
.B onehop
.ad
.RS 26n
.rt
When responding to a message that was originally sent to several
recipients, the other recipient addresses are normally forced to be relative
to the originating author's machine for the response. This flag disables
alteration of the recipients' addresses, improving efficiency in a network
where all machines can send directly to all other machines (that is, one hop
away). Disabled by default.
.RE

.sp
.ne 2
.mk
.na
.B outfolder
.ad
.RS 26n
.rt
Locate the files used to record outgoing messages in the directory
specified by the
.B folder
variable unless the path name is absolute.
Disabled by default. See \fBfolder\fR above and the \fBS\fRave, \fBC\fRopy,
\fBfo\fRllowup, and \fBF\fRollowup commands.
.RE

.sp
.ne 2
.mk
.na
.B page
.ad
.RS 26n
.rt
Used with the \fBpi\fRpe command to insert a form feed after each message
sent through the pipe. Disabled by default.
.RE

.sp
.ne 2
.mk
.na
.B pipeignore
.ad
.RS 26n
.rt
Omit ignored header when outputting to the
.B pipe
command. Although
disabled by default,
.B pipeignore
is frequently set in the system
startup file. See
.B "Starting Mail"
in USAGE above.
.RE

.sp
.ne 2
.mk
.na
.B postmark
.ad
.RS 26n
.rt
Your "real name" to be included in the From line of messages you send.  By
default this is derived from the comment field in your
.BR passwd (4)
file
entry.
.RE

.sp
.ne 2
.mk
.na
\fBprompt=\fIstring\fR
.ad
.RS 26n
.rt
Set the \fIcommand mode\fR prompt to \fIstring\fR. Default is "\fB?\fR ",
unless the \fBbsdcompat\fR variable is set, then the default is "\fB&\fR".
.RE

.sp
.ne 2
.mk
.na
.B quiet
.ad
.RS 26n
.rt
Refrain from printing the opening message and version when entering
.BR mailx .
Disabled by default.
.RE

.sp
.ne 2
.mk
.na
\fBrecord=\fIfile\fR
.ad
.RS 26n
.rt
Record all outgoing mail in
.IR file .
Disabled by default. See also
.B outfolder
above.
.RE

.sp
.ne 2
.mk
.na
.B replyall
.ad
.RS 26n
.rt
Reverse the effect of the \fBr\fReply and \fBR\fReply and \fBfo\fRllowup
and \fBFo\fRllowup commands. Although set by default,
.B replayall
is
frequently unset in the system startup file. See \fBflipr\fR and \fBStarting
Mail\fR in USAGE above.
.RE

.sp
.ne 2
.mk
.na
\fBreturnaddr=\fIstring\fR
.ad
.RS 26n
.rt
The default sender address is that of the current user. This variable can
be used to set the sender address to any arbitrary value. Set with
caution.
.RE

.sp
.ne 2
.mk
.na
.B save
.ad
.RS 26n
.rt
Enable saving of messages in
.B dead-letter
on interrupt or delivery
error. See
.B DEAD
for a description of this file. Enabled by default.
.RE

.sp
.ne 2
.mk
.na
\fBscreen=\fInumber\fR
.ad
.RS 26n
.rt
Sets the number of lines in a screen-full of headers for the \fBh\fReaders
command.
.I number
must be a positive number.
.sp
The default is set according to baud rate or window size. With a baud rate
less than
.BR 1200 ,
.I number
defaults to
.BR 5 ,
if baud rate is
exactly
.BR 1200 ,
it defaults to
.BR 10 .
If you are in a window,
.I number
defaults to the default window size minus 4. Otherwise, the
default is
.BR 20 .
.RE

.sp
.ne 2
.mk
.na
\fBsendmail=\fIshell-command\fR
.ad
.RS 26n
.rt
Alternate command for delivering messages.
.B Note:
In addition to the
expected list of recipients,
.B mail
also passes the
.B -i
and
.BR -m ,
flags to the command. Since these flags are not appropriate to
other commands, you may have to use a shell script that strips them from the
arguments list before invoking the desired command. Default is
.BR /usr/bin/rmail .
.RE

.sp
.ne 2
.mk
.na
.B sendwait
.ad
.RS 26n
.rt
Wait for background mailer to finish before returning. Disabled by
default.
.RE

.sp
.ne 2
.mk
.na
.B showname
.ad
.RS 26n
.rt
Causes the message header display to show the sender's real name (if known)
rather than their mail address. Disabled by default, but
.B showname
is
set in the
.B /etc/mail/mailx.rc
system startup file for
.BR mailx .
.RE

.sp
.ne 2
.mk
.na
.B showto
.ad
.RS 26n
.rt
When displaying the header summary and the message is from you, print the
recipient's name instead of the author's name.
.RE

.sp
.ne 2
.mk
.na
\fBsign=\fIstring\fR
.ad
.RS 26n
.rt
The variable inserted into the text of a message when the
.BR ~a
(autograph) command is given. No default (see also
.B ~i
in \fBTilde
Escapes\fR).
.sp
`
.RE

.sp
.ne 2
.mk
.na
\fBSign=\fIstring\fR
.ad
.RS 26n
.rt
The variable inserted into the text of a message when the
.B ~A
command
is given.  No default (see also
.B ~i
in
.BR "Tilde Escapes" ).
.RE

.sp
.ne 2
.mk
.na
\fBtoplines=\fInumber\fR
.ad
.RS 26n
.rt
The number of lines of header to print with the \fBto\fRp command. Default
is
.BR 5 .
.RE

.sp
.ne 2
.mk
.na
.B verbose
.ad
.RS 26n
.rt
Invoke \fBsendmail\fR(1M) with the \fB-v\fR flag.
.RE

.sp
.ne 2
.mk
.na
.B translate
.ad
.RS 26n
.rt
The name of a program to translate mail addresses. The program receives
mail addresses as arguments. The program produces, on the standard output,
lines containing the following data, in this order:
.RS +4
.TP
.ie t \(bu
.el o
the postmark for the sender (see the postmark variable)
.RE
.RS +4
.TP
.ie t \(bu
.el o
translated mail addresses, one per line, corresponding to the program's
arguments. Each translated address will replace the corresponding address in
the mail message being sent.
.RE
.RS +4
.TP
.ie t \(bu
.el o
a line containing only "y" or "n".  if the line contains "y" the user will
be asked to confirm that the message should be sent.
.RE
The translate program will be invoked for each mail message to be sent. If
the program exits with a non-zero exit status, or fails to produce enough
output, the message is not sent.
.RE

.SS "Large File Behavior"
.sp
.LP
See
.BR largefile (5)
for the description of the behavior of
.BR mailx
when encountering files greater than or equal to 2 Gbyte ( 2^31 bytes).
.SH ENVIRONMENT VARIABLES
.sp
.LP
See
.BR environ (5)
for descriptions of the following environment
variables that affect the execution of
.BR mailx :
.BR HOME ,
.BR LANG ,
.BR LC_CTYPE ,
.BR LC_TIME ,
.BR LC_MESSAGES ,
.BR NLSPATH ,
and
.BR TERM .
.sp
.ne 2
.mk
.na
.B DEAD
.ad
.RS 14n
.rt
The name of the file in which to save partial letters in case of untimely
interrupt. Default is
.BR $HOME/dead.letter .
.RE

.sp
.ne 2
.mk
.na
.B EDITOR
.ad
.RS 14n
.rt
The command to run when the \fBe\fRdit or \fB~e\fR command is used. Default
is
.BR ed (1).
.RE

.sp
.ne 2
.mk
.na
.B LISTER
.ad
.RS 14n
.rt
The command (and options) to use when listing the contents of the
.B folder
directory. The default is
.BR ls (1).
.RE

.sp
.ne 2
.mk
.na
.B MAIL
.ad
.RS 14n
.rt
The name of the initial mailbox file to read (in lieu of the standard
system mailbox). The default is \fB/var/mail/\fIusername\fR .\fR
.RE

.sp
.ne 2
.mk
.na
.B MAILRC
.ad
.RS 14n
.rt
The name of the startup file.  Default is
.BR $HOME/.mailrc .
.RE

.sp
.ne 2
.mk
.na
.B MAILX_HEAD
.ad
.RS 14n
.rt
The specified string is included at the beginning of the body of each
message that is sent.
.RE

.sp
.ne 2
.mk
.na
.B MAILX_TAIL
.ad
.RS 14n
.rt
The specified string is included at the end of the body of each message
that is sent.
.RE

.sp
.ne 2
.mk
.na
.B MBOX
.ad
.RS 14n
.rt
The name of the file to save messages which have been read. The \fBex\fRit
command overrides this function, as does saving the message explicitly in
another file.  Default is
.BR $HOME/mbox .
.RE

.sp
.ne 2
.mk
.na
.B PAGER
.ad
.RS 14n
.rt
The command to use as a filter for paginating output. This can also be used
to specify the options to be used.  Default is
.BR pg (1),
or if the
.B bsdcompat
variable is set, the default is
.BR more (1).
See
.BR "Internal Variables" .
.RE

.sp
.ne 2
.mk
.na
.B SHELL
.ad
.RS 14n
.rt
The name of a preferred command interpreter. Default is
.BR sh (1).
.RE

.sp
.ne 2
.mk
.na
.B VISUAL
.ad
.RS 14n
.rt
The name of a preferred screen editor.  Default is
.BR vi (1).
.RE

.SH EXIT STATUS
.sp
.LP
When the
.B -e
option is specified, the following exit values are
returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 6n
.rt
Mail was found.
.RE

.sp
.ne 2
.mk
.na
.B >0
.ad
.RS 6n
.rt
Mail was not found or an error occurred.
.RE

.sp
.LP
Otherwise, the following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 6n
.rt
Successful completion. Notice that this status implies that all messages
were
.BR sent ,
but it gives no assurances that any of them were actually
.BR delivered .
.RE

.sp
.ne 2
.mk
.na
.B >0
.ad
.RS 6n
.rt
An error occurred
.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B $HOME/.mailrc
.ad
.sp .6
.RS 4n
 personal startup file
.RE

.sp
.ne 2
.mk
.na
.B $HOME/mbox
.ad
.sp .6
.RS 4n
secondary storage file
.RE

.sp
.ne 2
.mk
.na
.B $HOME/.Maillock
.ad
.sp .6
.RS 4n
lock file to prevent multiple writers of system mailbox
.RE

.sp
.ne 2
.mk
.na
.B /etc/mail/mailx.rc
.ad
.sp .6
.RS 4n
optional system startup file for
.B mailx
only
.RE

.sp
.ne 2
.mk
.na
.B /etc/mail/Mail.rc
.ad
.sp .6
.RS 4n
BSD compatibility system-wide startup file for
.B /usr/ucb/mail
and
.B /usr/ucb/Mail
.RE

.sp
.ne 2
.mk
.na
.B /tmp/R[emqsx]*
.ad
.sp .6
.RS 4n
temporary files
.RE

.sp
.ne 2
.mk
.na
.B /usr/share/lib/mailx/mailx.help*
.ad
.sp .6
.RS 4n
help message files
.RE

.sp
.ne 2
.mk
.na
.B /var/mail/*
.ad
.sp .6
.RS 4n
post office directory
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
_
Interface StabilityStandard
.TE

.SH SEE ALSO
.sp
.LP
.BR biff (1B),
.BR echo (1),
.BR ed (1),
.BR ex (1),
.BR fmt (1),
.BR lp (1),
.BR ls (1),
.BR mail (1),
.BR mail (1B),
.BR mailcompat (1),
.BR more (1),
.BR pg (1),
.BR sh (1),
.BR uucp (1C),
.BR vacation (1),
.BR vi (1),
.BR newaliases (1M),
.BR sendmail (1M),
.BR aliases (4),
.BR passwd (4),
.BR attributes (5),
.BR environ (5),
.BR largefile (5),
.BR standards (5)
.SH NOTES
.sp
.LP
Where
.I shell-command
is shown as valid, arguments are not always
allowed. Experimentation is recommended.
.sp
.LP
Internal variables imported from the execution environment cannot be
.BR uns et.
.sp
.LP
The full internet addressing is not fully supported by
.BR mailx .
The new
standards need some time to settle down.
.sp
.LP
Replies do not always generate correct return addresses.  Try resending the
errant reply with
.B onehop
set.
.sp
.LP
.B mailx
does not lock your record file. So, if you use a record file
and send two or more messages simultaneously, lines from the messages may be
interleaved in the record file.
.sp
.LP
The format for the
.B alias
command is a space-separated list of
recipients, while the format for an alias in either the \fB\&.forward\fR or
.B /etc/aliases
is a comma-separated list.
.sp
.LP
To read mail on a workstation running Solaris 1.\fIx\fR when your mail
server is running Solaris 2.\fIx\fR, first execute the
.BR mailcompat (1)
program.
