usr/src/man/man1/man.1
'\" te
.\" Copyright (c) 2008, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 1980 Regents of the University of California.
.\" All rights reserved. The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.TH man 1 "8 May 2008" "SunOS 5.11" "User Commands"
.SH NAME
man \- find and display reference manual pages
.SH SYNOPSIS
.LP
.nf
\fBman\fR [\fB-\fR] [\fB-adFlrt\fR] [\fB-M\fR \fIpath\fR] [\fB-T\fR \fImacro-package\fR] [\fB-s\fR \fIsection\fR] \fIname\fR.\|.\|.
.fi

.LP
.nf
\fBman\fR [\fB-M\fR \fIpath\fR] \fB-k\fR \fIkeyword\fR.\|.\|.
.fi

.LP
.nf
\fBman\fR [\fB-M\fR \fIpath\fR] \fB-f\fR \fIfile\fR.\|.\|.
.fi

.SH DESCRIPTION
.sp
.LP
The
.B man
command displays information from the reference manuals. It
displays complete manual pages that you select by
.IR name ,
or one-line
summaries selected either by
.IR keyword
.RB ( -k ),
or by the name of an
associated file (\fB-f\fR). If no manual page is located,
.B man
prints
an error message.
.SS "Source Format"
.sp
.LP
Reference Manual pages are marked up with either \fBnroff\fR (see
\fBnroff\fR(1)) or \fBSGML\fR (Standard Generalized Markup Language) tags
(see
.BR sgml (5)).
The
.B man
command recognizes the type of markup and
processes the file accordingly. The various source files are kept in
separate directories depending on the type of markup.
.SS "Location of Manual Pages"
.sp
.LP
The online Reference Manual page directories are conventionally located in
.BR /usr/share/man .
The nroff sources are located in the
\fB/usr/share/man/man\fR* directories. The \fBSGML\fR sources are located in
the
.BR /usr/share/man/sman *
directories. Each directory corresponds to a
section of the manual. Since these directories are optionally installed,
they might not reside on your host. You might have to mount
\fB/usr/share/man\fR from a host on which they do reside.
.sp
.LP
If there are preformatted, up-to-date versions in the corresponding
\fBcat\fR* or \fBfmt\fR* directories, \fBman\fR simply displays or prints
those versions. If the preformatted version of interest is out of date or
missing,
.B man
reformats it prior to display and stores the preformatted
version if
.BR cat *
or \fBfmt\fR* is writable. The
.B windex
database
is not updated. See \fBcatman\fR(1M). If directories for the preformatted
versions are not provided,
.B man
reformats a page whenever it is
requested.
.B man
uses a temporary file to store the formatted text
during display.
.sp
.LP
If the standard output is not a terminal, or if the `\fB-\fR' flag is
given,
.B man
pipes its output through
.BR cat (1).
.RB Otherwise, " man"
pipes its output through
.BR more (1)
to handle paging and underlining on
the screen.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -a
.ad
.RS 20n
.rt
Shows all manual pages matching
.I name
within the
.B MANPATH
search
path. Manual pages are displayed in the order found.
.RE

.sp
.ne 2
.mk
.na
.B -d
.ad
.RS 20n
.rt
Debugs. Displays what a section-specifier evaluates to, method used for
searching, and paths searched by
.BR man .
.RE

.sp
.ne 2
.mk
.na
\fB-f\fR \fIfile .\|.\|.\fR
.ad
.RS 20n
.rt
\fBman\fR attempts to locate manual pages related to any of the given
\fIfile\fRs. It strips the leading path name components from each
\fIfile\fR, and then prints one-line summaries containing the resulting
basename or names. This option also uses the
.B windex
database.
.RE

.sp
.ne 2
.mk
.na
.B -F
.ad
.RS 20n
.rt
Forces
.B man
to search all directories specified by
.B MANPATH
or
the \fBman.cf\fR file, rather than using the
.B windex
lookup database.
This option is useful if the database is not up to date and it has been made
the default behavior of the
.B man
command. The option therefore does not
have to be invoked and is documented here for reference only.
.RE

.sp
.ne 2
.mk
.na
\fB-k\fR \fIkeyword .\|.\|.\fR
.ad
.RS 20n
.rt
Prints out one-line summaries from the
.B windex
database (table of
contents) that contain any of the given \fIkeyword\fRs. The \fBwindex\fR
database is created using
.BR catman (1M).
.RE

.sp
.ne 2
.mk
.na
.B -l
.ad
.RS 20n
.rt
Lists all manual pages found matching
.I name
within the search path.
.RE

.sp
.ne 2
.mk
.na
\fB-M\fR \fIpath\fR
.ad
.RS 20n
.rt
Specifies an alternate search path for manual pages.
.I path
is a
colon-separated list of directories that contain manual page directory
subtrees. For example, if
.I path
is
.BR /usr/share/man:/usr/local/man ,
\fBman\fR searches for \fIname\fR in the standard location, and then
.BR /usr/local/man .
When used with the
.B -k
or \fB-f\fR options, the
\fB-M\fR option must appear first. Each directory in the \fIpath\fR is
assumed to contain subdirectories of the form
.BR man *
or
.BR sman *
,
one for each section. This option overrides the
.B MANPATH
environment
variable.
.RE

.sp
.ne 2
.mk
.na
.B -r
.ad
.RS 20n
.rt
Reformats the manual page, but does not display it. This replaces the
.B "man -"
.B -t
\fIname\fR combination.
.RE

.sp
.ne 2
.mk
.na
\fB-s\fR \fIsection .\|.\|.\fR
.ad
.RS 20n
.rt
Specifies sections of the manual for
.B man
to search. The directories
searched for
.I name
are limited to those specified by
.IR section .
\fIsection\fR can be a numerical digit, perhaps followed by one or more
letters to match the desired section of the manual, for example,
"\fB3libucb\fR". Also, \fIsection\fR can be a word, for example,
.BR local ,
.BR new ,
.BR old ,
.BR public .
\fIsection\fR can also be a
letter. To specify multiple sections, separate each section with a comma.
This option overrides the
.B MANPATH
environment variable and the
\fBman.cf\fR file. See \fBSearch Path\fR below for an explanation of
how
.B man
conducts its search.
.RE

.sp
.ne 2
.mk
.na
.B -t
.ad
.RS 20n
.rt
\fBman\fR arranges for the specified manual pages to be \fBtroff\fRed to a
suitable raster output device (see
.BR troff (1)).
If both the
.B -
and
\fB-t\fR flags are given, \fBman\fR updates the \fBtroff\fRed versions of
each named
.I name
(if necessary), but does not display them.
.RE

.sp
.ne 2
.mk
.na
\fB-T\fR \fImacro-package\fR
.ad
.RS 20n
.rt
Formats manual pages using
.I macro-package
rather than the standard
\fB-man\fR macros defined in
.BR /usr/share/lib/tmac/an .
See \fBSearch
Path\fR under USAGE for a complete explanation of the default search path
order.
.RE

.SH OPERANDS
.sp
.LP
The following operand is supported:
.sp
.ne 2
.mk
.na
.I name
.ad
.RS 8n
.rt
The name of a standard utility or a keyword.
.RE

.SH USAGE
.sp
.LP
The usage of
.B man
is described below:
.SS "Manual Page Sections"
.sp
.LP
Entries in the reference manuals are organized into
.IR section "s. A"
section name consists of a major section name, typically a single digit,
optionally followed by a subsection name, typically one or more letters. An
unadorned major section name, for example, "\fB9\fR", does not act as an
abbreviation for the subsections of that name, such as "\fB9e\fR",
"\fB9f\fR", or "\fB9s\fR". That is, each subsection must be searched
separately by
.BR "man -s" .
Each section contains descriptions apropos
to a particular reference category, with subsections refining these
distinctions. See the
.B intro
manual pages for an explanation of the
classification used in this release.
.SS "Search Path"
.sp
.LP
Before searching for a given
.IR name ,
\fBman\fR constructs a list of
candidate directories and sections.
.B man
searches for
.I name
in the
directories specified by the
.B MANPATH
environment variable.
.sp
.LP
In the absence of
.BR MANPATH ,
\fBman\fR constructs its search path based
upon the
.B PATH
environment variable, primarily by substituting
\fBman\fR for the last component of the \fBPATH\fR element. Special
provisions are added to account for unique characteristics of directories
such as
.BR /sbin ,
.BR /usr/ucb ,
.BR /usr/xpg4/bin ,
and others. If the
file argument contains a
.B /
character, the
.I dirname
portion of the
argument is used in place of
.B PATH
elements to construct the search
path.
.sp
.LP
Within the manual page directories,
.B man
confines its search to the
sections specified in the following order:
.RS +4
.TP
.ie t \(bu
.el o
\fIsection\fRs specified on the command line with the \fB-s\fR option
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fIsection\fRs embedded in the \fBMANPATH\fR environment variable
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fIsection\fRs specified in the \fBman.cf\fR file for each directory
specified in the
.B MANPATH
environment variable
.RE
.sp
.LP
If none of the above exist,
.B man
searches each directory in the manual
page path, and displays the first matching manual page found.
.sp
.LP
The \fBman.cf\fR file has the following format:
.sp
.in +2
.nf
MANSECTS=\fIsection\fR[,\fIsection\fR].\|.\|.
.fi
.in -2
.sp

.sp
.LP
Lines beginning with `\fB#\fR' and blank lines are considered comments, and
are ignored. Each directory specified in
.B MANPATH
can contain a manual
page configuration file, specifying the default search order for that
directory.
.SH FORMATTING MANUAL PAGES
.sp
.LP
Manual pages are marked up in
.BR nroff (1)
or
.BR sgml (5).
Nroff manual
pages are processed by
.BR nroff (1)
or
.BR troff (1)
with the
.BR -man
macro package. Please refer to
.BR man (5)
for information on macro usage.
\fBSGML\fR\(emtagged manual pages are processed by an \fBSGML\fR parser and
passed to the formatter.
.SS "Preprocessing Nroff Manual Pages"
.sp
.LP
When formatting an nroff manual page,
.B man
examines the first line to
determine whether it requires special processing. If the first line is a
string of the form:
.sp
.in +2
.nf
\&'\e" \fIX\fR
.fi
.in -2
.sp

.sp
.LP
where \fIX\fR is separated from the `\fB"\fR' by a single SPACE and
consists of any combination of characters in the following list, \fBman\fR
pipes its input to
.BR troff (1)
or
.BR nroff (1)
through the
corresponding preprocessors.
.sp
.ne 2
.mk
.na
.B e
.ad
.RS 5n
.rt
.BR eqn (1),
or
.B neqn
for \fBnroff\fR
.RE

.sp
.ne 2
.mk
.na
.B r
.ad
.RS 5n
.rt
.BR refer (1)
.RE

.sp
.ne 2
.mk
.na
.B t
.ad
.RS 5n
.rt
.BR tbl (1)
.RE

.sp
.ne 2
.mk
.na
.B v
.ad
.RS 5n
.rt
.BR vgrind (1)
.RE

.sp
.LP
If
.B eqn
or
.B neqn
is invoked, it automatically reads the file
\fB/usr/pub/eqnchar\fR (see
.BR eqnchar (5)).
If
.BR nroff (1)
is invoked,
.BR col (1)
is automatically used.
.SS "Referring to Other nroff Manual Pages"
.sp
.LP
If the first line of the nroff manual page is a reference to another manual
page entry fitting the pattern:
.sp
.in +2
.nf
\&.so man*/\fIsourcefile\fR
.fi
.in -2
.sp

.sp
.LP
\fBman\fR processes the indicated file in place of the current one. The
reference must be expressed as a path name relative to the root of the
manual page directory subtree.
.sp
.LP
When the second or any subsequent line starts with \fB\&.so\fR, \fBman\fR
ignores it;
.BR troff (1)
or
.BR nroff (1)
processes the request in the
usual manner.
.SS "Processing SGML Manual Pages"
.sp
.LP
Manual pages are identified as being marked up in SGML by the presence of
the string
.BR <!DOCTYPE \&.
If the file also contains the string
.BR SHADOW_PAGE ,
the file refers to another manual page for the content.
The reference is made with a file entity reference to the manual page that
contains the text. This is similar to the \fB\&.so\fR mechanism used in the
nroff formatted man pages.
.SH ENVIRONMENT VARIABLES
.sp
.LP
See
.BR environ (5)
for descriptions of the following environment
variables that affect the execution of
.BR man :
.BR LANG ,
.BR LC_ALL ,
.BR LC_CTYPE ,
.BR LC_MESSAGES ,
and
.BR NLSPATH .
.sp
.ne 2
.mk
.na
.B MANPATH
.ad
.RS 11n
.rt
A colon-separated list of directories; each directory can be followed by a
comma-separated list of sections. If set, its value overrides
\fB/usr/share/man\fR as the default directory search path, and the
\fBman.cf\fR file as the default section search path. The \fB-M\fR and
\fB-s\fR flags, in turn, override these values.)
.RE

.sp
.ne 2
.mk
.na
.B PAGER
.ad
.RS 11n
.rt
A program to use for interactively delivering
.BR man "'s output to the"
screen. If not set, `\fBmore -s\fR' is used. See \fBmore\fR(1).
.RE

.sp
.ne 2
.mk
.na
.B TCAT
.ad
.RS 11n
.rt
The name of the program to use to display \fBtroff\fRed manual pages.
.RE

.sp
.ne 2
.mk
.na
.B TROFF
.ad
.RS 11n
.rt
The name of the formatter to use when the
.B -t
flag is given. If not
set,
.BR troff (1)
is used.
.RE

.SH EXAMPLES
.LP
\fBExample 1\fR Creating a PostScript Version of a man page
.sp
.LP
The following example creates the
.BR pipe (2)
man page in postscript for
csh, tcsh, ksh and sh users:

.sp
.in +2
.nf
	% env TCAT=/usr/lib/lp/postscript/dpost man -t -s 2 pipe > pipe.ps
.fi
.in -2
.sp

.sp
.LP
This is an alternative to using
.BR "man -t" ,
which sends the man
page to the default printer, if the user wants a postscript file version of
the man page.

.LP
\fBExample 2\fR Creating a Text Version of a man page
.sp
.LP
The following example creates the
.BR pipe (2)
man page in ascii text:

.sp
.in +2
.nf
man pipe.2 | col -x -b > pipe.text
.fi
.in -2
.sp

.sp
.LP
This is an alternative to using
.BR "man -t" ,
which sends the man
page to the default printer, if the user wants a text file version of the
man page.

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 6n
.rt
Successful completion.
.RE

.sp
.ne 2
.mk
.na
.B >0
.ad
.RS 6n
.rt
An error occurred.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B /usr/share/man
.ad
.sp .6
.RS 4n
Root of the standard manual page directory subtree
.RE

.sp
.ne 2
.mk
.na
.B /usr/share/man/man?/*
.ad
.sp .6
.RS 4n
Unformatted nroff manual entries
.RE

.sp
.ne 2
.mk
.na
.B /usr/share/man/sman?/*
.ad
.sp .6
.RS 4n
Unformatted
.B SGML
manual entries
.RE

.sp
.ne 2
.mk
.na
.B /usr/share/man/cat?/*
.ad
.sp .6
.RS 4n
\fBnroff\fRed manual entries
.RE

.sp
.ne 2
.mk
.na
\fB/usr/share/man/fmt?/*\fR
.ad
.sp .6
.RS 4n
\fBtroff\fRed manual entries
.RE

.sp
.ne 2
.mk
.na
.B /usr/share/man/windex
.ad
.sp .6
.RS 4n
Table of contents and keyword database
.RE

.sp
.ne 2
.mk
.na
.B /usr/share/lib/tmac/an
.ad
.sp .6
.RS 4n
Standard
.B -man
macro package
.RE

.sp
.ne 2
.mk
.na
.B /usr/share/lib/sgml/locale/C/dtd/*
.ad
.sp .6
.RS 4n
\fBSGML\fR document type definition files
.RE

.sp
.ne 2
.mk
.na
.B /usr/share/lib/sgml/locale/C/solbook/*
.ad
.sp .6
.RS 4n
\fBSGML\fR style sheet and entity definitions directories
.RE

.sp
.ne 2
.mk
.na
.B /usr/share/lib/pub/eqnchar
.ad
.sp .6
.RS 4n
Standard definitions for
.B eqn
and
.BR neqn
.RE

.sp
.ne 2
.mk
.na
\fBman.cf\fR
.ad
.sp .6
.RS 4n
Default search order by section
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWdoc
_
CSIEnabled, see \fBNOTES\fR.
_
Interface StabilityCommitted
_
StandardSee \fBstandards\fR(5).
.TE

.SH SEE ALSO
.sp
.LP
.BR apropos (1),
.BR cat (1),
.BR col (1),
.BR dpost (1),
.BR eqn (1),
.BR more (1),
\fBnroff\fR(1), \fBrefer\fR(1),
.BR tbl (1),
.BR troff (1),
.BR vgrind (1),
.BR whatis (1),
.BR catman (1M),
.BR attributes (5),
.BR environ (5),
.BR eqnchar (5),
.BR man (5),
.BR sgml (5),
.BR standards (5)
.SH NOTES
.sp
.LP
The \fB-f\fR and
.B -k
options use the
.B windex
database, which is
created by
.BR catman (1M).
.sp
.LP
The
.B man
command is CSI-capable. However, some utilities invoked by
the
.B man
command, namely,
.BR troff ,
.BR eqn ,
.BR neqn ,
.BR refer ,
.BR tbl ,
and
.BR vgrind ,
are not verified to be
CSI-capable. Because of this, the man command with the
.B -t
option can
not handle non-EUC data. Also, using the
.B man
command to display man
pages that require special processing through
.BR eqn ,
.BR neqn ,
.BR refer ,
.BR tbl ,
or
.B vgrind
can not be CSI-capable.
.SH BUGS
.sp
.LP
The manual is supposed to be reproducible either on a phototypesetter or on
an
.B ASCII
terminal. However, on a terminal some information (indicated
by font changes, for instance) is lost.
.sp
.LP
Some dumb terminals cannot process the vertical motions produced by the
\fBe\fR (see
.BR eqn (1))
preprocessing flag. To prevent garbled output on
these terminals, when you use
.BR e ,
also use
.BR t ,
to invoke
.BR col (1)
implicitly. This workaround has the disadvantage of eliminating
superscripts and subscripts, even on those terminals that can display them.
Control-q clears a terminal that gets confused by
.BR eqn (1)
output.
