usr/src/man/man1/more.1
'\" te
.\" Copyright 1989 AT&T
.\" Copyright (c) 2005, Sun Microsystems, Inc.  All Rights Reserved
.\" Portions Copyright (c) 1992, X/Open Company Limited  All Rights Reserved
.\"
.\" Sun Microsystems, Inc. gratefully acknowledges The Open Group for
.\" permission to reproduce portions of its copyrighted documentation.
.\" Original documentation from The Open Group can be obtained online
.\" at http://www.opengroup.org/bookstore/.
.\"
.\" The Institute of Electrical and Electronics Engineers and The Open Group,
.\" have given us permission to reprint portions of their documentation.
.\"
.\" In the following statement, the phrase "this text" refers to portions
.\" of the system documentation.
.\"
.\" Portions of this text are reprinted and reproduced in electronic form in
.\" the Sun OS Reference Manual, from IEEE Std 1003.1, 2004 Edition, Standard
.\" for Information Technology -- Portable Operating System Interface (POSIX),
.\" The Open Group Base Specifications Issue 6, Copyright (C) 2001-2004 by the
.\" Institute of Electrical and Electronics Engineers, Inc and The Open Group.
.\" In the event of any discrepancy between these versions and the original
.\" IEEE and The Open Group Standard, the original IEEE and The Open Group
.\" Standard is the referee document.
.\"
.\" The original Standard can be obtained online at
.\" http://www.opengroup.org/unix/online.html.
.\"
.\" This notice shall appear on any product containing this material.
.\"
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH more 1 "4 Nov 2005" "SunOS 5.11" "User Commands"
.SH NAME
more, page \- browse or page through a text file
.SH SYNOPSIS
.LP
.nf
\fB/usr/bin/more\fR [\fB-cdflrsuw\fR] [\fB-lines\fR] [+ \fIlinenumber\fR]
     [+/ \fIpattern\fR] [\fIfile\fR]...
.fi

.LP
.nf
\fB/usr/bin/page\fR [\fB-cdflrsuw\fR] [\fB-lines\fR] [+ \fIlinenumber\fR]
     [+/ \fIpattern\fR] [\fIfile\fR]...
.fi

.LP
.nf
\fB/usr/xpg4/bin/more\fR [\fB-cdeisu\fR] [\fB-n\fR \fInumber\fR] [\fB-p\fR \fIcommand\fR]
     [\fB-t\fR \fItagstring\fR] [\fIfile\fR]...
.fi

.LP
.nf
\fB/usr/xpg4/bin/more\fR [\fB-cdeisu\fR] [\fB-n\fR \fInumber\fR] [+ \fIcommand\fR]
     [\fB-t\fR \fItagstring\fR] [\fIfile\fR]...
.fi

.SH DESCRIPTION
.sp
.LP
The
.B more
utility is a filter that displays the contents of a text
file on the terminal, one screenful at a time.  It normally pauses after
each screenful.
.B /usr/bin/more
then prints
.B --More--
and
\fB/usr/xpg4/bin/more\fR then prints \fIfile\fR at the bottom of the screen.
If
.B more
is reading from a file rather than a pipe, the percentage of
characters displayed so far is also shown.
.sp
.LP
The
.B more
utility scrolls up to display one more line in response to a
\fBRETURN\fR character. \fBmore\fR displays another screenful in response to
a
.B SPACE
character. Other commands are listed below.
.sp
.LP
The
.B page
utility clears the screen before displaying the next
screenful of text.
.B page
only provides a one-line overlap between
screens.
.sp
.LP
The
.B more
utility sets the terminal to
.B NOECHO
mode, so that the
output can be continuous. Commands that you type do not normally show up on
your terminal, except for the
.B /
and
.B !
commands.
.sp
.LP
The
.B /usr/bin/more
utility exits after displaying the last specified
file.
.B /usr/xpg4/bin/more
prompts for a command at the last line of the
last specified file.
.sp
.LP
If the standard output is not a terminal,
.B more
acts just like
.BR cat (1),
except that a header is printed before each file in a
series.
.SH OPTIONS
.sp
.LP
The following options are supported for both
.B /usr/bin/more
and
.BR /usr/xpg4/bin/more :
.sp
.ne 2
.mk
.na
.B -c
.ad
.RS 7n
.rt
Clears before displaying. Redraws the screen instead of scrolling for
faster displays. This option is ignored if the terminal does not have the
ability to clear to the end of a line.
.RE

.sp
.ne 2
.mk
.na
.B -d
.ad
.RS 7n
.rt
Displays error messages rather than ringing the terminal bell if an
unrecognized command is used. This is helpful for inexperienced users.
.RE

.sp
.ne 2
.mk
.na
.B -s
.ad
.RS 7n
.rt
Squeeze.  Replaces multiple blank lines with a single blank line. This is
helpful when viewing
.BR nroff (1)
output on the screen.
.RE

.SS "/usr/bin/more"
.sp
.LP
The following options are supported for
.B /usr/bin/more
only:
.sp
.ne 2
.mk
.na
\fB-f\fR
.ad
.RS 15n
.rt
Does not fold long lines. This is useful when lines contain nonprinting
characters or escape sequences, such as those generated when
.BR nroff (1)
output is piped through
.BR ul (1).
.RE

.sp
.ne 2
.mk
.na
.B -l
.ad
.RS 15n
.rt
Does not treat
.B FORMFEED
characters (Control-l) as page breaks. If
\fB-l\fR is not used, \fBmore\fR pauses to accept commands after any line
containing a
.B ^L
character (Control-l). Also, if a file begins with a
.BR FORMFEED ,
the screen is cleared before the file is printed.
.RE

.sp
.ne 2
.mk
.na
.B -r
.ad
.RS 15n
.rt
Normally,
.B more
ignores control characters that it does not interpret
in some way. The
.B -r
option causes these to be displayed as
\fB^\fIC\fR where \fIC\fR stands for any such control character.
.RE

.sp
.ne 2
.mk
.na
.B -u
.ad
.RS 15n
.rt
Suppresses generation of underlining escape sequences. Normally, \fBmore\fR
handles underlining, such as that produced by
.BR nroff (1),
in a manner
appropriate to the terminal. If the terminal can perform underlining or has
a stand-out mode,
.B more
supplies appropriate escape sequences as called
for in the text file.
.RE

.sp
.ne 2
.mk
.na
.B -w
.ad
.RS 15n
.rt
Normally,
.B more
exits when it comes to the end of its input. With
.BR -w ,
however,
.B more
prompts and waits for any key to be struck
before exiting.
.RE

.sp
.ne 2
.mk
.na
\fB-\fIlines\fR
.ad
.RS 15n
.rt
Displays the indicated number of
.I lines
in each screenful, rather than
the default (the number of lines in the terminal screen less two).
.RE

.sp
.ne 2
.mk
.na
\fB+\fIlinenumber\fR
.ad
.RS 15n
.rt
Start up at
.IR linenumber .
.RE

.sp
.ne 2
.mk
.na
\fB+/\fIpattern\fR
.ad
.RS 15n
.rt
Start up two lines above the line containing the regular expression
.IR pattern .
\fBNote:\fR Unlike editors, this construct should \fInot\fR
end with a `\fB/\fR.' If it does, then the trailing slash is taken as a
character in the search pattern.
.RE

.SS "/usr/xpg4/bin/more"
.sp
.LP
The following options are supported for
.B /usr/xpg4/bin/more
only:
.sp
.ne 2
.mk
.na
.B -e
.ad
.RS 17n
.rt
Exits immediately after writing the last line of the last file in the
argument list.
.RE

.sp
.ne 2
.mk
.na
.B -i
.ad
.RS 17n
.rt
Performs pattern matching in searches without regard to case.
.RE

.sp
.ne 2
.mk
.na
\fB-n\fR \fInumber\fR
.ad
.RS 17n
.rt
Specifies the number of lines per screenful. The
.I number
argument is a
positive decimal integer. The
.B -n
option overrides any values obtained
from the environment.
.RE

.sp
.ne 2
.mk
.na
\fB-p\fR \fIcommand\fR
.ad
.br
.na
\fB+\fIcommand\fR
.ad
.RS 17n
.rt
For each file examined, initially executes the
.B more
command in the
\fIcommand\fR argument. If the command is a positioning command, such as a
line number or a regular expression search, set the current position to
represent the final results of the command, without writing any intermediate
lines of the file. For example, the two commands:
.sp
.in +2
.nf
\fBmore -p 1000j file
more -p 1000G file\fR
.fi
.in -2
.sp

are equivalent and start the display with the current position at line
1000, bypassing the lines that
.B j
would write and scroll off the screen
if it had been issued during the file examination. If the positioning
command is unsuccessful, the first line in the file will be the current
position.
.RE

.sp
.ne 2
.mk
.na
\fB-t\fR \fItagstring\fR
.ad
.RS 17n
.rt
Writes the screenful of the file containing the tag named by the
\fItagstring\fR argument. See the
.BR ctags (1)
utility.
.RE

.sp
.ne 2
.mk
.na
.B -u
.ad
.RS 17n
.rt
Treats a backspace character as a printable control character, displayed as
a ^H (Control-h), suppressing backspacing and the special handling that
produces underlined or standout-mode text on some terminal types.  Also,
does not ignore a carriage-return character at the end of a line.
.RE

.sp
.LP
If both the \fB-t\fI tagstring\fR and \fB-p\fI command\fR (or the
obsolescent
.IR +command )
options are given, the \fB-t\fI tagstring\fR
is processed first.
.SH USAGE
.SS "Environment"
.sp
.LP
\fBmore\fR uses the terminal's
.BR terminfo (4)
entry to determine its
display characteristics.
.sp
.LP
\fBmore\fR looks in the environment variable \fBMORE\fR for any preset
options. For instance, to page through files using the
.B -c
mode by
default, set the value of this variable to
.BR -c .
(Normally, the command
sequence to set up this environment variable is placed in the \fB\&.login\fR
or \fB\&.profile\fR file).
.SS "Commands"
.sp
.LP
The commands take effect immediately. It is not necessary to type a
carriage return unless the command requires a
.IR file ,
.IR command ,
.IR tagstring ,
or
.IR pattern .
Up to the time when the command character
itself is given, the user may type the line kill character to cancel the
numerical argument being formed. In addition, the user may type the erase
character to redisplay the `\fB--More--(\fIxx\fR%)' or \fIfile\fR
message.
.sp
.LP
In the following commands,
.I i
is a numerical argument (\fB1\fR by
default).
.sp
.ne 2
.mk
.na
\fIi\fRSPACE\fR
.ad
.RS 13n
.rt
Display another screenful, or
.I i
more lines if
.I i
is specified.
.RE

.sp
.ne 2
.mk
.na
\fIi\fRRETURN\fR
.ad
.RS 13n
.rt
Display another line, or
.I i
more lines, if specified.
.RE

.sp
.ne 2
.mk
.na
\fIi\fBb\fR
.ad
.br
.na
\fIi\fB^B\fR
.ad
.RS 13n
.rt
(Control-b) Skip back
.I i
screenfuls and then print a screenful.
.RE

.sp
.ne 2
.mk
.na
\fIi\fBd\fR
.ad
.br
.na
\fIi\fB^D\fR
.ad
.RS 13n
.rt
(Control-d) Scroll forward one half screenful or
.I i
more lines. If
\fIi\fR is specified, the count becomes the default for subsequent \fBd\fR
and
.B u
commands.
.RE

.sp
.ne 2
.mk
.na
\fIi\fBf\fR
.ad
.RS 13n
.rt
Skip
.I i
screens full and then print a screenful.
.RE

.sp
.ne 2
.mk
.na
.B h
.ad
.RS 13n
.rt
Help. Give a description of all the
.B more
commands.
.RE

.sp
.ne 2
.mk
.na
.B ^L
.ad
.RS 13n
.rt
(Control-l) Refresh.
.RE

.sp
.ne 2
.mk
.na
\fIi\fBn\fR
.ad
.RS 13n
.rt
Search for the \fIi\|\fRth occurrence of the last
.I pattern
entered.
.RE

.sp
.ne 2
.mk
.na
.B q
.ad
.br
.na
.B Q
.ad
.RS 13n
.rt
Exit from
.BR more .
.RE

.sp
.ne 2
.mk
.na
\fIi\fBs\fR
.ad
.RS 13n
.rt
Skip
.I i
lines and then print a screenful.
.RE

.sp
.ne 2
.mk
.na
.B v
.ad
.RS 13n
.rt
Drop into the
.B vi
editor at the current line of the current file.
.RE

.sp
.ne 2
.mk
.na
\fIi\fBz\fR
.ad
.RS 13n
.rt
Same as SPACE, except that
.IR i ,
if present, becomes the new default
number of lines per screenful.
.RE

.sp
.ne 2
.mk
.na
.B =
.ad
.RS 13n
.rt
Display the current line number.
.RE

.sp
.ne 2
.mk
.na
\fIi\fB/\fIpattern\fR
.ad
.RS 13n
.rt
Search forward for the \fIi\|\fRth occurrence of the regular expression
.IR pattern .
Display the screenful starting two lines before the line that
contains the \fIi\|\fRth match for the regular expression
.IR pattern ,
or
the end of a pipe, whichever comes first. If
.B more
is displaying a file
and there is no match, its position in the file remains unchanged. Regular
expressions can be edited using erase and kill characters. Erasing back past
the first column cancels the search command.
.RE

.sp
.ne 2
.mk
.na
\fB!\fIcommand\fR
.ad
.RS 13n
.rt
Invoke a shell to execute \fIcommand\|\fR. The characters
.B %
and
.BR ! ,
when used within
.I command
are replaced with the current
filename and the previous shell command, respectively. If there is no
current filename,
.B %
is not expanded. Prepend a backslash to these
characters to escape expansion.
.RE

.sp
.ne 2
.mk
.na
\fB:f\fR
.ad
.RS 13n
.rt
Display the current filename and line number.
.RE

.sp
.ne 2
.mk
.na
\fIi\fB:n\fR
.ad
.RS 13n
.rt
Skip to the \fIi\|\fRth next filename given in the command line, or to the
last filename in the list if
.I i
is out of range.
.RE

.sp
.ne 2
.mk
.na
\fIi\fB:p\fR
.ad
.RS 13n
.rt
Skip to the \fIi\|\fRth previous filename given in the command line, or to
the first filename if
.I i
is out of range. If given while
.B more
is
positioned within a file, go to the beginning of the file. If
.B more
is
reading from a pipe,
.B more
simply rings the terminal bell.
.RE

.sp
.ne 2
.mk
.na
.B :q
.ad
.br
.na
.B :Q
.ad
.RS 13n
.rt
Exit from
.B more
(same as
.B q
or
.BR Q ).
.RE

.SS "/usr/bin/more"
.sp
.LP
The following commands are available only in
.BR /usr/bin/more :
.sp
.ne 2
.mk
.na
\fB\&'\fR
.ad
.RS 9n
.rt
Single quote. Go to the point from which the last search started. If no
search has been performed in the current file, go to the beginning of the
file.
.RE

.sp
.ne 2
.mk
.na
\fB\&.\fR
.ad
.RS 9n
.rt
Dot. Repeat the previous command.
.RE

.sp
.ne 2
.mk
.na
\fB^\|\e\fR
.ad
.RS 9n
.rt
Halt a partial display of text.
.B more
stops sending output, and
displays the usual
.B --More--
prompt. Some output is lost as a result.
.RE

.SS "/usr/xpg4/bin/more"
.sp
.LP
The following commands are available only in
.BR /usr/xpg4/bin/more :
.sp
.ne 2
.mk
.na
\fIi\fB^F\fR
.ad
.RS 17n
.rt
(Control-f) Skip
.I i
screens full and print a screenful. (Same as
\fIi\fBf\fR.)
.RE

.sp
.ne 2
.mk
.na
.B ^G
.ad
.RS 17n
.rt
(Control-g) Display the current line number (same as
.BR = ).
.RE

.sp
.ne 2
.mk
.na
\fIi\fBg\fR
.ad
.RS 17n
.rt
Go to line number
.I i
with the default of the first line in the file.
.RE

.sp
.ne 2
.mk
.na
\fIi\fBG\fR
.ad
.RS 17n
.rt
Go to line number
.I i
with the default of the Last line in the file.
.RE

.sp
.ne 2
.mk
.na
\fIi\fBj\fR
.ad
.RS 17n
.rt
Display another line, or
.I i
more lines, if specified. (Same as
.IR i RETURN.)
.RE

.sp
.ne 2
.mk
.na
\fIi\fBk\fR
.ad
.RS 17n
.rt
Scroll backwards one or
.I i
lines, if specified.
.RE

.sp
.ne 2
.mk
.na
\fBm\fIletter\fR
.ad
.RS 17n
.rt
Mark the current position with the name
.IR letter .
.RE

.sp
.ne 2
.mk
.na
.B N
.ad
.RS 17n
.rt
Reverse direction of search.
.RE

.sp
.ne 2
.mk
.na
.B r
.ad
.RS 17n
.rt
Refresh the screen.
.RE

.sp
.ne 2
.mk
.na
.B R
.ad
.RS 17n
.rt
Refresh the screen, discarding any buffered input.
.RE

.sp
.ne 2
.mk
.na
\fIi\fBu\fR
.ad
.br
.na
\fIi\fB^U\fR
.ad
.RS 17n
.rt
(Control-u) Scroll backwards one half a screen of
.I i
lines, if
specified. If
.I i
is specified, the count becomes the new default for
subsequent
.B d
and
.B u
commands.
.RE

.sp
.ne 2
.mk
.na
.B ZZ
.ad
.RS 17n
.rt
Exit from
.B more
(same as
.BR q ).
.RE

.sp
.ne 2
.mk
.na
\fB:e\fR \fIfile\fR
.ad
.RS 17n
.rt
Examine (display) a new file. If no \fIfile\fR is specified, the current
file is redisplayed.
.RE

.sp
.ne 2
.mk
.na
\fB:t\fR \fItagstring\fR
.ad
.RS 17n
.rt
Go to the tag named by the
.I tagstring
argument and scroll/rewrite the
.RB "screen with the tagged line in the current position. See the" " ctags"
utility.
.RE

.sp
.ne 2
.mk
.na
\fB\&'\fIletter\fR
.ad
.RS 17n
.rt
Return to the position that was previously marked with the name
.IR letter .
.RE

.sp
.ne 2
.mk
.na
\fB\&''\fR
.ad
.RS 17n
.rt
Return to the position from which the last move of more than a screenful
was made. Defaults to the beginning of the file.
.RE

.sp
.ne 2
.mk
.na
\fIi\fB?\fR[\fI!\fR]\fIpattern\fR
.ad
.RS 17n
.rt
Search backward in the file for the
.IR i "th line containing the"
.IR pattern .
The
.I !
specifies to search backward for the
.IR i th
line that does not contain the
.IR pattern .
.RE

.sp
.ne 2
.mk
.na
\fIi\fB/!\fIpattern\fR
.ad
.RS 17n
.rt
Search forward in the file for the
.IR i "th line that does not contain the"
pattern.
.RE

.sp
.ne 2
.mk
.na
\fB!\fR[\fIcommand\fR]\fR
.ad
.RS 17n
.rt
Invoke a shell or the specified command.
.RE

.SS "Large File Behavior"
.sp
.LP
See
.BR largefile (5)
for the description of the behavior of
.BR more
and
.B page
when encountering files greater than or equal to 2 Gbyte (
2^31 bytes).
.SH ENVIRONMENT VARIABLES
.sp
.LP
See
.BR environ (5)
for descriptions of the following environment
variables that affect the execution of
.BR more :
.BR LANG ,
.BR LC_ALL ,
\fBLC_COLLATE\fR (\fB/usr/xpg4/bin/more\fR only),
.BR LC_CTYPE ,
.BR LC_MESSAGES ,
.BR NLSPATH ,
and
.BR TERM .
.SS "/usr/xpg4/bin/more"
.sp
.LP
The following environment variables also affect the execution of
.BR /usr/xpg4/bin/more :
.sp
.ne 2
.mk
.na
.B COLUMNS
.ad
.RS 12n
.rt
Overrides the system selected horizontal screen size.
.RE

.sp
.ne 2
.mk
.na
.B EDITOR
.ad
.RS 12n
.rt
Used by the
.B v
command to select an editor.
.RE

.sp
.ne 2
.mk
.na
.B LINES
.ad
.RS 12n
.rt
Overrides the system selected vertical screen size. The
.B -n
option has
precedence over
.B LINES
in determining the number of lines in a
screen.
.RE

.sp
.ne 2
.mk
.na
.B MORE
.ad
.RS 12n
.rt
A string specifying options as described in the OPTIONS section, above. As
in a command line, The options must be separated by blank characters and
each option specification must start with a \(mi. Any command line options
are processed after those specified in
.B MORE
as though the command line
were:
.B "more $MORE"
.I options operands
.RE

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 7n
.rt
Successful completion.
.RE

.sp
.ne 2
.mk
.na
.B >0
.ad
.RS 7n
.rt
An error occurred.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B /usr/lib/more.help
.ad
.RS 22n
.rt
help file for
.B /usr/bin/more
and
.B /usr/bin/page
only.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.SS "/usr/bin/more /usr/bin/page"
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
_
CSINot enabled
.TE

.SS "/usr/xpg4/bin/more"
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWxcu4
_
CSIEnabled
_
Interface StabilityStandard
.TE

.SH SEE ALSO
.sp
.LP
.BR cat (1),
.BR csh (1),
.BR ctags (1),
.BR man (1),
.BR nroff (1),
.BR script (1),
.BR sh (1),
.BR ul (1),
.BR terminfo (4),
.BR attributes (5),
.BR environ (5),
.BR largefile (5),
.BR standards (5)
.SS "/usr/bin/more /usr/bin/page"
.sp
.LP
.BR regcomp (3C)
.SS "/usr/xpg4/bin/more"
.sp
.LP
.BR regex (5)
.SH NOTES
.SS "/usr/bin/more"
.sp
.LP
Skipping backwards is too slow on large files.
.SS "/usr/xpg4/bin/more"
.sp
.LP
This utility will not behave correctly if the terminal is not set up
properly.
