usr/src/man/man1/mpss.so.1.1
'\" te
.\" Copyright (c) 2002, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH mpss.so.1 1 "20 Feb 2002" "SunOS 5.11" "User Commands"
.SH NAME
mpss.so.1 \- shared object for setting preferred page size
.SH SYNOPSIS
.LP
.nf
\fBmpss.so.1\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B mpss.so.1
shared object provides a means by which the preferred
stack and/or heap page size can be selectively configured for launched
processes and their descendants. To enable
.BR mpss.so.1 ,
the following
string needs to be present in the environment (see
.BR ld.so.1 (1))
along
with one or more
.B MPSS
(Multiple Page Size Support) environment
variables:
.sp
.in +2
.nf
\fBLD_PRELOAD=$LD_PRELOAD:mpss.so.1\fR
.fi
.in -2
.sp

.SH ENVIRONMENT VARIABLES
.sp
.LP
Once preloaded, the
.B mpss.so.1
shared object reads the following
environment variables to determine any preferred page size requirements and
any processes these may be specific to.
.sp
.ne 2
.mk
.na
\fBMPSSHEAP\fR=\fIsize\fR
.ad
.br
.na
\fBMPSSSTACK\fR=\fIsize\fR
.ad
.RS 27n
.rt
.B MPSSHEAP
and
.B MPSSSTACK
specify the preferred page sizes for the
heap and stack, respectively. The specified page size(s) are applied to all
created processes.
.sp
.I size
must be a supported page size (see
.BR pagesize (1))
or
.BR 0 ,
in which case the system will select an appropriate page size (see
.BR memcntl (2)).
.sp
.I size
can be qualified with
.BR K ,
.BR M ,
.BR G ,
or
.B T
to
specify Kilobytes, Megabytes, Gigabytes, or Terabytes respectively.
.RE

.sp
.ne 2
.mk
.na
\fBMPSSCFGFILE\fR=\fIconfig-file\fR
.ad
.RS 27n
.rt
.I config-file
is a text file which contains one or more
.BR mpss
configuration entries of the form:
.sp
.in +2
.nf
\fIexec-name\fR \fIexec-args\fR:\fIheap-size\fR:\fIstack-size\fR
.fi
.in -2
.sp

.I exec-name
specifies the name of an application or executable. The
corresponding preferred page size(s) are set for newly created processes
(see \fBgetexecname\fR(3C)) that match the first \fIexec-name\fR found in
the file.
.sp
.I exec-name
can be a full pathname, a base name or a pattern string.
See
.B "File Name Generation"
in
.BR sh (1)
for a discussion of pattern
matching.
.sp
.I exec-args
is an optionally specified pattern string to match against
arguments. Preferred page size(s) are set only if
.I exec-args
is not
specified or occurs within the arguments to
.IR exec-name .
.sp
If
.I heap-size
and/or
.I stack-size
are not specified, the
corresponding preferred page size(s) will not be set.
.sp
.B MPSSCFGFILE
takes precedence over
.B MPSSHEAP
and
.BR MPSSSTACK .
When
.B MPSSCFGFILE
is not set, preferred page size settings are taken
from file
.B /etc/mpss.conf
if it exists.
.RE

.sp
.ne 2
.mk
.na
\fBMPSSERRFILE\fR=\fIpathname\fR
.ad
.RS 27n
.rt
By default, error messages are logged via
.BR syslog (3C)
using level
.B LOG_ERR
and facility
.BR LOG_USER .
If
.B MPSSERRFILE
contains a
valid
.I pathname
(such as
.BR /dev/stderr ),
error messages will be
logged there instead.
.RE

.SH EXAMPLES
.LP
.B Example 1
Configuring preferred page sizes using MPSSCFGFILE
.sp
.LP
The following Bourne shell commands (see
.BR sh (1))
configure the
preferred page sizes to a select set of applications with exec names that
begin with
.BR foo ,
using the
.B MPSSCFGFILE
environment variable. The
.B MPSS
configuration file,
.BR mpsscfg ,
is assumed to have been
previously created via a text editor like
.BR vi (1).
The
.BR cat (1)
command is only dumping out the contents.

.sp
.in +2
.nf
example$ \fBLD_PRELOAD=$LD_PRELOAD:mpss.so.1\fR
example$ \fBMPSSCFGFILE=mpsscfg\fR
example$ \fBexport LD_PRELOAD MPSSCFGFILE\fR
example$ \fBcat $MPSSCFGFILE\fR
foo*:512K:64K
.fi
.in -2
.sp

.sp
.LP
Once the application has been started,
.B pmap
(see
.BR proc (1))
can
be used to view the actual page sizes configured:

.sp
.in +2
.nf
example$ \fBfoobar &\fR
example$ \fBpmap -s `pgrep foobar`\fR
.fi
.in -2
.sp

.sp
.LP
If the desired page size is not configured (shown in the \fBpmap\fR
output), it may be due to errors in the
.B MPSS
configuration file or
environment variables. Check the error log (by default:
.BR /var/adm/messages )
for errors.

.sp
.LP
If no errors can be found, resource or alignment constraints may be
responsible. See the NOTES section.

.LP
.B Example 2
Configuring preferred page sizes using MPSSHEAP and
MPSSSTACK
.sp
.LP
The following Bourne shell commands configure
.B 512K
heap and
.BR 64K
stack preferred page sizes for all applications using the
.B MPSSHEAP
and
.B MPSSSTACK
environment variables.

.sp
.in +2
.nf
example$ \fBLD_PRELOAD=$LD_PRELOAD:mpss.so.1\fR
example$ \fBMPSSHEAP=512K\fR
example$ \fBMPSSSTACK=64K\fR
example$ \fBexport LD_PRELOAD MPSSHEAP MPSSSTACK\fR
.fi
.in -2
.sp

.LP
.B Example 3
Precedence rules (continuation from Example 2)
.sp
.LP
The preferred page size configuration in
.B MPSSCFGFILE
overrides
.B MPSSHEAP
and
.BR MPSSTACK .
Appending the following commands to those
in
.B "Example 2"
would mean that all applications will be configured with
.B 512K
heap and
.B 64K
stack preferred page sizes with the exception
of those applications, the
.B ls
command, and all applications beginning
with
.B ora
that have
.B ora1
as an argument, in the configuration
file.

.sp
.in +2
.nf
example$ \fBMPSSCFGFILE=mpsscfg2\fR
example$ \fBexport MPSSCFGFILE\fR
example$ \fBcat $MPSSCFGFILE\fR
ls::
ora* ora1:4m:4m
.fi
.in -2
.sp

.SH FILES
.sp
.ne 2
.mk
.na
.B /usr/lib/ld/map.bssalign
.ad
.RS 29n
.rt
A template link-editor
.B mapfile
for aligning bss (see NOTES).
.RE

.sp
.ne 2
.mk
.na
.B /etc/mpss.conf
.ad
.RS 29n
.rt
Configuration file
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWesu (32-bit)
_
SUNWesxu (64-bit)
_
Interface StabilityEvolving
.TE

.SH SEE ALSO
.sp
.LP
.BR cat (1),
.BR ld (1),
.BR ld.so.1 (1),
.BR pagesize (1),
.BR ppgsz (1),
.BR proc (1),
.BR sh (1),
.BR vi (1),
.BR exec (2),
.BR fork (2),
.BR memcntl (2),
.BR getexecname (3C),
.BR getpagesize (3C),
.BR syslog (3C),
.BR proc (4),
.BR attributes (5)

.SH NOTES
.sp
.LP
The heap and stack preferred page sizes are inherited. A child process has
the same preferred page sizes as its parent. On
.BR exec (2),
the preferred
page sizes are set back to the default system page size unless a preferred
page size has been configured via the
.B mpss
shared object.
.sp
.LP
.BR ppgsz (1),
a proc tool, can also be used to set the preferred stack
and/or heap page sizes. It cannot selectively configure the page size for
descendents based on name matches.
.sp
.LP
See also NOTES under
.BR ppgsz (1).
