usr/src/man/man1/mv.1
'\" te
.\" Copyright 1989 AT&T
.\" Copyright (c) 1992, X/Open Company Limited  All Rights Reserved
.\" Portions Copyright (c) 2007, Sun Microsystems, Inc.  All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\"
.\" Sun Microsystems, Inc. gratefully acknowledges The Open Group for
.\" permission to reproduce portions of its copyrighted documentation.
.\" Original documentation from The Open Group can be obtained online
.\" at http://www.opengroup.org/bookstore/.
.\"
.\" The Institute of Electrical and Electronics Engineers and The Open Group,
.\" have given us permission to reprint portions of their documentation.
.\"
.\" In the following statement, the phrase "this text" refers to portions
.\" of the system documentation.
.\"
.\" Portions of this text are reprinted and reproduced in electronic form in
.\" the Sun OS Reference Manual, from IEEE Std 1003.1, 2004 Edition, Standard
.\" for Information Technology -- Portable Operating System Interface (POSIX),
.\" The Open Group Base Specifications Issue 6, Copyright (C) 2001-2004 by the
.\" Institute of Electrical and Electronics Engineers, Inc and The Open Group.
.\" In the event of any discrepancy between these versions and the original
.\" IEEE and The Open Group Standard, the original IEEE and The Open Group
.\" Standard is the referee document.
.\"
.\" The original Standard can be obtained online at
.\" http://www.opengroup.org/unix/online.html.
.\"
.\" This notice shall appear on any product containing this material.
.\"
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH mv 1 "17 Jul 2007" "SunOS 5.11" "User Commands"
.SH NAME
mv \- move files
.SH SYNOPSIS
.LP
.nf
\fB/usr/bin/mv\fR [\fB-fi\fR] \fIsource\fR \fItarget_file\fR
.fi

.LP
.nf
\fB/usr/bin/mv\fR [\fB-fi\fR] \fIsource\fR.\|.\|. \fItarget_dir\fR
.fi

.LP
.nf
\fB/usr/xpg4/bin/mv\fR [\fB-fi\fR] \fIsource\fR \fItarget_file\fR
.fi

.LP
.nf
\fB/usr/xpg4/bin/mv\fR [\fB-fi\fR] \fIsource\fR.\|.\|. \fItarget_dir\fR
.fi

.SH DESCRIPTION
.sp
.LP
In the first synopsis form, the
.B mv
utility moves the file named by
the
.I source
operand to the destination specified by the
.IR target_file .
.I source
and
.I target_file
can not have the same
name. If \fItarget_file\fR does not exist,
.B mv
creates a file named
.IR target_file .
If
.I target_file
exists, its contents are
overwritten. This first synopsis form is assumed when the final operand does
not name an existing directory.
.sp
.LP
In the second synopsis form,
.B mv
moves each file named by a
.I source
operand to a destination file in the existing directory named
by the
.I target_dir
operand. The destination path for each
.I source
is the concatenation of the target directory, a single slash character
.RB ( / ),
and the last path name component of the
.IR source .
This second
form is assumed when the final operand names an existing directory.
.sp
.LP
If
.B mv
determines that the mode of
.I target_file
forbids writing,
it prints the mode (see
.BR chmod (2)),
ask for a response, and read the
standard input for one line. If the response is affirmative, the
.B mv
occurs, if permissible; otherwise, the command exits. Notice that the mode
displayed can not fully represent the access permission if
.I target
is
associated with an
.BR ACL .
When the parent directory of
.I source
is
writable and has the sticky bit set, one or more of the following conditions
must be true:
.RS +4
.TP
.ie t \(bu
.el o
the user must own the file
.RE
.RS +4
.TP
.ie t \(bu
.el o
the user must own the directory
.RE
.RS +4
.TP
.ie t \(bu
.el o
the file must be writable by the user
.RE
.RS +4
.TP
.ie t \(bu
.el o
the user must be a privileged user
.RE
.sp
.LP
If
.I source
is a file and
.I target_file
is a link to another file
with links, the other links remain and
.I target_file
becomes a new
file.
.sp
.LP
If
.I source
.RI "and " target_file / target_dir " are on different"
file systems,
.B mv
copies the source and deletes the original. Any hard
links to other files are lost.
.B mv
attempts to duplicate the source
file characteristics to the target, that is, the owner and group id,
permission modes, modification and access times,
.BR ACL s,
and extended
attributes, if applicable. For symbolic links,
.B mv
preserves only the
owner and group of the link itself.
.sp
.LP
If unable to preserve owner and group id,
.B mv
clears
.B S_ISUID
and
.B S_ISGID
bits in the target.
.B mv
prints a diagnostic message to
stderr if unable to clear these bits, though the exit code is not affected.
.B mv
might be unable to preserve extended attributes if the target file
.RB "system does not have extended attribute support." " /usr/xpg4/bin/mv"
prints a diagnostic message to stderr for all other failed attempts to
duplicate file characteristics. The exit code is not affected.
.sp
.LP
In order to preserve the source file characteristics, users must have the
appropriate file access permissions. This includes being super-user or
having the same owner id as the destination file.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -f
.ad
.RS 6n
.rt
.B mv
moves the file(s) without prompting even if it is writing over an
existing
.IR target .
Note that this is the default if the standard input
is not a terminal.
.RE

.sp
.ne 2
.mk
.na
.B -i
.ad
.RS 6n
.rt
.B mv
prompts for confirmation whenever the move would overwrite an
existing
.IR target .
An affirmative answer means that the move should
proceed. Any other answer prevents
.B mv
from overwriting the
.IR target .
.RE

.SS "/usr/bin/mv"
.sp
.LP
Specifying both the
.B -f
and the
.B -i
options is not considered an
error. The
.B -f
option overrides the
.B -i
option.
.SS "/usr/xpg4/bin/mv"
.sp
.LP
Specifying both the
.B -f
and the
.B -i
options is not considered an
error. The last option specified determines the behavior of
.BR mv .
.SH OPERANDS
.sp
.LP
The following operands are supported:
.sp
.ne 2
.mk
.na
.I source
.ad
.RS 15n
.rt
A path name of a file or directory to be moved.
.RE

.sp
.ne 2
.mk
.na
.I target_file
.ad
.RS 15n
.rt
A new path name for the file or directory being moved.
.RE

.sp
.ne 2
.mk
.na
.I target_dir
.ad
.RS 15n
.rt
A path name of an existing directory into which to move the input files.
.RE

.SH USAGE
.sp
.LP
See
.BR largefile (5)
for the description of the behavior of
.B mv
when
encountering files greater than or equal to 2 Gbyte ( 2^31 bytes).
.SH ENVIRONMENT VARIABLES
.sp
.LP
See
.BR environ (5)
for descriptions of the following environment
variables that affect the execution of
.BR mv :
.BR LANG ,
.BR LC_ALL ,
.BR LC_COLLATE ,
.BR LC_CTYPE ,
.BR LC_MESSAGES ,
and
.BR NLSPATH .
.sp
.LP
Affirmative responses are processed using the extended regular expression
defined for the
.B yesexpr
keyword in the
.B LC_MESSAGES
category of
the user's locale. The locale specified in the
.B LC_COLLATE
category
defines the behavior of ranges, equivalence classes, and multi-character
collating elements used in the expression defined for
.BR yesexpr .
The
locale specified in
.B LC_CTYPE
determines the locale for interpretation
of sequences of bytes of text data a characters, the behavior of character
classes used in the expression defined for the
.BR yesexpr .
See
.BR locale (5).
.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 6n
.rt
All input files were moved successfully.
.RE

.sp
.ne 2
.mk
.na
.B >0
.ad
.RS 6n
.rt
An error occurred.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.SS "/usr/bin/mv"
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
_
CSIEnabled
_
Interface StabilityStable
.TE

.SS "/usr/xpg4/bin/mv"
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWxcu4
_
CSIEnabled
_
Interface StabilityStandard
.TE

.SH SEE ALSO
.sp
.LP
.BR cp (1),
.BR cpio (1),
.BR ln (1),
.BR rm (1),
.BR setfacl (1),
.BR chmod (2),
.BR attributes (5),
.BR environ (5),
.BR fsattr (5),
.BR largefile (5),
.BR standards (5)
.SH NOTES
.sp
.LP
A
.B --
permits the user to mark explicitly the end of any command line
options, allowing
.B mv
to recognize filename arguments that begin with a
.BR - .
As an aid to BSD migration,
.B mv
accepts
.B -
as a synonym
for
.BR -- .
This migration aid might disappear in a future release.
