usr/src/man/man1/nice.1
'\" te
.\" Copyright 1989 AT&T
.\" Copyright (c) 2004, Sun Microsystems, Inc.  All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" Portions Copyright (c) 1992, X/Open Company Limited  All Rights Reserved
.\"
.\" Sun Microsystems, Inc. gratefully acknowledges The Open Group for
.\" permission to reproduce portions of its copyrighted documentation.
.\" Original documentation from The Open Group can be obtained online
.\" at http://www.opengroup.org/bookstore/.
.\"
.\" The Institute of Electrical and Electronics Engineers and The Open Group,
.\" have given us permission to reprint portions of their documentation.
.\"
.\" In the following statement, the phrase "this text" refers to portions
.\" of the system documentation.
.\"
.\" Portions of this text are reprinted and reproduced in electronic form in
.\" the Sun OS Reference Manual, from IEEE Std 1003.1, 2004 Edition, Standard
.\" for Information Technology -- Portable Operating System Interface (POSIX),
.\" The Open Group Base Specifications Issue 6, Copyright (C) 2001-2004 by the
.\" Institute of Electrical and Electronics Engineers, Inc and The Open Group.
.\" In the event of any discrepancy between these versions and the original
.\" IEEE and The Open Group Standard, the original IEEE and The Open Group
.\" Standard is the referee document.
.\"
.\" The original Standard can be obtained online at
.\" http://www.opengroup.org/unix/online.html.
.\"
.\" This notice shall appear on any product containing this material.
.\"
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH nice 1 "23 Jan 2004" "SunOS 5.11" "User Commands"
.SH NAME
nice \- invoke a command with an altered scheduling priority
.SH SYNOPSIS
.LP
.nf
\fB/usr/bin/nice\fR [\fB-\fIincrement\fR | \fB-n\fR \fIincrement\fR] \fIcommand\fR
     [\fIargument\fR]...
.fi

.LP
.nf
\fB/usr/xpg4/bin/nice\fR [\fB-\fIincrement\fR | \fB-n\fR \fIincrement\fR] \fIcommand\fR
     [\fIargument\fR]...
.fi

.SS "csh Builtin"
.LP
.nf
\fBnice\fR [\fB-\fIincrement\fR | +\fIincrement\fR] [\fIcommand\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The
.B nice
utility invokes
.BR command ,
requesting that it be run
with a different system scheduling priority. The
.BR priocntl (1)
command
is a more general interface to scheduler functions.
.sp
.LP
The invoking process (generally the user's shell) must be in a scheduling
class that supports
.BR nice .
.sp
.LP
If the C shell (see
.BR csh (1))
is used, the full path of the command
must be specified. Otherwise, the
.B csh
built-in version of
.B nice
will be invoked. See
.B "csh Builtin"
below.
.SS "/usr/bin/nice"
.sp
.LP
If
.B nice
executes commands with arguments, it uses the default shell
.B /usr/bin/sh
(see
.BR sh (1)).
.SS "/usr/xpg4/bin/nice"
.sp
.LP
If
.B nice
executes commands with arguments, it uses
.B /usr/xpg4/bin/sh
(see
.BR ksh (1)).
.SS "csh Builtin"
.sp
.LP
.B nice
is also a
.B csh
built-in command with behavior different
from the utility versions.  See
.BR csh (1)
for description.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.BI - increment
| \fB-n\fR \fIincrement\fR
.ad
.RS 29n
.rt
.I increment
is a positive or negative decimal integer that has the same
effect on the execution of the utility as if the utility had called the
.B nice()
function with the numeric value of the
.IR increment
option-argument. See
.BR nice (2).
.B nice()
errors, other than
.BR EINVAL ,
are ignored. If not specified, an increment of
.B 10
is
assumed.
.sp
The super-user may run commands with priority higher than normal by using a
negative increment such as
.BR -10 \&.
A negative
.I increment
assigned
by an unprivileged user is ignored.
.RE

.SH OPERANDS
.sp
.LP
The following operands are supported:
.sp
.ne 2
.mk
.na
.I command
.ad
.RS 12n
.rt
The name of a command that is to be invoked. If
.I command
names any of
the special built-in utilities (see
.BR shell_builtins (1)),
the results
are undefined.
.RE

.sp
.ne 2
.mk
.na
.I argument
.ad
.RS 12n
.rt
Any string to be supplied as an argument when invoking
.IR command .
.RE

.SH ENVIRONMENT VARIABLES
.sp
.LP
See
.BR environ (5)
for descriptions of the following environment
variables that affect the execution of
.BR nice :
.BR LANG ,
.BR LC_ALL ,
.BR LC_CTYPE ,
.BR LC_MESSAGES ,
.BR PATH ,
and
.BR NLSPATH .
.SH EXIT STATUS
.sp
.LP
If
.I command
is invoked, the exit status of
.B nice
will be the exit
status of
.IR command .
Otherwise,
.B nice
will exit with one of the
following values:
.sp
.ne 2
.mk
.na
.B 1-125
.ad
.RS 9n
.rt
An error occurred.
.RE

.sp
.ne 2
.mk
.na
.B 126
.ad
.RS 9n
.rt
.I command
was found but could not be invoked.
.RE

.sp
.ne 2
.mk
.na
.B 127
.ad
.RS 9n
.rt
.I command
could not be found.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.SS "/usr/bin/nice"
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
_
CSIEnabled
.TE

.SS "/usr/xpg4/bin/nice"
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWxcu4
_
CSIEnabled
_
Interface StabilityStandard
.TE

.SH SEE ALSO
.sp
.LP
.BR csh (1),
.BR ksh (1),
.BR nohup (1),
.BR priocntl (1),
.BR sh (1),
.BR shell_builtins (1),
.BR nice (2),
.BR attributes (5),
.BR environ (5),
.BR standards (5)
