usr/src/man/man1/nl.1
'\" te
.\" Copyright 1989 AT&T
.\" Copyright (c) 1995, Sun Microsystems, Inc.  All Rights Reserved
.\" Portions Copyright (c) 1992, X/Open Company Limited  All Rights Reserved
.\"
.\" Sun Microsystems, Inc. gratefully acknowledges The Open Group for
.\" permission to reproduce portions of its copyrighted documentation.
.\" Original documentation from The Open Group can be obtained online
.\" at http://www.opengroup.org/bookstore/.
.\"
.\" The Institute of Electrical and Electronics Engineers and The Open Group,
.\" have given us permission to reprint portions of their documentation.
.\"
.\" In the following statement, the phrase "this text" refers to portions
.\" of the system documentation.
.\"
.\" Portions of this text are reprinted and reproduced in electronic form in
.\" the Sun OS Reference Manual, from IEEE Std 1003.1, 2004 Edition, Standard
.\" for Information Technology -- Portable Operating System Interface (POSIX),
.\" The Open Group Base Specifications Issue 6, Copyright (C) 2001-2004 by the
.\" Institute of Electrical and Electronics Engineers, Inc and The Open Group.
.\" In the event of any discrepancy between these versions and the original
.\" IEEE and The Open Group Standard, the original IEEE and The Open Group
.\" Standard is the referee document.
.\"
.\" The original Standard can be obtained online at
.\" http://www.opengroup.org/unix/online.html.
.\"
.\" This notice shall appear on any product containing this material.
.\"
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH nl 1 "28 Mar 1995" "SunOS 5.11" "User Commands"
.SH NAME
nl \- line numbering filter
.SH SYNOPSIS
.LP
.nf
\fB/usr/bin/nl\fR [\fB-p\fR] [\fB-b\fR [\fItype\fR]] [\fB-d\fR [\fIdelim\fR]] [\fB-f\fR [\fItype\fR]]
     [\fB-h\fR [\fItype\fR]] [\fB-i\fR [\fIincr\fR]] [\fB-l\fR [\fInum\fR]] [\fB-n\fR [\fIformat\fR]]
     [\fB-s\fR [\fIsep\fR]] [\fB-w\fR [\fIwidth\fR]] [\fB-v\fR [\fIstartnum\fR]] [\fIfile\fR]
.fi

.LP
.nf
\fB/usr/xpg4/bin/nl\fR [\fB-p\fR] [\fB-b\fR \fItype\fR] [\fB-d\fR \fIdelim\fR] [\fB-f\fR \fItype\fR]
     [\fB-h\fR \fItype\fR] [\fB-i\fR \fIincr\fR] [\fB-l\fR \fInum\fR] [\fB-n\fR \fIformat\fR] [\fB-s\fR \fIsep\fR]
     [\fB-w\fR \fIwidth\fR] [\fB-v\fR \fIstartnum\fR] [\fIfile\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The
.B nl
utility reads lines from the named
.IR file ,
or the standard
input if no
.I file
is named, and reproduces the lines on the standard
output. Lines are numbered on the left in accordance with the command options in
effect.
.sp
.LP
.B nl
views the text it reads in terms of logical pages. Line numbering is
reset at the start of each logical page. A logical page consists of a header, a
body, and a footer section. Empty sections are valid. Different line numbering
options are independently available for header, body, and footer. For example,
.B -bt
(the default) numbers non-blank lines in the body section and does not
number any lines in the header and footer sections.
.sp
.LP
The start of logical page sections are signaled by input lines containing
nothing but the following delimiter character(s):
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
Line contentsStart Of
_
\e:\e:\e:header
_
\e:\e:body
_
\e:footer
.TE

.sp
.LP
Unless optioned otherwise,
.B nl
assumes the text being read is in a single
logical page body.
.SH OPTIONS
.sp
.LP
Command options may appear in any order and may be intermingled with an
optional file name. Only one file may be named. The specified default is used
.RB "when the option is not entered on the command line." " /usr/xpg4/bin/nl"
options require option arguments.  A
.B SPACE
character
.B may
separate
options from option arguments.
.B /usr/bin/nl
options
.B may
have option
arguments. If option-arguments of
.B /usr/bin/nl
options are not specified,
these options result in the default. The supported options are:
.sp
.ne 2
.mk
.na
\fB-b\fItype\fR
.ad
.RS 14n
.rt
Specifies which logical page body lines are to be numbered. Recognized
\fItype\fRs and their meanings are:
.sp
.ne 2
.mk
.na
.B a
.ad
.RS 8n
.rt
number all lines
.RE

.sp
.ne 2
.mk
.na
.B t
.ad
.RS 8n
.rt
number all non-empty lines.
.RE

.sp
.ne 2
.mk
.na
.B n
.ad
.RS 8n
.rt
no line numbering
.RE

.sp
.ne 2
.mk
.na
\fBp\fIexp\fR
.ad
.RS 8n
.rt
number only lines that contain the regular expression specified in
.IR exp .
See NOTES below.
.RE

Default
.I type
for logical page body is
.B t
(text lines numbered).
.RE

.sp
.ne 2
.mk
.na
\fB-f\fItype\fR
.ad
.RS 14n
.rt
Same as \fB-b\fItype\fR except for footer. Default \fItype\fR for logical
page footer is
.B n
(no lines numbered).
.RE

.sp
.ne 2
.mk
.na
\fB-d\fIdelim\fR
.ad
.RS 14n
.rt
The two delimiter characters specifying the start of a logical page section may
be changed from the default characters (\e\|:\|) to two user-specified
characters. If only one character is entered, the second character remains the
default character (:). No space should appear between the
.B -d
and the
delimiter characters. To enter a backslash, use two backslashes.
.RE

.sp
.ne 2
.mk
.na
\fB-h\fItype\fR
.ad
.RS 14n
.rt
Same as \fB-b\fItype\fR except for header. Default \fItype\fR for logical
page header is
.B n
(no lines numbered).
.RE

.sp
.ne 2
.mk
.na
\fB-i\fIincr\fR
.ad
.RS 14n
.rt
.I incr
is the increment value used to number logical page lines. Default
.I incr
is
.BR 1 .
.RE

.sp
.ne 2
.mk
.na
\fB-l\fInum\fR
.ad
.RS 14n
.rt
.I num
is the number of blank lines to be considered as one. For example,
\fB\(mil2\fR results in only the second adjacent blank being numbered (if the
appropriate
.BR -ha ,
.BR -ba ,
and/or
.B -fa
option is set). Default
.I num
is
.BR 1 .
.RE

.sp
.ne 2
.mk
.na
\fB-n\fIformat\fR
.ad
.RS 14n
.rt
.I format
is the line numbering format. Recognized values are:
.sp
.ne 2
.mk
.na
.B ln
.ad
.RS 6n
.rt
left justified, leading zeroes suppressed
.RE

.sp
.ne 2
.mk
.na
.B rn
.ad
.RS 6n
.rt
right justified, leading zeroes suppressed
.RE

.sp
.ne 2
.mk
.na
.B rz
.ad
.RS 6n
.rt
right justified, leading zeroes kept
.RE

Default \fIformat\fR is \fBrn\fR (right justified).
.RE

.sp
.ne 2
.mk
.na
.B -p
.ad
.RS 14n
.rt
Do not restart numbering at logical page delimiters.
.RE

.sp
.ne 2
.mk
.na
\fB-s\fIsep\fR
.ad
.RS 14n
.rt
.I sep
is the character(s) used in separating the line number and the
corresponding text line. Default
.I sep
is a
.BR TAB .
.RE

.sp
.ne 2
.mk
.na
\fB-v\fIstartnum\fR
.ad
.RS 14n
.rt
.I startnum
is the initial value used to number logical page lines. Default
.I startnum
is
.BR 1 .
.RE

.sp
.ne 2
.mk
.na
\fB-w\fIwidth\fR
.ad
.RS 14n
.rt
.I width
is the number of characters to be used for the line number. Default
.I width
is
.BR 6 .
.RE

.SH OPERANDS
.sp
.LP
The following operand is supported:
.sp
.ne 2
.mk
.na
.I file
.ad
.RS 8n
.rt
A path name of a text file to be line-numbered.
.RE

.SH EXAMPLES
.LP
.B Example 1
An example of the nl command
.sp
.LP
The command:

.sp
.in +2
.nf
example% \fBnl -v10 -i10 -d!+ filename1\fR
.fi
.in -2
.sp

.sp
.LP
will cause the first line of the page body to be numbered
.BR 10 ,
the second
line of the page body to be numbered
.BR 20 ,
the third
.BR 30 ,
and so forth.
The logical page delimiters are !+.

.SH ENVIRONMENT VARIABLES
.sp
.LP
See
.BR environ (5)
for descriptions of the following environment variables
that affect the execution of
.BR nl :
.BR LANG ,
.BR LC_ALL ,
.BR LC_COLLATE ,
.BR LC_CTYPE ,
.BR LC_MESSAGES ,
and
.BR NLSPATH .
.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 6n
.rt
Successful completion.
.RE

.sp
.ne 2
.mk
.na
.B >0
.ad
.RS 6n
.rt
An error occurred.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
\fB/usr/lib/locale/\fIlocale\fR/LC_COLLATE/CollTable\fR
.ad
.sp .6
.RS 4n
Collation table generated by \fBlocaledef\fR
.RE

.sp
.ne 2
.mk
.na
\fB/usr/lib/locale/\fIlocale\fR/LC_COLLATE/coll.so\fR
.ad
.sp .6
.RS 4n
Shared object containing string transformation library routines
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.SS "/usr/bin/nl"
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWesu
.TE

.SS "/usr/xpg4/bin/nl"
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWxcu4
_
Interface StabilityStandard
.TE

.SH SEE ALSO
.sp
.LP
.BR pr (1),
.BR attributes (5),
.BR environ (5),
.BR regex (5),
.BR regexp (5),
.BR standards (5)
.SH NOTES
.sp
.LP
Internationalized Regular Expressions are used in the POSIX and "C" locales. In
other locales, Internationalized Regular Expressions are used if the following
two conditions are met:
.RS +4
.TP
.ie t \(bu
.el o
\fB/usr/lib/locale/\fIlocale\fR/LC_COLLATE/CollTable\fR is present.
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fB/usr/lib/locale/\fIlocale\fR/LC_COLLATE/coll.so\fR is not present.
.RE
.sp
.LP
Otherwise, Simple Regular Expressions are used.
.sp
.LP
Internationalized Regular Expressions are explained on
.BR regex (5).
Simple
Regular Expressions are explained on
.BR regexp (5).
