usr/src/man/man1/passwd.1
'\" te
.\" Copyright 1989 AT&T
.\" Copyright (c) 2009, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH passwd 1 "25 Feb 2009" "SunOS 5.11" "User Commands"
.SH NAME
passwd \- change login password and password attributes
.SH SYNOPSIS
.LP
.nf
\fBpasswd\fR [\fB-r\fR files | \fB-r\fR ldap | \fB-r\fR nis | \fB-r\fR nisplus] [\fIname\fR]
.fi

.LP
.nf
\fBpasswd\fR [\fB-r\fR files] [\fB-egh\fR] [\fIname\fR]
.fi

.LP
.nf
\fBpasswd\fR [\fB-r\fR files] \fB-s\fR [\fB-a\fR]
.fi

.LP
.nf
\fBpasswd\fR [\fB-r\fR files] \fB-s\fR [\fIname\fR]
.fi

.LP
.nf
\fBpasswd\fR [\fB-r\fR files] [\fB-d\fR | \fB-l\fR | \fB-u\fR | \fB-N\fR] [\fB-f\fR] [\fB-n\fR \fImin\fR]
     [\fB-w\fR \fIwarn\fR] [\fB-x\fR \fImax\fR] \fIname\fR
.fi

.LP
.nf
\fBpasswd\fR \fB-r\fR ldap [\fB-egh\fR] [\fIname\fR]
.fi

.LP
.nf
\fBpasswd\fR [\fB-r\fR ldap ] \fB-s\fR [\fB-a\fR]
.fi

.LP
.nf
\fBpasswd\fR [\fB-r\fR ldap ] \fB-s\fR [\fIname\fR]
.fi

.LP
.nf
\fBpasswd\fR \fB-r\fR ldap [\fB-d | -l | -u | -N\fR] [\fB-f\fR] [\fB-n\fR \fImin\fR] [\fB-w\fR \fIwarn\fR] [\fB-x\fR \fImax\fR] \fIname\fR
.fi

.LP
.nf
\fBpasswd\fR \fB-r\fR nis [\fB-egh\fR] [\fIname\fR]
.fi

.LP
.nf
\fBpasswd\fR \fB-r\fR nisplus [\fB-egh\fR] [\fB-D\fR \fIdomainname\fR] [\fIname\fR]
.fi

.LP
.nf
\fBpasswd\fR \fB-r\fR nisplus \fB-s\fR [\fB-a\fR]
.fi

.LP
.nf
\fBpasswd\fR \fB-r\fR nisplus [\fB-D\fR \fIdomainname\fR] \fB-s\fR [\fIname\fR]
.fi

.LP
.nf
\fBpasswd\fR \fB-r\fR nisplus [\fB-l\fR | \fB-u\fR | \fB-N\fR] [\fB-f\fR] [\fB-n\fR \fImin\fR] [\fB-w\fR \fIwarn\fR]
     [\fB-x\fR \fImax\fR] [\fB-D\fR \fIdomainname\fR] \fIname\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B passwd
command changes the password or lists password attributes
associated with the user's login
.IR name .
Additionally, privileged users
can use
.B passwd
to install or change passwords and attributes
associated with any login
.IR name .
.sp
.LP
When used to change a password,
.B passwd
prompts everyone for their old
password, if any. It then prompts for the new password twice. When the old
password is entered,
.B passwd
checks to see if it has aged sufficiently.
If
.B aging
is insufficient,
.B passwd
terminates; see
.BR pwconv (1M),
.BR nistbladm (1),
and
.BR shadow (4)
for additional
information.
.sp
.LP
The
.B pwconv
command creates and updates
.B /etc/shadow
with
information from
.BR /etc/passwd .
.B pwconv
relies on a special value
of
.B x
in the password field of
.BR /etc/passwd .
This value of
\fBx\fRindicates that the password for the user is already in
.B /etc/shadow
and should not be modified.
.sp
.LP
If aging is sufficient, a check is made to ensure that the new password
meets construction requirements. When the new password is entered a second
time, the two copies of the new password are compared. If the two copies are
not identical, the cycle of prompting for the new password is repeated for,
at most, two more times.
.sp
.LP
Passwords must be constructed to meet the following requirements:
.RS +4
.TP
.ie t \(bu
.el o
Each password must have
.B PASSLENGTH
.RB "characters, where" " PASSLENGTH"
is defined in
.B /etc/default/passwd
and is set to
.BR 6 .
Setting
.B PASSLENGTH
to more than eight characters requires configuring
.BR policy.conf (4)
with an algorithm that supports greater than eight
characters.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Each password must meet the configured complexity constraints specified in
.BR /etc/default/passwd .
.RE
.RS +4
.TP
.ie t \(bu
.el o
Each password must not be a member of the configured dictionary as
specified in
.BR /etc/default/passwd .
.RE
.RS +4
.TP
.ie t \(bu
.el o
For accounts in name services which support password history checking, if
prior password history is defined, new passwords must not be contained in
the prior password history.
.RE
.sp
.LP
If all requirements are met, by default, the
.B passwd
command consults
.B /etc/nsswitch.conf
to determine in which repositories to perform
password update. It searches the
.B passwd
and
.BR passwd_compat
entries. The sources (repositories) associated with these entries are
updated. However, the password update configurations supported are limited
to the following cases. Failure to comply with the configurations prevents
users from logging onto the system. The password update configurations
are:
.RS +4
.TP
.ie t \(bu
.el o
.B passwd: files
.RE
.RS +4
.TP
.ie t \(bu
.el o
.B passwd: files ldap
.RE
.RS +4
.TP
.ie t \(bu
.el o
.B passwd: files nis
.RE
.RS +4
.TP
.ie t \(bu
.el o
.B passwd: files nisplus
.RE
.RS +4
.TP
.ie t \(bu
.el o
.B passwd: compat
(==> files nis)
.RE
.RS +4
.TP
.ie t \(bu
.el o
.B passwd: compat
(==> files ldap)
.sp
.B passwd_compat: ldap
.RE
.RS +4
.TP
.ie t \(bu
.el o
.B passwd: compat
(==> files nisplus)
.sp
.B passwd_compat: nisplus
.RE
.sp
.LP
You can add the
.B ad
keyword to any of the
.B passwd
configurations
in the above list. However, you cannot use the
.B passwd
command to
change the password of an Active Directory (AD) user. If the \fBad\fR
keyword is found in the
.B passwd
entry during a password update
operation, it is ignored. To update the password of an AD user, use the
.BR kpasswd (1)
command.
.sp
.LP
Network administrators, who own the NIS+ password table, can change any
password attributes. The administrator configured for updating LDAP shadow
information can also change any password attributes. See
.BR ldapclient (1M).
.sp
.LP
When a user has a password stored in one of the name services as well as a
local
.B files
entry, the
.B passwd
command updates both. It is
possible to have different passwords in the name service and local files
entry. Use
.B "passwd -r"
to change a specific password repository.

.sp
.LP
In the
.B files
case, super-users (for instance, real and effective uid
equal to
.BR 0 ,
see
.BR id "(1M) and"
.BR su (1M))
can change any
password. Hence,
.B passwd
does not prompt privileged users for the old
password. Privileged users are not forced to comply with password aging and
password construction requirements. A privileged user can create a null
password by entering a carriage return in response to the prompt for a new
password. (This differs from
.B "passwd -d"
because the
.B password
prompt is still displayed.) If NIS is in effect, superuser on
the root master can change any password without being prompted for the old
NIS
.BR passwd ,
and is not forced to comply with password construction
requirements.
.sp
.LP
If LDAP is in effect, superuser on any Native LDAP client system can change
any password without being prompted for the old LDAP passwd, and is not
forced to comply with password construction requirements.
.sp
.LP
Normally,
.B passwd
entered with no arguments changes the password of
the current user. When a user logs in and then invokes
.BR su (1M)
to
become superuser or another user,
.B passwd
changes the original user's
password, not the password of the superuser or the new user.
.sp
.LP
Any user can use the
.B -s
option to show password attributes for his or
her own login
.IR name ,
provided they are using the
.BR "-r nisplus"
argument. Otherwise, the
.B -s
argument is restricted to the superuser.
.sp
.LP
The format of the display is:
.sp
.in +2
.nf
\fIname status mm/dd/yy min max warn\fR
.fi
.in -2
.sp

.sp
.LP
or, if password aging information is not present,
.sp
.in +2
.nf
\fIname status\fR
.fi
.in -2
.sp

.sp
.LP
where
.sp
.ne 2
.mk
.na
.I name
.ad
.RS 12n
.rt
The login
.B ID
of the user.
.RE

.sp
.ne 2
.mk
.na
.I status
.ad
.RS 12n
.rt
The password status of
.IR name .
.sp
The
.I status
field can take the following values:
.sp
.ne 2
.mk
.na
.B LK
.ad
.RS 6n
.rt
This account is
.B locked
account. See Security.
.RE

.sp
.ne 2
.mk
.na
.B NL
.ad
.RS 6n
.rt
This account is a
.B "no login"
account. See
.BR Security .
.RE

.sp
.ne 2
.mk
.na
.B NP
.ad
.RS 6n
.rt
This account has no password and is therefore open without
authentication.
.RE

.sp
.ne 2
.mk
.na
.B PS
.ad
.RS 6n
.rt
This account has a password.
.RE

.RE

.sp
.ne 2
.mk
.na
.I mm/dd/yy
.ad
.RS 12n
.rt
The date password was last changed for
.IR name .
All password aging dates
are determined using Greenwich Mean Time (Universal Time) and therefore can
differ by as much as a day in other time zones.
.RE

.sp
.ne 2
.mk
.na
.I min
.ad
.RS 12n
.rt
The minimum number of days required between password changes for
.IR name .
.B MINWEEKS
is found in
.B /etc/default/passwd
and is set
to
.BR NULL .
.RE

.sp
.ne 2
.mk
.na
.I max
.ad
.RS 12n
.rt
The maximum number of days the password is valid for
.IR name .
.B MAXWEEKS
is found in
.B /etc/default/passwd
and is set to
.BR NULL .
.RE

.sp
.ne 2
.mk
.na
.I warn
.ad
.RS 12n
.rt
The number of days relative to
.I max
before the password expires and
the
.I name
are warned.
.RE

.SS "Security"
.sp
.LP
.B passwd
uses \fBpam\fR(3PAM) for password change. It calls PAM with a
service name
.B passwd
and uses service module type
.B auth
for
authentication and password for password change.
.sp
.LP
Locking an account (\fB-l\fR option) does not allow its use for password
based login or delayed execution (such as
.BR at (1),
.BR batch (1),
or
.BR cron (1M)).
The
.B -N
option can be used to disallow password based
login, while continuing to allow delayed execution.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -a
.ad
.RS 17n
.rt
Shows password attributes for all entries. Use only with the \fB-s\fR
option.
.I name
must not be provided. For the
.B nisplus
repository,
this shows only the entries in the NIS+ password table in the local domain
that the invoker is authorized to read. For the \fBfiles\fR and \fBldap\fR
repositories, this is restricted to the superuser.
.RE

.sp
.ne 2
.mk
.na
.B -D
.I domainname
.ad
.RS 17n
.rt
Consults the
.B passwd.org_dir
table in
.BR domainname .
If this option
is not specified, the default
.B domainname
returned by
.BR nis_local_directory (3NSL)
are used. This domain name is the same as
that returned by
.BR domainname (1M).
.RE

.sp
.ne 2
.mk
.na
.B -e
.ad
.RS 17n
.rt
Changes the login shell. For the
.B files
repository, this only works
for the superuser. Normal users can change the
.BR ldap ,
.BR nis ,
or
.B nisplus
repositories. The choice of shell is limited by the
requirements of \fBgetusershell\fR(3C). If the user currently has a shell
that is not allowed by
.BR getusershell ,
only root can change it.
.RE

.sp
.ne 2
.mk
.na
.B -g
.ad
.RS 17n
.rt
Changes the gecos (finger) information. For the
.B files
repository,
this only works for the superuser. Normal users can change the
.BR ldap ,
.BR nis ,
or
.B nisplus
repositories.
.RE

.sp
.ne 2
.mk
.na
.B -h
.ad
.RS 17n
.rt
Changes the home directory.
.RE

.sp
.ne 2
.mk
.na
.B -r
.ad
.RS 17n
.rt
Specifies the repository to which an operation is applied. The supported
repositories are
.BR files ,
.BR ldap ,
.BR nis ,
or
.BR nisplus .
.RE

.sp
.ne 2
.mk
.na
.B -s
.I name
.ad
.RS 17n
.rt
Shows password attributes for the login
.IR name .
For the
.BR nisplus
repository, this works for everyone. However for the
.B files
and
.B ldap
repositories, this only works for the superuser. It does not work
at all for the
.B nis
repository which does not support password aging.
.sp
The output of this option, and only this option is Stable and parsable. The
format is
.I username
followed by white space followed by one of the
following codes.
.sp
New codes might be added in the future so code that parses this must be
flexible in the face of unknown codes. While all existing codes are two
characters in length that might not always be the case.
.sp
The following are the current status codes:
.sp
.ne 2
.mk
.na
.B LK
.ad
.RS 6n
.rt
Account is locked for UNIX authenitcation.
.B "passwd -l"
was run or the
authentication failed
.B RETRIES
times.
.RE

.sp
.ne 2
.mk
.na
.B NL
.ad
.RS 6n
.rt
The account is a no login account.
.B "passwd -N"
has been run.
.RE

.sp
.ne 2
.mk
.na
.B NP
.ad
.RS 6n
.rt
Account has no password.
.B "passwd -d"
was run.
.RE

.sp
.ne 2
.mk
.na
.B PS
.ad
.RS 6n
.rt
The account probably has a valid password.
.RE

.sp
.ne 2
.mk
.na
.B UN
.ad
.RS 6n
.rt
The data in the password field is unknown. It is not a recognizable hashed
password or any of the above entries. See \fBcrypt\fR(3C) for valid password
hashes.
.RE

.RE

.SS "Privileged User Options"
.sp
.LP
Only a privileged user can use the following options:
.sp
.ne 2
.mk
.na
.B -d
.ad
.RS 11n
.rt
Deletes password for
.I name
and unlocks the account. The login
.I name
is not prompted for password. It is only applicable to the
.B files
and
.B ldap
repositories.
.sp
If the
.BR login (1)
option
.B PASSREQ=YES
is configured, the account
is not able to login.
.B PASSREQ=YES
is the delivered default.
.RE

.sp
.ne 2
.mk
.na
.B -f
.ad
.RS 11n
.rt
Forces the user to change password at the next login by expiring the
password for
.IR name .
.RE

.sp
.ne 2
.mk
.na
.B -l
.ad
.RS 11n
.rt
Locks password entry for
.IR name .
See the
.B -d
or
.B -u
option
for unlocking the account.
.RE

.sp
.ne 2
.mk
.na
.B -N
.ad
.RS 11n
.rt
Makes the password entry for name a value that cannot be used for login,
but does not lock the account. See the
.B -d
option for removing the
value, or to set a password to allow logins.
.RE

.sp
.ne 2
.mk
.na
.B -n
.I min
.ad
.RS 11n
.rt
Sets minimum field for
.IR name .
The
.I min
field contains the minimum
number of days between password changes for
.IR name .
If
.I min
is
greater than
.IR max ,
the user can not change the password. Always use
this option with the
.B -x
option, unless
.I max
is set to \fB\(mi1\fR
(aging turned off). In that case,
.I min
need not be set.
.RE

.sp
.ne 2
.mk
.na
.B -u
.ad
.RS 11n
.rt
Unlocks a locked password for entry name. See the
.B -d
option for
removing the locked password, or to set a password to allow logins.
.RE

.sp
.ne 2
.mk
.na
.B -w
.I warn
.ad
.RS 11n
.rt
Sets warn field for
.IR name .
The
.I warn
field contains the number of
days before the password expires and the user is warned. This option is not
valid if password aging is disabled.
.RE

.sp
.ne 2
.mk
.na
.B -x
.I max
.ad
.RS 11n
.rt
Sets maximum field for
.IR name .
The
.I max
field contains the number
of days that the password is valid for
.IR name .
The aging for
.IR name
is turned off immediately if
.I max
is set to \fB\(mi1\fR\&.
.RE

.SH OPERANDS
.sp
.LP
The following operand is supported:
.sp
.ne 2
.mk
.na
.I name
.ad
.RS 8n
.rt
User login name.
.RE

.SH ENVIRONMENT VARIABLES
.sp
.LP
If any of the
.B LC_*
variables, that is,
.BR LC_CTYPE ,
.BR LC_MESSAGES ,
.BR LC_TIME ,
.BR LC_COLLATE ,
.BR LC_NUMERIC ,
and
.B LC_MONETARY
(see
.BR environ (5)),
are not set in the environment,
the operational behavior of
.B passwd
for each corresponding locale
category is determined by the value of the
.B LANG
environment variable.
If
.B LC_ALL
is set, its contents are used to override both the
.B LANG
and the other
.B LC_*
variables. If none of the above
variables is set in the environment, the
.B C
(U.S. style) locale
determines how
.B passwd
behaves.
.sp
.ne 2
.mk
.na
.B LC_CTYPE
.ad
.RS 15n
.rt
Determines how
.B passwd
handles characters. When
.B LC_CTYPE
is set
to a valid value,
.B passwd
can display and handle text and filenames
containing valid characters for that locale.
.B passwd
can display and
handle Extended Unix Code (\fBEUC\fR) characters where any individual
character can be 1, 2, or 3 bytes wide.
.B passwd
can also handle
.B EUC
characters of 1, 2, or more column widths. In the
.B C
locale,
only characters from ISO 8859-1 are valid.
.RE

.sp
.ne 2
.mk
.na
.B LC_MESSAGES
.ad
.RS 15n
.rt
Determines how diagnostic and informative messages are presented. This
includes the language and style of the messages, and the correct form of
affirmative and negative responses. In the
.B C
locale, the messages are
presented in the default form found in the program itself (in most cases,
U.S. English).
.RE

.SH EXIT STATUS
.sp
.LP
The
.B passwd
command exits with one of the following values:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 6n
.rt
Success.
.RE

.sp
.ne 2
.mk
.na
.B 1
.ad
.RS 6n
.rt
Permission denied.
.RE

.sp
.ne 2
.mk
.na
.B 2
.ad
.RS 6n
.rt
Invalid combination of options.
.RE

.sp
.ne 2
.mk
.na
.B 3
.ad
.RS 6n
.rt
Unexpected failure. Password file unchanged.
.RE

.sp
.ne 2
.mk
.na
.B 4
.ad
.RS 6n
.rt
Unexpected failure. Password file(s) missing.
.RE

.sp
.ne 2
.mk
.na
.B 5
.ad
.RS 6n
.rt
Password file(s) busy. Try again later.
.RE

.sp
.ne 2
.mk
.na
.B 6
.ad
.RS 6n
.rt
Invalid argument to option.
.RE

.sp
.ne 2
.mk
.na
.B 7
.ad
.RS 6n
.rt
Aging option is disabled.
.RE

.sp
.ne 2
.mk
.na
.B 8
.ad
.RS 6n
.rt
No memory.
.RE

.sp
.ne 2
.mk
.na
.B 9
.ad
.RS 6n
.rt
System error.
.RE

.sp
.ne 2
.mk
.na
.B 10
.ad
.RS 6n
.rt
Account expired.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/default/passwd
.ad
.RS 23n
.rt
Default values can be set for the following flags in
.BR /etc/default/passwd .
For example:
.B MAXWEEKS=26
.sp
.ne 2
.mk
.na
.B DICTIONDBDIR
.ad
.RS 16n
.rt
The directory where the generated dictionary databases reside. Defaults to
.BR /var/passwd .
.sp
If neither
.B DICTIONLIST
nor
.B DICTIONDBDIR
is specified, the
system does not perform a dictionary check.
.RE

.sp
.ne 2
.mk
.na
.B DICTIONLIST
.ad
.RS 16n
.rt
DICTIONLIST can contain list of comma separated dictionary files such as
\fBDICTIONLIST=\fIfile1\fR, \fIfile2\fR,
.IR file3 .
Each dictionary
file contains multiple lines and each line consists of a word and a NEWLINE
character (similar to
.BR /usr/share/lib/dict/words .)
You must specify
full pathnames. The words from these files are merged into a database that
is used to determine whether a password is based on a dictionary word.
.sp
If neither
.B DICTIONLIST
nor
.B DICTIONDBDIR
is specified, the
system does not perform a dictionary check.
.sp
To pre-build the dictionary database, see
.BR mkpwdict (1M).
.RE

.sp
.ne 2
.mk
.na
.B HISTORY
.ad
.RS 16n
.rt
Maximum number of prior password history to keep for a user. Setting the
.B HISTORY
value to zero
.RB ( 0 ),
or removing the flag, causes the
prior password history of all users to be discarded at the next password
change by any user. The default is not to define the
.B HISTORY
flag. The
maximum value is
.B 26.
Currently, this functionality is enforced only
for user accounts defined in the
.B files
name service (local
\fBpasswd\fR(4)/\fBshadow\fR(4)).
.RE

.sp
.ne 2
.mk
.na
.B MAXREPEATS
.ad
.RS 16n
.rt
Maximum number of allowable consecutive repeating characters. If
.B MAXREPEATS
is not set or is zero
.RB ( 0 ),
the default is no checks
.RE

.sp
.ne 2
.mk
.na
.B MAXWEEKS
.ad
.RS 16n
.rt
Maximum time period that password is valid.
.RE

.sp
.ne 2
.mk
.na
.B MINALPHA
.ad
.RS 16n
.rt
Minimum number of alpha character required. If
.B MINALPHA
is not set,
the default is
.BR 2 .
.RE

.sp
.ne 2
.mk
.na
.B MINDIFF
.ad
.RS 16n
.rt
Minimum differences required between an old and a new password. If
.B MINDIFF
is not set, the default is
.BR 3 .
.RE

.sp
.ne 2
.mk
.na
.B MINDIGIT
.ad
.RS 16n
.rt
Minimum number of digits required. If
.B MINDIGIT
is not set or is set
to zero
.RB ( 0 ),
the default is no checks. You cannot be specify
.B MINDIGIT
if
.B MINNONALPHA
is also specified.
.RE

.sp
.ne 2
.mk
.na
.B MINLOWER
.ad
.RS 16n
.rt
Minimum number of lower case letters required. If not set or zero (0), the
default is no checks.
.RE

.sp
.ne 2
.mk
.na
.B MINNONALPHA
.ad
.RS 16n
.rt
Minimum number of non-alpha (including numeric and special) required. If
.B MINNONALPHA
is not set, the default is
.BR 1 .
You cannot specify
.B MINNONALPHA
if
.B MINDIGIT
or
.B MINSPECIAL
is also specified.
.RE

.sp
.ne 2
.mk
.na
.B MINWEEKS
.ad
.RS 16n
.rt
Minimum time period before the password can be changed.
.RE

.sp
.ne 2
.mk
.na
.B MINSPECIAL
.ad
.RS 16n
.rt
Minimum number of special (non-alpha and non-digit) characters required. If
.B MINSPECIAL
is not set or is zero
.RB ( 0 ),
the default is no checks.
You cannot specify
.B MINSPECIAL
if you also specify
.BR MINNONALPHA .
.RE

.sp
.ne 2
.mk
.na
.B MINUPPER
.ad
.RS 16n
.rt
Minimum number of upper case letters required. If
.B MINUPPER
is not set
or is zero
.RB ( 0 ),
the default is no checks.
.RE

.sp
.ne 2
.mk
.na
.B NAMECHECK
.ad
.RS 16n
.rt
Enable/disable checking or the login name. The default is to do login name
checking. A case insensitive value of
.B no
disables this feature.
.RE

.sp
.ne 2
.mk
.na
.B PASSLENGTH
.ad
.RS 16n
.rt
Minimum length of password, in characters.
.RE

.sp
.ne 2
.mk
.na
.B WARNWEEKS
.ad
.RS 16n
.rt
Time period until warning of date of password's ensuing expiration.
.RE

.sp
.ne 2
.mk
.na
.B WHITESPACE
.ad
.RS 16n
.rt
Determine if white space characters are allowed in passwords. Valid values
are
.B YES
and
.BR NO .
If
.B WHITESPACE
is not set or is set to
.BR YES ,
white space characters are allowed.
.RE

.RE

.sp
.ne 2
.mk
.na
.B /etc/oshadow
.ad
.RS 23n
.rt
Temporary file used by
.BR passwd ,
.B passmgmt
and
.B pwconv
to
update the real shadow file.
.RE

.sp
.ne 2
.mk
.na
.B /etc/passwd
.ad
.RS 23n
.rt
Password file.
.RE

.sp
.ne 2
.mk
.na
.B /etc/shadow
.ad
.RS 23n
.rt
Shadow password file.
.RE

.sp
.ne 2
.mk
.na
.B /etc/shells
.ad
.RS 23n
.rt
Shell database.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
_
CSIEnabled
_
Interface StabilitySee below.
.TE

.sp
.LP
The human readable output is Uncommitted. The options are Committed.
.SH SEE ALSO
.sp
.LP
.BR at (1),
.BR batch (1),
.BR finger (1),
.BR kpasswd (1),
.BR login (1),
.BR nistbladm (1),
.BR cron (1M),
.BR domainname (1M),
.BR eeprom (1M),
.BR id (1M),
.BR ldapclient (1M),
.BR mkpwdict (1M),
.BR passmgmt (1M),
.BR pwconv (1M),
.BR su (1M),
.BR useradd (1M),
.BR userdel (1M),
.BR usermod (1M),
.BR crypt (3C),
.BR getpwnam (3C),
.BR getspnam (3C),
.BR getusershell (3C),
.BR nis_local_directory (3NSL),
.BR pam (3PAM),
.BR loginlog (4),
.BR nsswitch.conf (4),
.BR pam.conf (4),
.BR passwd (4),
.BR policy.conf (4),
.BR shadow (4),
.BR shells (4),
.BR attributes (5),
.BR environ (5),
.BR pam_authtok_check (5),
.BR pam_authtok_get (5),
.BR pam_authtok_store (5),
.BR pam_dhkeys (5),
.BR pam_ldap (5),
.BR pam_unix_account (5),
.BR pam_unix_auth (5),
.BR pam_unix_session (5)
.SH NOTES
.sp
.LP
The
.BR pam_unix (5)
module is no longer supported. Similar functionality
is provided by
.BR pam_unix_account (5),
.BR pam_unix_auth (5),
.BR pam_unix_session (5),
.BR pam_authtok_check (5),
.BR pam_authtok_get (5),
.BR pam_authtok_store (5),
.BR pam_dhkeys (5),
and
.BR pam_passwd_auth (5).
.sp
.LP
The
.B nispasswd
and
.B ypasswd
commands are wrappers around
.BR passwd .
Use of
.B nispasswd
and
.B ypasswd
is discouraged. Use
.B "passwd -r"
.I repository_name
instead.
.sp
.LP
NIS+ might not be supported in future releases of the Solaris operating
system. Tools to aid the migration from NIS+ to LDAP are available in the
current Solaris release. For more information, visit
http://www.sun.com/directory/nisplus/transition.html.
.sp
.LP
Changing a password in the
.B files
and
.B ldap
repositories clears
the failed login count.
.sp
.LP
Changing a password reactivates an account deactivated for inactivity for
the length of the inactivity period.
.sp
.LP
Input terminal processing might interpret some key sequences and not pass
them to the
.B passwd
command.
.sp
.LP
An account with no password, status code
.BR NP ,
might not be able to
login. See the
.BR login (1)
.B PASSREQ
option.
