usr/src/man/man1/pkginfo.1
'\" te
.\" Copyright 1989 AT&T  Copyright (c) 2007 Sun Microsystems, Inc.  All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH pkginfo 1 "30 Oct 2007" "SunOS 5.11" "User Commands"
.SH NAME
pkginfo \- display software package information
.SH SYNOPSIS
.LP
.nf
\fBpkginfo\fR [\fB-q\fR | \fB-x\fR | \fB-l\fR] [\fB-p\fR | \fB-i\fR] [\fB-r\fR] [\fB-a\fR \fIarch\fR]
     [\fB-v\fR \fIversion\fR] [\fB-c\fR \fIcategory\fR].\|.\|. [\fIpkginst\fR].\|.\|.
.fi

.LP
.nf
\fBpkginfo\fR [\fB-d\fR \fIdevice\fR] [\fB-R\fR \fIroot_path\fR] [\fB-q\fR | \fB-x\fR | \fB-l\fR] [\fB-a\fR \fIarch\fR]
     [\fB-v\fR \fIversion\fR] [\fB-c\fR \fIcategory\fR].\|.\|. [\fIpkginst\fR].\|.\|.
.fi

.SH DESCRIPTION
.sp
.LP
.B pkginfo
displays information about software packages that are
installed on the system (with the first synopsis)  or that reside on a
particular device or directory (with the second synopsis).
.sp
.LP
Without options,
.B pkginfo
lists the primary category, package
instance, and the names of all completely installed and partially installed
packages. It displays one line for each package selected.
.SH OPTIONS
.sp
.LP
The
.B -p
and
.B -i
options are meaningless if used in conjunction
with the
.B -d
option.
.sp
.LP
The options
.BR -q ,
.BR -x ,
and
.B -l
are mutually exclusive.
.sp
.ne 2
.mk
.na
.B -a
.I arch
.ad
.sp .6
.RS 4n
Specify the architecture of the package as
.BR arch .
.RE

.sp
.ne 2
.mk
.na
.B -c
.I category
.ad
.sp .6
.RS 4n
Display packages that match
.IR category .
Categories are defined with
the
.B CATEGORY
parameter in the
.BR pkginfo (4)
file. If more than one
category is supplied, the  package needs to match only one category in the
list. The match is not case specific.
.RE

.sp
.ne 2
.mk
.na
.B -d
.I device
.ad
.sp .6
.RS 4n
Defines a device,
.IR device ,
on which the software resides. \fIdevice\fR
can be an absolute directory pathname or the identifiers for tape, floppy
disk, removable disk, and so forth. The special token
.B spool
may be
used to indicate the default installation spool directory
(\fB/var/spool/pkg\fR).
.RE

.sp
.ne 2
.mk
.na
.B -i
.ad
.sp .6
.RS 4n
Display information for fully installed packages only.
.RE

.sp
.ne 2
.mk
.na
.B -l
.ad
.sp .6
.RS 4n
Specify long format, which includes all available information about the
designated package(s).
.RE

.sp
.ne 2
.mk
.na
.B -p
.ad
.sp .6
.RS 4n
Display information for partially installed packages only.
.RE

.sp
.ne 2
.mk
.na
.B -q
.ad
.sp .6
.RS 4n
Do not list any information. Used from a program to check  whether or not a
package has been installed.
.RE

.sp
.ne 2
.mk
.na
.B -r
.ad
.sp .6
.RS 4n
List the installation base for relocatable packages.
.RE

.sp
.ne 2
.mk
.na
.B -R
.I root_path
.ad
.sp .6
.RS 4n
Defines the full path name of a directory to use as the
.IR root_path .
All files, including package system information files, are relocated to a
directory tree starting in the specified
.IR root_path .
.RE

.sp
.ne 2
.mk
.na
.B -v
.I version
.ad
.sp .6
.RS 4n
Specify the version of the package as
.IR version .
The version is defined
with the
.B VERSION
parameter in the
.BR pkginfo (4)
file. All
compatible versions can be requested by preceding the version name with a
tilde (\fB\(ap\fR). Multiple white spaces are replaced with a single white
space during version comparison.
.RE

.sp
.ne 2
.mk
.na
.B -x
.ad
.sp .6
.RS 4n
Designate an extracted listing of package information. The listing contains
the package abbreviation, package name, package architecture (if available)
and package version (if available).
.RE

.SH OPERANDS
.sp
.ne 2
.mk
.na
.I pkginst
.ad
.sp .6
.RS 4n
A package designation by its instance. An instance can be the package
abbreviation or a specific instance (for example,
.B inst.1
or
.BR inst.2 ).
All instances of a package can be requested by
.BR inst.* .
The asterisk character (\fB*\fR) is a special character to some shells and
may need to be escaped. In the C-Shell, "\fB*\fR" must be surrounded by
single quotes (\fB\&'\fR) or preceded by a backslash (\e).
.RE

.SH EXIT STATUS
.sp
.ne 2
.mk
.na
.B 0
.ad
.sp .6
.RS 4n
Successful completion.
.RE

.sp
.ne 2
.mk
.na
.B >0
.ad
.sp .6
.RS 4n
An error occurred.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B /var/spool/pkg
.ad
.sp .6
.RS 4n
default installation spool directory
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.sp
.LP
.BR pkgtrans (1),
.BR pkgadd (1M),
.BR pkgask (1M),
.BR pkgchk (1M),
.BR pkgrm (1M),
.BR pkginfo (4),
.BR attributes (5),
.BR largefile (5)
.sp
.LP
\fIApplication Packaging Developer\&'s Guide\fR
.SH NOTES
.sp
.LP
Package commands are \fBlargefile\fR(5)-aware. They handle files larger
than 2 GB in the same way they handle smaller files. In their current
implementations,
.BR pkgadd (1M),
.BR pkgtrans (1)
and other package
commands can process a datastream of  up to 4 GB.
