usr/src/man/man1/pkgmk.1
'\" te
.\" Copyright 1989 AT&T
.\" Copyright (c) 2007, Sun Microsystems, Inc. All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH pkgmk 1 "30 Oct 2007" "SunOS 5.11" "User Commands"
.SH NAME
pkgmk \- produce an installable package
.SH SYNOPSIS
.LP
.nf
\fBpkgmk\fR [\fB-o\fR] [\fB-a\fR \fIarch\fR] [\fB-b\fR \fIbase_src_dir\fR] [\fB-d\fR \fIdevice\fR]
     [\fB-f\fR \fIprototype\fR] [\fB-l\fR \fIlimit\fR] [\fB-p\fR \fIpstamp\fR] [\fB-r\fR \fIroot_path\fR]
     [\fB-v\fR \fIversion\fR] [\fIvariable=value\fR].\|.\|. [\fIpkginst\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The
.B pkgmk
utility produces an installable package to be used as input
to the
.BR pkgadd "(1M) command. The package contents is in directory"
structure format.
.sp
.LP
The command uses the package
.BR prototype (4)
file as input and creates a
.BR pkgmap (4)
file. The contents for each entry in the \fBprototype\fR
file is copied to the appropriate output location. Information concerning
the contents (checksum, file size, modification date) is computed and stored
in the
.B pkgmap
file, along with attribute information specified in the
.B prototype
file.
.sp
.LP
.B pkgmk
searches for the files listed in the
.BR prototype (4)
file as
described in the following conditions.
.B Note:
If a prototype file
contains the explicit location of the file to include in the package, then
the following search explanations do not apply.
.RS +4
.TP
1.
If neither
.B -b
nor
.B -r
options are specified, the file name
component of each file path listed in the
.BR prototype (4)
file is
expected to be found in the same directory as the
.BR prototype (4)
file
.RE
.RS +4
.TP
2.
If \fB-b\fR is specified as a relative path (without a leading "\fB/\fR"),
then
.I base_src_dir
is prepended to the relative file paths from the
.BR prototype (4)
file. The resulting path is searched for in the
.I root_path
directories. If a
.I root_path
is not specified, it
defaults to "\fB/\fR".
.RE
.RS +4
.TP
3.
If \fB-b\fR is specified as an absolute path (with a leading "\fB/\fR"),
then
.I base_src_dir
is prepended to the relative paths from the
.BR prototype (4)
file and the result is the location of the file.
.I root_path
is
.B not
searched.
.RE
.RS +4
.TP
4.
If
.B -r
is specified, then full file paths are used from the
.BR prototype (4)
file. Relative paths have
.I base_src_dir
prepended.
If \fIbase_src_dir\fR is not specified, it defaults to \fB""\fR. The
resulting path is searched for in each directory of the
.IR root_path .
.RE
.sp
.LP
If you created your prototype file using \fB"pkgproto a/relative/path"\fRor
\fB"pkgproto a/relative/path=install/path"\fR, you should use the \fB-r\fR
.I root_path
option to specify the location of
.B a/relative/path
so
that
.B pkgmk
can correctly locate your source files.
.sp
.LP
Package commands, including
.BR pkgmk ,
are
.BR largefile "(5)-aware. They"
handle files larger than 2 GB in the same way they handle smaller files. In
their current implementations,
.BR pkgadd (1M),
.BR pkgtrans (1)
and other
package commands can process a datastream of  up to 4 GB.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -a
.I arch
.ad
.RS 19n
.rt
Overrides the architecture information provided in the
.BR pkginfo (4)
file with
.IR arch .
.RE

.sp
.ne 2
.mk
.na
.B -b
.I base_src_dir
.ad
.RS 19n
.rt
Prepends the indicated
.I base_src_dir
to locate relocatable objects on
the source machine. Use this option to search for all objects in the
prototype file.
.B pkgmk
expects to find the objects in
/\fIbase_src_dir\fR or to locate the objects by use of the \fB-b\fR and
.B -r
options, respectively.
.RE

.sp
.ne 2
.mk
.na
.B -d
.I device
.ad
.RS 19n
.rt
Creates the package on
.IR device .
.I device
can be an absolute
directory pathname or the identifiers for a floppy disk or removable disk
(for example,
.BR /dev/diskette ).
The default device is the installation
spool directory
.RB ( /var/spool/pkg ).
.RE

.sp
.ne 2
.mk
.na
.B -f
.I prototype
.ad
.RS 19n
.rt
Uses the file
.I prototype
as input to the command. The default
\fIprototype\fR filename is [\fBPp\fR]\fBrototype\fR.
.RE

.sp
.ne 2
.mk
.na
.B -l
.I limit
.ad
.RS 19n
.rt
Specifies the maximum size in 512 byte blocks of the output device as
.BR limit .
By default, if the output file is a directory or a mountable
device,
.B pkgmk
employs the \fBdf\fR(1M) command to dynamically
calculate the amount of available space on the output device. This option is
useful in conjunction with
.BR pkgtrans (1)
to create a package with a
datastream format.
.RE

.sp
.ne 2
.mk
.na
.B -o
.ad
.RS 19n
.rt
Overwrites the same instance; package instance is overwritten if it already
exists.
.RE

.sp
.ne 2
.mk
.na
.B -p
.I pstamp
.ad
.RS 19n
.rt
Overrides the production stamp definition in the
.BR pkginfo (4)
file with
.IR pstamp .
.RE

.sp
.ne 2
.mk
.na
.B -r
.I root_path
.ad
.RS 19n
.rt
Uses the indicated
.I root_path
with the source pathname appended to
locate objects on the source machine, using a comma (\fB,\fR) as the
separator for the path elements. If this option is specified, look for the
full destination path in each of the directories specified. If neither
.B -b
nor
.B -r
is specified, look for the leaf filename in the
current directory.
.RE

.sp
.ne 2
.mk
.na
.B -v
.I version
.ad
.RS 19n
.rt
Overrides the version information provided in the
.BR pkginfo (4)
file
with
.IR version .
.RE

.sp
.ne 2
.mk
.na
.I variable=value
.ad
.RS 19n
.rt
Places the indicated variable in the packaging environment. (See
.BR prototype (4)
for definitions of variable specifications.)
.RE

.SH OPERANDS
.sp
.LP
The following operand is supported:
.sp
.ne 2
.mk
.na
.I pkginst
.ad
.RS 11n
.rt
A package designation by its instance. An instance can be the package
abbreviation or a specific instance (for example,
.B inst.1
or
.BR inst.2 ).
All instances of a package can be requested by
.BR inst.* .
The asterisk character (\fB*\fR) is a special character to some shells and
might need to be escaped. In the C-Shell,
.B *
must be surrounded by
single quotes (\fB\&'\fR) or preceded by a backslash (\e).
.RE

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 6n
.rt
Successful completion.
.RE

.sp
.ne 2
.mk
.na
.B >0
.ad
.RS 6n
.rt
An error occurred.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.sp
.LP
.BR pkgparam (1),
.BR pkgproto (1),
.BR pkgtrans (1),
.BR uname (1),
.BR df (1M),
.BR pkgadd (1M),
.BR pkginfo (4),
.BR pkgmap (4),
.BR prototype (4),
.BR attributes (5),
.BR largefile (5)
.sp
.LP
\fIApplication Packaging Developer\&'s Guide\fR
.SH NOTES
.sp
.LP
Architecture information is provided on the command line with the
.BR -a
option or in the
.BR prototype (4)
file. If no architecture information is
supplied,
.B pkgmk
uses the output of
.B "uname -m"
(see
.BR uname (1)).
.sp
.LP
Version information is provided on the command line with the
.BR -v
option or in the
.BR pkginfo (4)
file. If no version information is
supplied, a default based on the current date is provided.
.sp
.LP
Command line definitions for both architecture and version override the
.BR prototype (4)
definitions.
.sp
.LP
.B pkgmk
fails if one of the following invalid combinations of
zone-related parameters is used:
.RS +4
.TP
1.
Both
.B SUNW_PKG_ALLZONES
and
.B SUNW_PKG_THISZONE
are set to
.BR TRUE .
.RE
.RS +4
.TP
2.
.B SUNW_PKG_HOLLOW
is set to
.B TRUE
and
.B SUNW_PKG_ALLZONES
is
set to
.BR FALSE .
.RE
.RS +4
.TP
3.
The package contains a request script and
.B SUNW_PKG_THISZONE
set to
.BR TRUE .
.RE
.sp
.LP
For additional information regarding these parameters, see
.BR pkginfo (4).
