usr/src/man/man1/pkgparam.1
'\" te
.\" Copyright 1989 AT&T  Copyright (c) 2007, Sun Microsystems, Inc.  All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH pkgparam 1 "30 Oct 2007" "SunOS 5.11" "User Commands"
.SH NAME
pkgparam \- display package parameter values
.SH SYNOPSIS
.LP
.nf
\fBpkgparam\fR [\fB-v\fR] [\fB-d\fR \fIdevice\fR] [\fB-R\fR \fIroot_path\fR] \fIpkginst\fR [\fIparam\fR]...
.fi

.LP
.nf
\fBpkgparam\fR \fB-f\fR \fIfilename\fR [\fB-v\fR] [\fIparam\fR]...
.fi

.SH DESCRIPTION
.sp
.LP
.B pkgparam
displays the value associated with the parameter or
parameters requested on the command line. The values are located in either
the
.BR pkginfo (4)
file for
.I pkginst
or from the specific file named
with the
.B -f
option.
.sp
.LP
One parameter value is shown per line. Only the value of a parameter is
given unless the
.B -v
option is used. With this option, the output of
the command is in this format:
.sp
.in +2
.nf
\fIparameter1\fB='\fIvalue1\fB\&'\fR
\fIparameter2\fB='\fIvalue2\fB\&'\fR
\fIparameter3\fB='\fIvalue3\fB\&'\fR
.fi
.in -2
.sp

.sp
.LP
If no parameters are specified on the command line, values for all
parameters associated with the package are shown.
.SH OPTIONS
.sp
.LP
Options and arguments for this command are:
.sp
.ne 2
.mk
.na
.B -d
.I device
.ad
.RS 16n
.rt
Specify the
.I device
on which a
.I pkginst
is stored. It can be a
directory pathname or the identifiers for tape, floppy disk, or removable
disk (for example,
.BR /var/tmp ,
.BR /dev/diskette ,
and
.BR /dev/dsk/c1d0s0 ).
The special token
.B spool
may be used to
represent the default installation spool directory
.RB ( /var/spool/pkg ).
.RE

.sp
.ne 2
.mk
.na
.B -f
.I filename
.ad
.RS 16n
.rt
Read
.I filename
for parameter values.
.RE

.sp
.ne 2
.mk
.na
.B -R
.I root_path
.ad
.RS 16n
.rt
Defines the full path name of a subdirectory to use as the
.IR root_path .
All files, including package system information files, are relocated to a
directory tree starting in the specified
.IR root_path .
.RE

.sp
.ne 2
.mk
.na
.B -v
.ad
.RS 16n
.rt
Verbose mode. Display name of parameter and its value.
.RE

.SH OPERANDS
.sp
.ne 2
.mk
.na
.I pkginst
.ad
.RS 11n
.rt
Defines a specific package instance for which parameter values should be
displayed.
.RE

.sp
.ne 2
.mk
.na
.I param
.ad
.RS 11n
.rt
Defines a specific parameter whose value should be displayed.
.RE

.SH ERRORS
.sp
.LP
If parameter information is not available for the indicated package, the
command exits with a non-zero status.
.SH EXIT STATUS
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 6n
.rt
Successful completion.
.RE

.sp
.ne 2
.mk
.na
.B >0
.ad
.RS 6n
.rt
An error occurred.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.sp
.LP
.BR pkgmk (1),
.BR pkgproto (1),
.BR pkgtrans (1),
.BR pkgadd (1M),
.BR pkginfo (4),
.BR attributes (5),
.BR largefile (5)
.sp
.LP
\fIApplication Packaging Developer\&'s Guide\fR
.SH NOTES
.sp
.LP
With the
.B -f
option, you can specify the file from which parameter
values should be extracted. This file should be in the same  format as a
.BR pkginfo (4)
file. For example, such a file might be created during
package development and used while testing software during this stage.
.sp
.LP
Package commands are \fBlargefile\fR(5)-aware. They handle files larger
than 2 GB in the same way they handle smaller files. In their current
implementations,
.BR pkgadd (1M),
.BR pkgtrans (1)
and other package
commands can process a datastream of  up to 4 GB.
