usr/src/man/man1/pkgproto.1
'\" te
.\" Copyright 1989 AT&T  Copyright (c) 2007, Sun Microsystems, Inc.  All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH pkgproto 1 "30 Oct 2007" "SunOS 5.11" "User Commands"
.SH NAME
pkgproto \- generate prototype file entries for input to pkgmk command
.SH SYNOPSIS
.LP
.nf
\fBpkgproto\fR [\fB-i\fR] [\fB-c\fR \fIclass\fR] [\fIpath1\fR]
.fi

.LP
.nf
\fBpkgproto\fR [\fB-i\fR] [\fB-c\fR \fIclass\fR] [\fIpath1=path2\fR]...
.fi

.SH DESCRIPTION
.sp
.LP
.B pkgproto
scans the indicated paths and generates
.BR prototype (4)
file entries that may be used as input to the
.BR pkgmk (1)
command.
.sp
.LP
If no paths are specified on the command line, standard input is assumed to
be a list of paths. If the pathname listed on the command line is a
directory, the contents of the directory is searched. However, if input is
read from
.BR stdin ,
a directory specified as a pathname will not be
searched.
.sp
.LP
Package commands, such as
.BR pkgproto ,
are
.BR largefile (5)-aware.
They handle files larger than 2 GB in the same way they handle smaller
files. In their current implementations,
.BR pkgadd (1M),
.BR pkgtrans (1)
and other package commands can process a datastream of  up to 4 GB.
.SH OPTIONS
.sp
.ne 2
.mk
.na
.B -i
.ad
.RS 12n
.rt
Ignores symbolic links and records the paths as \fBftype\fR=\fBf\fR (a
file) versus \fBftype\fR=\fBs\fR (symbolic link).
.RE

.sp
.ne 2
.mk
.na
.B -c
.I class
.ad
.RS 12n
.rt
Maps the class of all paths to
.IR class .
.RE

.SH OPERANDS
.sp
.ne 2
.mk
.na
.I path1
.ad
.RS 9n
.rt
Pathname where objects are located.
.RE

.sp
.ne 2
.mk
.na
.I path2
.ad
.RS 9n
.rt
Pathname which should be substituted on output for
.IR path1 .
.RE

.SH EXAMPLES
.LP
.B Example 1
Basic Usage
.sp
.LP
The following example shows a common usage of
.B pkgproto
and a partial
listing of the output produced.

.sp
.in +2
.nf
\fBexample%\fR \fBpkgproto\fR /bin=bin /usr/bin=usrbin /etc=etc
f none bin/sed=/bin/sed 0775 bin bin
f none bin/sh=/bin/sh 0755 bin daemon
f none bin/sort=/bin/sort 0755 bin bin
f none usrbin/sdb=/usr/bin/sdb 0775 bin bin
f none usrbin/shl=/usr/bin/shl 4755 bin bin
d none etc/master.d 0755 root daemon
f none etc/master.d/kernel=/etc/master.d/kernel 0644 root daemon
f none etc/rc=/etc/rc 0744 root daemon
.fi
.in -2
.sp

.LP
.B Example 2
Using
.B pkgproto
in a Pipeline
.sp
.LP
The following command shows
.B pkgproto
accepting the output of the
.B find
command.

.sp
.in +2
.nf
\fBexample% find /\fR \fB-type\fR d \fB-print\fR | pkgproto
d none / 755 root root
d none /bin 755 bin bin
d none /usr 755 root root
d none /usr/bin 775 bin bin
d none /etc 755 root root
d none /tmp 777 root root
.fi
.in -2
.sp

.SH EXIT STATUS
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 6n
.rt
Successful completion.
.RE

.sp
.ne 2
.mk
.na
.B >0
.ad
.RS 6n
.rt
An error occurred.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.sp
.LP
.BR pkgmk (1),
.BR pkgparam (1),
.BR pkgtrans (1),
.BR pkgadd (1M),
.BR prototype (4),
.BR attributes (5),
.BR largefile (5)
.sp
.LP
\fIApplication Packaging Developer\&'s Guide\fR
.SH NOTES
.sp
.LP
By default,
.B pkgproto
creates symbolic link entries for any symbolic
link encountered (\fBftype\fR=\fBs\fR). When you use the
.B -i
option,
.B pkgproto
creates a file entry for symbolic links
(\fBftype\fR=\fBf\fR). The
.BR prototype (4)
file would have to be edited
to assign such file types as
.B v
(volatile),
.B e
(editable), or
.B x
(exclusive directory).
.B pkgproto
detects linked files. If
multiple files are linked together, the first path encountered is considered
the source of the link.
.sp
.LP
By default,
.B pkgproto
prints prototype entries on the standard output.
However, the output should be saved in a file (named
.B Prototype
or
.BR prototype ,
for convenience) to be used as input to the
.BR pkgmk (1)
command.
