usr/src/man/man1/pkgtrans.1
'\" te
.\" Copyright 1989 AT&T
.\" Copyright (c) 2007, Sun Microsystems, Inc.  All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH pkgtrans 1 "30 Oct 2007" "SunOS 5.11" "User Commands"
.SH NAME
pkgtrans \- translate package format
.SH SYNOPSIS
.LP
.nf
\fBpkgtrans\fR [\fB-inosg\fR] [\fB-k\fR \fIkeystore\fR] [\fB-a\fR \fIalias\fR] [\fB-P\fR \fIpasswd\fR] \fIdevice1\fR \fIdevice2\fR
     [\fIpkginst\fR]...
.fi

.SH DESCRIPTION
.sp
.LP
The
.B pkgtrans
utility translates an installable package from one
format to another. It translates:
.RS +4
.TP
.ie t \(bu
.el o
a file system format to a datastream
.RE
.RS +4
.TP
.ie t \(bu
.el o
a file system format to a signed datastream
.RE
.RS +4
.TP
.ie t \(bu
.el o
a datastream to a file system format
.RE
.RS +4
.TP
.ie t \(bu
.el o
one file system format to another file system format
.RE
.SH OPTIONS
.sp
.LP
The options and arguments for this command are:
.sp
.ne 2
.mk
.na
\fB-a\fR \fIalias\fR
.ad
.RS 15n
.rt
Use public key certificate associated with friendlyName alias, and the
corresponding private key. See
.B "KEYSTORE LOCATIONS"
and \fBKEYSTORE AND
CERTIFICATE FORMATS\fR in \fBpkgadd\fR(1M) for more information.
.RE

.sp
.ne 2
.mk
.na
.B -g
.ad
.RS 15n
.rt
Sign resulting datastream.
.RE

.sp
.ne 2
.mk
.na
.B -i
.ad
.RS 15n
.rt
Copies only the
.BR pkginfo (4)
and
.BR pkgmap (4)
files.
.RE

.sp
.ne 2
.mk
.na
\fB-k\fR \fIkeystore\fR
.ad
.RS 15n
.rt
Use keystore to retrieve private key used to generate signature. If it not
specified, default locations are searched to find the specified private key
specified by
.BR -a .
If no alias is given, and multiple keys exist in the
key store,
.B pkgtrans
will abort. See
.B "KEYSTORE LOCATIONS"
and
\fBKEYSTORE AND CERTIFICATE FORMATS\fR in \fBpkgadd\fR(1M) for more
information on search locations and formats.
.sp
When running as a user other than root, the default base directory for
certificate searching is
.BR ~/.pkg/security ,
where
.B ~
is the home
directory of the user invoking
.BR pkgtrans .
.RE

.sp
.ne 2
.mk
.na
.B -n
.ad
.RS 15n
.rt
Creates a new instance of the package on the destination device if any
instance of this package already exists, up to the number specified by the
\fBMAXINST\fR variable in the
.BR pkginfo (4)
file.
.RE

.sp
.ne 2
.mk
.na
.B -o
.ad
.RS 15n
.rt
Overwrites the same instance on the destination device. Package instance
will be overwritten if it already exists.
.RE

.sp
.ne 2
.mk
.na
\fB-P\fR \fIpasswd\fR
.ad
.RS 15n
.rt
Supply password used to decrypt the keystore. See \fBPASS PHRASE
ARGUMENTS\fR in \fBpkgadd\fR(1M) for details on the syntax of the argument
to this option.
.RE

.sp
.ne 2
.mk
.na
.B -s
.ad
.RS 15n
.rt
Indicates that the package should be written to
.I device2
as a
datastream rather than as a file system. The default behavior is to write a
file system format on devices that support both formats.
.RE

.SH OPERANDS
.sp
.ne 2
.mk
.na
.I device1
.ad
.RS 11n
.rt
Indicates the source device. The package or packages on this device will be
translated and placed on
.IR device2 .
See DEVICE SPECIFIERS, below.
.RE

.sp
.ne 2
.mk
.na
.I device2
.ad
.RS 11n
.rt
Indicates the destination device. Translated packages will be placed on
this device. See DEVICE SPECIFIERS, below.
.RE

.sp
.ne 2
.mk
.na
.I pkginst
.ad
.RS 11n
.rt
Specifies which package instance or instances on
.I device1
should be
translated. The token
.B all
may be used to indicate all packages.
\fBpkginst.*\fR can be used to indicate all instances of a package. If no
packages are defined, a prompt shows all packages on the device and asks
which to translate.
.sp
The asterisk character (\fB*\fR) is a special character to some shells and
may need to be escaped. In the C-Shell, the
.B *
must be surrounded by
single quotes (\fB\&'\fR) or preceded by a backslash (\fB\e\fR).
.RE

.SH DEVICE SPECIFIERS
.sp
.LP
Packaging tools, including
.BR pkgtrans ,
.BR pkgadd (1M),
and
.BR pkgchk (1M),
have options for specifying a package location by
specifying the device on which it resides. Listed below are the device types
that a package can be stored to and retrieved from. Note that source and
destination devices cannot be the same.
.sp
.ne 2
.mk
.na
.B device
.ad
.RS 16n
.rt
Packages can be stored to a character or block device by specifying the
device identifier as the device. Common examples of this device type are
\fB/dev/rmt/0\fR for a removable magnetic tape and \fB/floppy/floppy0\fR for
the first floppy disk on the system.
.B pkgtrans
can also produce regular
file system files in a stream format, which is suitable for storage on a
character device, web server, or as input to \fBpkgadd\fR(1M).
.RE

.sp
.ne 2
.mk
.na
.B device alias
.ad
.RS 16n
.rt
Devices that have been specified in
.B /etc/device.tab
are eligible for
being the recipient or source of a package. Common examples of this type of
device specification are
.B spool
(the default package device location)
and
.BR disk1 .
These names correspond to devices specified in
.B /etc/device.tab
.RE

.sp
.ne 2
.mk
.na
.B directory
.ad
.RS 16n
.rt
Packages can be stored onto a directory by specifying an absolute path to a
file system directory. The package contents reside in a directory within the
specified directory. The package directory name must be identical to its
\fBPKG\fR specification in the
.BR pkginfo (4)
file. An example device
specification of this type is
.BR /export/packages .
.RE

.SH EXAMPLES
.LP
\fBExample 1\fR Translating All Packages on the Floppy Disk
.sp
.LP
The following example translates all packages on the floppy drive
\fB/dev/diskette\fR and places the translations on \fB/tmp\fR:

.sp
.in +2
.nf
example% pkgtrans /dev/diskette /tmp all
.fi
.in -2
.sp

.LP
\fBExample 2\fR Translating Packages on \fB/tmp\fR
.sp
.LP
The following example translates packages
.B pkg1
and
.B pkg2
on
\fB/tmp\fR and places their translations (that is, a datastream) on the
\fB9track1\fR output device:

.sp
.in +2
.nf
example% pkgtrans /tmp 9track1 pkg1 pkg2
.fi
.in -2
.sp

.LP
\fBExample 3\fR Translating Packages on \fB/tmp\fR
.sp
.LP
The following example translates
.B pkg1
and
.B pkg2
on
.BR /tmp
and places them on the diskette in a datastream format:

.sp
.in +2
.nf
example% pkgtrans -s /tmp /dev/diskette pkg1 pkg2
.fi
.in -2
.sp

.LP
\fBExample 4\fR Creating a Signed Package
.sp
.LP
The following example creates a signed package from
.B pkg1
and
.BR pkg2 ,
and reads the password from the
.B $PASS
environment
variable:

.sp
.in +2
.nf
example% pkgtrans -sg -k /tmp/keystore.p12 -a foo \e
    -p env:PASS /tmp /tmp/signedpkg pkg1 pkg2
.fi
.in -2
.sp

.LP
\fBExample 5\fR Translating a Package Datastream
.sp
.LP
The following example translates a package datastream into a file system
format package:

.sp
.in +2
.nf
example%  pkgtrans /tmp/pkg1.pkg ~/tmp pkg1
.fi
.in -2
.sp

.SH ENVIRONMENT VARIABLES
.sp
.LP
The
.B MAXINST
variable is set in the
.BR pkginfo (4)
file and declares
the maximum number of package instances.
.SH EXIT STATUS
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 6n
.rt
Successful completion.
.RE

.sp
.ne 2
.mk
.na
.B >0
.ad
.RS 6n
.rt
An error occurred.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWpkgcmdsu
_
Interface StabilitySee below.
.TE

.sp
.LP
The command-line syntax is Evolving. The digitally-signed stream package is
Evolving.
.SH SEE ALSO
.sp
.LP
\fBpkginfo\fR(1), \fBpkgmk\fR(1),
.BR pkgparam (1),
.BR pkgproto (1),
\fBinstallf\fR(1M), \fBpkgadd\fR(1M), \fBpkgask\fR(1M), \fBpkgrm\fR(1M),
\fBremovef\fR(1M), \fBpkginfo\fR(4),
.BR pkgmap (4),
.BR attributes (5),
.BR largefile (5)
.sp
.LP
\fIApplication Packaging Developer\&'s Guide\fR
.SH NOTES
.sp
.LP
By default,
.B pkgtrans
does not translate any instance of a package if
any instance of that package already exists on the destination device. Using
the
.B -n
option creates a new instance if an instance of this package
already exists.  Using the
.B -o
option overwrites an instance of this
package if it already exists. Neither of these options are useful if the
destination device is a datastream.
.sp
.LP
Package commands are \fBlargefile\fR(5)-aware. They handle files larger
than 2 GB in the same way they handle smaller files. In their current
implementations, \fBpkgadd\fR(1M),
.B pkgtrans
and other package commands
can process a datastream of  up to 4 GB.
