usr/src/man/man1/prctl.1
'\" te
.\" Copyright (c) 2009 Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH prctl 1 "25 Aug 2009" "SunOS 5.11" "User Commands"
.SH NAME
prctl \- get or set the resource controls of running processes, tasks, and
projects
.SH SYNOPSIS
.LP
.nf
\fBprctl\fR [\fB-P\fR] [\fB-t\fR [basic | privileged | system]]
     [\fB-n\fR \fIname\fR [\fB-srx\fR] [\fB-v\fR \fIvalue\fR] [\fB-e\fR | \fB-d\fR \fIaction\fR] [\fB-p\fR \fIpid\fR]]
     [\fB-i\fR \fIidtype\fR] \fIid\fR...
.fi

.SH DESCRIPTION
.sp
.LP
The
.B prctl
utility allows the examination and modification of the
resource controls associated with an active process, task, or project on the
system. It allows access to the  basic and privileged limits and the current
usage on  the     specified entity.
.sp
.LP
See
.BR resource_controls (5)
for a description of the resource controls
supported in the current release of the Solaris operating system.
.SH OPTIONS
.sp
.LP
If none of the
.BR -s ,
.BR -r ,
.BR -x ,
.BR -v ,
.BR -d ,
or
.BR -e
options are specified, the invocation is considered a get operation. Otherwise,
it is considered a modify operation.
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -d
|
.B -e
.I action
.ad
.sp .6
.RS 4n
Disables (\fB-d\fR) or enables (\fB-e\fR) the specified
.I action
on the
resource control value specified by
.BR -v ,
.BR -t ,
and
.BR -p .
If any of
the
.BR -v ,
.BR -t ,
or
.B -p
options are unspecified, they match any
value, privilege, or recipient pid. For example, specifying only \fB-v\fR
modifies the first resource control with matching value, matching any privilege
and recipient pid. If no matching resource control value is found, a new value
is added as if
.B -s
were specified.
.sp
.B Actions:
.sp
.ne 2
.mk
.na
.B all
.ad
.RS 17n
.rt
This action is only available with
.BR -d .
It disables all actions. This
fails on resource control values that have the
.B deny
global flag.
.RE

.sp
.ne 2
.mk
.na
.B deny
.ad
.RS 17n
.rt
Indicates that the resource control attempts to deny granting the resource to
the process, task, project, or zone on a request for resources in excess of the
resource control value.
.B deny
actions can not be enabled if the resource
control has the
.B no-deny
global flag.
.B deny
actions can not be
disabled if the resource control has the
.B deny
global flag.
.RE

.sp
.ne 2
.mk
.na
.B signal
.ad
.RS 17n
.rt
This action is only available with
.BR -d .
It deactivates the
.BR signal
action.
.RE

.sp
.ne 2
.mk
.na
\fBsignal\fR=\fIsignum\fR
.ad
.RS 17n
.rt
In the \fBsignal=\fIsignum\fR action, \fIsignum\fR is a signal number (or
string representation of a signal). Setting a
.B signal
action on a resource
control with the
.B no-local-action
global flag fails. A limited set of
signals can be sent. See
.B NOTES
for additional details.
.RE

.RE

.sp
.ne 2
.mk
.na
.B -i
.I idtype
.ad
.sp .6
.RS 4n
Specifies the type of the id operands. Valid \fIidtype\fRs are
.BR process ,
.BR task ,
.BR project ,
or
.BR zone .
Also allowed are
.BR pid ,
.BR taskid ,
.BR projid ,
and
.BR zoneid .
The default id type, if the
.B -i
option is omitted, is
.BR process .
.sp
For a modify operation, the entity to which id operands are members is the
.RB "target entity. For instance, setting a project resource control on an" " -i"
.B process
sets the resource control on the project to which each given
process argument is a member.
.sp
For a get operation, the resource controls are listed for all entities to
.RB "which the id operands are members. For example," " -i task"
.I taskid
lists the task, project, and zone resource controls for the task,
and for the project and zone to which that task is a member.
.RE

.sp
.ne 2
.mk
.na
.B -n
.I name
.ad
.sp .6
.RS 4n
Specifies the name of the resource control to get or set. If the
.I name
is
unspecified, all resource controls are retrieved.
.RE

.sp
.ne 2
.mk
.na
.B -p
.I pid
.ad
.sp .6
.RS 4n
When manipulating (using
.BR -s ,
.BR -r ,
.BR -x ,
.BR -d ,
or
.BR -e )
.RI "a basic task project, or zone resource control values, a recipient" " pid"
can be specified using
.BR -p .
When setting a new basic resource control or
controls on a task, project, or zone, the
.B -p
option is required if the
.B -i
.I idtype
option argument is not
.BR process .
.RE

.sp
.ne 2
.mk
.na
.B -P
.ad
.sp .6
.RS 4n
Display resource control values in space delimited format.
.RE

.sp
.ne 2
.mk
.na
.B -r
.ad
.sp .6
.RS 4n
Replaces the first resource control value (matching with the \fB-t\fR
.BR privilege )
with the new value specified through the
.B -v
option.
.RE

.sp
.ne 2
.mk
.na
.B -s
.ad
.sp .6
.RS 4n
Set a new resource control value.
.sp
This option requires the
.B -v
option.
.sp
If you do not specify the
.B -t
option, basic privilege is used. If you
want to set a basic task, process, or zone rctl,
.B -p
is required. If
.B -e
or
.B -d
are also specified, the action on the new
.B rctl
is
set as well.
.sp
For compatibility with prior releases, this option is implied if
.B -v
is
specified, without any of
.BR -e ,
.BR -d ,
.BR -r ,
or
.BR -x .
.sp
See
.BR resource_controls (5)
for a description of unit modifiers and scaling
factors you can use to express large values when setting a resource control
value.
.RE

.sp
.ne 2
.mk
.na
.B -t
[ \fBbasic\fR | \fBprivileged\fR | \fBsystem\fR ]\fR
.ad
.sp .6
.RS 4n
Specifies which resource control type to set. Unless the "lowerable" flag is
set for a resource control, only invocations by users (or setuid programs) who
have privileges equivalent to those of root can modify privileged resource
controls. See \fBrctlblk_set_value\fR(3C) for a description of the
.B RCTL_GLOBAL_LOWERABLE
flag. If the type is not specified,
.B basic
is
assumed. For a get operation, the values of all resource control types,
including
.BR system ,
are displayed if no type is specified.
.RE

.sp
.ne 2
.mk
.na
.B -v
.I value
.ad
.sp .6
.RS 4n
Specifies the value for the resource control for a set operation. If no
.I value
is specified, then the modification (deletion, action enabling or
disabling) is carried out on the lowest-valued resource control with the given
type.
.sp
See
.BR resource_controls (5)
for a description of unit modifiers and scaling
factors you can use to express large values when setting a resource control
value.
.RE

.sp
.ne 2
.mk
.na
.B -x
.ad
.sp .6
.RS 4n
Deletes the specified resource control value. If the delete option is not
provided, the default operation of
.B prctl
is to modify a resource control
value of matching value and privilege, or insert a new value with the given
privilege. The matching criteria are discussed more fully in
.BR setrctl (2).
.RE

.sp
.LP
If none of the
.BR -d ,
.BR -e ,
.BR -v ,
or
.B -x
options is specified,
the invocation is considered a get operation.
.SH OPERANDS
.sp
.LP
The following operand is supported:
.sp
.ne 2
.mk
.na
.I id
.ad
.RS 6n
.rt
The
.B ID
of the entity (\fBprocess\fR,
.BR task ,
.BR project ,
or
.BR zone )
to interrogate. If the invoking user's credentials are unprivileged
and the entity being interrogated possesses different credentials, the
operation fails. If no
.I id
is specified, an error message is returned.
.RE

.SH EXAMPLES
.LP
.B Example 1
Displaying Current Resource Control Settings
.sp
.LP
The following example displays current resource control settings for a task to
which the current shell belongs:

.sp
.in +2
.nf
 example$ ps -o taskid -p $$
TASKID
8
example$ prctl -i task 8
136150: /bin/ksh
NAME    PRIVILEGE       VALUE    FLAG   ACTION             RECIPIENT
task.max-cpu-time
        usage            8s
        system          18.4Es    inf   none                -
task.max-lwps
        usage              39
        system          2.15G     max   deny                -
project.max-contracts
        privileged      10.0K       -   deny                -
project.max-locked-memory
        usage               0B
        privileged       508MB      -   deny                -
project.max-port-ids
        privileged      8.19K       -   deny                -
project.max-shm-memory
        privileged       508MB      -   deny                -
project.max-shm-ids
        privileged        128       -   deny                -
project.max-msg-ids
        privileged        128       -   deny                -
project.max-sem-ids
        privileged        128       -   deny                -
project.max-crypto-memory
         usage            0B
privileged       508MB      -   deny                -
project.max-tasks
        usage               2
        system          2.15G     max   deny                -
project.max-lwps
         usage             39
        system          2.15G     max   deny                -
project.cpu-shares
        usage               1
        privileged          1       -   none                -
zone.max-shm-memory
        system          16.0EB    max   deny                -
zone.max-shm-ids
        system          16.8M     max   deny                -
zone.max-sem-ids
        system          16.8M     max   deny                -
zone.max-msg-ids
        system          16.8M     max   deny                -
zone.max-lwps
        system          2.15G     max   deny                -
zone.cpu-shares
        privileged          1       -   none                -
zone.max-locked-memory
        usage               0B
        privileged       508MB      -   deny                -
.fi
.in -2
.sp

.LP
.B Example 2
Displaying, Replacing, and Verifying the Value of a Specific
Control
.sp
.LP
The following examples displays, replaces, and verifies the value of a
specific control on an existing project:

.sp
.in +2
.nf
example# prctl -n project.cpu-shares -i project group.staff
project: 10: group.staff
NAME    PRIVILEGE       VALUE    FLAG   ACTION               RECIPIENT
project.cpu-shares
        usage               1
        privileged          1       -   none                         -
        system          65.5K     max   none                         -

example# prctl -n project.cpu-shares -v 10 -r -i project group.staff
example# prctl -n project.cpu-shares -i project group.staff
project: 10: group.staff
NAME    PRIVILEGE       VALUE    FLAG   ACTION               RECIPIENT
project.cpu-shares
        usage              10
        privileged         10       -   none                         -
        system          65.5K     max   none                         -
.fi
.in -2
.sp

.LP
.B Example 3
Adjusting Resources
.sp
.LP
The following example uses the
.B project.max-locked-memory
resource.

.sp
.LP
First, use
.B "id -p"
to find out which project the current shell is a
member of:

.sp
.in +2
.nf
/home/garfield> id -p
          uid=77880(garfield) gid=10(staff) projid=10(group.staff)
.fi
.in -2
.sp

.sp
.LP
Using the target project, identify the resource limit value before the
change:

.sp
.in +2
.nf
/home/garfield> prctl -n project.max-locked-memory -i project \e
                      group.staff
	project 10: group.staff
	project.max-locked-memory
            privileged         256MB       -    deny                  -
      	    system            16.0EB     max    deny                  -

current limit is 256 Megabytes.
.fi
.in -2
.sp

.sp
.LP
Next, adjust the
.B project.max-locked-memory
limit to 300 Megabytes for
the target project:

.sp
.in +2
.nf
# prctl -n project.max-locked-memory -v 300M -r -i project group.staff
.fi
.in -2
.sp

.sp
.LP
The resource limit value after the change shows a new value of 300
Megabytes:

.sp
.in +2
.nf
# prctl -n project.max-locked-memory -i project group.staff
	project 10:group.staff
	project.max-locked-memory
	    usage              200MG
     privileged         300MB       -    deny                           -
	   system            16.0EB     max    deny                           -
.fi
.in -2
.sp

.LP
.B Example 4
Modifying CPU Caps for a Project
.sp
.LP
The
.B prctl
command can use the
.B project.cpu-cap
resource control
(see
.BR resource_controls (5))
to set and modify CPU caps for a project. (The
same resource control can be used in the
.B /etc/project
file. See
.BR project (4))
The following command modifies the CPU cap to limit
.B user.smith
to three CPUs:

.sp
.in +2
.nf
# \fBprctl -r -t privileged -n project.cpu-cap -v 300 -i project user.smith\fR
.fi
.in -2
.sp

.sp
.LP
The
.B "prctl -r"
option, used above, is used to dynamically change a
CPU cap for a project or zone. For example, the following command will change
the cap set in the preceding command to 80 percent:

.sp
.in +2
.nf
# \fBprctl -r -t privileged -n project.cpu-cap -v 80 -i project user.smith\fR
.fi
.in -2
.sp

.sp
.LP
To remove a CPU cap, enter:

.sp
.in +2
.nf
# \fBprctl -x -n project.cpu-cap $$\fR
.fi
.in -2
.sp

.LP
.B Example 5
Modifying CPU Caps for a Zone
.sp
.LP
The
.B prctl
command can use the
.B zone.cpu-cap
resource control (see
.BR resource_controls (5))
to set and modify CPU caps for a zone. (The same
resource control can be manipulated using the \fBzonecfg\fR(1M) command.) The
following command modifies the CPU cap to limit the global zone to 80 percent
of a CPU:

.sp
.in +2
.nf
# \fBprctl -t privileged -n zone.cpu-cap -v 80 -i zone global\fR
.fi
.in -2
.sp

.sp
.LP
The cap can be lowered to 50% using:

.sp
.in +2
.nf
# \fBprctl -r -t privileged -n zone.cpu-cap -v 50 -i zone global\fR
.fi
.in -2
.sp

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 5n
.rt
Success.
.RE

.sp
.ne 2
.mk
.na
.B 1
.ad
.RS 5n
.rt
Fatal error encountered.
.RE

.sp
.ne 2
.mk
.na
.B 2
.ad
.RS 5n
.rt
Invalid command line options were specified.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B /proc/pid/*
.ad
.RS 15n
.rt
Process information and control files
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWesu
_
Interface StabilitySee below.
.TE

.sp
.LP
The command-line syntax is Committed. The human-readable output is
Uncommitted. The parseable output is Committed.
.SH SEE ALSO
.sp
.LP
.BR rctladm (1M),
.BR zonecfg (1M),
.BR setrctl (2),
.BR rctlblk_get_local_action (3C),
.BR project (4),
.BR attributes (5),
.BR resource_controls (5)
.SH NOTES
.sp
.LP
The valid signals that can be set on a resource control block allowing local
actions are
.BR SIGABRT ,
.BR SIGXRES ,
.BR SIGHUP ,
.BR SIGSTOP ,
.BR SIGTERM ,
and
.BR SIGKILL .
Additionally, CPU time related controls can
issue the
.B SIGXCPU
signal, and file size related controls can send the
.B SIGXFSZ
signal.
