usr/src/man/man1/profiles.1
'\" te
.\" Copyright (c) 2000, Sun Microsystems, Inc.  All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH profiles 1 "11 Feb 2000" "SunOS 5.11" "User Commands"
.SH NAME
profiles \- print execution profiles for a user
.SH SYNOPSIS
.LP
.nf
\fBprofiles\fR [\fB-l\fR] [ \fIuser\fR ]...
.fi

.SH DESCRIPTION
.sp
.LP
The \fBprofiles\fR command prints on standard output the names of the
execution profiles that have been assigned to you or to the
optionally-specified user or role name. Profiles are a bundling mechanism
used to enumerate the commands and authorizations needed to perform a
specific function. Along with each listed executable are the process
attributes, such as the effective user and group \fBID\fRs, with which the
process runs when started by a privileged command interpreter. The profile
shells are
.BR pfcsh ,
\fBpfksh\fR, and
.BR pfexec .
See the
\fBpfexec\fR(1) man page. Profiles can contain other profiles defined in
\fBprof_attr\fR(4).
.sp
.LP
Multiple profiles can be combined to construct the appropriate access
control. When profiles are assigned, the authorizations are added to the
existing set. If the same command appears in multiple profiles, the first
occurrence, as determined by the ordering of the profiles, is used for
process-attribute settings. For convenience, a wild card can be specified to
match all commands.
.sp
.LP
When profiles are interpreted, the profile list is loaded from
.BR user_attr (4).
If any default profile is defined in
\fB/etc/security/policy.conf\fR (see
.BR policy.conf (4)),
the list of
default profiles are added to the list loaded from
.BR user_attr (4).
Matching entries in
.BR prof_attr (4)
provide the authorizations list, and
matching entries in
.BR exec_attr (4)
provide the commands list.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -l
.ad
.RS 6n
.rt
Lists the commands in each profile followed by the special process
attributes such as user and group
.BR ID s.
.RE

.SH EXAMPLES
.LP
\fBExample 1\fR Sample Output
.sp
.LP
The output of the \fBprofiles\fR command has the following form:

.sp
.in +2
.nf
example% \fBprofiles tester01 tester02\fRtester01 : Audit Management, All Commands
tester02 : Device Management, All Commands
example%
.fi
.in -2
.sp

.LP
\fBExample 2\fR Using the \fBlist\fR Option
.sp
.in +2
.nf
example% \fBprofiles -l tester01 tester02\fRtester01 :
    Audit Management:
      /usr/sbin/audit          euid=root
      /usr/sbin/auditconfig    euid=root    egid=sys
    All Commands:
      *
tester02 :
    Device Management:
      /usr/bin/allocate:       euid=root
      /usr/bin/deallocate:     euid=root
    All Commands
      *
example%
.fi
.in -2
.sp

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 6n
.rt
Successful completion.
.RE

.sp
.ne 2
.mk
.na
.B 1
.ad
.RS 6n
.rt
An error occurred.
.RE

.SH FILES
.sp
.LP
.B /etc/security/exec_attr
.sp
.LP
\fB/etc/security/prof_attr\fR
.sp
.LP
.B /etc/user_attr
.sp
.LP
\fB/etc/security/policy.conf\fR
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.sp
.LP
.BR auths (1),
\fBpfexec\fR(1),
.BR roles (1),
\fBgetprofattr\fR(3SECDB),
.BR exec_attr (4),
\fBpolicy.conf\fR(4), \fBprof_attr\fR(4),
.BR user_attr (4),
.BR attributes (5)
