usr/src/man/man1/ptree.1
'\" te
.\" Copyright (c) 2005, Sun Microsystems, Inc. All Rights Reserved.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ptree 1 "11 Oct 2005" "SunOS 5.11" "User Commands"
.SH NAME
ptree \- print process trees
.SH SYNOPSIS
.LP
.nf
\fB/usr/bin/ptree\fR [\fB-a\fR] [\fB-c\fR] [\fB-z\fR \fIzone\fR] [\fIpid\fR | \fIuser\fR]...
.fi

.SH DESCRIPTION
.sp
.LP
The
.B ptree
utility prints the process trees containing the specified
\fIpid\fRs or \fIuser\fRs, with child processes indented from their
respective parent processes. An argument of all digits is taken to be a
process-ID, otherwise it is assumed to be a user login name. The default is
all processes.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -a
.ad
.RS 11n
.rt
All. Print all processes, including children of process 0.
.RE

.sp
.ne 2
.mk
.na
.B -c
.ad
.RS 11n
.rt
Contracts. Print process contract memberships in addition to parent-child
relationships. See
.BR process (4).
This option implies the
.BR -a
option.
.RE

.sp
.ne 2
.mk
.na
\fB-z\fR \fIzone\fR
.ad
.RS 11n
.rt
Zones. Print only processes in the specified
.IR zone .
Each zone
.BR ID
can be specified as either a zone name or a numerical zone
.BR ID .
.sp
This option is only useful when executed in the global zone.
.RE

.SH OPERANDS
.sp
.LP
The following operands are supported:
.sp
.ne 2
.mk
.na
.I pid
.ad
.RS 8n
.rt
Process-id or a list of process-ids.
.B ptree
also accepts
\fB/proc/\fInnn\fR as a process-id, so the shell expansion \fB/proc/*\fR
can be used to specify all processes in the system.
.RE

.sp
.ne 2
.mk
.na
.I user
.ad
.RS 8n
.rt
Username or list of usernames. Processes whose effective user IDs match
those given are displayed.
.RE

.SH EXAMPLES
.LP
\fBExample 1\fR Using ptree
.sp
.LP
The following example prints the process tree (including children of
process 0) for processes which match the command name \fBssh\fR:

.sp
.in +2
.nf
$ ptree -a `pgrep ssh`
        1     /sbin/init
          100909 /usr/lib/ssh/sshd
            569150 /usr/lib/ssh/sshd
              569157 /usr/lib/ssh/sshd
                569159 -ksh
                  569171 bash
                    569173 /bin/ksh
                      569193 bash
.fi
.in -2
.sp

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 12n
.rt
Successful operation.
.RE

.sp
.ne 2
.mk
.na
.B non-zero
.ad
.RS 12n
.rt
An error has occurred.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B /proc/*
.ad
.RS 11n
.rt
process files
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWesu
_
Interface StabilitySee below.
.TE

.sp
.LP
The human readable output is Unstable. The options are Evolving.
.SH SEE ALSO
.sp
.LP
.BR gcore (1),
.BR ldd (1),
.BR pargs (1),
.BR pgrep (1),
.BR pkill (1),
.BR plimit (1),
.BR pmap (1),
.BR preap (1),
.BR proc (1),
.BR ps (1),
.BR ppgsz (1),
.BR pwd (1),
.BR rlogin (1),
.BR time (1),
.BR truss (1),
.BR wait (1),
\fBfcntl\fR(2),
\fBfstat\fR(2),
.BR setuid (2),
.BR dlopen (3C),
.BR signal.h (3HEAD),
.BR core (4),
.BR proc (4),
.BR process (4),
.BR attributes (5),
.BR zones (5)
