usr/src/man/man1/roles.1
'\" te
.\" Copyright (c) 2001, Sun Microsystems, Inc.  All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH roles 1 "14 Feb 2001" "SunOS 5.11" "User Commands"
.SH NAME
roles \- print roles granted to a user
.SH SYNOPSIS
.LP
.nf
\fBroles\fR [ \fIuser\fR ]...
.fi

.SH DESCRIPTION
.sp
.LP
The command
.B roles
prints on standard output the roles that you or the
optionally-specified user have been granted. Roles are special accounts that
correspond to a functional responsibility rather than to an actual person
(referred to as a normal user).
.sp
.LP
Each user may have zero or more roles. Roles have most of the attributes of
normal users and are identified like normal users in
.BR passwd (4)
and
.BR shadow (4).
Each role must have an entry in the
.BR user_attr (4)
file
that identifies it as a role. Roles can have their own authorizations and
profiles. See
.BR auths (1)
and
.BR profiles (1).
.sp
.LP
Roles are not allowed to log into a system as a primary user. Instead, a
user must log in as him\(em or herself and assume the role. The actions of a
role are attributable to the normal user. When auditing is enabled, the
audited events of the role contain the audit
.B ID
of the original user
who assumed the role.
.sp
.LP
A role may not assume itself or any other role. Roles are not hierarchical.
However, rights profiles (see
.BR prof_attr (4))
are hierarchical and can
be used to achieve the same effect as hierarchical roles.
.sp
.LP
Roles must have valid passwords and one of the shells that interprets
profiles: either
.BR pfcsh ,
.BR pfksh ,
or
.BR pfsh .
See
.BR pfexec (1).
.sp
.LP
Role assumption may be performed using
.BR su (1M),
.BR rlogin (1),
or
some other service that supports the
.B PAM_RUSER
variable. Successful
assumption requires knowledge of the role's password and membership in the
role. Role assignments are specified in
.BR user_attr (4).
.SH EXAMPLES
.LP
\fBExample 1\fR Sample output
.sp
.LP
The output of the
.B roles
command has the following form:

.sp
.in +2
.nf
example% \fBroles tester01 tester02\fRtester01 : admin
tester02 : secadmin, root
example%
.fi
.in -2
.sp

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 6n
.rt
Successful completion.
.RE

.sp
.ne 2
.mk
.na
.B 1
.ad
.RS 6n
.rt
An error occurred.
.RE

.SH FILES
.sp
.LP
.B /etc/user_attr
.sp
.LP
.B /etc/security/auth_attr
.sp
.LP
\fB/etc/security/prof_attr\fR
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.sp
.LP
.BR auths (1),
.BR pfexec (1),
.BR profiles (1),
.BR rlogin (1),
.BR su (1M),
.BR getauusernam (3BSM),
.BR auth_attr (4),
.BR passwd (4),
.BR prof_attr (4),
.BR shadow (4),
.BR user_attr (4),
.BR attributes (5)
