usr/src/man/man1/sccs-delta.1
'\" te
.\" Copyright (c) 1999, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH sccs-delta 1 "1 Nov 1999" "SunOS 5.11" "User Commands"
.SH NAME
sccs-delta, delta \- make a delta to an SCCS file
.SH SYNOPSIS
.LP
.nf
\fB/usr/ccs/bin/delta\fR [\fB-dnps\fR] [\fB-g\fR \fIsid-list\fR | \fB-g\fIsid-list\fR]
     [\fB-m\fR \fImr-list\fR | \fB-m\fImr-list\fR] [\fB-r\fR \fIsid\fR | \fB-r\fIsid\fR]
     [\fB-y\fR [\fIcomment\fR]] \fI s.filename\fR...
.fi

.LP
.nf
\fB/usr/xpg4/bin/delta\fR [\fB-dnps\fR] [\fB-g\fR \fIsid-list\fR | \fB-g\fIsid-list\fR]
     [\fB-m\fR \fImr-list\fR | \fB-m\fImr-list\fR] [\fB-r\fR \fIsid\fR | \fB-r\fIsid\fR]
     [\fB-y\fR [\fIcomment\fR]] \fI s.filename\fR...
.fi

.SH DESCRIPTION
.sp
.LP
The
.B delta
utility checks in a record of the line-by-line differences
made to a checked-out version of a file under
.B SCCS
control. These
changes are taken from the writable working copy that was retrieved using
the
.B "SCCS get"
command (see
.BR sccs-get (1)).
This working copy
does not have the `\fBs.\fR' prefix, and is also referred to as a
.BR g -file.
.sp
.LP
If a directory name is used in place of the
.I s.filename
argument, the
.B delta
command applies to all \fBs.\fRfiles in that directory.
Unreadable \fBs.\fRfiles produce an error; processing continues with the
next file (if any). The use of `\fB\(mi\fR\&' as the \fIs.filename\fR
argument indicates that the names of files are to be read from the standard
input, one \fBs.\fRfile per line (requires
.BR -y ,
and in some cases,
.BR -m ).
.sp
.LP
.B delta
may issue prompts on the standard output depending upon the
options specified and the flags that are set in the \fBs.\fRfile (see
.BR sccs-admin (1),
and the
.B -m
and
.B -y
options below, for
details).
.SS "/usr/xpg4/bin/delta"
.sp
.LP
The
.B SID
of the delta is not echoed to
.BR stdout .
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -d
.ad
.RS 28n
.rt
Use command
.BR diff (1)
instead of
.BR bdiff (1).
Returns exit status
.B 2
if
.I s.filename
argument is not specified.
.RE

.sp
.ne 2
.mk
.na
.B -n
.ad
.RS 28n
.rt
Retain the edited \fBg\fR-file, which is normally removed at the completion
of processing.
.RE

.sp
.ne 2
.mk
.na
.B -p
.ad
.RS 28n
.rt
Display line-by-line differences (in
.BR diff (1)
format) on the standard
output.
.RE

.sp
.ne 2
.mk
.na
.B -s
.ad
.RS 28n
.rt
Silent.  Do not display warning or confirmation messages.  Do not suppress
error messages (which are written to standard error).
.RE

.sp
.ne 2
.mk
.na
\fB-g\fR \fIsid-list\fR | \fB-g\fIsid-list\fR
.ad
.RS 28n
.rt
Specify a list of deltas to omit when the file is accessed at the
.B SCCS
version
.B ID
(\fBSID\fR) created by this delta.
.I sid-list
is a comma-separated list of \fBSID\fRs. To specify a range
of deltas, use a `\fB\(mi\fR\&' separator instead of a comma, between two
\fBSID\fRs in the list.
.RE

.sp
.ne 2
.mk
.na
\fB-m\fR \fImr-list\fR | \fB-m\fImr-list\fR
.ad
.RS 28n
.rt
If the SCCS file has the
.B v
flag set (see
.BR sccs-admin (1)),
you
must supply one or more Modification Request (MR) numbers for the new delta.
When specifying more than one MR number on the command line, \fImr-list\fR
takes the form of a quoted, space-separated list. If
.B -m
is not used
and the standard input is a terminal,
.B delta
prompts with
.BR MRs?
for the list (before issuing the
.B comments?
prompt). If the \fBv\fR
flag in the \fBs.\fRfile has a value, it is taken to be the name of a
program to validate the MR numbers. If that validation program returns a
non-zero exit status,
.B delta
terminates without checking in the
changes.
.RE

.sp
.ne 2
.mk
.na
\fB-r\fR \fIsid\fR | \fB-r\fIsid\fR
.ad
.RS 28n
.rt
When two or more versions are checked out, specify the version to check in.
This
.B SID
value can be either the
.B SID
specified on the
.BR get
command line, or the
.B SID
of the new version to be checked in as
reported by
.BR get .
A diagnostic results if the specified
.B SID
is
ambiguous, or if one is required but not supplied.
.RE

.sp
.ne 2
.mk
.na
\fB-y\fR[\fIcomment\fR]\fR
.ad
.RS 28n
.rt
Supply a comment for the delta table (version log). A null comment is
accepted, and produces an empty commentary in the log. If
.B -y
is not
specified and the standard input is a terminal,
.B delta
prompts with
`\fBcomments?\fR'. An unescaped NEWLINE terminates the comment.
.RE

.SH ENVIRONMENT VARIABLES
.sp
.LP
See
.BR environ (5)
for descriptions of the following environment
variables that affect the execution of
.BR delta :
.BR LANG ,
.BR LC_ALL ,
.BR LC_COLLATE ,
.BR LC_CTYPE ,
.BR LC_MESSAGES ,
and
.BR NLSPATH .
.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 5n
.rt
Successful completion.
.RE

.sp
.ne 2
.mk
.na
.B 1
.ad
.RS 5n
.rt
An error occurred and the
.B -d
option had not been specified.
.RE

.sp
.ne 2
.mk
.na
.B 2
.ad
.RS 5n
.rt
An error occurred, the
.B -d
option had been specified, and the
.I s.filename
argument was not specified.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B d.file
.ad
.RS 10n
.rt
temporary file of differences
.RE

.sp
.ne 2
.mk
.na
.B p.file
.ad
.RS 10n
.rt
lock file for a checked-out version
.RE

.sp
.ne 2
.mk
.na
.B q.file
.ad
.RS 10n
.rt
temporary file
.RE

.sp
.ne 2
.mk
.na
.B s.file
.ad
.RS 10n
.rt
.B SCCS
history file
.RE

.sp
.ne 2
.mk
.na
.B x.file
.ad
.RS 10n
.rt
temporary copy of the \fBs.\fRfile
.RE

.sp
.ne 2
.mk
.na
.B z.file
.ad
.RS 10n
.rt
temporary file
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.SS "/usr/ccs/bin/delta"
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWsprot
.TE

.SS "/usr/xpg4/bin/delta"
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWxcu4t
_
Interface StabilityStandard
.TE

.SH SEE ALSO
.sp
.LP
.BR bdiff (1),
.BR diff (1),
.BR sccs-admin (1),
.BR sccs-cdc (1),
.BR sccs-get (1),
.BR sccs-help (1),
.BR sccs-prs (1),
.BR sccs-prt (1),
.BR sccs-rmdel (1),
.BR sccs-sccsdiff (1),
.BR sccs-unget (1),
.BR sccs (1),
.BR what (1),
.BR sccsfile (4),
.BR attributes (5),
.BR environ (5),
.BR standards (5)
.SH DIAGNOSTICS
.sp
.LP
Use the
.B "SCCS help"
command for explanations (see
.BR sccs-help (1)).
.SH WARNINGS
.sp
.LP
Lines beginning with an
.B "ASCII SOH"
character (binary 001) cannot be
placed in the
.B SCCS
file unless the
.B SOH
is escaped. This
character has special meaning to
.B SCCS
(see
.BR sccsfile (4))
and
produces an error.
