usr/src/man/man1/sccs.1
'\" te
.\" Copyright (c) 2007, Sun Microsystems, Inc.  All Rights Reserved.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH sccs 1 "30 Jun 2007" "SunOS 5.11" "User Commands"
.SH NAME
sccs \- front end for the Source Code Control System (SCCS)
.SH SYNOPSIS
.LP
.nf
\fB/usr/bin/sccs\fR [\fB-r\fR] [\fB-d\fIrootprefix\fR] [\fB-p\fIsubdir\fR] \fIsubcommand\fR
     [\fIoption\fR].\|.\|. [\fIfile\fR].\|.\|.
.fi

.LP
.nf
\fB/usr/xpg4/bin/sccs\fR [\fB-r\fR] [\fB-d\fR \fIrootprefix\fR] [\fB-p\fR \fIsubdir\fR] \fIsubcommand\fR
     [\fIoption\fR].\|.\|. [\fIfile\fR].\|.\|.
.fi

.SH DESCRIPTION
.sp
.LP
The
.B sccs
command is a comprehensive, straightforward front end to the
various utility programs of the Source Code Control System
.RB ( SCCS ).
.sp
.LP
\fBsccs\fR applies the indicated \fIsubcommand\fR to the history file
associated with each of the indicated files.
.sp
.LP
The name of an
.B SCCS
history file is derived by prepending the `\fBs.\fR'
prefix to the filename of a working copy. The
.B sccs
command normally
expects these `\fBs.\fRfiles' to reside in an
.B SCCS
subdirectory. Thus,
when you supply
.B sccs
with a \fIfile\fR argument, it normally applies the
subcommand to a file named \fBs.\fIfile\fR in the
.B SCCS
subdirectory.
If \fIfile\fR is a path name, \fBsccs\fR looks for the history file in the
\fBSCCS\fR subdirectory of that file's parent directory. If \fIfile\fR is a
directory, however,
.B sccs
applies the subcommand to every \fBs.\fRfile
file it contains. Thus, the command:
.sp
.in +2
.nf
example% \fBsccs get program.c\fR
.fi
.in -2
.sp

.sp
.LP
would apply the
.B get
subcommand to a history file named
.BR SCCS/s.program.c ,
while the command:
.sp
.in +2
.nf
example% \fBsccs get SCCS\fR
.fi
.in -2
.sp

.sp
.LP
would apply it to every \fBs.\fRfile in the
.B SCCS
subdirectory.
.sp
.LP
Options for the
.B sccs
command itself must appear before the
\fIsubcommand\fR argument.  Options for a given subcommand must appear after
the
.I subcommand
argument. These options are specific to each subcommand,
.RB "and are described along with the subcommands themselves (see" " Subcommands"
below).
.SS "Running Setuid"
.sp
.LP
The
.B sccs
command also includes the capability to run ``setuid'' to
provide additional protection.  However, this does not apply to subcommands
such as
.BR sccs-admin (1),
since this would allow anyone to change the
authorizations of the history file.  Commands that would do so always run as
the real user.
.SH OPTIONS
.sp
.LP
The following options are supported:
.SS "/usr/bin/sccs"
.sp
.LP
\fB-d\fIrootprefix\fR
.SS "/usr/xpg4/bin/sccs"
.sp
.ne 2
.mk
.na
\fB-d\fR \fIrootprefix\fR
.ad
.sp .6
.RS 4n
Defines the root portion of the path name for
.B SCCS
history files. The
default root portion is the current directory. \fIrootprefix\fR is prepended to
the entire  \fIfile\fR argument, even if \fIfile\fR is an absolute path name.
\fB-d\fR overrides any directory specified by the \fBPROJECTDIR\fR environment
variable (see ENVIRONMENT VARIABLES below).
.RE

.SS "/usr/bin/sccs"
.sp
.LP
\fB-p\fIsubdir\fR
.SS "/usr/xpg4/bin/sccs"
.sp
.ne 2
.mk
.na
\fB-p\fIsubdir\fR
.ad
.sp .6
.RS 4n
Defines the (sub)directory within which a history file is expected to reside.
\fBSCCS\fR is the default. (See EXAMPLES below).
.RE

.sp
.ne 2
.mk
.na
.B -r
.ad
.sp .6
.RS 4n
Runs
.B sccs
with the real user
.BR ID ,
rather than set to the effective
user
.BR ID .
.RE

.SH OPERANDS
.sp
.LP
The following operands are supported:
.sp
.ne 2
.mk
.na
\fIfile\fR
.ad
.sp .6
.RS 4n
a file passed to
.IR subcommand
.RE

.sp
.ne 2
.mk
.na
.I option
.ad
.sp .6
.RS 4n
.RI "an option or option-argument passed to" " subcommand"
.RE

.sp
.ne 2
.mk
.na
.I subcommand
.ad
.sp .6
.RS 4n
one of the subcommands listed in
.BR Usage
.RE

.SH USAGE
.sp
.LP
The usage for
.B sccs
is described below.
.SS "Subcommands"
.sp
.LP
Many of the following
.B sccs
subcommands invoke programs that reside in
.BR /usr/bin .
Many of these subcommands accept additional arguments that are
documented in the reference page for the utility program the subcommand
invokes.
.sp
.ne 2
.mk
.na
.B admin
.ad
.sp .6
.RS 4n
Modify the flags or checksum of an
.B SCCS
history file. Refer to
.BR sccs-admin (1)
for more information about the
.B admin
utility. While
\fBadmin\fR can be used to initialize a history file, you might find that the
\fBcreate\fR subcommand is simpler to use for this purpose.
.RE

.SS "/usr/bin/sccs"
.sp
.LP
\fBcdc\fR \fB-r\fIsid\fR  [ \fB-y\fR[\fIcomment\fR]]
.SS "/usr/xpg4/bin/sccs"
.sp
.ne 2
.mk
.na
\fBcdc\fR \fB-r\fIsid\fR | \fB-r\fIsid\fR [
\fB-y\fR[\fIcomment\fR]]\fR
.ad
.sp .6
.RS 4n
Annotate (change) the delta commentary. Refer to
.BR sccs-cdc (1).
The
\fBfix\fR subcommand can be used to replace the delta, rather than merely
annotating the existing commentary.
.sp
.ne 2
.mk
.na
\fB-r\fR \fIsid\fR | \fB-r\fIsid\fR
.ad
.sp .6
.RS 4n
Specify the
.B SCCS
delta
.B ID
(\fBSID\fR) to which the change notation
is to be added. The
.B SID
for a given delta is a number, in Dewey decimal
format, composed of two or four fields: the
.I release
and
.IR level
fields, and for branch deltas, the
.I branch
and
.I sequence
fields.  For
instance, the
.B SID
for the initial delta is normally
.BR 1.1 .
.RE

.sp
.ne 2
.mk
.na
.B \-y\c
.RI [ comment ]
.ad
.sp .6
.RS 4n
Specify the comment with which to annotate the delta commentary. If \fB-y\fR
is omitted,
.B sccs
prompts for a comment. A null
.I comment
results in
an empty annotation.
.RE

.RE

.SS "/usr/bin/sccs"
.sp
.LP
\fBcheck\fR [\fB-b\fR] [\fB-u\fR[\fIusername\fR] ]
.SS "/usr/xpg4/bin/sccs"
.sp
.ne 2
.mk
.na
\fBcheck\fR [\fB-b\fR] [\fB-u\fR [\fIusername\fR] | \fB-U\fR ]\fR
.ad
.sp .6
.RS 4n
Check for files currently being edited. Like \fBinfo\fR and
.BR tell ,
but
returns an exit code, rather than producing a listing of files. \fBcheck\fR
returns a non-zero exit status if anything is being edited.
.sp
.ne 2
.mk
.na
.B -b
.ad
.sp .6
.RS 4n
Ignore branches.
.RE

.sp
.ne 2
.mk
.na
\fB-u\fR[\fIusername\fR] | \fB-u\fR [ \fIusername\fR] | \fB-U\fR
.ad
.sp .6
.RS 4n
Check only files being edited by you.  When
.I username
is specified, check
only files being edited by that user. For
.BR /usr/xpg4/bin/sccs ,
the
\fB-U\fR option is equivalent to \fB-u\fR <\fIcurrent_user\fR>.
.RE

.RE

.sp
.ne 2
.mk
.na
\fBclean\fR [ \fB-b\fR ]\fR
.ad
.sp .6
.RS 4n
Remove everything in the current directory that can be retrieved from an
\fBSCCS\fR history.  Does not remove files that are being edited.
.sp
.ne 2
.mk
.na
.B -b
.ad
.RS 6n
.rt
Do not check branches to see if they are being edited. `\fBclean -b\fR'
is dangerous when branch versions are kept in the same directory.
.RE

.RE

.sp
.ne 2
.mk
.na
.B comb
.ad
.sp .6
.RS 4n
Generate scripts to combine deltas. Refer to
.BR sccs-comb (1).
.RE

.sp
.ne 2
.mk
.na
.B create
.ad
.sp .6
.RS 4n
Create (initialize) history files.
.B create
performs the following steps:

.RS +4
.TP
.ie t \(bu
.el o
Renames the original source file to
.B ,program.c
in the current
directory.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Create the history file called
.B s.program.c
in the
.BR SCCS
subdirectory.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Performs an `\fBsccs get\fR' on
.B program.c
to retrieve a read-only copy
of the initial version.
.RE
.RE

.sp
.ne 2
.mk
.na
\fBdeledit\fR [\fB-s\fR] [\fB-y\fR[\fIcomment\fR]\|]\fR
.ad
.sp .6
.RS 4n
Equivalent to an `\fBsccs delta\fR' and then an `\fBsccs edit\fR'.
\fBdeledit\fR checks in a delta, and checks the file back out again, but leaves
the current working copy of the file intact.
.sp
.ne 2
.mk
.na
.B -s
.ad
.RS 15n
.rt
Silent. Do not report delta numbers or statistics.
.RE

.sp
.ne 2
.mk
.na
\fB-y[\fIcomment]\fR
.ad
.RS 15n
.rt
Supply a comment for the delta commentary.  If
.B -y
is omitted,
\fBdelta\fR prompts for a comment.  A null \fIcomment\fR results in an empty
comment field for the delta.
.RE

.RE

.sp
.ne 2
.mk
.na
\fBdelget\fR [\fB-s\fR] [\fB-y\fR[\fIcomment\fR]\|]\fR
.ad
.sp .6
.RS 4n
Perform an `\fBsccs delta\fR' and then an `\fBsccs get\fR' to check in a delta
and retrieve read-only copies of the resulting new version. See the
\fBdeledit\fR subcommand for a description of \fB-s\fR and
.BR -y .
.B sccs
performs a
.B delta
on all the files specified in the argument list, and
then a
.B get
on all the files. If an error occurs during the
.BR delta ,
the
.B get
is not performed.
.RE

.sp
.ne 2
.mk
.na
\fBdelta\fR [\fB-s\fR] [\fB-y\fR[\fIcomment\fR]\|]\fR
.ad
.sp .6
.RS 4n
Check in pending changes. Records the line-by-line changes introduced while
the file was checked out. The effective user
.B ID
must be the same as the
\fBID\fR of the person who has the file checked out. Refer to
.BR sccs-delta (1).
See the
.B deledit
subcommand for a description of
\fB-s\fR and
.BR -y .
.RE

.SS "/usr/bin/sccs"
.sp
.LP
\fBdiffs\fR [\fB-C\fR] [\fB-I\fR] [\fB-c\fIdate-time\fR]
[\fB-r\fIsid\fR] \fIdiff-options\fR
.SS "/usr/xpg4/bin/sccs"
.sp
.ne 2
.mk
.na
\fBdiffs\fR [\fB-C\fR] [\fB-I\fR] [\fB-c\fR \fIdate-time\fR |
\fB-c\fIdate-time\fR ]\fR
.ad
.br
.na
\fB[-r\fR \fIsid\fR | \fB-r\fIsid\fR] \fIdiff-options\fR
.ad
.sp .6
.RS 4n
Compare (in
.BR diff (1)
format) the working copy of a file that is checked
out for editing, with a version from the
.B SCCS
history. Use the most
recent checked-in version by default. The \fBdiffs\fR subcommand accepts the
same options as
.BR diff .
.sp
Any
.BR -r ,
.BR -c ,
.BR -i ,
.BR -x ,
and
.B -t
options are passed to
subcommand
.BR get .
A
.B -C
option is passed to \fBdiff\fR as
.BR -c .
An
\fB-I\fR option is passed to \fBdiff\fR as
.BR -i .
.sp
.ne 2
.mk
.na
\fB-c\fR \fIdate-time\fR | \fB-c\fIdate-time\fR
.ad
.sp .6
.RS 4n
Use the most recent version checked in before the indicated date and time for
comparison. \fIdate-time\fR takes the form: \fIyy\fR[\fImm\fR[\fIdd\fR[
\fIhh\fR[\fImm\fR[\fIss\fR]\|]\|]\|]\|]. Omitted units default to their maximum
possible values; that is
.B -c7502
is equivalent to
.BR -c750228235959 .
.RE

.sp
.ne 2
.mk
.na
\fB-r\fR \fIsid\fR | \fB-r\fIsid\fR
.ad
.sp .6
.RS 4n
Use the version corresponding to the indicated delta for comparison.
.RE

.RE

.sp
.ne 2
.mk
.na
.B edit
.ad
.sp .6
.RS 4n
Retrieve a version of the file for editing. `\fBsccs edit\fR' extracts a
version of the file that is writable by you, and creates a \fBp.\fRfile in the
\fBSCCS\fR subdirectory as lock on the history, so that no one
else can check that version in or out.
.B ID
keywords are retrieved in
unexpanded form.
.B edit
accepts the same options as
.BR get ,
below. Refer
to
.BR sccs-get (1)
for a list of ID keywords and their definitions.
.RE

.sp
.ne 2
.mk
.na
.B enter
.ad
.sp .6
.RS 4n
Similar to
.BR create ,
but omits the final `\fBsccs get\fR'. This can be
used if an `\fBsccs edit\fR' is to be performed immediately after the history
file is initialized.
.RE

.SS "/usr/bin/sccs"
.sp
.LP
\fBfix\fR \fB-r\fIsid\fR
.SS "/usr/xpg4/bin/sccs"
.sp
.ne 2
.mk
.na
\fBfix -r\fR \fIsid\fR | \fB-r\fIsid\fR
.ad
.sp .6
.RS 4n
Revise a (leaf) delta.  Remove the indicated delta from the \fBSCCS\fR
history, but leave a working copy of the current version in the directory. This
is useful for incorporating trivial updates for which no audit record is
needed, or for revising the delta commentary. \fBfix\fR must be followed by a
\fB-r\fR option, to specify the \fBSID\fR of the delta to remove. The indicated
delta must be the most recent (leaf) delta in its branch. Use \fBfix\fR with
caution since it does not leave an audit trail of differences (although the
previous commentary is retained within the history file).
.RE

.SS "/usr/bin/sccs"
.sp
.LP
\fBget\fR [\fB-ekmps\fR] [\fB-G\fInewname\fR] [\fB-c\fIdate-time\fR]
[\fB-r\fR[\fIsid\fR] ]
.SS "/usr/xpg4/bin/sccs"
.sp
.ne 2
.mk
.na
\fBget\fR [\fB-ekmps\fR] [\fB-G\fR \fInewname\fR |
\fB-G\fInewname\fR]\fR
.ad
.br
.na
\fB[-c\fR \fIdate-time\fR | \fB-c\fIdate-time\fR] [\fB-r\fR \fIsid\fR |
\fB-r\fIsid\fR]\fR
.ad
.sp .6
.RS 4n
Retrieve a version from the
.B SCCS
history. By default, this is a
read-only working copy of the most recent version.
.B ID
keywords are in
expanded form. Refer to
.BR sccs-get (1),
which includes a list of
.BR ID
keywords and their definitions.
.sp
.ne 2
.mk
.na
\fB-c\fR \fIdate-time\fR | \fB-c\fIdate-time\fR
.ad
.sp .6
.RS 4n
Retrieve the latest version checked in prior to the date and time indicated by
the
.I date-time
argument.
.I date-time
takes the form:
\fIyy\fR[\fImm\fR[\fBdd\fR[ \fIhh\fR[\fImm\fR[\fIss\fR]\|]\|]\|]\|].
.RE

.sp
.ne 2
.mk
.na
.B -e
.ad
.sp .6
.RS 4n
Retrieve a version for editing. Same as
.BR "sccs edit" .
.RE

.sp
.ne 2
.mk
.na
\fB-G\fR \fInewname\fR | \fB-G\fInewname\fR
.ad
.sp .6
.RS 4n
Use
.I newname
as the name of the retrieved version.
.RE

.sp
.ne 2
.mk
.na
.B -k
.ad
.sp .6
.RS 4n
Retrieve a writable copy but do not check out the file.
.B ID
keywords are
unexpanded.
.RE

.sp
.ne 2
.mk
.na
.B -m
.ad
.sp .6
.RS 4n
Precede each line with the
.B SID
of the delta in which it was added.
.RE

.sp
.ne 2
.mk
.na
.B -p
.ad
.sp .6
.RS 4n
Produce the retrieved version on the standard output.  Reports that would
normally go to the standard output (delta \fBID\fRs and statistics) are
directed to the standard error.
.RE

.sp
.ne 2
.mk
.na
\fB-r\fR \fIsid\fR | \fB-r\fIsid\fR
.ad
.sp .6
.RS 4n
Retrieve the version corresponding to the indicated
.BR SID .
For
.BR /usr/bin/sccs ,
if no
.I sid
is specified, the latest
.I sid
for the
specified file is retrieved.
.RE

.sp
.ne 2
.mk
.na
.B -s
.ad
.sp .6
.RS 4n
Silent. Do not report version numbers or statistics.
.RE

.RE

.sp
.ne 2
.mk
.na
\fBhelp\fR \fImessage-code\fR|\fIsccs-command\fR
.ad
.br
.na
.B help stuck
.ad
.sp .6
.RS 4n
Supply more information about
.B SCCS
diagnostics.
.B help
displays a
brief explanation of the error when you supply the code displayed by an
\fBSCCS\fR diagnostic message.  If you supply the name of an \fBSCCS\fR
command, it prints a usage line.
.B help
also recognizes the keyword
.BR stuck .
Refer to
.BR sccs-help (1).
.RE

.SS "/usr/bin/sccs"
.sp
.LP
\fBinfo\fR [\fB-b\fR] [\fB-u\fR[\fIusername\fR] ]
.SS "/usr/xpg4/bin/sccs"
.sp
.ne 2
.mk
.na
\fBinfo\fR [\fB-b\fR] [\fB-u\fR [ \fIusername\fR] | \fB-U\fR]\fR
.ad
.sp .6
.RS 4n
Display a list of files being edited, including the version number checked
out, the version to be checked in, the name of the user who holds the lock, and
the date and time the file was checked out.
.sp
.ne 2
.mk
.na
.B -b
.ad
.sp .6
.RS 4n
Ignore branches.
.RE

.sp
.ne 2
.mk
.na
\fB-u\fR[\fIusername\fR] | \fB-u\fR [\fIusername\fR] | \fB-U\fR
.ad
.sp .6
.RS 4n
List only files checked out by you. When
.I username
is specified, list
only files checked out by that user. For
.BR /usr/xpg4/bin/sccs ,
the
.BR -U
option is equivalent to
.B -u
<\fIcurrent_user\fR>.
.RE

.RE

.sp
.ne 2
.mk
.na
.B print
.ad
.sp .6
.RS 4n
Print the entire history of each named file. Equivalent to an `\fBsccs prs\fR
\fB-e\fR' followed by an `\fBsccs get\fR \fB-p -m\fR'.
.RE

.SS "/usr/bin/sccs"
.sp
.LP
\fBprs\fR [\fB-el\fR] [\fB-c\fIdate-time\fR] [\fB-r\fIsid\fR]
.SS "/usr/xpg4/bin/sccs"
.sp
.ne 2
.mk
.na
\fBprs\fR [\fB-el\fR] \fB[ -c\fR \fIdate-time\fR |
\fB-c\fIdate-time\fR] [\fB-r\fR \fIsid\fR | \fB-r\fIsid\fR]\fR
.ad
.sp .6
.RS 4n
Peruse (display) the delta table, or other portion of an
.B s.
file. Refer
to
.BR sccs-prs (1).
.sp
.ne 2
.mk
.na
\fB-c\fR \fIdate-time\fR | \fB-c\fIdate-time\fR
.ad
.sp .6
.RS 4n
Specify the latest delta checked in before the indicated date and time. The
\fIdate-time\fR argument takes the orm: \fIyy\fR[\fImm\fR[\fBdd\fR[
\fIhh\fR[\fImm\fR[\fIss\fR]\|]\|]\|]\|].
.RE

.sp
.ne 2
.mk
.na
.B -e
.ad
.sp .6
.RS 4n
Display delta table information for all deltas earlier than the one specified
with
.B -r
(or all deltas if none is specified).
.RE

.sp
.ne 2
.mk
.na
.B -l
.ad
.sp .6
.RS 4n
Display information for all deltas later than, and including, that specified
by
.B -c
or
.BR -r .
.RE

.sp
.ne 2
.mk
.na
\fB-r\fR \fIsid\fR | \fB-r\fIsid\fR
.ad
.sp .6
.RS 4n
Specify a given delta by
.BR SID .
.RE

.RE

.sp
.ne 2
.mk
.na
\fBprt\fR [\fB-y\fR]\fR
.ad
.RS 12n
.rt
Display the delta table, but omit the
.B MR
field (see
.BR sccsfile (4)
for more information on this field). Refer to
.BR sccs-prt (1).
.sp
.ne 2
.mk
.na
.B -y
.ad
.RS 6n
.rt
Display the most recent delta table entry.  The format is a single output line
for each file argument, which is convenient for use in a pipeline with
.BR awk (1)
or
.BR sed (1).
.RE

.RE

.SS "/usr/bin/sccs"
.sp
.LP
\fBrmdel\fR \fB-r\fIsid\fR
.SS "/usr/xpg4/bin/sccs"
.sp
.ne 2
.mk
.na
\fBrmdel -r\fR \fIsid\fR
.ad
.sp .6
.RS 4n
Remove the indicated delta from the history file.  That delta must be the most
recent (leaf) delta in its branch. Refer to
.BR sccs-rmdel (1).
.RE

.sp
.ne 2
.mk
.na
.B sact
.ad
.sp .6
.RS 4n
Show editing activity status of an
.B SCCS
file. Refer to
.BR sccs-sact (1).
.RE

.sp
.ne 2
.mk
.na
\fBsccsdiff\fR \fB-r\fIold-sid\fR \fB-r\fInew-sid\fR
\fIdiff-options\fR
.ad
.sp .6
.RS 4n
Compare two versions corresponding to the indicated
.B SIDs
(deltas) using
\fBdiff\fR. Refer to \fBsccs-sccsdiff\fR(1).
.RE

.SS "/usr/bin/sccs"
.sp
.LP
\fBtell\fR [\fB-b\fR] [\fB-u\fR[\fIusername\fR] ]
.SS "/usr/xpg4/bin/sccs"
.sp
.ne 2
.mk
.na
\fBtell\fR [\fB-b\fR] [\fB-u\fR [\fIusername\fR] | \fB-U\fR]\fR
.ad
.sp .6
.RS 4n
Display the list of files that are currently checked out, one file per line.

.sp
.ne 2
.mk
.na
.B -b
.ad
.sp .6
.RS 4n
Ignore branches.
.RE

.sp
.ne 2
.mk
.na
\fB-u\fR[\fIusername\fR] | \fB-u\fR [\fIusername\fR] | \fB-U\fR
.ad
.sp .6
.RS 4n
List only files checked out to you.  When
.I username
is specified, list
only files checked out to that user. For
.BR /usr/xpg4/bin/sccs ,
the
\fB-U\fR option is equivalent to \fB-u\fR <\fIcurrent_user\fR>.
.RE

.RE

.sp
.ne 2
.mk
.na
.B unedit
.ad
.sp .6
.RS 4n
"Undo" the last \fBedit\fR or `\fBget -e\fR', and return the working
copy to its previous condition.
.B unedit
backs out all pending changes made
since the file was checked out.
.RE

.sp
.ne 2
.mk
.na
.B unget
.ad
.sp .6
.RS 4n
Same as
.BR unedit .
Refer to
.BR sccs-unget (1).
.RE

.sp
.ne 2
.mk
.na
.B val
.ad
.sp .6
.RS 4n
Validate the history file. Refer to
.BR sccs-val (1).
.RE

.sp
.ne 2
.mk
.na
.B what
.ad
.sp .6
.RS 4n
Display any expanded
.B ID
keyword strings contained in a binary (object)
or text file. Refer to
.BR what (1)
for more information.
.RE

.SH EXAMPLES
.LP
\fBExample 1\fR Checking out, editing, and checking in a file
.sp
.LP
To check out a copy of
.B program.c
for editing, edit it, and then check it
back in:

.sp
.in +2
.nf
example% \fBsccs edit program.c\fR
1.1
new delta 1.2
14 lines

example% \fBvi program.c
\fIyour editing session\fR

example% \fBsccs delget program.c\fR
comments? \fBclarified cryptic diagnostic\fR
1.2
3 inserted
2 deleted
12 unchanged
1.2
15 lines
.fi
.in -2
.sp

.LP
\fBExample 2\fR Defining the root portion of the command pathname
.sp
.LP
\fBsccs\fR converts the command:

.sp
.in +2
.nf
example% \fBsccs -d/usr/src/include get stdio.h\fR
.fi
.in -2
.sp

.sp
.LP
to:

.sp
.in +2
.nf
\fB/usr/bin/get   /usr/src/include/SCCS/s.stdio.h\fR
.fi
.in -2
.sp

.LP
\fBExample 3\fR Defining the resident subdirectory
.sp
.LP
The command:

.sp
.in +2
.nf
example% \fBsccs -pprivate get include/stdio.h\fR
.fi
.in -2
.sp

.sp
.LP
becomes:

.sp
.in +2
.nf
\fB/usr/bin/get   include/private/s.stdio.h\fR
.fi
.in -2
.sp

.LP
\fBExample 4\fR Initializing a history file
.sp
.LP
To initialize the history file for a source file named
.BR program.c ,
make
the
.B SCCS
subdirectory, and then use `\fBsccs create\fR':

.sp
.in +2
.nf
example% \fBmkdir SCCS\fR
example% \fBsccs create program.c\fR
program.c:
1.1
14 lines
.fi
.in -2
.sp

.sp
.LP
After verifying the working copy, you can remove the backup file that starts
with a comma:

.sp
.in +2
.nf
example% \fBdiff program.c ,program.c\fR
example% \fBrm ,program.c\fR
.fi
.in -2
.sp

.LP
\fBExample 5\fR Retrieving a file from another directory
.sp
.LP
To retrieve a file from another directory into the current directory:

.sp
.in +2
.nf
example% \fBsccs get /usr/src/sccs/cc.c\fR
.fi
.in -2
.sp

.sp
.LP
or:

.sp
.in +2
.nf
example% \fBsccs -p/usr/src/sccs/ get cc.c\fR
.fi
.in -2
.sp

.LP
\fBExample 6\fR Checking out all files
.sp
.LP
To check out all files under
.B SCCS
in the current directory:

.sp
.in +2
.nf
example% \fBsccs edit SCCS\fR
.fi
.in -2
.sp

.LP
\fBExample 7\fR Checking in all files
.sp
.LP
To check in all files currently checked out to you:

.sp
.in +2
.nf
example% \fBsccs delta `sccs tell -u`\fR
.fi
.in -2
.sp

.LP
\fBExample 8\fR Entering multiple lines of comments
.sp
.LP
If using
.B -y
to enter a comment, for most shells, enclose the comment in
single or double quotes. In the following example, \fBMyfile\fR is checked in
with a two-line comment:

.sp
.in +2
.nf
example% \fBsccs deledit Myfile -y"Entering a
multi-line comment"\fR
No id keywords (cm7)
1.2
2 inserted
0 deleted
14 unchanged
1.2
new delta 1.3
.fi
.in -2
.sp

.sp
.LP
Displaying the SCCS history of
.BR Myfile :

.sp
.in +2
.nf
example% \fBsccs prt Myfile\fR

SCCS/s.Myfile:

D 1.2   01/04/20  16:37:07  me 2 1    00002/00000/00014
Entering a
multi-line comment

D 1.1   01/04/15  13:23:32  me 1 0    00014/00000/00000
date and time created 01/04/15 13:23:32 by me
.fi
.in -2
.sp

.sp
.LP
If
.B -y
is not used and
.B sccs
prompts for a comment, the newlines
must be escaped using the backslash character (\fB\e\fR):

.sp
.in +2
.nf
example% \fBsccs deledit Myfile\fR
comments? \fBEntering a \e
multi-line comment\fR
No id keywords (cm7)
1.2
0 inserted
0 deleted
14 unchanged
1.2
new delta 1.3
.fi
.in -2
.sp

.SH ENVIRONMENT VARIABLES
.sp
.LP
See
.BR environ (5)
for descriptions of the following environment variables
that affect the execution of
.BR sccs :
.BR LANG ,
.BR LC_ALL ,
.BR LC_CTYPE ,
.BR LC_MESSAGES ,
and
.BR NLSPATH .
.sp
.ne 2
.mk
.na
.B PROJECTDIR
.ad
.RS 14n
.rt
If contains an absolute path name (beginning with a slash), \fBsccs\fR
searches for
.B SCCS
history files in the directory given by that
variable.
.sp
If
.B PROJECTDIR
does not begin with a slash, it is taken as the name of a
user, and
.B sccs
searches the
.B src
or
.B source
subdirectory of
that user's home directory for history files. If such a directory is found, it
is used. Otherwise, the value is used as a relative path name.
.RE

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 6n
.rt
Successful completion.
.RE

.sp
.ne 2
.mk
.na
.B >0
.ad
.RS 6n
.rt
An error occurred.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B SCCS
.ad
.RS 15n
.rt
\fBSCCS\fR subdirectory
.RE

.sp
.ne 2
.mk
.na
\fBSCCS/d.\fIfile\fR
.ad
.RS 15n
.rt
temporary file of differences
.RE

.sp
.ne 2
.mk
.na
\fBSCCS/p.\fIfile\fR
.ad
.RS 15n
.rt
lock (permissions) file for checked-out versions
.RE

.sp
.ne 2
.mk
.na
\fBSCCS/q.\fIfile\fR
.ad
.RS 15n
.rt
temporary file
.RE

.sp
.ne 2
.mk
.na
\fBSCCS/s.\fIfile\fR
.ad
.RS 15n
.rt
\fBSCCS\fR history file
.RE

.sp
.ne 2
.mk
.na
\fBSCCS/x.\fIfile\fR
.ad
.RS 15n
.rt
temporary copy of the \fBs.\fRfile
.RE

.sp
.ne 2
.mk
.na
\fBSCCS/z.\fIfile\fR
.ad
.RS 15n
.rt
temporary lock file
.RE

.sp
.ne 2
.mk
.na
.B /usr/bin/*
.ad
.RS 15n
.rt
\fBSCCS\fR utility programs
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.SS "/usr/bin/sccs"
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWsprot
.TE

.SS "/usr/xpg4/bin/sccs"
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWxcu4t
_
Interface StabilityStandard
.TE

.SH SEE ALSO
.sp
.LP
.BR awk (1),
.BR diff (1),
.BR sccs-admin (1),
.BR sccs-cdc (1),
.BR sccs-comb (1),
.BR sccs-delta (1),
.BR sccs-get (1),
.BR sccs-help (1),
.BR sccs-prs (1),
.BR sccs-rmdel (1),
.BR sccs-sact (1),
.BR sccs-sccsdiff (1),
.BR sccs-unget (1),
.BR sccs-val (1),
.BR sed (1),
.BR what (1),
.BR sccsfile (4),
.BR attributes (5),
.BR environ (5),
.BR standards (5)
