usr/src/man/man1/sh.1
'\" te
.\" Copyright 1989 AT&T
.\" Copyright (c) 2008, Sun Microsystems, Inc. All Rights Reserved.
.\" Portions Copyright (c) 1992, X/Open Company Limited All Rights Reserved
.\"
.\" Sun Microsystems, Inc. gratefully acknowledges The Open Group for
.\" permission to reproduce portions of its copyrighted documentation.
.\" Original documentation from The Open Group can be obtained online
.\" at http://www.opengroup.org/bookstore/.
.\"
.\" The Institute of Electrical and Electronics Engineers and The Open Group,
.\" have given us permission to reprint portions of their documentation.
.\"
.\" In the following statement, the phrase "this text" refers to portions
.\" of the system documentation.
.\"
.\" Portions of this text are reprinted and reproduced in electronic form in
.\" the Sun OS Reference Manual, from IEEE Std 1003.1, 2004 Edition, Standard
.\" for Information Technology -- Portable Operating System Interface (POSIX),
.\" The Open Group Base Specifications Issue 6, Copyright (C) 2001-2004 by the
.\" Institute of Electrical and Electronics Engineers, Inc and The Open Group.
.\" In the event of any discrepancy between these versions and the original
.\" IEEE and The Open Group Standard, the original IEEE and The Open Group
.\" Standard is the referee document.
.\"
.\" The original Standard can be obtained online at
.\" http://www.opengroup.org/unix/online.html.
.\"
.\" This notice shall appear on any product containing this material.
.\"
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH sh 1 "3 Apr 2008" "SunOS 5.11" "User Commands"
.SH NAME
sh, jsh \- standard and job control shell and command interpreter
.SH SYNOPSIS
.LP
.nf
\fB/usr/bin/sh\fR  [\fB-acefhiknprstuvx\fR] [\fIargument\fR].\|.\|.
.fi

.LP
.nf
\fB/usr/xpg4/bin/sh\fR  [\(+- abCefhikmnoprstuvx]
     [\(+- o \fIoption\fR].\|.\|. [\fB-c\fR \fIstring\fR] [\fIarg\fR].\|.\|.
.fi

.LP
.nf
\fB/usr/bin/jsh\fR  [\fB-acefhiknprstuvx\fR] [\fIargument\fR].\|.\|.
.fi

.SH DESCRIPTION
.sp
.LP
The
.B /usr/bin/sh
utility is a command programming language that
executes commands read from a terminal or a file.
.sp
.LP
The
.B /usr/xpg4/bin/sh
utility is a standards compliant shell. This
utility provides all the functionality of
.BR ksh (1),
except in cases
discussed in
.BR ksh (1)
where differences in behavior exist.
.sp
.LP
The
.B jsh
utility is an interface to the shell that provides all of the
functionality of
.B sh
.RB "and enables job control (see" " Job Control"
section below).
.sp
.LP
Arguments to the shell are listed in the
.B Invocation
section below.
.SS "Definitions"
.sp
.LP
A
.I blank
is a tab or a space. A
.I name
is a sequence of
\fBASCII\fR letters, digits, or underscores, beginning with a letter or an
underscore. A
.I parameter
is a name, a digit, or any of the characters
.BR * ,
.BR @ ,
.BR # ,
.BR ? ,
.BR \(mi ,
.BR $ ,
and
.BR ! .
.SH USAGE
.SS "Commands"
.sp
.LP
A
.I simple-command
is a sequence of non-blank \fIword\fRs separated by
\fIblank\fRs. The first \fIword\fR specifies the name of the command to be
executed. Except as specified below, the remaining \fIword\fRs are passed as
arguments to the invoked command. The command name is passed as argument 0
(see
.BR exec (2)).
The
.I value
of a
.I simple-command
is its exit
status if it terminates normally, or (octal) \fB200\fR+\fIstatus\fR if it
terminates abnormally. See \fBsignal.h\fR(3HEAD) for a list of status
values.
.sp
.LP
A
.I pipeline
is a sequence of one or more
.IR command "s separated by"
.BR | .
The standard output of each
.I command
but the last is connected
by a
.BR pipe (2)
to the standard input of the next
.IR command .
Each
\fIcommand\fR is run as a separate process. The shell waits for the last
\fIcommand\fR to terminate. The exit status of a \fIpipeline\fR is the exit
status of the last command in the
.IR pipeline .
.sp
.LP
A
.I list
is a sequence of one or more
.IR pipeline "s separated by"
.BR ; ,
.BR & ,
.BR && ,
or \fB|\||\fR, and optionally terminated by
\fB;\fR or
.BR & \&.
Of these four symbols,
.B ;
and
.B &
have equal
precedence, which is lower than that of
.B &&
and \fB|\||\fR. The symbols
\fB&&\fR and \fB|\||\fR also have equal precedence. A semicolon (\fB;\fR)
causes sequential execution of the preceding
.IR pipeline ,
that is, the
shell waits for the
.I pipeline
to finish before executing any commands
following the semicolon. An ampersand (\fB&\fR) causes asynchronous
execution of the preceding pipeline, that is, the shell does
.B not
wait
for that pipeline to finish. The symbol
.B &&
(\|\fB|\||\fR) causes the
\fIlist\fR following it to be executed only if the preceding pipeline
returns a zero (non-zero) exit status. An arbitrary number of newlines can
appear in a
.IR list ,
instead of semicolons, to delimit commands.
.sp
.LP
A
.I command
is either a
.I simple-command
or one of the following.
Unless otherwise stated, the value returned by a command is that of the last
\fIsimple-command\fR executed in the command.
.sp
.ne 2
.mk
.na
\fBfor\fR \fIname\fR [ \fBin\fR \fIword\fR .\|.\|. ] \fBdo\fR \fIlist\fR
.B done
.ad
.sp .6
.RS 4n
Each time a \fBfor\fR command is executed,
.I name
is set to the next
\fIword\fR taken from the \fBin\fR \fIword\fR list. If \fBin\fR \fIword\fR
\&.\|.\|. is omitted, then the \fBfor\fR command executes the \fBdo\fR
\fIlist\fR once for each positional parameter that is set (see \fBParameter
Substitution\fR section below). Execution ends when there are no more words
in the list.
.RE

.sp
.ne 2
.mk
.na
\fBcase\fR \fIword\fR \fBin\fR [ \fIpattern\fR [ | \fIpattern\fR ]
\fB)\fR \fIlist\fR \fB;\|;\fR ] .\|.\|.  \fBesac\fR
.ad
.sp .6
.RS 4n
A
.B case
command executes the
.I list
associated with the first
\fIpattern\fR that matches
.IR word .
The form of the patterns is the same
as that used for file-name generation (see \fBFile Name Generation\fR
section), except that a slash, a leading dot, or a dot immediately following
a slash need not be matched explicitly.
.RE

.sp
.LP
\fBif\fR \fIlist\fR \fB; then\fR \fIlist\fR \fBelif\fR \fIlist\fR \fB;
then\fR \fIlist\fR \fB;\fR ] .\|.\|. [ \fBelse\fR \fIlist\fR
.B ;
]
\fBfi\fR
.sp
.LP
The
.I list
following \fBif\fR is executed and, if it returns a zero
exit status, the
.I list
following the first
.B then
is executed.
Otherwise, the
.I list
following \fBelif\fR is executed and, if its value
is zero, the
.I list
following the next
.B then
is executed. Failing
that, the
.B else
\fIlist\fR is executed. If no \fBelse\fR \fIlist\fR or
.B then
.I list
is executed, then the \fBif\fR command returns a zero
exit status.
.sp
.ne 2
.mk
.na
.B while
.I list
.B do
.I list
.B done
.ad
.RS 27n
.rt
A
.B while
command repeatedly executes the
.B while
\fIlist\fR and,
if the exit status of the last command in the list is zero, executes the
.B do
.IR list ;
otherwise the loop terminates. If no commands in the
.B do
.I list
are executed, then the
.B while
command returns a
zero exit status;
.B until
can be used in place of
.B while
to negate
the loop termination test.
.RE

.sp
.ne 2
.mk
.na
\fB(\fIlist\fB)\fR
.ad
.RS 27n
.rt
Execute
.I list
in a sub-shell.
.RE

.sp
.ne 2
.mk
.na
\fB{\fR \fIlist\fB;}\fR
.ad
.RS 27n
.rt
\fIlist\fR is executed in the current (that is, parent) shell. The \fB{\fR
must be followed by a space.
.RE

.sp
.ne 2
.mk
.na
\fIname\fR \fB(\|) {\fR \fIlist\fB;}\fR
.ad
.RS 27n
.rt
Define a function which is referenced by
.IR name .
The body of the
function is the
.I list
of commands between
.BR { " and"
.BR } .
The
\fB{\fR must be followed by a space. Execution of functions is described
below (see
.B Execution
section). The
.B {
and
.B }
are unnecessary
if the body of the function is a
.I command
as defined above, under
.BR Commands .
.RE

.sp
.LP
The following words are only recognized as the first word of a command and
when not quoted:
.sp
.LP
\fBif  then  else  elif  fi  case  esac  for  while  until  do done  {
}\fR
.SS "Comments Lines"
.sp
.LP
A word beginning with
.B #
causes that word and all the following
characters up to a newline to be ignored.
.SS "Command Substitution"
.sp
.LP
The shell reads commands from the string between two grave accents
(\fB``\fR) and the standard output from these commands can be used as all or
part of a word. Trailing newlines from the standard output are removed.
.sp
.LP
No interpretation is done on the string before the string is read, except
to remove backslashes (\fB\e\fR) used to escape other characters.
Backslashes can be used to escape a grave accent (\fB`\fR) or another
backslash (\fB\e\fR) and are removed before the command string is read.
Escaping grave accents allows nested command substitution. If the command
substitution lies within a pair of double quotes (\fB" .\|.\|.\|` .\|.\|.\|`
\&.\|.\|.\| "\fR), a backslash used to escape a double quote (\fB\e"\fR) is
removed. Otherwise, it is left intact.
.sp
.LP
If a backslash is used to escape a newline character (\fB\enewline\fR),
both the backslash and the newline are removed (see the later section on
.BR Quoting ).
In addition, backslashes used to escape dollar signs
(\fB\e$\fR) are removed. Since no parameter substitution is done on the
command string before it is read, inserting a backslash to escape a dollar
sign has no effect. Backslashes that precede characters other than
.BR \e ,
\fB`\fR, \fB"\fR, \fBnewline\fR, and \fB$\fR are left intact when the
command string is read.
.SS "Parameter Substitution"
.sp
.LP
The character
.B $
is used to introduce substitutable
.IR parameter s.
There are two types of parameters, positional and keyword. If
\fIparameter\fR is a digit, it is a positional parameter. Positional
parameters can be assigned values by
.BR set .
Keyword parameters (also
known as variables) can be assigned values by writing:
.sp
.LP
\fIname\fB=\fIvalue\fR [ \fIname\fB=\fIvalue\fR ] .\|.\|.
.sp
.LP
Pattern-matching is not performed on
.IR value .
There cannot be a
function and a variable with the same
.IR name .
.sp
.ne 2
.mk
.na
\fB${\fIparameter\fB}\fR
.ad
.RS 25n
.rt
The value, if any, of the parameter is substituted. The braces are required
only when
.I parameter
is followed by a letter, digit, or underscore that
is not to be interpreted as part of its name. If
.I parameter
is
.BR *
or
.BR @ ,
all the positional parameters, starting with
.BR $1 ,
are
substituted (separated by spaces). Parameter
.B $0
is set from argument
zero when the shell is invoked.
.RE

.sp
.ne 2
.mk
.na
\fB${\fIparameter\fB:\(mi\fIword\fB}\fR
.ad
.RS 25n
.rt
Use Default Values. If
.I parameter
is unset or null, the expansion of
\fIword\fR is substituted; otherwise, the value of \fIparameter\fR is
substituted.
.RE

.sp
.ne 2
.mk
.na
\fB${\fIparameter\fB:=\fIword\fB}\fR
.ad
.RS 25n
.rt
Assign Default Values. If
.I parameter
is unset or null, the expansion
of
.I word
is assigned to
.IR parameter .
In all cases, the final value
of
.I parameter
is substituted. Only variables, not positional parameters
or special parameters, can be assigned in this way.
.RE

.sp
.ne 2
.mk
.na
\fB${\fIparameter\fB:?\fIword\fB}\fR
.ad
.RS 25n
.rt
If
.I parameter
is set and is non-null, substitute its value; otherwise,
print
.I word
and exit from the shell. If
.I word
is omitted, the
message "parameter null or not set" is printed.
.RE

.sp
.ne 2
.mk
.na
\fB${\fIparameter\fB:+\fIword\fB}\fR
.ad
.RS 25n
.rt
If
.I parameter
is set and is non-null, substitute
.IR word ;
otherwise
substitute nothing.
.RE

.sp
.LP
In the above,
.I word
is not evaluated unless it is to be used as the
substituted string, so that, in the following example,
.B pwd
is executed
only if
.B d
is not set or is null:
.sp
.in +2
.nf
\fBecho  ${d:\(mi`pwd`}\fR
.fi
.in -2
.sp

.sp
.LP
If the colon (\fB:\fR) is omitted from the above expressions, the shell
only checks whether
.I parameter
is set or not.
.sp
.LP
The following parameters are automatically set by the shell.
.sp
.ne 2
.mk
.na
.B #
.ad
.RS 8n
.rt
The number of positional parameters in decimal.
.RE

.sp
.ne 2
.mk
.na
\fB\(mi\fR
.ad
.RS 8n
.rt
Flags supplied to the shell on invocation or by the
.B set
command.
.RE

.sp
.ne 2
.mk
.na
.B ?
.ad
.RS 8n
.rt
The decimal value returned by the last synchronously executed command.
.RE

.sp
.ne 2
.mk
.na
.B $
.ad
.RS 8n
.rt
The process number of this shell.
.RE

.sp
.ne 2
.mk
.na
.B !
.ad
.RS 8n
.rt
The process number of the last background command invoked.
.RE

.sp
.LP
The following parameters are used by the shell. The parameters in this
section are also referred to as environment variables.
.sp
.ne 2
.mk
.na
.B HOME
.ad
.RS 13n
.rt
The default argument (home directory) for the
.B cd
command, set to the
user's login directory by
.BR login (1)
from the password file (see
.BR passwd (4)).
.RE

.sp
.ne 2
.mk
.na
.B PATH
.ad
.RS 13n
.rt
The search path for commands (see
.B Execution
section below).
.RE

.sp
.ne 2
.mk
.na
.B CDPATH
.ad
.RS 13n
.rt
The search path for the
.B cd
command.
.RE

.sp
.ne 2
.mk
.na
.B MAIL
.ad
.RS 13n
.rt
If this parameter is set to the name of a mail file
.I and
the
\fBMAILPATH\fR parameter is not set, the shell informs the user of the
arrival of mail in the specified file.
.RE

.sp
.ne 2
.mk
.na
.B MAILCHECK
.ad
.RS 13n
.rt
This parameter specifies how often (in seconds) the shell checks for the
arrival of mail in the files specified by the
.B MAILPATH
or
.BR MAIL
parameters. The default value is
.B 600
seconds (10 minutes). If set to
0, the shell checks before each prompt.
.RE

.sp
.ne 2
.mk
.na
.B MAILPATH
.ad
.RS 13n
.rt
A colon-separated list of file names. If this parameter is set, the shell
informs the user of the arrival of mail in any of the specified files. Each
file name can be followed by % and a message that is e printed when the
modification time changes. The default message is,
.BR "you have mail" .
.RE

.sp
.ne 2
.mk
.na
.B PS1
.ad
.RS 13n
.rt
Primary prompt string, by default " $ \|".
.RE

.sp
.ne 2
.mk
.na
.B PS2
.ad
.RS 13n
.rt
Secondary prompt string, by default " > \|".
.RE

.sp
.ne 2
.mk
.na
.B IFS
.ad
.RS 13n
.rt
Internal field separators, normally
.BR space ,
.BR tab ,
and
\fBnewline\fR (see \fBBlank Interpretation\fR section).
.RE

.sp
.ne 2
.mk
.na
.B SHACCT
.ad
.RS 13n
.rt
If this parameter is set to the name of a file writable by the user, the
shell writes an accounting record in the file for each shell procedure
executed.
.RE

.sp
.ne 2
.mk
.na
.B SHELL
.ad
.RS 13n
.rt
.RB "When the shell is invoked, it scans the environment (see" " Environment"
section below) for this name.
.RE

.sp
.LP
See
.BR environ (5)
for descriptions of the following environment
variables that affect the execution of
.BR sh :
\fBLC_CTYPE\fR and
.BR LC_MESSAGES .
.sp
.LP
The shell gives default values to
.BR PATH ,
.BR PS1 ,
.BR PS2 ,
.BR MAILCHECK ,
and
.BR IFS .
Default values for
.B HOME
and
.BR MAIL
are set by
.BR login (1).
.SS "Blank Interpretation"
.sp
.LP
After parameter and command substitution, the results of substitution are
scanned for internal field separator characters (those found in
.BR IFS )
and split into distinct arguments where such characters are found. Explicit
null arguments (\fB""\fR or \fB\&''\fR) are retained. Implicit null
arguments (those resulting from \fIparameter\fRs that have no values) are
removed.
.SS "Input/Output Redirection"
.sp
.LP
A command's input and output can be redirected using a special notation
interpreted by the shell. The following can appear anywhere in a
\fIsimple-command\fR or can precede or follow a \fIcommand\fR and are
\fBnot\fR passed on as arguments to the invoked command. \fBNote:\fR
Parameter and command substitution occurs before
.I word
or
.IR digit
is used.
.sp
.ne 2
.mk
.na
\fB<\fIword\fR
.ad
.RS 16n
.rt
Use file
.I word
as standard input (file descriptor 0).
.RE

.sp
.ne 2
.mk
.na
\fB>\fIword\fR
.ad
.RS 16n
.rt
Use file
.I word
as standard output (file descriptor 1). If the file
does not exist, it is created; otherwise, it is truncated to zero length.
.RE

.sp
.ne 2
.mk
.na
\fB>>\fIword\fR
.ad
.RS 16n
.rt
Use file
.I word
as standard output. If the file exists, output is
appended to it by first seeking to the
.BR EOF .
Otherwise, the file is
created.
.RE

.sp
.ne 2
.mk
.na
\fB<\|>\fIword\fR
.ad
.RS 16n
.rt
Open file
.I word
for reading and writing as standard input.
.RE

.sp
.ne 2
.mk
.na
\fB<<\fR[\fB\(mi\fR]\fIword\fR
.ad
.RS 16n
.rt
After parameter and command substitution is done on
.IR word ,
the shell
input is read up to the first line that literally matches the resulting
.IR word ,
or to an
.BR EOF .
If, however, the hyphen (\fB\(mi\fR) is
appended to
.BR << :
.RS +4
.TP
1.
leading tabs are stripped from
.I word
before the shell input is read
(but after parameter and command substitution is done on
.IR word );
.RE
.RS +4
.TP
2.
leading tabs are stripped from the shell input as it is read and before
each line is compared with
.IR word ;
and
.RE
.RS +4
.TP
3.
shell input is read up to the first line that literally matches the
resulting
.IR word ,
or to an
.BR EOF .
.RE
If any character of
.I word
is quoted (see
.B Quoting
section later),
no additional processing is done to the shell input. If no characters of
\fIword\fR are quoted:
.RS +4
.TP
1.
parameter and command substitution occurs;
.RE
.RS +4
.TP
2.
(escaped) \fB\enewline\fRs are removed; and
.RE
.RS +4
.TP
3.
\fB\e\fR must be used to quote the characters \fB\e\fR,
.BR $ ,
and
.BR ` .
.RE
The resulting document becomes the standard input.
.RE

.sp
.ne 2
.mk
.na
\fB<&\fIdigit\fR
.ad
.RS 16n
.rt
Use the file associated with file descriptor
.I digit
as standard input.
Similarly for the standard output using \fB>&\fIdigit\fR.
.RE

.sp
.ne 2
.mk
.na
\fB<&\(mi\fR
.ad
.RS 16n
.rt
The standard input is closed. Similarly for the standard output using
.BR >&\(mi .
.RE

.sp
.LP
If any of the above is preceded by a digit, the file descriptor which is
associated with the file is that specified by the digit (instead of the
default
.B 0
or
.BR 1 ).
For example:
.sp
.in +2
.nf
\fB\&.\|.\|. 2>&1\fR
.fi
.in -2
.sp

.sp
.LP
associates file descriptor 2 with the file currently associated with file
descriptor 1.
.sp
.LP
The order in which redirections are specified is significant. The shell
evaluates redirections left-to-right. For example:
.sp
.in +2
.nf
\fB\&.\|.\|. 1>\fIxxx\fR 2>&1\fR
.fi
.in -2
.sp

.sp
.LP
first associates file descriptor 1 with file
.IR xxx .
It associates file
descriptor 2 with the file associated with file descriptor 1 (that is,
.IR xxx ).
If the order of redirections were reversed, file descriptor 2
would be associated with the terminal (assuming file descriptor 1 had been)
and file descriptor 1 would be associated with file
.IR xxx .
.sp
.LP
Using the terminology introduced on the first page, under
.BR Commands ,
if a
.I command
is composed of several
.IR "simple commands" ,
redirection
is evaluated for the entire
.I command
before it is evaluated for each
.IR "simple command" .
That is, the shell evaluates redirection for the
entire
.IR list ,
then each
.I pipeline
within the
.IR list ,
then each
\fIcommand\fR within each
.IR pipeline ,
then each
.I list
within each
.IR command .
.sp
.LP
If a command is followed by
.BR & ,
the default standard input for the
command is the empty file,
.BR /dev/null .
Otherwise, the environment for
the execution of a command contains the file descriptors of the invoking
shell as modified by input/output specifications.
.SS "File Name Generation"
.sp
.LP
Before a command is executed, each command
.I word
is scanned for the
characters
.BR * ,
.BR ? ,
and
.BR [ .
If one of these characters appears
the word is regarded as a
.IR pattern .
The word is replaced with
alphabetically sorted file names that match the pattern. If no file name is
found that matches the pattern, the word is left unchanged. The character
\fB\&.\fR at the start of a file name or immediately following a
.BR / ,
as
well as the character
.B /
itself, must be matched explicitly.
.sp
.ne 2
.mk
.na
.B *
.ad
.RS 13n
.rt
Matches any string, including the null string.
.RE

.sp
.ne 2
.mk
.na
.B ?
.ad
.RS 13n
.rt
Matches any single character.
.RE

.sp
.ne 2
.mk
.na
\fB[\fR.\|.\|.\fB]\fR
.ad
.RS 13n
.rt
Matches any one of the enclosed characters. A pair of characters separated
by \fB\(mi\fR matches any character lexically between the pair, inclusive.
If the first character following the opening
.B [
is a
.BR ! ,
any
character not enclosed is matched.
.RE

.sp
.LP
Notice that all quoted characters (see below) must be matched explicitly in
a filename.
.SS "Quoting"
.sp
.LP
The following characters have a special meaning to the shell and cause
termination of a word unless quoted:
.sp
.LP
.B ";  &  (  )  |  ^  <  >  newline  space  tab
.sp
.LP
A character can be
.I quoted
(that is, made to stand for itself) by
preceding it with a backslash (\fB\e\fR) or inserting it between a pair of
quote marks (\fB\|'\|'\fR or \fB""\fR). During processing, the shell can
quote certain characters to prevent them from taking on a special meaning.
Backslashes used to quote a single character are removed from the word
before the command is executed. The pair \fB\enewline\fR is removed from a
word before command and parameter substitution.
.sp
.LP
All characters enclosed between a pair of single quote marks
(\fB\|'\|'\fR), except a single quote, are quoted by the shell. Backslash
has no special meaning inside a pair of single quotes. A single quote can be
quoted inside a pair of double quote marks (for example, \fB"\|'"\fR), but a
single quote can not be quoted inside a pair of single quotes.
.sp
.LP
Inside a pair of double quote marks (\fB""\fR), parameter and command
substitution occurs and the shell quotes the results to avoid blank
interpretation and file name generation. If
.B $*
is within a pair of
double quotes, the positional parameters are substituted and quoted,
separated by quoted spaces (\fB"$1 \|$2\fR \|.\|.\|.\fB"\fR). However, if
\fB$@\fR is within a pair of double quotes, the positional parameters are
substituted and quoted, separated by unquoted spaces (\fB"$1"\|"$2"\fR \|
\&.\|.\|. ). \fB\e\fR quotes the characters \fB\e\fR,
.BR ` ,
.B ,
(comma), and
.BR $ .
The pair \fB\enewline\fR is removed before parameter
and command substitution. If a backslash precedes characters other than
.BR \e ,
.BR ` ,
\fB,\fR (comma),
.BR $ ,
and newline, then the backslash
itself is quoted by the shell.
.SS "Prompting"
.sp
.LP
When used interactively, the shell prompts with the value of \fBPS1\fR
before reading a command. If at any time a newline is typed and further
input is needed to complete a command, the secondary prompt (that is, the
value of
.BR PS2 )
is issued.
.SS "Environment"
.sp
.LP
The
.I environment
(see
.BR environ (5))
is a list of name-value pairs
that is passed to an executed program in the same way as a normal argument
list. The shell interacts with the environment in several ways. On
invocation, the shell scans the environment and creates a parameter for each
name found, giving it the corresponding value. If the user modifies the
value of any of these parameters or creates new parameters, none of these
affects the environment unless the
.B export
command is used to bind the
shell's parameter to the environment (see also
.BR "set -a" ).
A
parameter can be removed from the environment with the
.B unset
command.
The environment seen by any executed command is thus composed of any
unmodified name-value pairs originally inherited by the shell, minus any
pairs removed by
.BR unset ,
plus any modifications or additions, all of
which must be noted in
.B export
commands.
.sp
.LP
The environment for any
.I simple-command
can be augmented by prefixing
it with one or more assignments to parameters. Thus:
.sp
.in +2
.nf
\fBTERM=450  \fIcommand\fR
.fi
.in -2
.sp

.sp
.LP
and
.sp
.in +2
.nf
\fB(export TERM; TERM=450;   \fIcommand\fR
.fi
.in -2
.sp

.sp
.LP
are equivalent as far as the execution of
.I command
is concerned if
\fIcommand\fR is not a Special Command. If \fIcommand\fR is a Special
Command, then
.sp
.in +2
.nf
\fBTERM=450   \fIcommand\fR
.fi
.in -2
.sp

.sp
.LP
modifies the
.B TERM
variable in the current shell.
.sp
.LP
If the
.B -k
flag is set,
.I all
keyword arguments are placed in the
environment, even if they occur after the command name. The following
example first prints
.B "a=b c"
and
.BR c :
.sp
.in +2
.nf
\fBecho a=b  c

a=b  c

set  \(mik

echo a=b  c

c\fR
.fi
.in -2
.sp

.SS "Signals"
.sp
.LP
The
.B INTERRUPT
and
.B QUIT
signals for an invoked command are
ignored if the command is followed by
.BR & \&.
Otherwise, signals have the
values inherited by the shell from its parent, with the exception of signal
11 (but see also the
.B trap
command below).
.SS "Execution"
.sp
.LP
Each time a command is executed, the command substitution, parameter
substitution, blank interpretation, input/output redirection, and filename
generation listed above are carried out. If the command name matches the
name of a defined function, the function is executed in the shell process
(note how this differs from the execution of shell script files, which
require a sub-shell for invocation). If the command name does not match the
name of a defined function, but matches one of the \fBSpecial Commands\fR
listed below, it is executed in the shell process.
.sp
.LP
The positional parameters
.BR $1 ,
.BR $2 ,
\&.\|.\|. are set to the
arguments of the function. If the command name matches neither a \fBSpecial
Command\fR nor the name of a defined function, a new process is created and
an attempt is made to execute the command via
.BR exec (2).
.sp
.LP
The shell parameter
.B PATH
defines the search path for the directory
containing the command. Alternative directory names are separated by a colon
(\fB:\fR). The default path is
.BR /usr/bin .
The current directory is
specified by a null path name, which can appear immediately after the equal
sign, between two colon delimiters anywhere in the path list, or at the end
of the path list. If the command name contains a
.B /
the search path is
not used. Otherwise, each directory in the path is searched for an
executable file. If the file has execute permission but is not an
\fBa.out\fR file, it is assumed to be a file containing shell commands. A
sub-shell is spawned to read it. A parenthesized command is also executed in
a sub-shell.
.sp
.LP
The location in the search path where a command was found is remembered by
the shell (to help avoid unnecessary \fIexec\fRs later). If the command was
found in a relative directory, its location must be re-determined whenever
the current directory changes. The shell forgets all remembered locations
whenever the
.B PATH
variable is changed or the
.BR "hash -r"
command is executed (see below).
.SS "Special Commands"
.sp
.LP
Input/output redirection is now permitted for these commands. File
descriptor 1 is the default output location. When Job Control is enabled,
additional
.B "Special Commands"
are added to the shell's environment (see
\fBJob Control\fR section below).
.sp
.ne 2
.mk
.na
.B :
.ad
.sp .6
.RS 4n
No effect; the command does nothing. A zero exit code is returned.
.RE

.sp
.ne 2
.mk
.na
\fB\&.\|\fR \fIfilename\fR
.ad
.sp .6
.RS 4n
Read and execute commands from \fIfilename\fR and return. The search path
specified by
.B PATH
is used to find the directory containing
.IR filename .
.RE

.sp
.ne 2
.mk
.na
\fBbg\fR [\fB%\fIjobid .\|.\|.\fR]\fR
.ad
.sp .6
.RS 4n
When Job Control is enabled, the
.B bg
command is added to the user's
environment to manipulate jobs. Resumes the execution of a stopped job in
the background. If \fB%\fIjobid\fR is omitted the current job is assumed.
(See
.B "Job Control"
section below for more detail.)
.RE

.sp
.ne 2
.mk
.na
\fBbreak\fR [ \fIn\fR ]\fR
.ad
.sp .6
.RS 4n
Exit from the enclosing \fBfor\fR or \fBwhile\fR loop, if any. If \fIn\fR
is specified, break
.I n
levels.
.RE

.sp
.ne 2
.mk
.na
\fBcd\fR [ \fIargument\fR ]\fR
.ad
.sp .6
.RS 4n
Change the current directory to
.IR argument .
The shell parameter
\fBHOME\fR is the default
.IR argument .
The shell parameter
.BR CDPATH
defines the search path for the directory containing
.IR argument .
Alternative directory names are separated by a colon
.RB ( : ).
The default
path is
.B <null>
(specifying the current directory).
.B Note:
The
current directory is specified by a null path name, which can appear
immediately after the equal sign or between the colon delimiters anywhere
else in the path list. If
.I argument
begins with a
.B /
the search
path is not used. Otherwise, each directory in the path is searched for
.IR argument .
.RE

.sp
.ne 2
.mk
.na
\fBchdir\fR [ \fIdir\fR ]\fR
.ad
.sp .6
.RS 4n
\fBchdir\fR changes the shell's working directory to directory
.IR dir .
If no argument is given, change to the home directory of the user. If
\fIdir\fR is a relative pathname not found in the current directory, check
for it in those directories listed in the
.B CDPATH
variable. If
\fIdir\fR is the name of a shell variable whose value starts with a
.BR / ,
change to the directory named by that value.
.RE

.sp
.ne 2
.mk
.na
\fBcontinue\fR [ \fIn\fR ]\fR
.ad
.sp .6
.RS 4n
Resume the next iteration of the enclosing \fBfor\fR or
.B while
loop.
If
.I n
is specified, resume at the \fIn\fR-th enclosing loop.
.RE

.sp
.ne 2
.mk
.na
\fBecho\fR [ \fIarguments\fR .\|.\|. ]\fR
.ad
.sp .6
.RS 4n
The words in
.I arguments
are written to the shell's standard output,
separated by space characters. See
.BR echo (1)
for fuller usage and
description.
.RE

.sp
.ne 2
.mk
.na
\fBeval\fR [ \fIargument\fR .\|.\|. ]\fR
.ad
.sp .6
.RS 4n
The arguments are read as input to the shell and the resulting command(s)
executed.
.RE

.sp
.ne 2
.mk
.na
\fBexec\fR [ \fIargument\fR .\|.\|. ]\fR
.ad
.sp .6
.RS 4n
The command specified by the arguments is executed in place of this shell
without creating a new process. Input/output arguments can appear and, if no
other arguments are given, cause the shell input/output to be modified.
.RE

.sp
.ne 2
.mk
.na
\fBexit\fR [ \fIn\fR ]\fR
.ad
.sp .6
.RS 4n
Causes the calling shell or shell script to exit with the exit status
specified by
.IR n .
If
.I n
is omitted the exit status is that of the
last command executed (an
.B EOF
also causes the shell to exit.)
.RE

.sp
.ne 2
.mk
.na
\fBexport\fR [ \fIname\fR .\|.\|. ]\fR
.ad
.sp .6
.RS 4n
The given \fIname\fRs are marked for automatic export to the
\fIenvironment\fR of subsequently executed commands. If no arguments are
given, variable names that have been marked for export during the current
shell's execution are listed. (Variable names exported from a parent shell
are listed only if they have been exported again during the current shell's
execution.) Function names are
.B not
exported.
.RE

.sp
.ne 2
.mk
.na
\fBfg\fR [\fB%\fIjobid .\|.\|.\fR]\fR
.ad
.sp .6
.RS 4n
When Job Control is enabled, the \fBfg\fR command is added to the user's
environment to manipulate jobs. This command resumes the execution of a
stopped job in the foreground and also moves an executing background job
into the foreground. If \fB%\fIjobid\fR is omitted, the current job is
assumed. (See
.B "Job Control"
section below for more detail.)
.RE

.sp
.ne 2
.mk
.na
.B getopts
.ad
.sp .6
.RS 4n
Use in shell scripts to support command syntax standards (see
.BR Intro (1)).
This command parses positional parameters and checks for
legal options. See
.BR getoptcvt (1)
for usage and description.
.RE

.sp
.ne 2
.mk
.na
\fBhash\fR [ \fB-r\fR ] [ \fIname\fR .\|.\|. ]\fR
.ad
.sp .6
.RS 4n
For each
.IR name ,
the location in the search path of the command
specified by
.I name
is determined and remembered by the shell. The
\fB-r\fR option causes the shell to forget all remembered locations. If no
arguments are given, information about remembered commands is presented.
\fIHits\fR is the number of times a command has been invoked by the shell
process.
.I Cost
is a measure of the work required to locate a command in
the search path. If a command is found in a "relative" directory in the
search path, after changing to that directory, the stored location of that
command is recalculated. Commands for which this are done are indicated by
an asterisk (\fB*\fR) adjacent to the \fIhits\fR information.
.I Cost
is
incremented when the recalculation is done.
.RE

.sp
.ne 2
.mk
.na
\fBjobs\fR [\fB-p|-l\fR] [\fB%\fIjobid .\|.\|.\fR]\fR
.ad
.br
.na
\fBjobs -x\fR \fIcommand\fR [\fIarguments\fR]\fR
.ad
.sp .6
.RS 4n
Reports all jobs that are stopped or executing in the background. If
\fB%\fIjobid\fR is omitted, all jobs that are stopped or running in the
background are reported. (See
.B "Job Control"
section below for more
detail.)
.RE

.sp
.ne 2
.mk
.na
\fBkill\fR [ \fB-\fIsig\fR ] \fB%\fIjob\fR .\|.\|.\fR
.ad
.br
.na
.B kill -l
.ad
.sp .6
.RS 4n
Sends either the
.B TERM
(terminate) signal or the specified signal to
the specified jobs or processes. Signals are either given by number or by
names (as given in \fBsignal.h\fR(3HEAD) stripped of the prefix "SIG" with
the exception that
.B SIGCHD
is named
.BR CHLD ).
If the signal being
sent is
.B TERM
(terminate) or
.B HUP
(hangup), then the job or
process is sent a
.B CONT
(continue) signal if it is stopped. The
argument
.I job
can be the process id of a process that is not a member
of one of the active jobs. See
.B "Job Control"
section below for a
description of the format of
.IR job .
In the second form, \fBkill\fR
.BR -l ,
the signal numbers and names are listed. (See
.BR kill (1)).
.RE

.sp
.ne 2
.mk
.na
\fBlogin\fR [ \fIargument\fR .\|.\|. ]\fR
.ad
.sp .6
.RS 4n
Equivalent to `\fBexec login\fR \fIargument\fR.\|.\|.\|.' See
.BR login (1)
for usage and description.
.RE

.sp
.ne 2
.mk
.na
\fBnewgrp\fR [ \fIargument\fR ]\fR
.ad
.sp .6
.RS 4n
Equivalent to
.BR "exec newgrp"
.IR argument .
See
.BR newgrp (1)
for usage and description.
.RE

.sp
.ne 2
.mk
.na
.B pwd
.ad
.sp .6
.RS 4n
Print the current working directory. See
.BR pwd (1)
for usage and
description.
.RE

.sp
.ne 2
.mk
.na
.B read
.I name
\&.\|.\|.\fR
.ad
.sp .6
.RS 4n
One line is read from the standard input and, using the internal field
separator,
.B IFS
(normally space or tab), to delimit word boundaries,
the first word is assigned to the first
.IR name ,
the second word to the
second
.IR name ,
and so forth, with leftover words assigned to the last
.IR name .
Lines can be continued using \fB\enewline\fR\&. Characters other
than
.B newline
can be quoted by preceding them with a backslash. These
backslashes are removed before words are assigned to
.IR names ,
and no
interpretation is done on the character that follows the backslash. The
return code is
.BR 0 ,
unless an
.B EOF
is encountered.
.RE

.sp
.ne 2
.mk
.na
\fBreadonly\fR [ \fIname\fR .\|.\|. ]\fR
.ad
.sp .6
.RS 4n
The given \fIname\fRs are marked \fBreadonly\fR and the values of the these
\fIname\fRs can not be changed by subsequent assignment. If no arguments are
given, a list of all
.B readonly
names is printed.
.RE

.sp
.ne 2
.mk
.na
\fBreturn\fR [ \fIn\fR ]\fR
.ad
.sp .6
.RS 4n
Causes a function to exit with the return value specified by
.IR n .
If
\fIn\fR is omitted, the return status is that of the last command
executed.
.RE

.sp
.ne 2
.mk
.na
\fBset\fR [ \fB-aefhkntuvx\fR [ \fIargument\fR .\|.\|. ] ]\fR
.ad
.sp .6
.RS 4n
.sp
.ne 2
.mk
.na
.B -a
.ad
.RS 6n
.rt
Mark variables which are modified or created for export.
.RE

.sp
.ne 2
.mk
.na
.B -e
.ad
.RS 6n
.rt
Exit immediately if a command exits with a non-zero exit status.
.RE

.sp
.ne 2
.mk
.na
\fB-f\fR
.ad
.RS 6n
.rt
Disable file name generation.
.RE

.sp
.ne 2
.mk
.na
.B -h
.ad
.RS 6n
.rt
Locate and remember function commands as functions are defined (function
commands are normally located when the function is executed).
.RE

.sp
.ne 2
.mk
.na
.B -k
.ad
.RS 6n
.rt
All keyword arguments are placed in the environment for a command, not just
those that precede the command name.
.RE

.sp
.ne 2
.mk
.na
.B -n
.ad
.RS 6n
.rt
Read commands but do not execute them.
.RE

.sp
.ne 2
.mk
.na
.B -t
.ad
.RS 6n
.rt
Exit after reading and executing one command.
.RE

.sp
.ne 2
.mk
.na
.B -u
.ad
.RS 6n
.rt
Treat unset variables as an error when substituting.
.RE

.sp
.ne 2
.mk
.na
.B -v
.ad
.RS 6n
.rt
Print shell input lines as they are read.
.RE

.sp
.ne 2
.mk
.na
.B -x
.ad
.RS 6n
.rt
Print commands and their arguments as they are executed.
.RE

.sp
.ne 2
.mk
.na
.B -
.ad
.RS 6n
.rt
Do not change any of the flags; useful in setting
.B $1
to
.BR \(mi \&.
.RE

Using
.B +
rather than \fB\(mi\fR causes these flags to be turned off.
These flags can also be used upon invocation of the shell. The current set
of flags can be found in \fB$\(mi\fR. The remaining arguments are positional
parameters and are assigned, in order, to
.BR $1 ,
.BR $2 ,
\&.\|.\|. If no
arguments are given, the values of all names are printed.
.RE

.sp
.ne 2
.mk
.na
\fBshift\fR [ \fIn\fR ]\fR
.ad
.sp .6
.RS 4n
The positional parameters from \fB$\fIn\fB+1\fR .\|.\|. are renamed
\fB$1\fR .\|.\|. . If \fIn\fR is not given, it is assumed to be 1.
.RE

.sp
.ne 2
.mk
.na
\fBstop\fR \fIpid .\|.\|.\fR
.ad
.sp .6
.RS 4n
Halt execution of the process number
.IR pid .
(see
.BR ps (1)).
.RE

.sp
.ne 2
.mk
.na
.B suspend
.ad
.sp .6
.RS 4n
Stops the execution of the current shell (but not if it is the login
shell).
.RE

.sp
.ne 2
.mk
.na
.B test
.ad
.sp .6
.RS 4n
Evaluate conditional expressions. See
.BR test (1)
for usage and
description.
.RE

.sp
.ne 2
.mk
.na
.B times
.ad
.sp .6
.RS 4n
Print the accumulated user and system times for processes run from the
shell.
.RE

.sp
.ne 2
.mk
.na
\fBtrap\fR [ \fIargument n\fR [ \fIn2\fR .\|.\|. ]]\fR
.ad
.sp .6
.RS 4n
The command
.I argument
is to be read and executed when the shell
receives numeric or symbolic signal(s)
.RI ( n ).
(\fBNote:\fR
\fIargument\fR is scanned once when the trap is set and once when the trap
is taken.) Trap commands are executed in order of signal number or
corresponding symbolic names. Any attempt to set a trap on a signal that was
ignored on entry to the current shell is ineffective. An attempt to trap on
signal 11 (memory fault) produces an error. If
.I argument
is absent, all
trap(s)
.I n
are reset to their original values. If
.I argument
is the
null string, this signal is ignored by the shell and by the commands it
invokes. If
.I n
is 0, the command
.I argument
is executed on exit
from the shell. The
.B trap
command with no arguments prints a list of
commands associated with each signal number.
.RE

.sp
.ne 2
.mk
.na
\fBtype\fR [ \fIname\fR .\|.\|. ]\fR
.ad
.sp .6
.RS 4n
For each
.IR name ,
indicate how it would be interpreted if used as a
command name.
.RE

.sp
.ne 2
.mk
.na
\fBulimit\fR [ [\fB-HS\fR] [\fB-a\fR | \fB-cdfnstv\fR] ]\fR
.ad
.br
.na
\fBulimit\fR [ [\fB-HS\fR] [\fB-c\fR | \fB-d\fR | \fB-f\fR | \fB-n\fR |
\fB-s\fR | \fB-t\fR | \fB-v\fR] ] \fBlimit\fR
.ad
.sp .6
.RS 4n
\fBulimit\fR prints or sets hard or soft resource limits. These limits are
described in
.BR getrlimit (2).
.sp
If
.I limit
is not present,
.B ulimit
prints the specified limits.
Any number of limits can be printed at one time. The
.B -a
option prints
all limits.
.sp
If
.I limit
is present,
.B ulimit
sets the specified limit to
.IR limit .
The string
.B unlimited
requests that the current limit, if
any, be removed. Any user can set a soft limit  to any value less than or
equal to  the hard limit. Any user can lower a hard limit.  Only a  user
with appropriate privileges can raise or remove a hard limit.  See
.BR getrlimit (2).
.sp
The
.B -H
option specifies a hard limit. The
.B -S
option specifies a
soft limit. If neither option is specified,
.B ulimit
sets both limits
and print the soft limit.
.sp
The following options specify the resource whose limits are to be printed
or set. If no option is specified, the file size limit is printed or set.
.sp
.ne 2
.mk
.na
.B -c
.ad
.RS 6n
.rt
maximum core file size (in 512-byte blocks)
.RE

.sp
.ne 2
.mk
.na
.B -d
.ad
.RS 6n
.rt
maximum size of data segment or heap (in kbytes)
.RE

.sp
.ne 2
.mk
.na
\fB-f\fR
.ad
.RS 6n
.rt
maximum file size (in 512-byte blocks)
.RE

.sp
.ne 2
.mk
.na
.B -n
.ad
.RS 6n
.rt
maximum file descriptor plus 1
.RE

.sp
.ne 2
.mk
.na
.B -s
.ad
.RS 6n
.rt
maximum size of stack segment (in kbytes)
.RE

.sp
.ne 2
.mk
.na
.B -t
.ad
.RS 6n
.rt
maximum CPU time (in seconds)
.RE

.sp
.ne 2
.mk
.na
.B -v
.ad
.RS 6n
.rt
maximum size of virtual memory (in kbytes)
.RE

Run the \fBsysdef\fR(1M) command to obtain the maximum possible limits for
your system. The values reported are in hexadecimal, but can be translated
into decimal numbers using the
.BR bc (1)
utility. See
.BR swap (1M).)
.sp
As an example of
.BR ulimit ,
to limit the size of a core file dump to 0
Megabytes, type the following:
.sp
.in +2
.nf
\fBulimit -c 0\fR
.fi
.in -2
.sp

.RE

.sp
.ne 2
.mk
.na
\fBumask\fR [ \fInnn\fR ]\fR
.ad
.sp .6
.RS 4n
The user file-creation mask is set to
.I nnn
(see
.BR umask (1)).
If
\fInnn\fR is omitted, the current value of the mask is printed.
.RE

.sp
.ne 2
.mk
.na
\fBunset\fR [ \fIname\fR .\|.\|. ]\fR
.ad
.sp .6
.RS 4n
For each
.IR name ,
remove the corresponding variable or function value.
The variables
.BR PATH ,
.BR PS1 ,
.BR PS2 ,
.BR MAILCHECK ,
and
\fBIFS\fR cannot be unset.
.RE

.sp
.ne 2
.mk
.na
\fBwait\fR [ \fIn\fR ]\fR
.ad
.sp .6
.RS 4n
Wait for your background process whose process id is
.I n
and report its
termination status. If
.I n
is omitted, all your shell's currently active
background processes are waited for and the return code is zero.
.RE

.SS "Invocation"
.sp
.LP
If the shell is invoked through
.BR exec (2)
and the first character of
argument zero is \fB\(mi\fR, commands are initially read from
\fB/etc/profile\fR and from
.BR $HOME/.profile ,
if such files exist.
Thereafter, commands are read as described below, which is also the case
when the shell is invoked as
.BR /usr/bin/sh .
The flags below are
interpreted by the shell on invocation only.
.B Note:
Unless the
.BR -c
or
.B -s
flag is specified, the first argument is assumed to be the name
of a file containing commands, and the remaining arguments are passed as
positional parameters to that command file:
.sp
.ne 2
.mk
.na
\fB-c\fI\| string\fR
.ad
.RS 15n
.rt
If the
.B -c
flag is present commands are read from
.IR string .
.RE

.sp
.ne 2
.mk
.na
.B -i
.ad
.RS 15n
.rt
If the
.B -i
flag is present or if the shell input and output are
attached to a terminal, this shell is
.BR interactive .
In this case,
TERMINATE is ignored (so that
.B "kill 0"
does not kill an interactive
shell) and INTERRUPT is caught and ignored (so that
.B wait
is
interruptible). In all cases, QUIT is ignored by the shell.
.RE

.sp
.ne 2
.mk
.na
.B -p
.ad
.RS 15n
.rt
If the
.B -p
flag is present, the shell does not set the effective user
and group IDs to the real user and group IDs.
.RE

.sp
.ne 2
.mk
.na
.B -r
.ad
.RS 15n
.rt
If the
.B -r
flag is present the shell is a restricted shell (see
.BR rsh (1M)).
.RE

.sp
.ne 2
.mk
.na
.B -s
.ad
.RS 15n
.rt
If the
.B -s
flag is present or if no arguments remain, commands are
read from the standard input. Any remaining arguments specify the positional
parameters. Shell output (except for
.BR "Special Commands" )
is written to
file descriptor 2.
.RE

.sp
.LP
The remaining flags and arguments are described under the
.B set
command
above.
.SS "Job Control (jsh)"
.sp
.LP
When the shell is invoked as
.BR jsh ,
Job Control is enabled in addition
to all of the functionality described previously for
.BR sh .
Typically,
Job Control is enabled for the interactive shell only. Non-interactive
shells typically do not benefit from the added functionality of Job
Control.
.sp
.LP
With Job Control enabled, every command or pipeline the user enters at the
terminal is called a
.IR job .
All jobs exist in one of the following
states: foreground, background, or stopped. These terms are defined as
follows:
.RS +4
.TP
1.
A job in the foreground has read and write access to the controlling
terminal.
.RE
.RS +4
.TP
2.
A job in the background is denied read access and has conditional write
access to the controlling terminal (see
.BR stty (1)).
.RE
.RS +4
.TP
3.
A stopped job is a job that has been placed in a suspended state, usually
as a result of a
.B SIGTSTP
signal (see
.BR signal.h (3HEAD)).
.RE
.sp
.LP
Every job that the shell starts is assigned a positive integer, called a
\fIjob number\fR which is tracked by the shell and is used as an identifier
to indicate a specific job. Additionally, the shell keeps track of the
\fIcurrent\fR and \fIprevious\fR jobs. The \fIcurrent job\fR is the most
recent job to be started or restarted. The
.I "previous job"
is the first
non-current job.
.sp
.LP
The acceptable syntax for a Job Identifier is of the form:
.sp
.LP
\fB%\fIjobid\fR
.sp
.LP
where
.I jobid
can be specified in any of the following formats:
.sp
.ne 2
.mk
.na
\fB%\fR or \fB+\fR
.ad
.RS 13n
.rt
For the current job.
.RE

.sp
.ne 2
.mk
.na
\fB\(mi\fR
.ad
.RS 13n
.rt
For the previous job.
.RE

.sp
.ne 2
.mk
.na
\fB?\fI<string>\fR
.ad
.RS 13n
.rt
Specify the job for which the command line uniquely contains
.IR string .
.RE

.sp
.ne 2
.mk
.na
.I n
.ad
.RS 13n
.rt
For job number
.IR n .
.RE

.sp
.ne 2
.mk
.na
\fIpref\fR
.ad
.RS 13n
.rt
Where \fIpref\fR is a unique prefix of the command name. For example, if
the command
.B "ls -l"
\fIname\fR were running in the background, it
could be referred to as
.BR %ls .
\fIpref\fR cannot contain blanks unless
it is quoted.
.RE

.sp
.LP
When Job Control is enabled, the following commands are added to the user's
environment to manipulate jobs:
.sp
.ne 2
.mk
.na
\fBbg\fR [\fB%\fIjobid .\|.\|.\fR]\fR
.ad
.sp .6
.RS 4n
Resumes the execution of a stopped job in the background. If
\fB%\fIjobid\fR is omitted the current job is assumed.
.RE

.sp
.ne 2
.mk
.na
\fBfg\fR [\fB%\fIjobid .\|.\|.\fR]\fR
.ad
.sp .6
.RS 4n
Resumes the execution of a stopped job in the foreground, also moves an
executing background job into the foreground. If \fB%\fIjobid\fR is
omitted the current job is assumed.
.RE

.sp
.ne 2
.mk
.na
\fBjobs\fR [\fB-p\fR|\fB-l\fR] [\fB%\fIjobid .\|.\|.\fR]\fR
.ad
.br
.na
\fBjobs -x\fR \fBcommand\fR [\fIarguments\fR]\fR
.ad
.sp .6
.RS 4n
Reports all jobs that are stopped or executing in the background. If
\fB%\fIjobid\fR is omitted, all jobs that are stopped or running in the
background is reported. The following options modify/enhance the output of
.BR jobs :
.sp
.ne 2
.mk
.na
.B -l
.ad
.RS 6n
.rt
Report the process group ID and working directory of the jobs.
.RE

.sp
.ne 2
.mk
.na
.B -p
.ad
.RS 6n
.rt
Report only the process group ID of the jobs.
.RE

.sp
.ne 2
.mk
.na
.B -x
.ad
.RS 6n
.rt
Replace any
.I jobid
found in
.I command
or
.I arguments
with the
corresponding process group ID, and then execute
.I command
passing it
.IR arguments .
.RE

.RE

.sp
.ne 2
.mk
.na
\fBkill\fR [ \fB-signal\fR ] \fB%\fIjobid\fR
.ad
.sp .6
.RS 4n
Builtin version of
.B kill
to provide the functionality of the
\fBkill\fR command for processes identified with a
.IR jobid .
.RE

.sp
.ne 2
.mk
.na
\fBstop\fR \fB%\fIjobid .\|.\|.\fR
.ad
.sp .6
.RS 4n
Stops the execution of a background job(s).
.RE

.sp
.ne 2
.mk
.na
.B suspend
.ad
.sp .6
.RS 4n
Stops the execution of the current shell (but not if it is the login
shell).
.RE

.sp
.ne 2
.mk
.na
\fBwait\fR [\fB%\fIjobid .\|.\|.\fR]\fR
.ad
.sp .6
.RS 4n
\fBwait\fR builtin accepts a job identifier. If \fB%\fIjobid\fR is
omitted
.B wait
behaves as described above under \fBSpecial
Commands\fR.
.RE

.SS "Large File Behavior"
.sp
.LP
See
.BR largefile (5)
for the description of the behavior of
.B sh
and
\fBjsh\fR when encountering files greater than or equal to 2 Gbyte ( 2^31
bytes).
.SH EXIT STATUS
.sp
.LP
Errors detected by the shell, such as syntax errors, cause the shell to
return a non-zero exit status. If the shell is being used non-interactively
execution of the shell file is abandoned. Otherwise, the shell returns the
exit status of the last command executed (see also the
.B exit
command
above).
.SS "jsh Only"
.sp
.LP
If the shell is invoked as
.B jsh
and an attempt is made to exit the
shell while there are stopped jobs, the shell issues one warning:
.sp
.LP
.B There are stopped jobs.
.sp
.LP
This is the only message. If another exit attempt is made, and there are
still stopped jobs they are sent a
.B SIGHUP
signal from the kernel and
the shell is exited.
.SH FILES
.sp
.LP
\fB$HOME/.profile\fR
.sp
.LP
.B /dev/null
.sp
.LP
\fB/etc/profile\fR
.sp
.LP
.B /tmp/sh*
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.SS "/usr/bin/sh, /usr/bin/jsh"
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
_
CSIEnabled
.TE

.SS "/usr/xpg4/bin/sh"
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWxcu4
_
CSIEnabled
.TE

.SH SEE ALSO
.sp
.LP
.BR Intro (1),
.BR bc (1),
.BR echo (1),
.BR getoptcvt (1),
.BR kill (1),
.BR ksh (1),
.BR login (1),
.BR newgrp (1),
.BR pfsh (1),
.BR pfexec (1),
.BR ps (1),
.BR pwd (1),
.BR set (1),
.BR shell_builtins (1),
.BR stty (1),
.BR test (1),
.BR umask (1),
.BR wait (1),
.BR rsh (1M),
.BR su (1M),
.BR swap (1M),
.BR sysdef (1M),
.BR dup (2),
.BR exec (2),
.BR fork (2),
.BR getrlimit (2),
.BR pipe (2),
.BR ulimit (2),
.BR setlocale (3C),
.BR signal.h (3HEAD),
.BR passwd (4),
.BR profile (4),
.BR attributes (5),
.BR environ (5),
.BR largefile (5),
.BR XPG4 (5)
.SH WARNINGS
.sp
.LP
The use of
.B setuid
shell scripts is
.B strongly
discouraged.
.SH NOTES
.sp
.LP
Words used for filenames in input/output redirection are not interpreted
for filename generation (see
.B "File Name Generation"
section above). For
example, \fBcat file1 >a*\fR createsa file named
.BR a* .
.sp
.LP
Because commands in pipelines are run as separate processes, variables set
in a pipeline have no effect on the parent shell.
.sp
.LP
If the input or the output of a
.B while
or
.B until
loop is
redirected, the commands in the loop are run in a sub-shell, and variables
set or changed there have no effect on the parent process:
.sp
.in +2
.nf
   lastline=
   while read line
   do

           lastline=$line
   done < /etc/passwd
   echo "lastline=$lastline"       # lastline is empty!
.fi
.in -2
.sp

.sp
.LP
In these cases, the input or output can be redirected by using
.BR exec ,
as in the following example:
.sp
.in +2
.nf
   # Save standard input (file descriptor 0) as file
   # descriptor 3, and redirect standard input from the file
   /etc/passwd:

   exec 3<&0               # save standard input as fd 3
   exec </etc/passwd       # redirect input from file

   lastline=
   while read line
   do
           lastline=$line
   done

   exec 0<&3               # restore standard input
   exec 3<&-               # close file descriptor 3
   echo "$lastline"        # lastline
.fi
.in -2
.sp

.sp
.LP
If you get the error message, "\fBcannot fork, too many processes\fR", try
using the
.BR wait (1)
command to clean up your background processes. If
this doesn't help, the system process table is probably full or you have too
many active foreground processes. There is a limit to the number of process
ids associated with your login, and to the number the system can keep track
of.
.sp
.LP
Only the last process in a pipeline can be waited for.
.sp
.LP
If a command is executed, and a command with the same name is installed in
a directory in the search path before the directory where the original
command was found, the shell continues to
.B exec
the original command.
Use the
.B hash
command to correct this situation.
.sp
.LP
The Bourne shell has a limitation on the effective
.B UID
for a process.
If this
.B UID
is less than 100 (and not equal to the real UID of the
process), then the
.B UID
is reset to the real UID of the process.
.sp
.LP
Because the shell implements both foreground and background jobs in the
same process group, they all receive the same signals, which can lead to
unexpected behavior. It is, therefore, recommended that other job control
shells be used, especially in an interactive environment.
.sp
.LP
When the shell executes a shell script that attempts to execute a
non-existent command interpreter, the shell returns an erroneous diagnostic
message that the shell script file does not exist.
