usr/src/man/man1/svcprop.1
'\" te
.\" Copyright (c) 2007, Sun Microsystems, Inc. All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH svcprop 1 "13 Sep 2007" "SunOS 5.11" "User Commands"
.SH NAME
svcprop \- retrieve values of service configuration properties
.SH SYNOPSIS
.LP
.nf
\fBsvcprop\fR [\fB-fqtv\fR] [\fB-C\fR | \fB-c\fR | \fB-s\fR \fIsnapshot\fR] [\fB-p\fR [\fIname\fR/]\fIname\fR]...
     {\fIFMRI\fR | \fIpattern\fR}...
.fi

.LP
.nf
\fBsvcprop\fR \fB-w\fR [\fB-fqtv\fR] [\fB-p\fR [\fIname\fR/]\fIname\fR] {\fIFMRI\fR | \fIpattern\fR}
.fi

.SH DESCRIPTION
.sp
.LP
The
.B svcprop
utility prints values of properties in the service
configuration repository. Properties are selected by
.B -p
options and the
operands.
.sp
.LP
Without the
.BR -C ,
.BR -c ,
or
.B -s
options,
.B svcprop
accesses
effective properties. The effective properties of a service are its directly
attached properties. The effective properties of a service instance are the
union of properties in the composed view of its
.B running
snapshot and the
properties in nonpersistent property groups in the composed view of the
instance's directly attached properties. See
.BR smf (5)
for an explanation of
property composition. If the
.B running
snapshot does not exist then the
instance's directly attached properties are used instead.
.SS "Output Format"
.sp
.LP
By default, when a single property is selected, the values for each are
printed on separate lines. Empty
.B ASCII
string values are represented by a
pair of double quotes (\fB""\fR). Bourne shell metacharacters ('\fB;\fR',
\&'\fB&\fR\&', \&'\fB(\fR', '\fB)\fR', '\fB|\fR', '\fB^\fR', '\fB<\fR\&',
\&'\fB>\fR', newline, space, tab, backslash, '\fB"\fR', single-quote,
\&'\fB`\fR') in \fBASCII\fR string values are quoted by backslashes
(\fB\e\fR).
.sp
.LP
When multiple properties are selected, a single line is printed for each. Each
line comprises a property designator, a property type, and the values (as
described above), separated by spaces. By default, if a single \fIFMRI\fR
operand has been supplied, the property designator consists of the property
group name and the property name joined by a slash
.RB ( / ).
If multiple
.I FMRI
operands are supplied, the designator is the canonical
.I FMRI
for the property.
.sp
.LP
If access controls prohibit reading the value of a property, and no property
or property group is specified explicitly by a
.B -p
option, the property is
displayed as if it had no values. If one or more property or property group
names is specified by  a
.B -p
option, and any property value cannot be read
due to access controls, an error results.
.sp
.LP
Error messages are printed to the standard error stream.
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.B -C
.ad
.RS 14n
.rt
Uses the directly attached properties, without composition.
.RE

.sp
.ne 2
.mk
.na
.B -c
.ad
.RS 14n
.rt
For service instances, uses the composed view of their directly attached
properties.
.RE

.sp
.ne 2
.mk
.na
.B -f
.ad
.RS 14n
.rt
Selects the multi-property output format, with full FMRIs as designators.
.RE

.sp
.ne 2
.mk
.na
.B -p
.I name
.ad
.RS 14n
.rt
For each service or service instance specified by the operands, selects all
properties in the
.I name
property group. For property groups specified by
the operands, selects the
.I name
property.
.RE

.sp
.ne 2
.mk
.na
\fB-p\fR \fIpg\fR/\fIprop\fR
.ad
.RS 14n
.rt
Selects property
.I prop
in property group
.I pg
for each of the
services or service instances specified by the operands.
.RE

.sp
.ne 2
.mk
.na
.B -q
.ad
.RS 14n
.rt
Quiet. Produces no output.
.RE

.sp
.ne 2
.mk
.na
.B -s
.I name
.ad
.RS 14n
.rt
Uses the composed view of the
.I name
snapshot for service instances.
.RE

.sp
.ne 2
.mk
.na
.B -t
.ad
.RS 14n
.rt
Selects the multi-property output format.
.RE

.sp
.ne 2
.mk
.na
.B -v
.ad
.RS 14n
.rt
Verbose. Prints error messages for nonexistent properties, even if option -q
is also used.
.RE

.sp
.ne 2
.mk
.na
.B -w
.ad
.RS 14n
.rt
Waits until the specified property group or the property group containing the
specified property changes before printing.
.sp
This option is only valid when a single entity is specified. If more than one
operand is specified, or an operand matches more than one instance, an error
message is printed and no action is taken. The -C option is implied.
.RE

.SH OPERANDS
.sp
.LP
The following operands are supported:
.sp
.ne 2
.mk
.na
.I FMRI
.ad
.RS 11n
.rt
The FMRI of a service, a service instance, a property group, or a property.
.sp
Instances and services can be abbreviated by specifying the instance name, or
the trailing portion of the service name. Properties and property groups must
be specified by a full FMRI. For example, given the FMRI:
.sp
.in +2
.nf
svc:/network/smtp:sendmail
.fi
.in -2
.sp

The following are valid abbreviations:
.sp
.in +2
.nf
sendmail
:sendmail
smtp
smtp:sendmail
network/smtp
.fi
.in -2
.sp

The following are invalid abbreviations:
.sp
.in +2
.nf
mail
network
network/smt
.fi
.in -2
.sp

Abbreviated forms of FMRIs are unstable and should not be used in scripts or
other permanent tools. If an abbreviation matches multiple instances,
.B svcprop
acts on each instance.
.RE

.sp
.ne 2
.mk
.na
.B pattern
.ad
.RS 11n
.rt
A glob pattern which is matched against the FMRIs of services and instances in
the repository. See
.BR fnmatch (5).
If a pattern matches multiple services or
instances,
.B svcprop
acts on each service or instance.
.RE

.SH EXAMPLES
.LP
.B Example 1
Displaying the Value of a Single Property
.sp
.LP
The following example displays the value of the state property in the
restarter property group of instance
.B default
of service
.BR system/cron .

.sp
.in +2
.nf
example%  svcprop -p restarter/state system/cron:default
online
.fi
.in -2
.sp

.LP
.B Example 2
Retrieving Whether a Service is Enabled
.sp
.LP
Whether a service is enabled is determined by its
.BR -general/enabled
property. This property takes immediate effect, so the
.B -c
option must be
used:

.sp
.in +2
.nf
example%  svcprop -c -p general/enabled system/cron:default
true
.fi
.in -2
.sp

.LP
.B Example 3
Displaying All Properties in a Property Group
.sp
.LP
On a default installation of Solaris, the following example displays all
properties in the
.B general
property group of each instance of the
.B network/ntp
service:

.sp
.in +2
.nf
example% svcprop -p general ntp
general/package astring SUNWntpr
general/enabled boolean true
general/entity_stability astring Unstable
general/single_instance boolean true
.fi
.in -2
.sp

.LP
.B Example 4
Testing the Existance of a Property
.sp
.LP
The following example tests the existence of the
.BR general/enabled
property for all instances of service identity:

.sp
.in +2
.nf
example%  svcprop -q -p general/enabled identity:
example%  echo $?
0
.fi
.in -2
.sp

.LP
.B Example 5
Waiting for Property Change
.sp
.LP
The following example waits for the
.B sendmail
instance to change state.

.sp
.in +2
.nf
example%  svcprop -w -p restarter/state sendmail
.fi
.in -2
.sp

.LP
.B Example 6
Retrieving the Value of a Boolean Property in a Script
.sp
.LP
The following example retrieves the value of a boolean property in a script:

.sp
.in +2
.nf
set -- `svcprop -c -t -p general/enabled service`
code=$?
if [ $code -ne 0 ]; then
        echo "svcprop failed with exit code $code"
        return 1
fi
if [ $2 != boolean ]; then
         echo "general/enabled has unexpected type $2"
         return 2
fi
if [ $# -ne 3 ]; then
          echo "general/enabled has wrong number of values"
          return 3
fi
value=$3
\&...
.fi
.in -2
.sp

.LP
.B Example 7
Using
.B svcprop
in a Script
.sp
.in +2
.nf
example% cat getval
#!/bin/sh

svcprop -p $1 $2 | (
         read value v2
         if [ -n "$v2" ]; then echo "Multiple values!"; exit; fi
         echo $value
       )
.fi
.in -2
.sp

.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 5n
.rt
Successful completion.
.RE

.sp
.ne 2
.mk
.na
.B 1
.ad
.RS 5n
.rt
An error occurred.
.RE

.sp
.ne 2
.mk
.na
.B 2
.ad
.RS 5n
.rt
Invalid command line options were specified.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.sp
.LP
.BR svcs (1),
.BR inetd (1M),
.BR svcadm (1M),
.BR svccfg (1M),
.BR svc.startd (1M),
.BR service_bundle (4),
.BR attributes (5),
.BR fnmatch (5),
.BR smf (5),
.BR smf_method (5),
.BR smf_security (5)
