usr/src/man/man1/tail.1
'\" te
.\" Copyright 1989 AT&T
.\" Copyright (c) 1992, X/Open Company Limited  All Rights Reserved
.\" Portions Copyright (c) 2005, Sun Microsystems, Inc.  All Rights Reserved
.\"
.\" Sun Microsystems, Inc. gratefully acknowledges The Open Group for
.\" permission to reproduce portions of its copyrighted documentation.
.\" Original documentation from The Open Group can be obtained online
.\" at http://www.opengroup.org/bookstore/.
.\"
.\" The Institute of Electrical and Electronics Engineers and The Open Group,
.\" have given us permission to reprint portions of their documentation.
.\"
.\" In the following statement, the phrase "this text" refers to portions
.\" of the system documentation.
.\"
.\" Portions of this text are reprinted and reproduced in electronic form in
.\" the Sun OS Reference Manual, from IEEE Std 1003.1, 2004 Edition, Standard
.\" for Information Technology -- Portable Operating System Interface (POSIX),
.\" The Open Group Base Specifications Issue 6, Copyright (C) 2001-2004 by the
.\" Institute of Electrical and Electronics Engineers, Inc and The Open Group.
.\" In the event of any discrepancy between these versions and the original
.\" IEEE and The Open Group Standard, the original IEEE and The Open Group
.\" Standard is the referee document.
.\"
.\" The original Standard can be obtained online at
.\" http://www.opengroup.org/unix/online.html.
.\"
.\" This notice shall appear on any product containing this material.
.\"
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH tail 1 "13 Jul 2005" "SunOS 5.11" "User Commands"
.SH NAME
tail \- deliver the last part of a file
.SH SYNOPSIS
.LP
.nf
\fB/usr/bin/tail\fR [\(+-s \fInumber\fR [lbcr]] [\fIfile\fR]
.fi

.LP
.nf
\fB/usr/bin/tail\fR [\fB-lbcr\fR] [\fIfile\fR]
.fi

.LP
.nf
\fB/usr/bin/tail\fR [\(+- \fInumber\fR [lbcf]] [\fIfile\fR]
.fi

.LP
.nf
\fB/usr/bin/tail\fR [\fB-lbcf\fR] [\fIfile\fR]
.fi

.LP
.nf
\fB/usr/xpg4/bin/tail\fR [\fB-f\fR | \fB-r\fR] [\fB-c\fR \fInumber\fR | \fB-n\fR \fInumber\fR] [\fIfile\fR]
.fi

.LP
.nf
\fB/usr/xpg4/bin/tail\fR [\(+- \fInumber\fR [l | b | c] [f]] [\fIfile\fR]
.fi

.LP
.nf
\fB/usr/xpg4/bin/tail\fR [\(+- \fInumber\fR [l] [f | r]] [\fIfile\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The \fBtail\fR utility copies the named file to the standard output
beginning at a designated place. If no file is named, the standard input is
used.
.sp
.LP
Copying begins at a point in the file indicated by the \fB-c\fInumber\fR,
\fB-n\fInumber\fR, or \fB\(+-\fInumber\fR options (if
\fB+\fInumber\fR is specified, begins at distance number from the
beginning; if \fB-\fInumber\fR is specified, from the end of the input; if
\fInumber\fR is \fINULL\fR, the value \fB10\fR is assumed). \fInumber\fR is
counted in units of lines or byte according to the \fB-c\fR \fB or \fR
\fB-n\fR options, or lines, blocks, or bytes, according to the appended
option \fBl\fR, \fBb\fR, or \fBc\fR. When no units are specified, counting is
by lines.
.SH OPTIONS
.sp
.LP
The following options are supported for both \fB/usr/bin/tail\fR and
\fB/usr/xpg4/bin/tail\fR. The \fB-r\fR and \fB-f\fR options are mutually
exclusive. If both are specified on the command line, the \fB-f\fR option is
ignored.
.sp
.ne 2
.mk
.na
\fB-b\fR
.ad
.RS 7n
.rt
Units of blocks.
.RE

.sp
.ne 2
.mk
.na
\fB-c\fR
.ad
.RS 7n
.rt
Units of bytes.
.RE

.sp
.ne 2
.mk
.na
\fB-f\fR
.ad
.RS 7n
.rt
Follow. If the input-file is not a pipe, the program does not terminate
after the line of the input-file has been copied, but enters an endless loop,
wherein it sleeps for a second and then attempts to read and copy further
records from the input-file. Thus it can be used to monitor the growth of a
file that is being written by some other process.
.RE

.sp
.ne 2
.mk
.na
\fB-l\fR
.ad
.RS 7n
.rt
Units of lines.
.RE

.sp
.ne 2
.mk
.na
\fB-r\fR
.ad
.RS 7n
.rt
Reverse. Copies lines from the specified starting point in the file in
reverse order. The default for \fBr\fR is to print the entire file in reverse
order.
.RE

.SS "/usr/xpg4/bin/tail"
.sp
.LP
The following options are supported for \fB/usr/xpg4/bin/tail\fR only:
.sp
.ne 2
.mk
.na
\fB-c\fR \fInumber\fR
.ad
.RS 14n
.rt
The \fInumber\fR option-argument must be a decimal integer whose sign
affects the location in the file, measured in bytes, to begin the copying:
.sp
.ne 2
.mk
.na
\fB+\fR
.ad
.RS 9n
.rt
Copying starts relative to the beginning of the file.
.RE

.sp
.ne 2
.mk
.na
\fB\(mi\fR
.ad
.RS 9n
.rt
Copying starts relative to the end of the file.
.RE

.sp
.ne 2
.mk
.na
\fBnone\fR
.ad
.RS 9n
.rt
Copying starts relative to the end of the file.
.RE

The origin for counting is 1; that is, \fB-c\fB+1\fR represents the
first byte of the file, \fB-c\fB\(mi1\fR the last.
.RE

.sp
.ne 2
.mk
.na
\fB-n\fR \fInumber\fR
.ad
.RS 14n
.rt
Equivalent to \fB-c\fInumber,\fR except the starting location in the file
is measured in lines instead of bytes. The origin for counting is \fB1\fR.
That is, \fB-n\fB+1\fR represents the first line of the file,
\fB-n\fB\(mi1\fR the last.
.RE

.SH OPERANDS
.sp
.LP
The following operand is supported:
.sp
.ne 2
.mk
.na
\fIfile\fR
.ad
.RS 9n
.rt
A path name of an input file. If no \fIfile\fR operands are specified, the
standard input is used.
.RE

.SH USAGE
.sp
.LP
See \fBlargefile\fR(5) for the description of the behavior of \fBtail\fR
when encountering files greater than or equal to 2 Gbyte ( 2^31 bytes).
.SH EXAMPLES
.LP
\fBExample 1 \fRUsing the tail Command
.sp
.LP
The following command prints the last ten lines of the file \fBfred\fR,
followed by any lines that are appended to \fBfred\fR between the time
\fBtail\fR is initiated and killed.

.sp
.in +2
.nf
example% \fBtail -f fred\fR
.fi
.in -2
.sp

.sp
.LP
The next command prints the last 15 bytes of the file \fBfred\fR, followed
by any lines that are appended to \fBfred\fR between the time \fBtail\fR is
initiated and killed:

.sp
.in +2
.nf
example% \fBtail -15cf fred\fR
.fi
.in -2
.sp

.SH ENVIRONMENT VARIABLES
.sp
.LP
See \fBenviron\fR(5) for descriptions of the following environment variables
that affect the execution of \fBtail\fR: \fBLANG\fR, \fBLC_ALL\fR,
\fBLC_CTYPE\fR, \fBLC_MESSAGES\fR, and \fBNLSPATH\fR.
.SH EXIT STATUS
.sp
.LP
The following exit values are returned:
.sp
.ne 2
.mk
.na
\fB0\fR
.ad
.RS 7n
.rt
Successful completion.
.RE

.sp
.ne 2
.mk
.na
\fB>0\fR
.ad
.RS 7n
.rt
An error occurred.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.SS "/usr/bin/tail"
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
_
CSIEnabled
.TE

.SS "/usr/xpg4/bin/tail"
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWxcu4
_
CSIEnabled
_
Interface StabilityStandard
.TE

.SH SEE ALSO
.sp
.LP
\fBcat\fR(1), \fBhead\fR(1), \fBmore\fR(1), \fBpg\fR(1), \fBdd\fR(1M),
\fBattributes\fR(5), \fBenviron\fR(5), \fBlargefile\fR(5),
\fBstandards\fR(5)
.SH NOTES
.sp
.LP
Piped tails relative to the end of the file are stored in a buffer, and thus
are limited in length. Various kinds of anomalous behavior can happen with
character special files.
