usr/src/man/man1/vi.1
'\" te
.\" Copyright 1989 AT&T
.\" Copyright (c) 2007, Sun Microsystems, Inc.  All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" Portions Copyright (c) 1992, X/Open Company Limited  All Rights Reserved
.\"
.\" Sun Microsystems, Inc. gratefully acknowledges The Open Group for
.\" permission to reproduce portions of its copyrighted documentation.
.\" Original documentation from The Open Group can be obtained online
.\" at http://www.opengroup.org/bookstore/.
.\"
.\" The Institute of Electrical and Electronics Engineers and The Open Group,
.\" have given us permission to reprint portions of their documentation.
.\"
.\" In the following statement, the phrase "this text" refers to portions
.\" of the system documentation.
.\"
.\" Portions of this text are reprinted and reproduced in electronic form in
.\" the Sun OS Reference Manual, from IEEE Std 1003.1, 2004 Edition, Standard
.\" for Information Technology -- Portable Operating System Interface (POSIX),
.\" The Open Group Base Specifications Issue 6, Copyright (C) 2001-2004 by the
.\" Institute of Electrical and Electronics Engineers, Inc and The Open Group.
.\" In the event of any discrepancy between these versions and the original
.\" IEEE and The Open Group Standard, the original IEEE and The Open Group
.\" Standard is the referee document.
.\"
.\" The original Standard can be obtained online at
.\" http://www.opengroup.org/unix/online.html.
.\"
.\" This notice shall appear on any product containing this material.
.\"
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH vi 1 "16 May 2007" "SunOS 5.11" "User Commands"
.SH NAME
vi, view, vedit \- screen-oriented (visual) display editor based on ex
.SH SYNOPSIS
.LP
.nf
\fB/usr/bin/vi\fR [\fB-|\fR \fB-s\fR] [\fB-l\fR] [\fB-L\fR] [\fB-R\fR] [\fB-r\fR [\fIfilename\fR]] [\fB-S\fR]
     [\fB-t\fR \fItag\fR] [\fB-v\fR] [\fB-V\fR] [\fB-x\fR] [\fB-w\fIn\fR] [\fB-C\fR]
     [\fB+\fIcommand\fR | \fB-c\fR \fIcommand\fR] \fIfilename\fR...
.fi

.LP
.nf
\fB/usr/bin/view\fR [\fB-|\fR \fB-s\fR] [\fB-l\fR] [\fB-L\fR] [\fB-R\fR] [\fB-r\fR [\fIfilename\fR]] [\fB-S\fR]
     [\fB-t\fR \fItag\fR] [\fB-v\fR] [\fB-V\fR] [\fB-x\fR] [\fB-w\fIn\fR] [\fB-C\fR]
     [\fB+\fIcommand\fR | \fB-c\fR \fIcommand\fR] \fIfilename\fR...
.fi

.LP
.nf
\fB/usr/bin/vedit\fR [\fB-|\fR \fB-s\fR] [\fB-l\fR] [\fB-L\fR] [\fB-R\fR] [\fB-r\fR [\fIfilename\fR]] [\fB-S\fR]
     [\fB-t\fR \fItag\fR] [\fB-v\fR] [\fB-V\fR] [\fB-x\fR] [\fB-w\fIn\fR] [\fB-C\fR]
     [\fB+\fIcommand\fR | \fB-c\fR \fIcommand\fR] \fIfilename\fR...
.fi

.LP
.nf
\fB/usr/xpg4/bin/vi\fR [\fB-|\fR \fB-s\fR] [\fB-l\fR] [\fB-L\fR] [\fB-R\fR] [\fB-r\fR [\fIfilename\fR]]
     [\fB-S\fR] [\fB-t\fR \fItag\fR] [\fB-v\fR] [\fB-V\fR] [\fB-x\fR] [\fB-w\fIn\fR] [\fB-C\fR]
     [\fB+\fIcommand\fR | \fB-c\fR \fIcommand\fR] \fIfilename\fR...
.fi

.LP
.nf
\fB/usr/xpg4/bin/view\fR [\fB-|\fR \fB-s\fR] [\fB-l\fR] [\fB-L\fR] [\fB-R\fR] [\fB-r\fR [\fIfilename\fR]]
     [\fB-S\fR] [\fB-t\fR \fItag\fR] [\fB-v\fR] [\fB-V\fR] [\fB-x\fR] [\fB-w\fIn\fR] [\fB-C\fR]
     [\fB+\fIcommand\fR | \fB-c\fR \fIcommand\fR] \fIfilename\fR...
.fi

.LP
.nf
\fB/usr/xpg4/bin/vedit\fR [\fB-|\fR \fB-s\fR] [\fB-l\fR] [\fB-L\fR] [\fB-R\fR] [\fB-r\fR [\fIfilename\fR]]
     [\fB-S\fR] [\fB-t\fR \fItag\fR] [\fB-v\fR] [\fB-V\fR] [\fB-x\fR] [\fB-w\fIn\fR] [\fB-C\fR]
     [\fB+\fIcommand\fR | \fB-c\fR \fIcommand\fR] \fIfilename\fR...
.fi

.LP
.nf
\fB/usr/xpg6/bin/vi\fR [\fB-|\fR \fB-s\fR] [\fB-l\fR] [\fB-L\fR] [\fB-R\fR] [\fB-r\fR [\fIfilename\fR]]
     [\fB-S\fR] [\fB-t\fR \fItag\fR] [\fB-v\fR] [\fB-V\fR] [\fB-x\fR] [\fB-w\fIn\fR] [\fB-C\fR]
     [\fB+\fIcommand\fR | \fB-c\fR \fIcommand\fR] \fIfilename\fR...
.fi

.LP
.nf
\fB/usr/xpg6/bin/view\fR [\fB-|\fR \fB-s\fR] [\fB-l\fR] [\fB-L\fR] [\fB-R\fR] [\fB-r\fR [\fIfilename\fR]]
     [\fB-S\fR] [\fB-t\fR \fItag\fR] [\fB-v\fR] [\fB-V\fR] [\fB-x\fR] [\fB-w\fIn\fR] [\fB-C\fR]
     [\fB+\fIcommand\fR | \fB-c\fR \fIcommand\fR] \fIfilename\fR...
.fi

.LP
.nf
\fB/usr/xpg6/bin/vedit\fR [\fB-|\fR \fB-s\fR] [\fB-l\fR] [\fB-L\fR] [\fB-R\fR] [\fB-r\fR [\fIfilename\fR]]
     [\fB-S\fR] [\fB-t\fR \fItag\fR] [\fB-v\fR] [\fB-V\fR] [\fB-x\fR] [\fB-w\fIn\fR] [\fB-C\fR]
     [\fB+\fIcommand\fR | \fB-c\fR \fIcommand\fR] \fIfilename\fR...
.fi

.SH DESCRIPTION
.sp
.LP
The
.B vi
(visual) utility is a display-oriented text editor based on an
underlying line editor
.BR ex .
It is possible to use the command mode of
.B ex
from within
.B vi
and to use the command mode of
.B vi
from
within
.BR ex .
The visual commands are described on this manual page; how
to set options (like automatically numbering lines and automatically
.RB "starting a new output line when you type carriage return) and all" " ex"
line editor commands are described on the
.BR ex (1)
manual page.
.sp
.LP
When using
.BR vi ,
changes you make to the file are reflected in what you
see on your terminal screen. The position of the cursor on the screen
indicates the position within the file.
.sp
.LP
The
.B view
invocation is the same as
.B vi
except that the
.B readonly
flag is set.
.sp
.LP
The
.B vedit
invocation is intended for beginners. It is the same as
.B vi
except that the
.B report
flag is set to
.BR 1 ,
the
.B showmode
and
.B novice
flags are set, and
.B magic
is turned
off. These defaults make it easier to learn how to use
.BR vi .
.SH OPTIONS
.sp
.LP
The following options are supporrted:
.SS "Invocation Options"
.sp
.LP
The following invocation options are interpreted by
.B vi
(previously
documented options are discussed under NOTES):
.sp
.ne 2
.mk
.na
\fB\(mi\fR | \fB-s\fR
.ad
.RS 25n
.rt
Suppresses all interactive user feedback. This is useful when processing
editor scripts.
.RE

.sp
.ne 2
.mk
.na
.B -C
.ad
.RS 25n
.rt
Encryption option. Same as the
.B -x
.RB "option, except that" " vi"
simulates the
.B C
command of
.BR ex .
The
.B C
command is like the
.B X
command of
.BR ex ,
except that all text read in is assumed to have
been encrypted.
.RE

.sp
.ne 2
.mk
.na
.B -l
.ad
.RS 25n
.rt
Sets up for editing
.B LISP
programs.
.RE

.sp
.ne 2
.mk
.na
.B -L
.ad
.RS 25n
.rt
Lists the name of all files saved as the result of an editor or system
crash.
.RE

.sp
.ne 2
.mk
.na
.B -r
.I filename
.ad
.RS 25n
.rt
Edits
.I filename
after an editor or system crash. (Recovers the version
of
.I filename
that was in the buffer when the crash occurred.)
.RE

.sp
.ne 2
.mk
.na
.B -R
.ad
.RS 25n
.rt
.B Readonly
mode. The
.B readonly
flag is set, preventing accidental
overwriting of the file.
.RE

.sp
.ne 2
.mk
.na
.B -S
.ad
.RS 25n
.rt
This option is used in conjunction with the
.B -t
.I tag
option to
tell
.B vi
that the tags file can not be sorted and that, if the binary
search (which relies on a sorted tags file) for
.I tag
fails to find it,
the much slower linear search should also be done. Since the linear search
is slow, users of large tags files should ensure that the tags files are
sorted rather than use this flag. Creation of tags files normally produces
sorted tags files. See
.BR ctags (1)
for more information on tags files.
.RE

.sp
.ne 2
.mk
.na
.B -t
.I tag
.ad
.RS 25n
.rt
Edits the file containing
.I tag
and position the editor at its
definition. It is an error to specify more than one
.B -t
option.
.RE

.sp
.ne 2
.mk
.na
.B -v
.ad
.RS 25n
.rt
Starts up in display editing state, using
.BR vi .
You can achieve the
same effect by typing the
.B vi
command itself.
.RE

.sp
.ne 2
.mk
.na
.B -V
.ad
.RS 25n
.rt
Verbose. When
.B ex
commands are read by means of standard input, the
input is echoed to standard error. This can be useful when processing
.B ex
commands within shell scripts.
.RE

.sp
.ne 2
.mk
.na
.BI -w n
.ad
.RS 25n
.rt
Sets the default window size to
.IR n .
This is useful when using the
editor over a slow speed line.
.RE

.sp
.ne 2
.mk
.na
.B -x
.ad
.RS 25n
.rt
Encryption option. When used,
.B vi
simulates the
.B X
command of
.B ex
and prompts the user for a key. This key is used to encrypt and
decrypt text using the algorithm of the
.B crypt
.RB "command. The" " X"
command makes an educated guess to determine whether text read in is
encrypted or not. The temporary buffer file is encrypted also, using a
transformed version of the key typed in for the
.B -x
option. If an empty
encryption key is entered (that is, if the return key is pressed right after
the prompt), the file is not encrypted. This is a good way to decrypt a file
erroneously encrypted with a mistyped encryption key, such as a backspace or
undo key.
.RE

.sp
.ne 2
.mk
.na
.BI - command
| \fB-c\fR \fIcommand\fR
.ad
.RS 25n
.rt
Begins editing by executing the specified editor
.I command
(usually a
search or positioning command).
.RE

.SS "/usr/xpg4/bin/vi and /usr/xpg6/bin/vi"
.sp
.LP
If both the
.B -t
.I tag
and the
.B -c
.I command
options are
given, the
.B -t
.I tag
optionis processed first. That is, the file
containing
.I tag
is selected by
.B -t
and then the command is
executed.
.SH OPERANDS
.sp
.LP
The following operands are supported:
.sp
.ne 2
.mk
.na
.I filename
.ad
.RS 12n
.rt
A file to be edited.
.RE

.SH COMMAND SUMMARY
.sp
.LP
The
.B vi
command modes are summarized in this section.
.SS "vi Modes"
.sp
.ne 2
.mk
.na
.B Command
.ad
.RS 13n
.rt
Normal and initial mode. Other modes return to command mode upon
completion.
.I ESC
(escape) is used to cancel a partial command.
.RE

.sp
.ne 2
.mk
.na
.B Input
.ad
.RS 13n
.rt
Entered by setting any of the following options:
.sp
.in +2
.nf
a A i I o O c C s S R
.fi
.in -2
.sp

Arbitrary text can then be entered. Input mode is normally terminated with
the
.I ESC
character, or, abnormally, with an interrupt.
.RE

.sp
.ne 2
.mk
.na
.B Last line
.ad
.RS 13n
.rt
Reading input for
.B ": / ?"
or
.BR ! .
Terminate by typing a carriage
return. An interrupt cancels termination.
.RE

.SS "Sample Commands"
.sp
.LP
In the descriptions,
.I CR
stands for carriage return and
.IR ESC
stands for the escape key.
.sp
.ne 2
.mk
.na
\fB\(<-, \(->\fR
.ad
.br
.na
.B down-arrow
.ad
.br
.na
.B up-arrow
.ad
.RS 14n
.rt
arrow keys move the cursor
.RE

.sp
.ne 2
.mk
.na
.B h j k l
.ad
.RS 14n
.rt
same as arrow keys
.RE

.sp
.ne 2
.mk
.na
\fBi\fItext\fIESC\fR
.ad
.RS 14n
.rt
insert
.IR text
.RE

.sp
.ne 2
.mk
.na
\fBcw\fInew\fIESC\fR
.ad
.RS 14n
.rt
change word to
.IR new
.RE

.sp
.ne 2
.mk
.na
\fBea\fIs\fIESC\fR
.ad
.RS 14n
.rt
pluralize word (end of word; append
.BR s ;
escape from input state)
.RE

.sp
.ne 2
.mk
.na
.B x
.ad
.RS 14n
.rt
delete a character
.RE

.sp
.ne 2
.mk
.na
.B dw
.ad
.RS 14n
.rt
delete a word
.RE

.sp
.ne 2
.mk
.na
.B dd
.ad
.RS 14n
.rt
delete a line
.RE

.sp
.ne 2
.mk
.na
.B 3dd
.ad
.RS 14n
.rt
delete 3 lines
.RE

.sp
.ne 2
.mk
.na
.B u
.ad
.RS 14n
.rt
undo previous change
.RE

.sp
.ne 2
.mk
.na
.B ZZ
.ad
.RS 14n
.rt
exit
.BR vi ,
saving changes
.RE

.sp
.ne 2
.mk
.na
.BI :q! CR
.ad
.RS 14n
.rt
quit, discarding changes
.RE

.sp
.ne 2
.mk
.na
\fB/\fItext\fICR\fR
.ad
.RS 14n
.rt
search for
.IR text
.RE

.sp
.ne 2
.mk
.na
.B ^U ^D
.ad
.RS 14n
.rt
scroll up or down
.RE

.sp
.ne 2
.mk
.na
\fB:\fIcmd\fICR\fR
.ad
.RS 14n
.rt
any
.B ex
or
.B ed
command
.RE

.SS "Counts Before vi Commands"
.sp
.LP
Numbers can be typed as a prefix to some commands. They are interpreted in
one of these ways:
.sp
.ne 2
.mk
.na
.B line/column number
.ad
.RS 22n
.rt
z  G  |
.RE

.sp
.ne 2
.mk
.na
.B scroll amount
.ad
.RS 22n
.rt
^D  ^U
.RE

.sp
.ne 2
.mk
.na
.B repeat effect
.ad
.RS 22n
.rt
most of the rest
.RE

.SS "Interrupting, Canceling"
.sp
.ne 2
.mk
.na
.I ESC
.ad
.RS 7n
.rt
end insert or incomplete command
.RE

.sp
.ne 2
.mk
.na
.I DEL
.ad
.RS 7n
.rt
(delete or rubout) interrupts
.RE

.SS "File Manipulation"
.sp
.ne 2
.mk
.na
.B ZZ
.ad
.RS 15n
.rt
if file modified, write and exit; otherwise, exit
.RE

.sp
.ne 2
.mk
.na
.BI :w CR
.ad
.RS 15n
.rt
write back changes
.RE

.sp
.ne 2
.mk
.na
.BI :w! CR
.ad
.RS 15n
.rt
forced write, if permission originally not valid
.RE

.sp
.ne 2
.mk
.na
.BI :q CR
.ad
.RS 15n
.rt
quit
.RE

.sp
.ne 2
.mk
.na
.BI :q! CR
.ad
.RS 15n
.rt
quit, discard changes
.RE

.sp
.ne 2
.mk
.na
\fB:e \fIname\fICR\fR
.ad
.RS 15n
.rt
edit file
.IR name
.RE

.sp
.ne 2
.mk
.na
.BI :e! CR
.ad
.RS 15n
.rt
reedit, discard changes
.RE

.sp
.ne 2
.mk
.na
\fB:e + \fIname\fICR\fR
.ad
.RS 15n
.rt
edit, starting at end
.RE

.sp
.ne 2
.mk
.na
\fB:e +\fIn\fICR\fR
.ad
.RS 15n
.rt
.RI "edit, starting at line" " n"
.RE

.sp
.ne 2
.mk
.na
.BI ":e #" CR
.ad
.RS 15n
.rt
edit alternate file
.RE

.sp
.ne 2
.mk
.na
.BI ":e! #" CR
.ad
.RS 15n
.rt
edit alternate file, discard changes
.RE

.sp
.ne 2
.mk
.na
\fB:w \fIname\fICR\fR
.ad
.RS 15n
.rt
write file
.IR name
.RE

.sp
.ne 2
.mk
.na
\fB:w! \fIname\fICR\fR
.ad
.RS 15n
.rt
overwrite file
.IR name
.RE

.sp
.ne 2
.mk
.na
.BI :sh CR
.ad
.RS 15n
.rt
run shell, then return
.RE

.sp
.ne 2
.mk
.na
\fB:!\fIcmd\fICR\fR
.ad
.RS 15n
.rt
run
.IR cmd ,
then return
.RE

.sp
.ne 2
.mk
.na
.BI :n CR
.ad
.RS 15n
.rt
edit next file in arglist
.RE

.sp
.ne 2
.mk
.na
\fB:n \fIargs\fICR\fR
.ad
.RS 15n
.rt
specify new arglist
.RE

.sp
.ne 2
.mk
.na
.B ^G
.ad
.RS 15n
.rt
show current file and line
.RE

.sp
.ne 2
.mk
.na
\fB:ta \fItag\fICR\fR
.ad
.RS 15n
.rt
position cursor to
.IR tag
.RE

.sp
.LP
In general, any
.B ex
or
.B ed
command (such as
.I substitute
or
.IR global )
can be typed, preceded by a colon and followed by a carriage
return.
.SS "Positioning Within a File"
.sp
.ne 2
.mk
.na
.B F
.ad
.RS 14n
.rt
forward screen
.RE

.sp
.ne 2
.mk
.na
.B ^B
.ad
.RS 14n
.rt
backward screen
.RE

.sp
.ne 2
.mk
.na
.B ^D
.ad
.RS 14n
.rt
scroll down half screen
.RE

.sp
.ne 2
.mk
.na
.B ^U
.ad
.RS 14n
.rt
scroll up half screen
.RE

.sp
.ne 2
.mk
.na
.IR n G
.ad
.RS 14n
.rt
go to the beginning of the specified line (end default), where
.I n
is a
line number
.RE

.sp
.ne 2
.mk
.na
.BI / pat
.ad
.RS 14n
.rt
next line matching
.IR pat
.RE

.sp
.ne 2
.mk
.na
.BI ? pat
.ad
.RS 14n
.rt
previous line matching
.IR pat
.RE

.sp
.ne 2
.mk
.na
.B n
.ad
.RS 14n
.rt
repeat last
.B /
or
.B ?
command
.RE

.sp
.ne 2
.mk
.na
.B N
.ad
.RS 14n
.rt
reverse last
.B /
or
.B ?
command
.RE

.sp
.ne 2
.mk
.na
\fB/\fIpat\fR/+\fIn\fR
.ad
.RS 14n
.rt
\fIn\fRth line after \fIpat\fR
.RE

.sp
.ne 2
.mk
.na
\fB?\fIpat\fR?\(mi\fIn\fR
.ad
.RS 14n
.rt
\fIn\fRth line before \fIpat\fR
.RE

.sp
.ne 2
.mk
.na
.B ]]
.ad
.RS 14n
.rt
next section/function
.RE

.sp
.ne 2
.mk
.na
.B [[
.ad
.RS 14n
.rt
previous section/function
.RE

.sp
.ne 2
.mk
.na
.B (
.ad
.RS 14n
.rt
beginning of sentence
.RE

.sp
.ne 2
.mk
.na
.B )
.ad
.RS 14n
.rt
end of sentence
.RE

.sp
.ne 2
.mk
.na
.B {
.ad
.RS 14n
.rt
beginning of paragraph
.RE

.sp
.ne 2
.mk
.na
.B }
.ad
.RS 14n
.rt
end of paragraph
.RE

.sp
.ne 2
.mk
.na
.B %
.ad
.RS 14n
.rt
find matching
.B "( )"
or
.BR "{ }"
.RE

.SS "Adjusting the Screen"
.sp
.ne 2
.mk
.na
.B ^L
.ad
.RS 16n
.rt
clear and redraw window
.RE

.sp
.ne 2
.mk
.na
.B ^R
.ad
.RS 16n
.rt
clear and redraw window if
.B ^L
is \(-> key
.RE

.sp
.ne 2
.mk
.na
.BI z CR
.ad
.RS 16n
.rt
redraw screen with current line at top of window
.RE

.sp
.ne 2
.mk
.na
\fBz\(mi\fICR\fR
.ad
.RS 16n
.rt
redraw screen with current line at bottom of window
.RE

.sp
.ne 2
.mk
.na
.BI z. CR
.ad
.RS 16n
.rt
redraw screen with current line at center of window
.RE

.sp
.ne 2
.mk
.na
\fB/\fIpat\fR/z\(mi\fICR\fR
.ad
.RS 16n
.rt
move
.I pat
line to bottom of window
.RE

.sp
.ne 2
.mk
.na
\fBz\fIn\fR.\fICR\fR
.ad
.RS 16n
.rt
use \fIn\fR\(miline window
.RE

.sp
.ne 2
.mk
.na
.B ^E
.ad
.RS 16n
.rt
scroll window down one line
.RE

.sp
.ne 2
.mk
.na
.B ^Y
.ad
.RS 16n
.rt
scroll window up one line
.RE

.SS "Marking and Returning"
.sp
.ne 2
.mk
.na
\fB\(ga\(ga\fR
.ad
.RS 12n
.rt
move cursor to previous context
.RE

.sp
.ne 2
.mk
.na
\fB\&''\fR
.ad
.RS 12n
.rt
move cursor to first non-white space in line
.RE

.sp
.ne 2
.mk
.na
.BI m x
.ad
.RS 12n
.rt
mark current position with the
.B ASCII
.RI "lower-case letter" " x"
.RE

.sp
.ne 2
.mk
.na
\fB\(ga\fIx\fR
.ad
.RS 12n
.rt
move cursor to mark
.IR x
.RE

.sp
.ne 2
.mk
.na
\fB\&'\fIx\fR
.ad
.RS 12n
.rt
move cursor to first non-white space in line marked by
.I x
.RE

.SS "Line Positioning"
.sp
.ne 2
.mk
.na
.B H
.ad
.RS 14n
.rt
top line on screen
.RE

.sp
.ne 2
.mk
.na
.B L
.ad
.RS 14n
.rt
last line on screen
.RE

.sp
.ne 2
.mk
.na
.B M
.ad
.RS 14n
.rt
middle line on screen
.RE

.sp
.ne 2
.mk
.na
.B +
.ad
.RS 14n
.rt
next line, at first non-white space character
.RE

.sp
.ne 2
.mk
.na
\fB\(mi\fR
.ad
.RS 14n
.rt
previous line, at first non-white space character
.RE

.sp
.ne 2
.mk
.na
.I CR
.ad
.RS 14n
.rt
.RB "return, same as" " +"
.RE

.sp
.ne 2
.mk
.na
.B down-arrow
.ad
.br
.na
.B or j
.ad
.RS 14n
.rt
next line, same column
.RE

.sp
.ne 2
.mk
.na
.B up-arrow
.ad
.br
.na
.B or k
.ad
.RS 14n
.rt
previous line, same column
.RE

.SS "Character Positioning"
.sp
.ne 2
.mk
.na
.B ^
.ad
.RS 13n
.rt
first non-white space character
.RE

.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 13n
.rt
beginning of line
.RE

.sp
.ne 2
.mk
.na
.B $
.ad
.RS 13n
.rt
end of line
.RE

.sp
.ne 2
.mk
.na
.B l
or \fB\(->\fR
.ad
.RS 13n
.rt
forward
.RE

.sp
.ne 2
.mk
.na
.B h
or \fB\(<-\fR
.ad
.RS 13n
.rt
backward
.RE

.sp
.ne 2
.mk
.na
.B ^H
.ad
.RS 13n
.rt
same as \fB\(<-\fR (backspace)
.RE

.sp
.ne 2
.mk
.na
.B space
.ad
.RS 13n
.rt
same as \fB\(->\fR (space bar)
.RE

.sp
.ne 2
.mk
.na
.BI f x
.ad
.RS 13n
.rt
find next
.IR x
.RE

.sp
.ne 2
.mk
.na
.BI F x
.ad
.RS 13n
.rt
find previous
.IR x
.RE

.sp
.ne 2
.mk
.na
.BI t x
.ad
.RS 13n
.rt
move to character following the next
.IR x
.RE

.sp
.ne 2
.mk
.na
.BI T x
.ad
.RS 13n
.rt
move to character following the previous
.IR x
.RE

.sp
.ne 2
.mk
.na
.B ;
.ad
.RS 13n
.rt
repeat last
.BR f ,
.BR F ,
.BR t ,
or
.BR T
.RE

.sp
.ne 2
.mk
.na
.B ,
.ad
.RS 13n
.rt
repeat inverse of last
.BR f ,
.BR F ,
.BR t ,
or
.BR T
.RE

.sp
.ne 2
.mk
.na
.IR n |
.ad
.RS 13n
.rt
move to column
.IR n
.RE

.sp
.ne 2
.mk
.na
.B %
.ad
.RS 13n
.rt
find matching
.B "( )"
or
.BR "{ }"
.RE

.SS "Words, Sentences, Paragraphs"
.sp
.ne 2
.mk
.na
.B w
.ad
.RS 5n
.rt
forward a word
.RE

.sp
.ne 2
.mk
.na
.B b
.ad
.RS 5n
.rt
back a word
.RE

.sp
.ne 2
.mk
.na
.B e
.ad
.RS 5n
.rt
end of word
.RE

.sp
.ne 2
.mk
.na
.B )
.ad
.RS 5n
.rt
to next sentence
.RE

.sp
.ne 2
.mk
.na
.B }
.ad
.RS 5n
.rt
to next paragraph
.RE

.sp
.ne 2
.mk
.na
.B (
.ad
.RS 5n
.rt
back a sentence
.RE

.sp
.ne 2
.mk
.na
.B {
.ad
.RS 5n
.rt
back a paragraph
.RE

.sp
.ne 2
.mk
.na
.B W
.ad
.RS 5n
.rt
forward a blank-delimited word
.RE

.sp
.ne 2
.mk
.na
.B B
.ad
.RS 5n
.rt
back a blank-delimited word
.RE

.sp
.ne 2
.mk
.na
.B E
.ad
.RS 5n
.rt
end of a blank-delimited word
.RE

.SS "Corrections During Insert"
.sp
.ne 2
.mk
.na
.B ^H
.ad
.RS 16n
.rt
erase last character (backspace)
.RE

.sp
.ne 2
.mk
.na
.B ^W
.ad
.RS 16n
.rt
erase last word
.RE

.sp
.ne 2
.mk
.na
.B erase
.ad
.RS 16n
.rt
your erase character, same as
.B ^H
(backspace)
.RE

.sp
.ne 2
.mk
.na
.B kill
.ad
.RS 16n
.rt
your kill character, erase this line of input
.RE

.sp
.ne 2
.mk
.na
\fB\e\fR
.ad
.RS 16n
.rt
quotes your erase and kill characters
.RE

.sp
.ne 2
.mk
.na
.I ESC
.ad
.RS 16n
.rt
ends insertion, back to command mode
.RE

.sp
.ne 2
.mk
.na
\fBControl\(miC\fR
.ad
.RS 16n
.rt
interrupt, suspends insert mode
.RE

.sp
.ne 2
.mk
.na
.B ^D
.ad
.RS 16n
.rt
backtab one character; reset left margin of
.I autoindent
.RE

.sp
.ne 2
.mk
.na
.B ^^D
.ad
.RS 16n
.rt
caret
.RB ( ^ )
followed by control-d
.RB ( ^D );
backtab to beginning of
line; do not reset left margin of
.I autoindent
.RE

.sp
.ne 2
.mk
.na
.B 0^D
.ad
.RS 16n
.rt
backtab to beginning of line; reset left margin of
.I autoindent
.RE

.sp
.ne 2
.mk
.na
.B ^V
.ad
.RS 16n
.rt
quote non-printable character
.RE

.SS "Insert and Replace"
.sp
.ne 2
.mk
.na
.B a
.ad
.RS 12n
.rt
append after cursor
.RE

.sp
.ne 2
.mk
.na
.B A
.ad
.RS 12n
.rt
append at end of line
.RE

.sp
.ne 2
.mk
.na
.B i
.ad
.RS 12n
.rt
insert before cursor
.RE

.sp
.ne 2
.mk
.na
.B I
.ad
.RS 12n
.rt
insert before first non-blank
.RE

.sp
.ne 2
.mk
.na
.B o
.ad
.RS 12n
.rt
open line below
.RE

.sp
.ne 2
.mk
.na
.B O
.ad
.RS 12n
.rt
open line above
.RE

.sp
.ne 2
.mk
.na
.BI r x
.ad
.RS 12n
.rt
replace single character with
.IR x
.RE

.sp
.ne 2
.mk
.na
\fBR\fItext\fIESC\fR
.ad
.RS 12n
.rt
replace characters
.RE

.SS "Operators"
.sp
.LP
Operators are followed by a cursor motion and affect all text that would
have been moved over. For example, since
.B w
.RB "moves over a word," " dw"
deletes the word that would be moved over. Double the operator, for example
.BR dd ,
to affect whole lines.
.sp
.ne 2
.mk
.na
.B d
.ad
.RS 5n
.rt
delete
.RE

.sp
.ne 2
.mk
.na
.B c
.ad
.RS 5n
.rt
change
.RE

.sp
.ne 2
.mk
.na
.B y
.ad
.RS 5n
.rt
yank lines to buffer
.RE

.sp
.ne 2
.mk
.na
.B <
.ad
.RS 5n
.rt
left shift
.RE

.sp
.ne 2
.mk
.na
.B >
.ad
.RS 5n
.rt
right shift
.RE

.sp
.ne 2
.mk
.na
.B !
.ad
.RS 5n
.rt
filter through command
.RE

.SS "Miscellaneous Operations"
.sp
.ne 2
.mk
.na
.B C
.ad
.RS 5n
.rt
change rest of line
.RB ( c$ )
.RE

.sp
.ne 2
.mk
.na
.B D
.ad
.RS 5n
.rt
delete rest of line
.RB ( d$ )
.RE

.sp
.ne 2
.mk
.na
.B s
.ad
.RS 5n
.rt
substitute characters
.RB ( cl )
.RE

.sp
.ne 2
.mk
.na
.B S
.ad
.RS 5n
.rt
substitute lines
.RB ( cc )
.RE

.sp
.ne 2
.mk
.na
.B J
.ad
.RS 5n
.rt
join lines
.RE

.sp
.ne 2
.mk
.na
.B x
.ad
.RS 5n
.rt
delete characters
.RB ( dl )
.RE

.sp
.ne 2
.mk
.na
.B X
.ad
.RS 5n
.rt
delete characters before cursor
.BR dh )
.RE

.sp
.ne 2
.mk
.na
.B Y
.ad
.RS 5n
.rt
yank lines
.RB ( yy )
.RE

.SS "Yank and Put"
.sp
.LP
Put inserts the text most recently deleted or yanked; however, if a buffer
is named (using the
.B ASCII
lower-case letters
.B a
-
.BR z ),
the
text in that buffer is put instead.
.sp
.ne 2
.mk
.na
.B 3yy
.ad
.RS 7n
.rt
yank 3 lines
.RE

.sp
.ne 2
.mk
.na
.B 3yl
.ad
.RS 7n
.rt
yank 3 characters
.RE

.sp
.ne 2
.mk
.na
.B p
.ad
.RS 7n
.rt
put back text after cursor
.RE

.sp
.ne 2
.mk
.na
.B P
.ad
.RS 7n
.rt
put back text before cursor
.RE

.sp
.ne 2
.mk
.na
\fI"x\fRp\fR
.ad
.RS 7n
.rt
put from buffer
.IR x
.RE

.sp
.ne 2
.mk
.na
\fB"\fIx\fRy\fR
.ad
.RS 7n
.rt
yank to buffer
.IR x
.RE

.sp
.ne 2
.mk
.na
\fB"\fIx\fRd\fR
.ad
.RS 7n
.rt
delete into buffer
.IR x
.RE

.SS "Undo, Redo, Retrieve"
.sp
.ne 2
.mk
.na
.B u
.ad
.RS 7n
.rt
undo last change
.RE

.sp
.ne 2
.mk
.na
.B U
.ad
.RS 7n
.rt
restore current line
.RE

.sp
.ne 2
.mk
.na
\fB\&.\fR
.ad
.RS 7n
.rt
repeat last change
.RE

.sp
.ne 2
.mk
.na
\fB"\fId\fRp\fR
.ad
.RS 7n
.rt
retrieve
.IR d "'th last delete"
.RE

.SH USAGE
.sp
.LP
See
.BR largefile (5)
for the description of the behavior of
.B vi
and
.B view
when encountering files greater than or equal to 2 Gbyte ( 2^31
bytes).
.SH ENVIRONMENT VARIABLES
.sp
.LP
See
.BR environ (5)
for descriptions of the following environment
variables that affect the execution of
.BR vi :
.BR LANG ,
.BR LC_ALL ,
.BR LC_COLLATE ,
.BR LC_CTYPE ,
.BR LC_TIME ,
.BR LC_MESSAGES ,
.BR NLSPATH ,
.BR PATH ,
.BR SHELL ,
and
.BR TERM .
.sp
.ne 2
.mk
.na
.B COLUMNS
.ad
.RS 11n
.rt
Override the system-selected horizontal screen size.
.RE

.sp
.ne 2
.mk
.na
.B EXINIT
.ad
.RS 11n
.rt
Determine a list of
.B ex
commands that are executed on editor start-up,
before reading the first file. The list can contain multiple commands by
separating them using a vertical-line
.RB ( | )
character.
.RE

.sp
.ne 2
.mk
.na
.B LINES
.ad
.RS 11n
.rt
Override the system-selected vertical screen size, used as the number of
lines in a screenful and the vertical screen size in visual mode.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B /var/tmp
.ad
.sp .6
.RS 4n
default directory where temporary work files are placed; it can be changed
using the
.B directory
option (see the
.BR ex (1)
command)
.RE

.sp
.ne 2
.mk
.na
.B /usr/share/lib/terminfo/?/*
.ad
.sp .6
.RS 4n
compiled terminal description database
.RE

.sp
.ne 2
.mk
.na
.B /usr/lib/.COREterm/?/*
.ad
.sp .6
.RS 4n
subset of compiled terminal description database
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.SS "/usr/bin/vi, /usr/bin/view, /usr/bin/vedit"
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
_
CSINot enabled
.TE

.SS "/usr/xpg4/bin/vi, /usr/xpg4/bin/view, /usr/xpg4/bin/vedit"
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWxcu4
_
CSIEnabled
_
Interface StabilityStandard
.TE

.SS "/usr/xpg6/bin/vi, /usr/xpg6/bin/view, /usr/xpg6/bin/vedit"
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWxcu6
_
CSIEnabled
_
Interface StabilityStandard
.TE

.SH SEE ALSO
.sp
.LP
.BR Intro (1),
.BR ctags (1),
.BR ed (1),
.BR edit (1),
.BR ex (1),
.BR attributes (5),
.BR environ (5),
.BR largefile (5),
.BR standards (5)
.sp
.LP
\fISolaris Advanced User\&'s Guide\fR
.SH AUTHOR
.sp
.LP
.B vi
and
.B ex
were developed by The University of California,
Berkeley California, Computer Science Division, Department of Electrical
Engineering and Computer Science.
.SH NOTES
.sp
.LP
Two options, although they continue to be supported, have been replaced in
the documentation by options that follow the Command Syntax Standard (see
.BR Intro (1)).
An
.B -r
option that is not followed with an
option-argument has been replaced by
.B -L
and
.B +command
has
been replaced by
.BR "-c command" .
.sp
.LP
The message
.B "file too large to recover with"
.BR "-r option" ,
which is seen when a file is loaded, indicates that the file can be edited
and saved successfully, but if the editing session is lost, recovery of the
file with the
.B -r
option is not possible.
.sp
.LP
The editing environment defaults to certain configuration options. When an
editing session is initiated,
.B vi
attempts to read the
.BR EXINIT
environment variable. If it exists, the editor uses the values defined in
.BR EXINIT ;
otherwise the values set in
.B $HOME/.exrc
are used. If
.B $HOME/.exrc
does not exist, the default values are used.
.sp
.LP
To use a copy of \fB\&.exrc\fR located in the current directory other than
.BR $HOME ,
set the
.I exrc
option in
.B EXINIT
or
.BR $HOME/.exrc .
Options set in
.B EXINIT
can be turned off in a local \fB\&.exrc\fR only
if
.I exrc
is set in
.B EXINIT
or
.BR $HOME/.exrc .
In order to be
used, \fI\&.exrc\fR in
.B $HOME
or the current directory must fulfill
these conditions:
.RS +4
.TP
.ie t \(bu
.el o
It must exist.
.RE
.RS +4
.TP
.ie t \(bu
.el o
It must be owned by the same userid as the real userid of the process, or
the process has appropriate privileges.
.RE
.RS +4
.TP
.ie t \(bu
.el o
It is not writable by anyone other than the owner.
.RE
.sp
.LP
Tampering with entries in
.B /usr/share/lib/terminfo/?/*
or
.B /usr/share/lib/terminfo/?/*
(for example, changing or removing an
entry) can affect programs such as
.B vi
that expect the entry to be
present and correct. In particular, removing the "dumb" terminal can cause
unexpected problems.
.sp
.LP
Software tabs using
.B ^T
work only immediately after the
.IR autoindent .
.sp
.LP
Left and right shifts on intelligent terminals do not make use of insert
and delete character operations in the terminal.
.sp
.LP
Loading an alternate
.B malloc()
library using the environment variable
.B LD_PRELOAD
can cause problems for
.BR /usr/bin/vi .
.sp
.LP
The
.B vi
utility currently has the following limitations:
.RS +4
.TP
1.
Lines, including the trailing NEWLINE character, can contain no more than
4096 bytes.
.sp
If a longer line is found,
.B "Line too long"
is displayed in the status
line.
.RE
.RS +4
.TP
2.
The editor's temporary work file can be no larger than 128Mb.
.sp
If a larger temporary file is needed,
.B "Tmp file too large"
is displayed
in the status line.
.RE
