usr/src/man/man4b/plot.4b
'\" te
.\" Copyright (C) 2003, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH plot 4B "18 Feb 2003" "SunOS 5.11" "SunOS/BSD Compatibility Package File Formats"
.SH NAME
plot \- graphics interface
.SH DESCRIPTION
.sp
.LP
Files of this format  are interpreted for various devices by commands
described in \fBplot\fR(1B). A graphics file is a stream of plotting
instructions. Each instruction consists of an
.B ASCII
letter usually
followed by bytes of binary information. The instructions are executed in
order. A point is designated by four bytes representing the
.I x
and
.I y
values; each value is a signed integer. The last designated point in
an
.BR l ,
.BR m ,
.BR n ,
or
.B p
instruction becomes the ``current
point'' for the next instruction.
.sp
.ne 2
.mk
.na
.B m
.ad
.RS 6n
.rt
Move: the next four bytes give a new current point.
.RE

.sp
.ne 2
.mk
.na
.B n
.ad
.RS 6n
.rt
Cont: draw a line from the current point to the point given by the next
four bytes. See
.BR plot (1B).
.RE

.sp
.ne 2
.mk
.na
.B p
.ad
.RS 6n
.rt
Point: plot the point given by the next four bytes.
.RE

.sp
.ne 2
.mk
.na
.B l
.ad
.RS 6n
.rt
Line: draw a line from the point given by the next four bytes to the point
given by the following four bytes.
.RE

.sp
.ne 2
.mk
.na
.B t
.ad
.RS 6n
.rt
Label: place the following
.B ASCII
string so that its first character
falls on the current point. The string is terminated by a \fBNEWLINE.\fR
.RE

.sp
.ne 2
.mk
.na
.B a
.ad
.RS 6n
.rt
Arc: the first four bytes give the center, the next four give the starting
point, and the last four give the end point of a circular arc. The least
significant coordinate of the end point is used only to determine the
quadrant. The arc is drawn counter-clockwise.
.RE

.sp
.ne 2
.mk
.na
.B c
.ad
.RS 6n
.rt
Circle: the first four bytes give the center of the circle, the next two
the radius.
.RE

.sp
.ne 2
.mk
.na
.B e
.ad
.RS 6n
.rt
Erase: start another frame of output.
.RE

.sp
.ne 2
.mk
.na
.B f
.ad
.RS 6n
.rt
Linemod: take the following string, up to a
.B NEWLINE,
as the style for
drawing further lines. The styles are ``dotted,'' ``solid,'' ``longdashed,''
``shortdashed,'' and ``dotdashed.'' Effective only in \fBplot 4014\fR
and
.BR "plot ver" .
.RE

.sp
.ne 2
.mk
.na
.B s
.ad
.RS 6n
.rt
Space: the next four bytes give the lower left corner of the plotting area;
the following four give the upper right corner. The plot will be magnified
or reduced to fit the device as closely as possible.
.sp
Space settings that exactly fill the plotting area with unity scaling
appear below for devices supported by the filters of
.BR plot "(1B). The"
upper limit is just outside the plotting area.
.RE

.sp
.LP
In every case the plotting area is taken to be square; points outside may
be displayable on devices whose face is not square.
.sp
.ne 2
.mk
.na
.B 4014
.ad
.RS 14n
.rt
.B "space(0, 0," 3120, 3120);
.RE

.sp
.ne 2
.mk
.na
.B ver
.ad
.RS 14n
.rt
.B "space(0, 0," 2048, 2048);
.RE

.sp
.ne 2
.mk
.na
\fB300\fR,\fB 300s\fR
.ad
.RS 14n
.rt
.B "space(0, 0," 4096, 4096);
.RE

.sp
.ne 2
.mk
.na
.B 450
.ad
.RS 14n
.rt
.B "space(0, 0," 4096, 4096);
.RE

.SH SEE ALSO
.sp
.LP
.BR graph (1),
.BR plot (1B)
