usr/src/man/man7/ibmf.7
'\" te
.\" Copyright (c) 2004, Sun Microsystems, Inc.  All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ibmf 7 "9 Sep 2004" "SunOS 5.11" "Device and Network Interfaces"
.SH NAME
ibmf \- InfiniBand Management Transport Framework
.SH DESCRIPTION
.sp
.LP
The InfiniBand (IB) Management Transport Framework provides the mechanisms
for IB management modules to communicate with other InfiniBand management
modules such as the Subnet Administration process.  It also provides helper
functions such as Subnet Administration Access (SAA) for commonly performed
operations.
.SH FILES
.sp
.ne 2
.mk
.na
.B /kernel/misc/ibmf
.ad
.RS 29n
.rt
32-bit ELF kernel misc module (x86 platform only).
.RE

.sp
.ne 2
.mk
.na
.B /kernel/misc/amd64/ibmf
.ad
.RS 29n
.rt
64-bit ELF kernel misc module (x86 platform only).
.RE

.sp
.ne 2
.mk
.na
.B /kernel/misc/sparcv9/ibmf
.ad
.RS 29n
.rt
64-bit ELF kernel misc module (SPARC platform only).
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
ArchitecturePCI-based systems
_
Interface stabilityConsolidation Private
_
Availability SUNWib
.TE

.SH SEE ALSO
.sp
.LP
.BR ibtl (7D)
.sp
.LP
.I InfiniBand Architecture Specification, Version 1.1
.sp
.LP
.I www.infinibandta.org
