usr/src/man/man5/ad.5
'\" te
.\" Copyright (c) 2008, Sun Microsystems, Inc. All Rights Reserved.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ad 5 "22 Oct 2008" "SunOS 5.11" "Standards, Environments, and Macros"
.SH NAME
ad \- Active Directory as a naming repository
.SH DESCRIPTION
.sp
.LP
Solaris clients can obtain naming information from Active Directory (AD)
servers.
.sp
.LP
The Solaris system must first join an AD domain and then add the
.BR ad
keyword to the appropriate entries in the
.BR nsswitch.conf (4)
file. The
Solaris system joins the AD domain by using the
.BR kclient "(1M) utility."
The AD name service only supports the naming databases for
.B passwd
and
.BR group .
.sp
.LP
Windows users are not able to log in. The
.BR user_attr (4)
database has
no entries for Windows users, and the
.BR passwd (1)
command does not
support the synchronization of user passwords with AD.
.sp
.LP
The Solaris AD client uses auto-discovery techniques to find AD directory
servers, such as domain controllers and global catalog servers. The client
also uses the LDAP v3 protocol to access naming information from AD servers.
The AD server schema requires no modification because the AD client works
with native AD schema. The Solaris AD client uses the
.BR idmap (1M)
service to map between Windows security identifiers (SIDs) and Solaris user
identifiers (UIDs) and group identifiers (GIDs). User names and group names
are taken from the
.B sAMAccountName
attribute of the AD user and group
objects and then tagged with the domain where the objects reside. The domain
name is separated from the user name or group name by the
.B @
character.

.sp
.LP
.RB "The client uses the SASL/GSSAPI/KRB5 security model. The" " kclient"
utility is used to join the client to AD. During the join operation,
.B kclient
configures Kerberos v5 on the client. See
.BR kclient (1M).
.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/nsswitch.conf
.ad
.RS 24n
.rt
Configuration file for the name-service switch.
.RE

.sp
.ne 2
.mk
.na
.B /etc/nsswitch.ad
.ad
.RS 24n
.rt
Sample configuration file for the name-service switch configured with ad,
dns and files.
.RE

.sp
.ne 2
.mk
.na
.B /usr/lib/nss_ad.so.1
.ad
.RS 24n
.rt
Name service switch module for AD.
.RE

.SH SEE ALSO
.sp
.LP
.BR passwd (1),
.BR svcs (1),
.BR idmap (1M),
.BR idmapd (1M),
.BR kclient (1M),
.BR svcadm (1M),
.BR svccfg (1M),
.BR svccfg (1M),
.BR nsswitch.conf (4),
.BR user_attr (4),
.BR smf (5)
