usr/src/man/man5/audit_syslog.5
'\" te
.\" Copyright (c) 2008, Sun Microsystems, Inc. All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH audit_syslog 5 "25 Sep 2008" "SunOS 5.11" "Standards, Environments, and Macros"
.SH NAME
audit_syslog \- realtime conversion of Solaris audit data to syslog
messages
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/security/audit_syslog.so\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B audit_syslog
plugin module for Solaris audit,
.BR /usr/lib/security/audit_syslog.so ,
provides realtime conversion of
Solaris audit data to syslog-formatted (text) data and sends it to a syslog
daemon as configured in
.BR syslog.conf (4).
The plugin's path is specified
in the audit configuration file,
.BR audit_control (4).
.sp
.LP
Messages to
.B syslog
are written if selected via the
.BR plugin
option in
.BR audit_control .
Syslog messages are generated with the
facility code of
.B LOG_AUDIT
(\fBaudit\fR in
.BR syslog.conf (4))
and
severity of
.BR LOG_NOTICE .
Audit
.B syslog
messages contain data
selected from the tokens described for the binary audit log. (See
.BR audit.log (4)).
As with all
.B syslog
messages, each line in a
\fBsyslog\fR file consists of two parts, a \fBsyslog\fR header and a
message.
.sp
.LP
The syslog header contains the date and time the message was generated, the
host name from which it was sent,
.B auditd
to indicate that it was
generated by the audit daemon, an ID field used internally by
.BR syslogd ,
and
.B audit.notice
indicating the
.B syslog
facility and severity
values. The
.B syslog
header ends with the characters
.BR ] ,
that is, a
closing square bracket and a space.
.sp
.LP
The message part starts with the event type from the header token. All
subsequent data appears only if contained in the original audit record and
there is room in the 1024-byte maximum length
.B syslog
line. In the
following example, the backslash (\fB\e\fR) indicates a continuation; actual
\fBsyslog\fR messages are contained on one line:
.sp
.in +2
.nf
Oct 31 11:38:08 smothers auditd: [ID 917521 audit.notice] chdir(2) ok\e
session 401 by joeuser as root:other from myultra obj /export/home
.fi
.in -2
.sp

.sp
.LP
In the preceding example,
.B chdir(2)
is the event type. Following this
field is additional data, described below. This data is omitted if it is not
contained in the source audit record.
.sp
.ne 2
.mk
.na
\fBok\fR or \fBfailed\fR
.ad
.RS 21n
.rt
Comes from the return or exit token.
.RE

.sp
.ne 2
.mk
.na
.BI "session " <#>
.ad
.RS 21n
.rt
\fI<#>\fR is the session ID from the subject token.
.RE

.sp
.ne 2
.mk
.na
.BI "by " <name>
.ad
.RS 21n
.rt
\fI<name>\fR is the audit ID from the subject token.
.RE

.sp
.ne 2
.mk
.na
\fBas \fI<name>\fR:\fI<group>\fR
.ad
.RS 21n
.rt
\fI<name>\fR is the effective user ID and \fI<group>\fR is the effective
group ID from the subject token.
.RE

.sp
.ne 2
.mk
.na
\fBin\fR \fI<zone name>\fR
.ad
.RS 21n
.rt
The zone name. This field is generated only if the
.B zonename
audit
policy is set.
.RE

.sp
.ne 2
.mk
.na
\fBfrom \fI<terminal>\fR
.ad
.RS 21n
.rt
\fI<terminal>\fR is the text machine address from the subject token.
.RE

.sp
.ne 2
.mk
.na
.BI "obj " <path>
.ad
.RS 21n
.rt
\fI<path>\fR is the path from the path token The path can be truncated from
the left if necessary to fit it on the line. Truncation is indicated by
leading ellipsis (\fB\&.\|.\|.\fR).
.RE

.sp
.ne 2
.mk
.na
.BI "proc_uid " <owner>
.ad
.RS 21n
.rt
\fI<owner>\fR is the effective user ID of the process owner.
.RE

.sp
.ne 2
.mk
.na
.BI "proc_auid " <owner>
.ad
.RS 21n
.rt
\fI<owner>\fR is the audit ID of the process owner.
.RE

.sp
.LP
The following are example
.B syslog
messages:
.sp
.in +2
.nf
Nov  4  8:27:07 smothers auditd: [ID 175219 audit.notice] \e
system booted

Nov  4  9:28:17 smothers auditd: [ID 752191 audit.notice] \e
login - rlogin ok session 401 by joeuser as joeuser:staff from myultra

Nov  4 10:29:27 smothers auditd: [ID 521917 audit.notice] \e
access(2) ok session 255 by janeuser as janeuser:staff from  \e
129.146.89.30 obj /etc/passwd
.fi
.in -2
.sp

.SH OBJECT ATTRIBUTES
.sp
.LP
The \fBp_flag\fR attribute, specified by means of the \fBplugin\fR
directive (see
.BR audit_control (4)),
is used to further filter audit data
being sent to the
.B syslog
daemon beyond the classes specified through
the \fBflags\fR and \fBnaflags\fR lines of
.B audit_control
and through
the user-specific lines of
.BR audit_user (4).
The parameter is a
comma-separated list; each item represents an audit class (see
.BR audit_class (4))
and is specified using the same syntax used in
\fBaudit_control\fR for the \fBflags\fR and \fBnaflags\fR lines. The default
(no \fBp_flags\fR listed) is that no audit records are generated.
.SH EXAMPLES
.LP
\fBExample 1\fR One Use of the \fBplugin\fR Line
.sp
.LP
In the specification shown below, the
.B plugin
line (in conjunction
with \fBflags\fR and
.BR naflags )
is used to allow class records for
\fBlo\fR but allows class records for \fBam\fR for failures only. Omission
of the \fBfm\fR class records results in no \fBfm\fR class records being
output. The
.B pc
parameter has no effect because you cannot add classes
to those defined by means of \fBflags\fR and \fBnaflags\fR and by
.BR audit_user (4).
You can only remove them.

.sp
.in +2
.nf
flags: lo,am,fm
naflags: lo
plugin: name=audit_syslog.so; p_flags=lo,-am
.fi
.in -2
.sp

.LP
\fBExample 2\fR Use of \fBall\fR
.sp
.LP
In the specification shown below, with one exception,
.B all
allows all
flags defined by means of \fBflags\fR and \fBnaflags\fR (and
.BR audit_user (4)).
The exception the
.B am
metaclass, which is
equivalent to
.BR ss,as,ua ,
which is modified to output all
.BR ua
events but only failure events for
.B ss
and
.BR as .

.sp
.in +2
.nf
flags: lo,am
naflags: lo
plugin: name=audit_syslog.so; p_flags=all,^+ss,^+as
.fi
.in -2
.sp

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for a description of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
\fBATTRIBUTE TYPE\fR\fBATTRIBUTE VALUE\fR
_
MT LevelMT-Safe
_
Interface StabilitySee below.
.TE

.sp
.LP
The message format and message content are Uncommitted. The configuration
parameters are Committed.
.SH SEE ALSO
.sp
.LP
.BR auditd (1M),
.BR audit_class (4),
.BR audit_control (4),
.BR syslog.conf (4),
.BR attributes (5)
.sp
.LP
.I System Administration Guide: Security Services
.SH NOTES
.sp
.LP
Use of the
.B plugin
configuration line to include
.BR audit_syslog.so
requires that \fB/etc/syslog.conf\fR is configured to store \fBsyslog\fR
messages of facility
.B audit
and severity
.B notice
or above in a
file intended for Solaris audit records. An example of such a line in
\fBsyslog.conf\fR is:
.sp
.in +2
.nf
audit.notice                /var/audit/audit.log
.fi
.in -2
.sp

.sp
.LP
Messages from
.B syslog
are sent to remote
.B syslog
servers by means
of UDP, which does not guarantee delivery or ensure the correct order of
arrival of messages.
.sp
.LP
If the parameters specified for the
.B plugin
line result in no classes
being preselected, an error is reported by means of a
.B syslog
alert
with the
.B LOG_DAEMON
facility code.
.sp
.LP
The time field in the
.B syslog
header is generated by
.BR syslog (3C)
and only approximates the time given in the binary audit log. Normally the
time field shows the same whole second or at most a few seconds
difference.
