usr/src/man/man5/audit_binfile.5
'\" te
.\" Copyright (c) 2009, Sun Microsystems, Inc. All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH audit_binfile 5 "24 Jun 2009" "SunOS 5.11" "Standards, Environments, and Macros"
.SH NAME
audit_binfile \- generation of Solaris audit logs
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/security/audit_binfile.so\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B audit_binfile
plugin module for Solaris audit,
.BR /usr/lib/security/audit_binfile.so ,
writes binary audit data to files
as configured in
.BR audit_control (4);
it is the default plugin for the
Solaris audit daemon
.BR auditd "(1M). Its output is described by"
.BR audit.log (4).
.sp
.LP
The \fBaudit_binfile\fR plugin is loaded by \fBauditd\fR if
.B audit_control
contains one or more lines defining audit directories by
means of the
.B dir:
specification or if
.B audit_control
has a
.B plugin:
specification of \fBname=audit_binfile.so\fR.
.SH OBJECT ATTRIBUTES
.sp
.LP
The
.B p_dir
and
.B p_minfree
attributes are equivalent to the
.B dir:
and
.B minfree:
lines described in
.BR audit_control .
If
both the
.B dir:
line and the
.B p_dir
attribute are used, the plugin
combines all directories into a single list with those specified by means of
.B dir:
at the front of the list. If both the
.B minfree
and the
.B p_minfree
attributes are given, the
.B p_minfree
value is used.
.sp
.LP
The
.B p_fsize
attribute defines the maximum size in bytes that an audit
file can become before it is automatically closed and a new audit file
.RB "opened. This is equivalent to an administrator issuing an" " audit"
.B -n
command when the audit file contains the specified number of bytes.
The default size is zero (0), which allows the file to grow without bound.
The value specified must be within the range of [512,000, 2,147,483,647].
.SH EXAMPLES
.sp
.LP
The following directives cause
.B audit_binfile.so
to be loaded, specify
the directories for writing audit logs, and specify the percentage of
required free space per directory.
.sp
.in +2
.nf
flags: lo,ad,-fm
naflags: lo,ad
plugin: name=audit_binfile.so;\e
p_minfree=20;\e
p_dir=/var/audit/jedgar/eggplant,\e
/var/audit/jedgar.aux/eggplant,\e
/var/audit/global/eggplant
.fi
.in -2
.sp

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for a description of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
\fBATTRIBUTE TYPE\fR\fBATTRIBUTE VALUE\fR
_
MT LevelMT-Safe
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
.BR auditd (1M),
.BR audit_control (4),
.BR syslog.conf (4),
.BR attributes (5)
.sp
.LP
.I System Administration Guide: Security Services
