usr/src/man/man5/crypt_bsdbf.5
'\" te
.\" Copyright (c) 2009, Sun Microsystems, Inc. All Rights Reserved.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH crypt_bsdbf 5 "13 Sep 2009" "SunOS 5.11" "Standards, Environments, and Macros"
.SH NAME
crypt_bsdbf \- password hashing module using Blowfish cryptographic
algorithm
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/security/$ISA/crypt_bsdbf.so\fR
.fi

.SH DESCRIPTION
.sp
.LP
The \fBcrypt_bsdbf\fR module is a one-way password hashing module for use
with \fBcrypt\fR(3C) that uses the Blowfish cryptographic algorithm. The
algorithm identifier for
.BR crypt.conf (4)
and
.BR policy.conf (4)
is
.BR 2a .
.sp
.LP
The maximum password length for \fBcrypt_bsdbf\fR is 72 characters.
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
MT-LevelSafe
.TE

.SH SEE ALSO
.sp
.LP
.BR passwd (1),
.BR crypt (3C),
.BR crypt_genhash_impl (3C),
.BR crypt_gensalt (3C),
.BR crypt_gensalt_impl (3C),
.BR getpassphrase (3C),
.BR crypt.conf (4),
.BR passwd (4),
.BR policy.conf (4),
.BR attributes (5)
