usr/src/man/man5/crypt_bsdmd5.5
'\" te
.\" Copyright (c) 2003, Sun Microsystems, Inc. All Rights Reserved.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH crypt_bsdmd5 5 "6 Aug 2003" "SunOS 5.11" "Standards, Environments, and Macros"
.SH NAME
crypt_bsdmd5 \- password hashing module using MD5 message hash algorithm
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/security/$ISA/crypt_bsdmd5.so\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B crypt_bsdmd5
module is a one-way password hashing module for use
with
.BR crypt "(3C) that uses the MD5 message hash algorithm. The algorithm"
identifier for
.BR crypt.conf (4)
and
.BR policy.conf (4)
is
.BR 1 .
The
output is compatible with
.B md5crypt
on BSD and Linux systems.
.sp
.LP
The maximum password length for
.B crypt_bsdmd5
is 255 characters.
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
MT-LevelSafe
.TE

.SH SEE ALSO
.sp
.LP
.BR passwd (1),
.BR crypt (3C),
.BR crypt_genhash_impl (3C),
.BR crypt_gensalt (3C),
.BR crypt_gensalt_impl (3C),
.BR getpassphrase (3C),
.BR crypt.conf (4),
.BR passwd (4),
.BR policy.conf (4),
.BR attributes (5)
