usr/src/man/man5/dhcp_modules.5
'\" te
.\" Copyright (c) 2003, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH dhcp_modules 5 "24 Jan 2003" "SunOS 5.11" "Standards, Environments, and Macros"
.SH NAME
dhcp_modules \- data storage modules for the DHCP service
.SH DESCRIPTION
.sp
.LP
This man page describes the characteristics of data storage modules (public
modules) for use by the Solaris Dynamic Host Configuration Protocol
.RB ( DHCP )
service.
.sp
.LP
Public modules are the part of the
.B DHCP
service architecture that
encapsulate the details of storing
.B DHCP
service data in a data storage
service. Examples of data storage services are
.BR NIS+ ,
Oracle, and
.B ufs
file systems.
.sp
.LP
Public modules are dynamic objects which can be shipped separately from the
Solaris
.B DHCP
service. Once installed, a public module is visible to
the
.B DHCP
service, and can be selected for use by the service through
the
.B DHCP
service management interfaces
.RB ( dhcpmgr (1M),
.BR dhcpconfig (1M),
.BR dhtadm (1M),
and
.BR pntadm (1M)).
.sp
.LP
Public modules may be provided by Sun Microsystems, Inc or by third
parties.
.sp
.LP
The Solaris
.B DHCP
service management architecture provides a mechanism
for plugging in public module-specific administration functionality into the
.BR dhcpmgr (1M)
and
.BR dhcpconfig (1M)
utilities. This functionality is
in the form of a Java Bean, which is provided by the public module vendor.
This Java Bean collects public module-specific configuration from the user
(you) and provides it to the Solaris
.B DHCP
service.
.sp
.LP
The Solaris
.B DHCP
service bundles three modules with the service,
which are described below. There are three
.BR dhcpsvc.conf (4)
.B DHCP
service configuration parameters pertaining to public modules:
.BR RESOURCE ,
.BR PATH ,
and
.BR RESOURCE_CONFIG .
See
.BR dhcpsvc.conf (4)
for more information about these parameters.
.SS "SUNWfiles"
.sp
.LP
This module stores its data in
.B ASCII
files. Although the format is
.BR ASCII ,
hand-editing is discouraged. It is useful for
.B DHCP
service environments that support several hundred to a couple thousand of
clients and lease times are a few hours or more.
.sp
.LP
This module's data may be shared between
.B DHCP
servers through the use
of
.BR NFS .
.SS "SUNWbinfiles"
.sp
.LP
This module stores its data in binary files. It is useful for
.B DHCP
service environments with many networks and many thousands of clients. This
module provides an order of magnitude increase in performance and capacity
over SUNWfiles.
.sp
.LP
This module's data cannot be shared between
.B DHCP
servers.
.SS "SUNWnisplus"
.sp
.LP
This module stores its data within a
.B NIS+
domain. It is useful in
environments where
.B NIS+
is already deployed and facilitates sharing
among multiple
.B DHCP
servers. This module suports several hundred to a
few thousand clients with lease times of several hours or more.
.sp
.LP
The
.B NIS+
service should be hosted on a machine with ample
.BR CPU
power, memory, and disk space, as the load on
.B NIS+
is significant when
it is used to store
.B DHCP
data. Periodic checkpointing of the
.B NIS+
service is necessary in order to roll the transaction logs and
keep the
.B NIS+
service operating at its highest efficiency. See
.BR nisping (1M)
and
.BR crontab (1)
for more information.
.SH SEE ALSO
.sp
.LP
.BR crontab (1),
.BR dhcpconfig (1M),
.BR dhcpmgr (1M),
.BR dhtadm (1M),
.BR nisping (1M),
.BR pntadm (1M),
.BR dhcpsvc.conf (4),
.BR dhcp (5)
.sp
.LP
.I
Solaris DHCP Service Developer\&'s Guide
