usr/src/man/man5/dhcp.5
'\" te
.\" Copyright (c) 2001, Sun Microsystems, Inc. All Rights Reserved.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH dhcp 5 "5 Jan 2007" "SunOS 5.11" "Standards, Environments, and Macros"
.SH NAME
dhcp \- Dynamic Host Configuration Protocol
.SH DESCRIPTION
.sp
.LP
Dynamic Host Configuration Protocol (\fBDHCP\fR) enables host systems in a
\fBTCP/IP\fR network to be configured automatically for the network as they
boot.
.B DHCP
uses a client/server mechanism: servers store configuration
information for clients, and provide that information upon a client's
request. The information can include the client's
.B IP
address and
information about network services available to the client.
.sp
.LP
This manual page provides a brief summary of the Solaris
.BR DHCP
implementation.
.SS "Solaris DHCP Client"
.sp
.LP
The Solaris DHCP client is implemented as background daemon,
.BR dhcpagent (1M).
.sp
.LP
For IPv4, this daemon is started automatically during bootup if there
exists at least one \fBdhcp.\fIinterface\fR file in
.BR /etc .
Only
interfaces with a corresponding \fB/etc/dhcp.\fIinterface\fR
file are automatically configured during boot.
.sp
.LP
For IPv6, this daemon is started automatically when commanded by
\fBin.ndpd\fR (based on IPv6 Routing Advertisement messages). No
\fB/etc/dhcp\fR.\fIinterface\fR file is necessary, but such a file can be
used to specify an interface as "primary," provided that IPv4 DHCP is also
in use.
.sp
.LP
Network parameters needed for system configuration during bootup are
extracted from the information received by the daemon through the use of the
\fBdhcpinfo\fR(1) command. The daemon's default behavior can be altered by
changing the tunables in the \fB/etc/default/dhcpagent\fR file. The daemon
is controlled by the \fBifconfig\fR(1M) utility. Check the status of the
daemon using the \fBnetstat\fR(1M) and \fBifconfig\fR(1M) commands.
.SS "Solaris DHCP Server"
.sp
.LP
The Solaris
.B DHCP
server is implemented as a background daemon,
.BR in.dhcpd (1M).
This daemon can deliver network configuration
information to either
.B BOOTP
or
.B DHCP
clients. The Solaris
\fBDHCP\fR service can be managed using the \fBdhcpmgr\fR(1M) \fBGUI\fR or
the command line utilities \fBdhcpconfig\fR(1M),
.BR dhtadm (1M),
and
.BR pntadm (1M).
.SS "DHCP Configuration Tables"
.sp
.LP
The Solaris
.B DHCP
server stores client configuration information in
the following two types of tables:
.sp
.ne 2
.mk
.na
.BR dhcptab " tables"
.ad
.RS 23n
.rt
Contain macros and options (also known as symbols), used to construct a
package of configuration information to send to each
.B DHCP
client.
There exists only one
.B dhcptab
for the
.B DHCP
service. The
.BR dhcptab (4)
can be viewed and modified using the
.BR dhtadm (1M)
command or
.BR dhcpmgr "(1M) graphical utility. See"
.BR dhcptab (4)
for
more information about the syntax of
.B dhcptab
records. See
.BR dhcp_inittab (4)
for more information about the
.B DHCP
options and
symbols.
.RE

.sp
.ne 2
.mk
.na
\fBDHCP\fR network tables\fR
.ad
.RS 23n
.rt
\fBDHCP\fR network tables, which contain mappings of client \fBID\fRs to
\fBIP\fR addresses and parameters associated with those addresses. Network
tables are named with the
.B IP
address of the network, and can be
created, viewed, and modified using the
.B pntadm
command or
\fBdhcpmgr\fR graphical utility. See
.BR dhcp_network (4)
for more
information about network tables.
.RE

.SH SEE ALSO
.sp
.LP
\fBdhcpinfo\fR(1), \fBdhcpagent\fR(1M), \fBdhcpconfig\fR(1M),
.BR dhcpmgr (1M),
.BR dhtadm (1M),
\fBifconfig\fR(1M), \fBin.dhcpd\fR(1M),
.BR in.ndpd (1M),
.BR netstat (1M),
.BR pntadm (1M),
.BR syslog (3C),
.BR dhcp_network (4),
.BR dhcptab (4),
.BR dhcpsvc.conf (4),
.BR dhcp_inittab (4),
\fBndpd.conf\fR(4), \fBdhcp_modules\fR(5)
.sp
.LP
\fISolaris DHCP Service Developer\&'s Guide\fR
.sp
.LP
Alexander, S., and R. Droms. \fIRFC 2132, DHCP Options and BOOTP Vendor
Extensions\fR. Silicon Graphics, Inc. Bucknell University. March 1997.
.sp
.LP
Droms, R.
.IR "RFC 1534, Interoperation Between DHCP and BOOTP" .
Bucknell
University. October 1993.
.sp
.LP
Droms, R.
.IR "RFC 2131, Dynamic Host Configuration Protocol" .
Bucknell
University. March 1997.
.sp
.LP
Wimer, W. \fIRFC 1542, Clarifications and Extensions for the Bootstrap
Protocol\fR. Carnegie Mellon University. October 1993.
.sp
.LP
Lemon, T. and B. Sommerfeld. \fIRFC 4361, Node-specific Client Identifiers
for Dynamic Host Configuration Protocol Version Four (DHCPv4)\fR. Nominum
and Sun Microsystems. February 2006.
.sp
.LP
Droms, R. \fIRFC 3315, Dynamic Host Configuration Protocol for IPv6
(DHCPv6)\fR. Cisco Systems. July 2003.
