usr/src/man/man5/eqnchar.5
'\" te
.\" Copyright (C) 2002, Sun Microsystems, Inc.
.\" All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH eqnchar 5 "12 Jul 2002" "SunOS 5.11" "Standards, Environments, and Macros"
.SH NAME
eqnchar \- special character definitions for eqn
.SH SYNOPSIS
.LP
.nf
eqn  /usr/share/lib/pub/eqnchar \fIfilename\fR |  troff \fIoptions\fR
.fi

.LP
.nf
neqn  /usr/share/lib/pub/eqnchar \fIfilename\fR |  troff \fIoptions\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B eqnchar
command contains
.BR nroff (1)
and \fBtroff\fR(1)
character definitions for constructing characters that are not available on
the Graphic Systems typesetter. These definitions are primarily intended for
use with
.BR eqn (1)
and
.BR neqn (1).
It contains definitions for the
characters listed in the following table.
.sp
To view the special characters, see the online man page on docs.sun.com or
a print copy.
.SH FILES
.sp
.LP
.B /usr/share/lib/pub/eqnchar
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWdoc
.TE

.SH SEE ALSO
.sp
.LP
.BR eqn (1),
\fBnroff\fR(1),
.BR troff (1),
.BR attributes (5)
