usr/src/man/man5/eqnchar.5
'\" te
.\" Copyright (C) 2002, Sun Microsystems, Inc.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH eqnchar 5 "12 Jul 2002" "SunOS 5.11" "Standards, Environments, and Macros"
.SH NAME
eqnchar \- special character definitions for eqn
.SH SYNOPSIS
.LP
.nf
eqn  /usr/share/lib/pub/eqnchar \fIfilename\fR |  troff \fIoptions\fR
.fi

.LP
.nf
neqn  /usr/share/lib/pub/eqnchar \fIfilename\fR |  troff \fIoptions\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B eqnchar
command contains
.BR nroff (1)
and
.BR troff (1)
character definitions for constructing characters that are not available on
the Graphic Systems typesetter. These definitions are primarily intended for
use with
.BR eqn (1)
and
.BR neqn (1).
It contains definitions for the
characters listed in the following table.
.sp
To view the special characters, see the online man page on docs.sun.com or
a print copy.
.SH FILES
.sp
.LP
.B /usr/share/lib/pub/eqnchar
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWdoc
.TE

.SH SEE ALSO
.sp
.LP
.BR eqn (1),
.BR nroff (1),
.BR troff (1),
.BR attributes (5)
