usr/src/man/man5/gss_auth_rules.5
'\" te
.\" Copyright (c) 2004, Sun Microsystems, Inc.  All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH gss_auth_rules 5 "13 Apr 2004" "SunOS 5.11" "Standards, Environments, and Macros"
.SH NAME
gss_auth_rules \- overview of GSS authorization
.SH DESCRIPTION
.sp
.LP
The establishment of the veracity of a user's credentials requires both
authentication (Is this an authentic user?) and authorization (Is this
authentic user, in fact, authorized?).
.sp
.LP
When a user makes use of Generic Security Services (GSS) versions of the
.B ftp
or
.B ssh
clients to connect to a server, the user is not
necessarily authorized, even if his claimed GSS identity is authenticated,
Authentication merely establishes that the user is who he says he is to the
GSS mechanism's authentication system. Authorization is then required: it
determines whether the GSS identity is permitted to access the specified
Solaris user account.
.sp
.LP
The GSS authorization rules are as follows:
.RS +4
.TP
.ie t \(bu
.el o
If the mechanism of the connection has a set of authorization rules, then
use those rules. For example, if the mechanism is Kerberos, then use the
.BR krb5_auth_rules (5),
so that authorization is consistent between raw
Kerberos applications and GSS/Kerberos applications.
.RE
.RS +4
.TP
.ie t \(bu
.el o
If the mechanism of the connection does not have a set of authorization
rules, then authorization is successful if the remote user's \fBgssname\fR
matches the local user's
.B gssname
exactly, as compared by
.BR gss_compare_name (3GSS).
.RE
.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/passwd
.ad
.RS 15n
.rt
System account file. This information may also be in a directory service.
See
.BR passwd (4).
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for a description of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
\fBATTRIBUTE TYPE\fR\fBATTRIBUTE VALUE\fR
_
Interface StabilityEvolving
.TE

.SH SEE ALSO
.sp
.LP
.BR ftp (1),
.BR ssh (1),
.BR gsscred (1M),
.BR gss_compare_name (3GSS),
.BR passwd (4),
.BR attributes (5),
.BR krb5_auth_rules (5)
