usr/src/man/man5/ieee802.11.5
'\" te
.\" Copyright (c) 2006, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ieee802.11 5 "28 Nov 2006" "SunOS 5.11" "Standards, Environments, and Macros"
.SH NAME
ieee802.11 \- 802.11 kernel statistics
.SH DESCRIPTION
.sp
.LP
This page describes the kernel statistics that can be used to monitor
attributes specific to the 802.11 physical layer. These statistics can be
retrieved using
.BR kstat "(1M). Not all 802.11 devices will support all"
statistics.
.sp
.ne 2
.mk
.na
.B tx_frags
.ad
.RS 16n
.rt
Count of data and management fragments transmitted.
.RE

.sp
.ne 2
.mk
.na
.B rx_frags
.ad
.RS 16n
.rt
Count of data and management fragments received.
.RE

.sp
.ne 2
.mk
.na
.B rx_dups
.ad
.RS 16n
.rt
Count of duplicate frames received. Duplicates are determined by the
sequence control field.
.RE

.sp
.ne 2
.mk
.na
.B mcast_tx
.ad
.RS 16n
.rt
Count of broadcast and multicast frames transmitted.
.RE

.sp
.ne 2
.mk
.na
.B mcast_rx
.ad
.RS 16n
.rt
Count of broadcast and multicast frames received.
.RE

.sp
.ne 2
.mk
.na
.B tx_failed
.ad
.RS 16n
.rt
Count of frames that could not be transmitted due to the retransmission
limit being reached.
.RE

.sp
.ne 2
.mk
.na
.B tx_retrans
.ad
.RS 16n
.rt
Count of frames successfully retransmitted after one or more
retransmissions.
.RE

.sp
.ne 2
.mk
.na
.B tx_reretrans
.ad
.RS 16n
.rt
Count of frames successfully retransmitted after more than one
retransmission.
.RE

.sp
.ne 2
.mk
.na
.B rts_success
.ad
.RS 16n
.rt
Count of times a
.B CTS
was received in response to an
.BR RTS .
.RE

.sp
.ne 2
.mk
.na
.B rts_failure
.ad
.RS 16n
.rt
 Count of times a
.B CTS
was not received in response to an
.BR RTS .
.RE

.sp
.ne 2
.mk
.na
.B ack_failure
.ad
.RS 16n
.rt
Count of times an
.B ACK
was expected but was not received.
.RE

.sp
.ne 2
.mk
.na
.B fcs_errors
.ad
.RS 16n
.rt
Count of frames received with
.B FCS
errors.
.RE

.sp
.ne 2
.mk
.na
.B wep_errors
.ad
.RS 16n
.rt
Count of frames received with the
.B WEP
bit set but that either should
not have been encrypted or that were discarded due to
.B WEP
not being
supported.
.RE

.SH SEE ALSO
.sp
.LP
.BR kstat (1M)
