usr/src/man/man5/Intro.5
'\" te
.\" Copyright 1989 AT&T
.\" Copyright (C) 2008, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH Intro 5 "17 Nov 2008" "SunOS 5.11" "Standards, Environments, and Macros"
.SH NAME
Intro, intro \- introduction to miscellany
.SH DESCRIPTION
.sp
.LP
Among the topics presented in this section are:
.sp
.ne 2
.mk
.na
.B Standards
.ad
.RS 16n
.rt
The POSIX (IEEE) Standards and the X/Open Specifications are described on
the
.B standards
page.
.RE

.sp
.ne 2
.mk
.na
.B Environments
.ad
.RS 16n
.rt
The user environment
.RB ( environ ),
the subset of the user environment
that depends on language and cultural conventions
.RB ( locale ),
the large
file compilation environment (\fBlfcompile\fR), and the transitional
compilation environment (\fBlfcompile64\fR) are described.
.RE

.sp
.ne 2
.mk
.na
.B Macros
.ad
.RS 16n
.rt
The macros to format Reference Manual pages (\fBman\fR and
.BR mansun )
as
well as other text format macros (\fBme\fR,
.BR mm ,
and
.BR ms )
are
described.
.RE

.sp
.ne 2
.mk
.na
.B Characters
.ad
.RS 16n
.rt
Tables of character sets (\fBascii\fR,
.BR charmap ,
.BR eqnchar ,
and
.BR iconv ),
file format notation (\fBformats\fR), file name pattern
matching (\fBfnmatch\fR), and regular expressions (\fBregex\fR and
.BR regexp )
are presented.
.RE

.SH ACKNOWLEDGMENTS
.sp
.LP
Sun Microsystems, Inc. gratefully acknowledges The Open Group for
permission to reproduce portions of its copyrighted documentation. Original
documentation from The Open Group can be obtained online at
http://www.opengroup.org/bookstore/\&.
.sp
.LP
The Institute of Electrical and Electronics Engineers and The Open Group,
have given us permission to reprint portions of their documentation.
.sp
.LP
In the following statement, the phrase ``this text'' refers to portions of
the system documentation.
.sp
.LP
Portions of this text are reprinted and reproduced in electronic form in
the SunOS Reference Manual, from IEEE Std 1003.1, 2004 Edition, Standard for
Information Technology -- Portable Operating System Interface (POSIX), The
Open Group Base Specifications Issue 6, Copyright (C) 2001-2004 by the
Institute of Electrical and Electronics Engineers, Inc and The Open Group.
In the event of any discrepancy between these versions and the original IEEE
and The Open Group Standard, the original IEEE and The Open Group Standard
is the referee document.  The original Standard can be obtained online at
http://www.opengroup.org/unix/online.html\&.
.sp
.LP
This notice shall appear on any product containing this material.
