usr/src/man/man5/kerberos.5
'\" te
.\" Copyright (c) 2008, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH kerberos 5 "1 Oct 2008" "SunOS 5.11" "Standards, Environments, and Macros"
.SH NAME
kerberos \- overview of Solaris Kerberos implementation
.SH DESCRIPTION
.sp
.LP
The Solaris Kerberos implementation, hereafter sometimes shortened to
"Kerberos," authenticates clients in a network environment, allowing for
secure transactions. (A client may be a user or a network service.) Kerberos
validates the identity of a client and the authenticity of transferred data.
Kerberos is a
.I single-sign-on
system, meaning that a user needs to
provide a password only at the beginning of a session. The Solaris Kerberos
implementation is based on the Kerberos(TM) system developed at
.BR MIT ,
and is compatible with Kerberos V5 systems over heterogeneous networks.
.sp
.LP
Kerberos works by granting clients
.IR tickets ,
which uniquely identify a
client, and which have a finite lifetime. A client possessing a ticket is
automatically validated for network services for which it is entitled; for
example, a user with a valid Kerberos ticket may rlogin into another machine
running Kerberos without having to identify itself. Because each client has a
unique ticket, its identity is guaranteed.
.sp
.LP
To obtain tickets, a client must first initialize the Kerberos session,
either by using the
.BR kinit (1)
command or a
.B PAM
module. (See
.BR pam_krb5 (5)).
.B kinit
prompts for a password, and then communicates
with a
.IR "Key Distribution Center"
.RB ( KDC ).
The
.B KDC
returns a
.I Ticket-Granting Ticket
(\fBTGT\fR) and prompts for a confirmation
password. If the client confirms the password, it can use the Ticket-Granting
Ticket to obtain tickets for specific network services. Because tickets are
granted transparently, the user need not worry about their management.
Current tickets may be viewed by using the
.BR klist (1)
command.
.sp
.LP
Tickets are valid according to the system
.I policy
set up at
installation time. For example, tickets have a default lifetime for which
they are valid. A policy may further dictate that privileged tickets, such as
those belonging to root, have very short lifetimes. Policies may allow some
defaults to be overruled; for example, a client may request a ticket with a
lifetime greater or less than the default.
.sp
.LP
Tickets can be renewed using
.BR kinit .
Tickets are also
.IR forwardable ,
allowing you to use a ticket granted on one machine on a
different host. Tickets can be destroyed by using
.BR kdestroy (1).
It is a
good idea to include a call to
.B kdestroy
in your \fB\&.logout\fR file.
.sp
.LP
Under Kerberos, a client is referred to as a
.IR principal .
A principal
takes the following form:
.sp
.in +2
.nf
primary/instance@REALM
.fi
.in -2
.sp

.sp
.ne 2
.mk
.na
.B primary
.ad
.RS 12n
.rt
A user, a host, or a service.
.RE

.sp
.ne 2
.mk
.na
.B instance
.ad
.RS 12n
.rt
A qualification of the primary. If the primary is a host \(em indicated by
the keyword \fBhost\fR\(em then the instance is the fully-qualified domain
name of that host. If the primary is a user or service, then the instance is
optional. Some instances, such as
.B admin
or
.BR root ,
are
privileged.
.RE

.sp
.ne 2
.mk
.na
.B realm
.ad
.RS 12n
.rt
The Kerberos equivalent of a domain; in fact, in most cases the realm is
directly mapped to a
.B DNS
domain name. Kerberos realms are given in
upper-case only. For examples of principal names, see the EXAMPLES.
.RE

.sp
.LP
By taking advantage of the General Security Services
.BR API
(\fBGSS-API\fR), Kerberos offers, besides user authentication, two other
types of security service:
.IR integrity ,
which authenticates the validity
of transmitted data, and
.IR privacy ,
which encrypts transmitted data.
Developers can take advantage of the
.B GSS-API
through the use of the
RPCSEC_GSS
.B API
interface (see
.BR rpcsec_gss (3NSL)).
.SH EXAMPLES
.LP
.B Example 1
Examples of valid principal names
.sp
.LP
The following are examples of valid principal names:

.sp
.in +2
.nf
	joe
	joe/admin
	joe@ENG.ACME.COM
	joe/admin@ENG.ACME.COM
	rlogin/bigmachine.eng.acme.com@ENG.ACME.COM
	host/bigmachine.eng.acme.com@ENG.ACME.COM
.fi
.in -2
.sp

.sp
.LP
The first four cases are
.IR "user principals" .
In the first two cases, it
is assumed that the user
.B joe
is in the same realm as the client, so no
realm is specified. Note that \fBjoe\fRand \fBjoe/admin\fR are different
principals, even if the same user uses them;
.B joe/admin
has different
privileges from
.BR joe .
The fifth case is a
.IR "service principal" ,
while
the final case is a
.IR "host principal" .
The word
.B host
is required for
host principals. With host principals, the instance is the fully qualified
hostname. Note that the words
.B admin
and
.B host
are reserved
keywords.

.SH SEE ALSO
.sp
.LP
.BR kdestroy (1),
.BR kinit (1),
.BR klist (1),
.BR kpasswd (1),
.BR krb5.conf (4),
.BR krb5envvar (5)
.sp
.LP
.I System Administration Guide: Security Services
.SH NOTES
.sp
.LP
In previous releases of the Solaris operating system, the Solaris Kerberos
implementation was referred to as the "Sun Enterprise Authentication
Mechanism" (SEAM).
.sp
.LP
If you enter your username and
.B kinit
responds with this message:
.sp
.in +2
.nf
Principal unknown (kerberos)
.fi
.in -2
.sp

.sp
.LP
you have not been registered as a Kerberos user. See your system
administrator or the
.IR "System Administration Guide: Security Services" .
