usr/src/man/man5/krb5_auth_rules.5
'\" te
.\" Copyright (c) 2006, Sun Microsystems, Inc. All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH krb5_auth_rules 5 "07 Apr 2006" "SunOS 5.11" "Standards, Environments, and Macros"
.SH NAME
krb5_auth_rules \- overview of Kerberos V5 authorization
.SH DESCRIPTION
.sp
.LP
When kerberized versions of the \fBftp\fR,
.BR rdist ,
.BR rcp ,
.BR rlogin ,
.BR rsh ,
.BR telnet ,
or
.B ssh
clients are used to
connect to a server, the identity of the originating user must be
authenticated to the Kerberos V5 authentication system. Account access can
then be authorized if appropriate entries exist in the
.BR ~/.k5login
file, the
.B gsscred
table, or if the default GSS/Kerberos authentication
rules successfully map the Kerberos principal name to Unix login name.
.sp
.LP
To avoid security problems, the
.B ~/.k5login
file must be owned by the
remote user on the server the client is attempting to access. The file
should contain a private authorization list comprised of Kerberos principal
names of the form \fIprincipal/instance\fR@\fIrealm\fR. The \fI/instance\fR
variable is optional in Kerberos principal names. For example, different
principal names such as
.B jdb@ENG.ACME.COM
and
\fBjdb/happy.eng.acme.com@ENG.ACME.COM\fR would each be legal, though not
equivalent, Kerberos principals. The client is granted access if the
\fB~/.k5login\fR file is located in the login directory of the remote user
account and if the originating user can be authenticated to one of the
principals named in the file. See \fBgkadmin\fR(1M) and \fBkadm5.acl\fR(4)
for more information on Kerberos principal names.
.sp
.LP
When no
.B ~/.k5login
file is found in the remote user's login account,
the Kerberos V5 principal name associated with the originating user is
checked against the
.B gsscred
table. If a
.B gsscred
table exists and
the principal name is matched in the table, access is granted if the Unix
user ID listed in the table corresponds to the user account the client is
attempting to access. If the Unix user ID does not match, access is denied.
See
.BR gsscred (1M).
.sp
.LP
For example, an originating user listed in the
.B gsscred
table with the
principal name
.B jdb@ENG.ACME.COM
and the
.B "uid 23154"
is
granted access to the
.B jdb-user
account if
.B 23154
is also the
\fBuid\fR of \fBjdb-user\fR listed in the user account database. See
.BR passwd (4).
.sp
.LP
Finally, if there is no
.B ~/.k5login
file and the Kerberos V5 identity
of the originating user is not in the
.B gsscred
table, or if the
\fBgsscred\fR table does not exist, the client is granted access to the
account under the following conditions (default GSS/Kerberos auth rules):
.RS +4
.TP
.ie t \(bu
.el o
The user part of the authenticated principal name is the same as the Unix
account name specified by the client.
.RE
.RS +4
.TP
.ie t \(bu
.el o
The realm part of the client and server are the same, unless the
\fBkrb5.conf\fR(4) \fIauth_to_local_realm\fR parameter is used to create
equivalence.
.RE
.RS +4
.TP
.ie t \(bu
.el o
The Unix account name exists on the server.
.RE
.sp
.LP
For example, if the originating user has the principal name
\fBjdb@ENG.ACME.COM\fR and if the server is in realm \fBSALES.ACME.COM\fR,
the client would be denied access even if
.B jdb
is a valid account name
on the server. This is because the realms
.B SALES.ACME.COM
and
\fBENG.ACME.COM\fR differ.
.sp
.LP
The
.BR krb5.conf (4)
\fIauth_to_local_realm\fR parameter also affects
authorization. Non-default realms can be equated with the default realm for
authenticated
.B "name-to-local name"
mapping.
.SH FILES
.sp
.ne 2
.mk
.na
.B ~/.k5login
.ad
.RS 15n
.rt
Per user-account authorization file.
.RE

.sp
.ne 2
.mk
.na
.B /etc/passwd
.ad
.RS 15n
.rt
System account file. This information may also be in a directory service.
See
.BR passwd (4).
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for a description of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
\fBATTRIBUTE TYPE\fR\fBATTRIBUTE VALUE\fR
_
Interface StabilityEvolving
.TE

.SH SEE ALSO
.sp
.LP
\fBftp\fR(1),
.BR rcp (1),
.BR rdist (1),
.BR rlogin (1),
.BR rsh (1),
.BR telnet (1),
.BR gkadmin (1M),
.BR gsscred (1M),
.BR kadm5.acl (4),
\fBkrb5.conf\fR(4),
.BR passwd (4),
.BR attributes (5),
.BR gss_auth_rules (5)
