usr/src/man/man5/largefile.5
'\" te
.\" Copyright (c) 2007 Sun Microsystems, Inc. All Rights Reserved
.\" Portions Copyright (c) 1982-2007 AT&T Knowledge Ventures
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH largefile 5 "2 Nov 2007" "SunOS 5.11" "Standards, Environments, and Macros"
.SH NAME
largefile \- large file status of utilities
.SH DESCRIPTION
.sp
.LP
A \fIlarge file\fR is a regular file whose size is greater than or equal to
2 Gbyte ( 2^31 bytes). A \fIsmall file\fR is a regular file whose size is
less than 2 Gbyte.
.SS "Large file aware utilities"
.sp
.LP
A utility is called \fIlarge file aware\fR if it can process large files in
the same manner as it does small files. A utility that is large file aware
is able to handle large files as input and generate as output large files
that are being processed. The exception is where additional files  are used
as system configuration files or support files that can augment the
processing. For example, the \fBfile\fR utility supports the
.B -m
option
for an alternative "magic" file and the \fB-f\fR option for a support file
that can contain a list of file names. It is unspecified whether a utility
that is large file aware will accept configuration or support files that are
large files. If a large file aware utility does not accept configuration or
support files that are large files, it will cause no data loss or corruption
upon encountering such files and will return an appropriate error.
.sp
.LP
The following
.B /usr/bin
utilities are large file aware:
.sp

.sp
.TS
tab();
lw(1.1i) lw(1.1i) lw(1.1i) lw(1.1i) lw(1.11i)
lw(1.1i) lw(1.1i) lw(1.1i) lw(1.1i) lw(1.11i)
.
\fBadb\fR\fBaliasadm\fR\fBawk\fR\fBbdiff\fR\fBcat\fR
\fBchgrp\fR\fBchmod\fR\fBchown\fR\fBcksum\fR\fBcmp\fR
\fBcompress\fR\fBcp\fR\fBcsh\fR\fBcsplit\fR\fBcut\fR
\fBdd\fR\fBdircmp\fR\fBdu\fR\fBegrep\fR\fBfgrep\fR
\fBfile\fR\fBfind\fR\fBftp\fR\fBgetconf\fR\fBgrep\fR
\fBgzip\fR\fBhead\fR\fBjoin\fR\fBjsh\fR\fBksh\fR
\fBksh93\fR\fBln\fR\fBls\fR\fBmailcompat\fR\fBmailstats\fR
\fBmdb\fR\fBmkdir\fR\fBmkfifo\fR\fBmore\fR\fBmv\fR
\fBnawk\fR\fBpage\fR\fBpaste\fR\fBpathchck\fR\fBpg\fR
\fBpraliases\fR\fBrcp\fR\fBremsh\fR\fBrksh\fR\fBrksh93\fR
\fBrm\fR\fBrmdir\fR\fBrsh\fR\fBsed\fR\fBsh\fR
\fBsort\fR\fBsplit\fR\fBsum\fR\fBtail\fR\fBtar\fR
\fBtee\fR\fBtest\fR\fBtouch\fR\fBtr\fR\fBuncompress\fR
\fBuudcode\fR\fBuuencode\fR\fBvacation\fR\fBwc\fR\fBzcat\fR
.TE

.sp
.LP
The following
.B /usr/xpg4/bin
utilities are large file aware:
.sp

.sp
.TS
tab();
lw(1.1i) lw(1.1i) lw(1.1i) lw(1.1i) lw(1.11i)
lw(1.1i) lw(1.1i) lw(1.1i) lw(1.1i) lw(1.11i)
.
\fBawk\fR\fBcp\fR\fBchgrp\fR\fBchown\fR\fBdu\fR
\fBegrep\fR\fBfgrep\fR\fBfile\fR\fBgrep\fR\fBln\fR
\fBls\fR\fBmore\fR\fBmv\fR\fBrm\fR\fBsed\fR
\fBsh\fRsorttailtr
.TE

.sp
.LP
The following
.B /usr/xpg6/bin
utilities are large file aware:
.sp

.sp
.TS
tab();
lw(1.1i) lw(1.1i) lw(1.1i) lw(1.1i) lw(1.11i)
.
\fBgetconf\fR\fBls\fR\fBtr\fR
.TE

.sp
.LP
The following
.B /usr/sbin
utilities are large file aware:
.sp

.sp
.TS
tab();
lw(1.1i) lw(1.1i) lw(1.1i) lw(1.1i) lw(1.11i)
lw(1.1i) lw(1.1i) lw(1.1i) lw(1.1i) lw(1.11i)
.
\fBeditmap\fR\fBinstall\fR\fBmakemap\fR\fBmkfile\fR\fBmknod\fR
\fBmvdir\fR\fBswap\fR
.TE

.sp
.LP
The following
.B /usr/lib
utilities are large file aware:
.sp

.sp
.TS
tab();
lw(1.1i) lw(1.1i) lw(1.1i) lw(1.1i) lw(1.11i)
.
\fBmail.local\fR\fBsendmail\fR\fBsmrsh\fR
.TE

.sp
.LP
See the USAGE section of the \fBswap\fR(1M) manual page for limitations of
\fBswap\fR on block devices greater than 2 Gbyte on a 32-bit operating
system.
.sp
.LP
The following
.B /usr/ucb
utilities are large file aware:
.sp

.sp
.TS
tab();
lw(1.1i) lw(1.1i) lw(1.1i) lw(1.1i) lw(1.11i)
lw(1.1i) lw(1.1i) lw(1.1i) lw(1.1i) lw(1.11i)
.
\fBchown\fR\fBfrom\fR\fBln\fR\fBls\fR\fBsed\fR
\fBsum\fR\fBtouch\fR
.TE

.sp
.LP
The
.B /usr/bin/cpio
and
.B /usr/bin/pax
utilities are large file
aware, but cannot archive a file whose size exceeds 8 Gbyte - 1 byte.
.sp
.LP
The
.B /usr/bin/truss
utilities has been modified to read a dump file
and display information relevant to large files, such as offsets.
.SS "cachefs file systems"
.sp
.LP
The following
.B /usr/bin
utilities are large file aware for
\fBcachefs\fR file systems:
.sp

.sp
.TS
tab();
lw(1.38i) lw(1.38i) lw(1.38i) lw(1.38i)
.
\fBcachefspack\fR\fBcachefsstat\fR
.TE

.sp
.LP
The following
.B /usr/sbin
utilities are large file aware for
\fBcachefs\fR file systems:
.sp

.sp
.TS
tab();
lw(1.38i) lw(1.38i) lw(1.38i) lw(1.38i)
lw(1.38i) lw(1.38i) lw(1.38i) lw(1.38i)
.
\fBcachefslog\fR\fBcachefswssize\fR\fBcfsadmin\fR\fBfsck\fR
\fBmount\fR\fBumount\fR
.TE

.SS "nfs file systems"
.sp
.LP
The following utilities are large file aware for \fBnfs\fR file systems:
.sp

.sp
.TS
tab();
lw(2.75i) lw(2.75i)
lw(2.75i) lw(2.75i)
.
\fB/usr/lib/autofs/automountd\fR\fB/usr/sbin/mount\fR
\fB/usr/lib/nfs/rquotad\fR
.TE

.SS "ufs file systems"
.sp
.LP
The following
.B /usr/bin
utility is large file aware for \fBufs\fR file
systems:
.sp
.LP
\fBdf\fR
.sp
.LP
The following \fB/usr/lib/nfs\fR utility is large file aware for \fBufs\fR
file systems:
.sp
.LP
.B rquotad
.sp
.LP
The following
.B /usr/xpg4/bin
utility is large file aware for \fBufs\fR
file systems:
.sp
.LP
\fBdf\fR
.sp
.LP
The following
.B /usr/sbin
utilities are large file aware for \fBufs\fR
file systems:
.sp

.sp
.TS
tab();
lw(1.1i) lw(1.1i) lw(1.1i) lw(1.1i) lw(1.11i)
lw(1.1i) lw(1.1i) lw(1.1i) lw(1.1i) lw(1.11i)
.
\fBclri\fR\fBdcopy\fR\fBedquota\fR\fBff\fR\fBfsck\fR
\fBfsdb\fR\fBfsirand\fR\fBfstyp\fR\fBlabelit\fR\fBlockfs\fR
\fBmkfs\fR\fBmount\fR\fBncheck\fR\fBnewfs\fR\fBquot\fR
\fBquota\fR\fBquotacheck\fR\fBquotaoff\fR\fBquotaon\fR\fBrepquota\fR
\fBtunefs\fR\fBufsdump\fR\fBufsrestore\fR\fBumount\fR
.TE

.SS "Large file safe utilities"
.sp
.LP
A utility is called \fBlarge file safe\fR if it causes no data loss or
corruption when it encounters a large file. A utility that is large file
safe is unable to process properly a large file, but returns an appropriate
error.
.sp
.LP
The following
.B /usr/bin
utilities are large file safe:
.sp

.sp
.TS
tab();
lw(1.36i) lw(1.04i) lw(1.21i) lw(1.11i) lw(.78i)
lw(1.36i) lw(1.04i) lw(1.21i) lw(1.11i) lw(.78i)
.
\fBaudioconvert\fR\fBaudioplay\fR\fBaudiorecord\fR\fBcomm\fR\fBdiff\fR
\fBdiff3\fR\fBdiffmk\fR\fBed\fR\fBlp\fR\fBmail\fR
\fBmailcompat\fR\fBmailstats\fR\fBmailx\fR\fBpack\fR\fBpcat\fR
\fBred\fR\fBrmail\fR\fBsdiff\fR\fBunpack\fR\fBvi\fR
\fBview\fR
.TE

.sp
.LP
The following
.B /usr/xpg4/bin
utilities are large file safe:
.sp

.sp
.TS
tab();
lw(1.1i) lw(1.1i) lw(1.1i) lw(1.1i) lw(1.11i)
.
\fBed\fR\fBvi\fR\fBview\fR
.TE

.sp
.LP
The following
.B /usr/xpg6/bin
utility is large file safe:
.sp

.sp
.TS
tab();
lw(1.1i) lw(1.1i) lw(1.1i) lw(1.1i) lw(1.11i)
.
\fBed\fR
.TE

.sp
.LP
The following
.B /usr/sbin
utilities are large file safe:
.sp

.sp
.TS
tab();
lw(1.1i) lw(1.1i) lw(1.1i) lw(1.1i) lw(1.11i)
.
lpfilter	lpforms
.TE

.sp
.LP
The following
.B /usr/ucb
utilities are large file safe:
.sp

.sp
.TS
tab();
lw(1.1i) lw(1.1i) lw(1.1i) lw(1.1i) lw(1.11i)
.
\fBMail\fR\fBlpr\fR
.TE

.SH SEE ALSO
.sp
.LP
.BR lf64 (5),
.BR lfcompile (5),
.BR lfcompile64 (5)
