usr/src/man/man5/lx.5
'\" te
.\" Copyright (c) 2006, Sun Microsystems, Inc. All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH lx 5 "29 Jul 2009" "SunOS 5.11" "Standards, Environments, and Macros"
.SH NAME
lx \- Linux branded zone
.SH DESCRIPTION
.sp
.LP
The
.B lx
brand uses the branded zones framework described in
.BR brands (5)
to enable Linux binary applications to run unmodified on a
machine with a Solaris Operating System kernel.
.sp
.LP
The
.B lx
brand includes the tools necessary to install a CentOS 3.x or
Red Hat Enterprise Linux 3.x distribution inside a non-global zone. The
brand supports the execution of 32-bit Linux applications on x86/x64
machines running the Solaris system in either 32-bit or 64-bit mode.
.SS "Supported Linux Distributions"
.sp
.LP
The
.B lx
brand emulates the system call interfaces provided by the
Linux 2.4.21 kernel, as modified by Red Hat in the RHEL 3.x distributions.
This kernel provides the system call interfaces consumed by the
.BR glibc
version 2.3.2 released by Red Hat.
.sp
.LP
In addition, the
.B lx
brand partially emulates the Linux
.B /dev
and
\fB/proc\fR interfaces.
.SS "Configuration and Administration"
.sp
.LP
The
.B lx
brand supports the whole root non-global zone model. You
cannot use the
.B inherit-pkg-dir
resource with the
.B lx
brand. All
of the required linux packages are installed into the private file systems
of the zone.
.sp
.LP
The \fBzonecfg\fR(1M) utility is used to configure an
.B lx
branded
zone. Once a branded zone has been installed, that zone's brand cannot be
changed or removed. The
.BR zoneadm (1M)
utility is used to report the
zone's brand type and administer the zone. The
.BR zlogin (1)
utility is
used to log in to the zone.
.SS "Application Support"
.sp
.LP
The
.B lx
zone only supports user-level Linux applications. You cannot
use Linux device drivers, Linux kernel modules, or Linux file systems from
inside an
.B lx
zone.
.sp
.LP
You cannot add any non-standard Solaris devices to a Linux zone. Any
attempt to do so will result in a zone that \fBzonecfg\fR(1M) will refuse to
verify.
.sp
.LP
You cannot run Solaris applications inside an
.B lx
zone. Solaris
debugging tools such as
.B DTrace
(see \fBdtrace\fR(1M)) and \fBmdb\fR
(see
.BR mdb (1))
can be applied to Linux processes executing inside the
zone, but the tools themselves must be running in the global zone. Any core
files generated are produced in the Solaris format, and such files can only
be debugged with Solaris tools.
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for a description of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
\fBATTRIBUTE TYPE\fR\fBATTRIBUTE VALUE\fR
_
AvailabilitySUNWlxr, SUNWlxu
_
Interface StabilityEvolving
.TE

.SH SEE ALSO
.sp
.LP
.BR mdb (1),
.BR zlogin (1),
.BR zonename (1),
.BR dtrace (1M),
.BR zoneadm (1M),
\fBzonecfg\fR(1M),
.BR brands (5),
.BR zones (5),
.BR lx_systrace (7D)
