usr/src/man/man5/mm.5
'\" te
.\" Copyright (c) 1997, Sun Microsystems, Inc.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH mm 5 "1 Jan 1997" "SunOS 5.11" "Standards, Environments, and Macros"
.SH NAME
mm \- text formatting (memorandum) macros
.SH SYNOPSIS
.LP
.nf
\fBnroff\fR  \fB-mm\fR [\fIoptions\fR] \fIfilename\fR...
.fi

.LP
.nf
\fBtroff\fR  \fB-mm\fR [\fIoptions\fR] \fIfilename\fR...
.fi

.SH DESCRIPTION
.sp
.LP
This package of
.BR nroff (1)
and
.BR troff (1)
macro definitions
provides a formatting facility for various styles of articles, theses, and
books. When producing 2-column output on a terminal or lineprinter, or when
reverse line motions are needed, filter the output through
.BR col (1).
All
external
.B -mm
macros are defined below.
.sp
.LP
Note: this
.B -mm
macro package is an extended version written at
Berkeley and is a superset of the standard
.B -mm
macro packages as
supplied by Bell Labs.  Some of the Bell Labs macros have been removed; for
instance, it is assumed that the user has little interest in producing
headers stating that the memo was generated at Whippany Labs.
.sp
.LP
Many \fBnroff\fR and \fBtroff\fR requests are unsafe in conjunction with
this package. However, the first four requests below may be used with
impunity after initialization, and the last two may be used even before
initialization:
.sp
.ne 2
.mk
.na
\fB\&.bp\fR
.ad
.RS 11n
.rt
begin new page
.RE

.sp
.ne 2
.mk
.na
\fB\&.br\fR
.ad
.RS 11n
.rt
break output line
.RE

.sp
.ne 2
.mk
.na
\fB\&.sp\fIn\fR
.ad
.RS 11n
.rt
insert n spacing lines
.RE

.sp
.ne 2
.mk
.na
\fB\&.ce\fIn\fR
.ad
.RS 11n
.rt
center next n lines
.RE

.sp
.ne 2
.mk
.na
\fB\&.ls\fIn\fR
.ad
.RS 11n
.rt
line spacing: \fIn\fB=1\fR single, \fIn\fB=2\fR double space
.RE

.sp
.ne 2
.mk
.na
\fB\&.na\fR
.ad
.RS 11n
.rt
no alignment of right margin
.RE

.sp
.LP
Font and point size changes with \fB\ef\fR and \fB\es\fR are also allowed;
for example, \fB\efIword\efR\fR will italicize
.IR word .
Output of the
.BR tbl (1),
.BR eqn (1)
and
.BR refer (1)
preprocessors for equations,
tables, and references is acceptable as input.
.SH REQUESTS
.sp
.LP
Here is a table of macros.
.sp

.sp
.TS
tab();
cw(1.47i) |cw(1.1i) |cw(.74i) |cw(2.19i)
lw(1.47i) |lw(1.1i) |lw(.74i) |lw(2.19i)
.
Macro NameInitial ValueBreak? Reset?Explanation
_
\fB\&.1C\fRony,yone column format on a new page
_
\fB\&.2C\fR [ \fIl\fR ]-y,ytwo column format \fIl\fR=line length
_
\fB\&.AE\fR-yend abstract
_
\fB\&.AL\fR [ \fIt\fR ] [ \fIi\fR ] [ \fIs\fR ]\fIt\fR=\fB1\fR;\fIi\fR=\fB\&.Li\fR;\fIs\fR=\fB0\fRyT{
Start automatic list type \fIt\fR=[\fB1\fR,\fBA\fR,\fBa\fR,\fBI\fR,\fBi\fR] \fB1\fR=arabic numbers; \fBA\fR=uppercase letters \fBa\fR=lowercase letters; \fBI\fR=uppercase Roman numerals; \fBi\fR=lowercase Roman numerals indentation \fIi\fR; separation \fIs\fR
T}
_
\fB\&.AS\fR \fIm\fR [ \fIn\fR ]\fIn\fR=\fB0\fRybegin abstract
_
\fB\&.AU\fR-yauthor's name
_
\fB\&.AV\fR \fIx\fR-ysignature and date line of verifier \fIx\fR
_
\fB\&.B\fR \fIx\fR-nembolden \fIx\fR; if no \fIx\fR, switch to boldface
_
\fB\&.BE\fR-yend block text
_
\fB\&.BI\fR \fIx\fR \fIy\fR-nembolden \fIx\fR and underline \fIy\fR
_
\fB\&.BL\fR-ybullet list
_
\fB\&.BR\fR \fIx\fR \fIy\fR-nembolden \fIx\fR and use Roman font for \fIy\fR
_
\fB\&.BS\fR-nstart block text
_
\fB\&.CN\fR-ysame as \fB\&.DE\fR (\fBnroff\fR)
_
\fB\&.CS\fR-ycover sheet
_
\fB\&.CW\fR-nsame as \fB\&.DS I\fR (\fBnroff\fR)
_
\fB\&.DE\fR-yend display
_
\fB\&.DF\fR [ \fIp\fR ] [ \fIf\fR ] [ \fIrp\fR ]\fIp\fR=\fBL\fR;\fIf\fR=\fBN\fRyT{
start floating display; position \fIp\fR=[\fBL\fR,\fBC\fR,\fBCB\fR] \fBL\fR=left; \fBI\fR=indent; \fBC\fR=center; \fBCB\fR=center block fill \fIf\fR=[\fBN\fR,\fBY\fR]; right position \fIrp\fR (fill only)
T}
_
\fB\&.DL\fR [ \fIi\fR ] [ \fIs\fR ]-ystart dash list
_
\fB\&.DS\fR [ \fIp\fR ] [ \fIf\fR ] [ \fIrp\fR ]\fIp\fR=\fBL\fR;\fIf\fR=\fBN\fRyT{
begin static display (see \fB\&.DF\fR for argument descriptions)
T}
_
\fB\&.EC\fR \fIx\fR [ \fIn\fR ]\fIn\fR=\fB1\fRyequation title; equation \fIx\fR; number \fIn\fR
_
\fB\&.EF\fR \fIx\fR-nT{
even footer appears at the bottom of even-numbered pages; \fIx\fR="\fIl\fB\&'\fIc\fB\&'\fIr\fR" \fIl\fR=left; \fIc\fR=center; \fIr\fR=right
T}
_
\fB\&.EH\fR \fIx\fR-nT{
even header appears at the top of even-numbered pages; \fIx\fR="\fIl\fB\&'\fIc\fB\&'\fIr\fR" \fIl\fR=left; \fIc\fR=center; \fIr\fR=right
T}
_
\fB\&.EN\fR-yend displayed equation produced by \fBeqn\fR
_
\fB\&.EQ\fR-ybreak out equation produced by \fBeqn\fR
_
\fB\&.EX\fR \fIx\fR [ \fIn\fR ]\fIn\fR=\fB1\fRyexhibit title; exhibit \fIx\fR
_
number \fIn\fR
_
\fB\&.FD\fR [ \fIf\fR ] [ \fIr\fR ]\fIf\fR=\fB10\fR;\fIr\fR=\fB1\fRnT{
set footnote style format \fIf\fR=[\fB0-11\fR]; renumber \fIr\fR=[\fB0\fR,\fB1\fR]
T}
_
\fB\&.FE\fR-yend footnote
_
\fB\&.FG\fR \fIx\fR [ \fIn\fR ]\fIn\fR=\fB1\fRyfigure title; figure \fIx\fR; number \fIn\fR
_
\fB\&.FS\fR-nstart footnote
_
\fB\&.H\fR \fIl\fR [ \fIt\fR ]-yT{
produce numbered heading level \fIl\fR=[\fB1-7\fR]; title \fIt\fR
T}
_
\fB\&.HU\fR \fIt\fR-yproduce unnumbered heading; title \fIt\fR
_
\fB\&.I\fR \fIx\fR-nunderline \fIx\fR
_
\fB\&.IB\fR \fIx\fR \fIy\fR-nunderline \fIx\fR and embolden \fIy\fR
_
\fB\&.IR\fR \fIx\fR \fIy\fR-nunderline \fIx\fR and use Roman font on \fIy\fR
_
\fB\&.LE\fR [ \fIs\fR ]\fIs\fR=\fB0\fRyend list; separation \fIs\fR
_
\fB\&.LI\fR [ \fIm\fR ] [ \fIp\fR ]-ystart new list item; mark \fIm\fR
_
prefix \fIp\fR (mark only)
_
\fB\&.ML\fR \fIm\fR [ \fIi\fR ] [ \fIs\fR ]\fIs\fR=\fB0\fRyT{
start marked list; mark \fIm\fR indentation \fIi\fR; separation \fIs\fR=[\fB0\fR,\fB1\fR]
T}
_
\fB\&.MT\fR \fIx\fRymemo title; title \fIx\fR
_
\fB\&.ND\fR \fIx\fRnT{
no date in page footer; \fIx\fR is date on cover
T}
_
\fB\&.NE\fR-yend block text
_
\fB\&.NS\fR-ystart block text
_
\fB\&.OF\fR \fIx\fR-nT{
odd footer appears at the bottom of odd-numbered pages; \fIx\fR="\fIl\fB\&'\fIc\fB\&'\fIr\fR" \fIl\fR=left; \fIc\fR=center; \fIr\fR=right
T}
_
\fB\&.OF\fR \fIx\fR-nT{
odd header appears at the top of odd-numbered pages; \fIx\fR="\fIl\fB\&'\fIc\fB\&'\fIr\fR" \fIl\fR=left; \fIc\fR=center; \fIr\fR=right
T}
_
\fB\&.OP\fR-yskip to the top of an odd-number page
_
\fB\&.P\fR [ \fIt\fR ]\fIt\fR=\fB0\fRy,yT{
begin paragraph; \fIt\fR=[\fB0\fR,\fB1\fR] \fB0\fR=justified; \fB1\fR=indented
T}
_
\fB\&.PF\fR \fIx\fR-nT{
page footer appears at the bottom of every page; \fIx\fR="\fIl\fB\&'\fIc\fB\&'\fIr\fR" \fIl\fR=left; \fIc\fR=center; \fIr\fR=right
T}
_
\fB\&.PH\fR \fIx\fR-nT{
page header appears at the top of every page; \fIx\fR="\fIl\fB\&'\fIc\fB\&'\fIr\fR" \fIl\fR=left; \fIc\fR=center; \fIr\fR=right
T}
_
\fB\&.R\fRonnreturn to Roman font
_
\fB\&.RB\fR \fIx\fR \fIy\fR-nuse Roman on \fIx\fR and embolden \fIy\fR
_
\fB\&.RI\fR \fIx\fR \fIy\fR-nuse Roman on \fIx\fR and underline \fIy\fR
_
\fB\&.RP\fR \fIx\fR-y,yT{
released paper format ? \fIx\fR=no stops title on first
T}
_
\fB\&.RS\fR5ny,yT{
right shift: start level of relative indentation
T}
_
\fB\&.S\fR \fIm\fR \fIn\fR-nT{
set character point size & vertical space character point size \fIm\fR; vertical space \fIn\fR
T}
_
\fB\&.SA\fR \fIx\fR\fIx\fR=\fB1\fRnjustification; \fIx\fR=[\fB0\fR,\fB1\fR]
_
\fB\&.SK\fR \fIx\fR-yskip \fIx\fR pages
_
\fB\&.SM\fR -nsmaller; decrease point size by 2
_
\fB\&.SP\fR [ \fIx\fR ]-yleave \fIx\fR blank lines
_
\fB\&.TB\fR \fIx\fR [ \fIn\fR ]\fIn\fR=\fB1\fRytable title; table \fIx\fR; number \fIn\fR
_
\fB\&.TC\fR-yT{
print table of contents (put at end of input file)
T}
_
\fB\&.TE\fR-yend of table processed by tbl
_
\fB\&.TH\fR-yend multi-page header of table
_
\fB\&.TL\fR-ntitle in boldface and two points larger
_
\fB\&.TM\fR-nUC Berkeley thesis mode
_
\fB\&.TP\fR \fIi\fRyyT{
\fIi\fR=p.i. Begin indented paragraph, with the tag given on the next text line. Set prevailing indent to \fIi\fR.
T}
_
\fB\&.TS\fR \fIx\fR-y,yT{
begin table; if \fIx\fR=\fBH\fR table has multi-page header
T}
_
\fB\&.TY\fR -ydisplay centered title \fBCONTENTS\fR
_
\fB\&.VL\fR \fIi\fR [ \fIm\fR ] [ \fIs\fR ]\fIm\fR=\fB0\fR;\fIs\fR=\fB0\fRyT{
start variable-item list; indentation \fIi\fR mark-indentation \fIm\fR; separation \fIs\fR
T}
.TE

.SH REGISTERS
.sp
.LP
Formatting distances can be controlled in
.B -mm
by means of built-in
number registers. For example, this sets the line length to 6.5 inches:
.sp
.in +2
.nf
\&.nr  LL  6.5i
.fi
.in -2

.sp
.LP
Here is a table of number registers and their default values:
.sp

.sp
.TS
tab();
cw(1.1i) |cw(2.19i) |cw(1.1i) |cw(1.11i)
lw(1.1i) |lw(2.19i) |lw(1.1i) |lw(1.11i)
.
NameRegister ControlsTakes EffectDefault
_
\fBCl\fRcontents leveltable of contents2
_
\fBDe\fRdisplay ejectdisplay0
_
\fBDf\fRdisplay floatingdisplay5
_
\fBDs\fRdisplay spacingdisplay1v
_
\fBHb\fRheading breakheading2
_
\fBHc\fRheading centeringheading0
_
\fBHi\fRheading indentheading1
_
\fBHi\fRheading spacingheading1
_
\fBHu\fRheading unnumberedheading2
_
\fBLi\fRlist indentationlist\fB6 (\fBnroff\fB) 5 (\fBtroff\fB)\fR
_
\fBLs\fRlist spacinglist6
_
\fBPi\fRparagraph indentparagraph5
_
\fBPt\fRparagraph typeparagraph1
_
\fBSi\fRstatic indentdisplay\fB5 (\fBnroff\fB) 3 (\fBtroff\fB)\fR
.TE

.sp
.LP
When resetting these values, make sure to specify the appropriate units.
Setting the line length to 7, for example, will result in output with one
character per line. Setting
.B Pi
to 0 suppresses paragraph indentation
.sp
.LP
Here is a list of string registers available in
.BR -mm ;
they may be used
anywhere in the text:
.sp

.sp
.TS
tab();
cw(1.82i) |cw(3.68i)
lw(1.82i) |lw(3.68i)
.
NameString's Function
_
\fB\e*Q\fRquote (\fB"\fR in \fBnroff,\fR\| \fB``\fR in \fBtroff\fR )
_
\fB\e*U\fR unquote (\fB"\fR in \fBnroff,\fR\| \fB\&''\fR in \fBtroff\fR )
_
\fB\e*-\fRdash (\fB--\fR in \fBnroff,\fR \(em in \fBtroff\fR )
_
\fB\e*(MO\fRmonth (month of the year)
_
\fB\e*(DY\fRday (current date)
_
\fB\e**\fRautomatically numbered footnote
_
\fB\e*'\fRacute accent (before letter)
_
\fB\e*`\fRgrave accent (before letter)
_
\fB\e*^\fRcircumflex (before letter)
_
\fB\e*,\fRcedilla (before letter)
_
\fB\e*:\fRumlaut (before letter)
_
\fB\e*~\fRtilde (before letter)
_
\fB\e(BU\fRbullet item
_
\fB\e(DT\fRdate (\fImonth day\fR, \fIyr\fR)
_
\fB\e(EM\fRem dash
_
\fB\e(Lf\fR\fBLIST OF FIGURES\fR title
_
\fB\e(Lt\fR\fBLIST OF TABLES\fR title
_
\fB\e(Lx\fR\fBLIST OF EXHIBITS\fR title
_
\fB\e(Le\fR\fBLIST OF EQUATIONS\fR title
_
\fB\e(Rp\fR\fBREFERENCES\fR title
_
\fB\e(Tm\fRtrademark character (TM)
.TE

.sp
.LP
When using the extended accent mark definitions available with
.BR \&.AM ,
these strings should come after, rather than before, the letter to be
accented.
.SH FILES
.sp
.ne 2
.mk
.na
.B /usr/share/lib/tmac/m
.ad
.sp .6
.RS 4n

.RE

.sp
.ne 2
.mk
.na
.B /usr/share/lib/tmac/mm.[nt]
.ad
.sp .6
.RS 4n
.B nroff
and
.B troff
definitions of
.BR mm .
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWdoc
.TE

.SH SEE ALSO
.sp
.LP
.BR col (1),
.BR eqn (1),
.BR nroff (1),
.BR refer (1),
.BR tbl (1),
.BR troff (1),
.BR attributes (5)
.SH BUGS
.sp
.LP
Floating keeps and regular keeps are diverted to the same space, so they
cannot be mixed together with predictable results.
