usr/src/man/man5/mms.5
'\" te
.\" Copyright (c) 2008, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH mms 5 "11 Nov 2008" "SunOS 5.11" "Standards, Environments, and Macros"
.SH NAME
mms \- MMS service overview
.SH DESCRIPTION
.sp
.LP
MMS is a distributed removable media management system. It is based on the
standard,
.IR "IEEE 1244, Media Management System (MMS)" .
.sp
.LP
The current implementation of MMS manages tapes and cartridges in a Sun
StorageTek ACSLS tape library and emulated tapes on a file system. MMS is
capable of sharing drives among multiple hosts. An important feature of MMS
is that it provides a uniform and consistent tape interface to its client
applications.
.sp
.LP
MMS consists of a media manager (MM) which manages the entire MMS system.
Information about the system is maintained by MM in a database.
.sp
.LP
Every library managed by MMS has an active library manager (LM). An LM
provides library access and mounting service to MMS.
.sp
.LP
A drive managed by MMS has a drive manager (DM) on each host that has
access to the drive. A DM provides device specific operations. A DM also
provides label processing. The current implementation supports only ANSI
labels.
.sp
.LP
MMS client applications request MM to mount and unmount cartridges and
process them after they are mounted. Applications use the Media Management
Protocol (MMP) to make requests. A library of client application functions
is available.
.sp
.LP
The Solaris implementation of the MMS uses the
.BR mmsinit "(1M) command to"
configure and start the MMS service and the
.BR mmsadm "(1M) command to list"
and set parameters required by the service.
.sp
.LP
The MMS service instances, as reported by
.BR svcs (1),
are:
.sp
.ne 2
.mk
.na
.B mms:wcr
.ad
.sp .6
.RS 4n
watcher
.RE

.sp
.ne 2
.mk
.na
.B mms:db
.ad
.sp .6
.RS 4n
Media Manager PostgreSQL database
.RE

.sp
.ne 2
.mk
.na
.B mms:mm
.ad
.sp .6
.RS 4n
Media Manager
.RE

.sp
.LP
The MMS service RBAC (see
.BR rbac (5))
authorizations are:
.RS +4
.TP
.ie t \(bu
.el o
.B solaris.smf.manage.mms
.RE
.RS +4
.TP
.ie t \(bu
.el o
.B solaris.smf.value.mms
.RE
.sp
.LP
The following are the MMS service configuration data accessible through the
service management facility (see
.BR smf (5)):
.sp
.ne 2
.mk
.na
.B config/type
.ad
.sp .6
.RS 4n
Host is media manager or watcher only. Valid values are
.B server
or
.BR client .
.RE

.sp
.ne 2
.mk
.na
.B manager/host
.ad
.sp .6
.RS 4n
Host name where the media manager is running.
.RE

.sp
.ne 2
.mk
.na
.B manager/port
.ad
.sp .6
.RS 4n
Port the media manager is using.
.RE

.sp
.ne 2
.mk
.na
.B ssl/enabled
.ad
.sp .6
.RS 4n
Media Manager is using SSL. Valid values are
.B true
or
.BR false .
Note the Media Manager needs an SSL RSA certificate and Diffie-Hellman
parameters must be 'true'.
.RE

.sp
.ne 2
.mk
.na
.B ssl/verify
.ad
.sp .6
.RS 4n
Media Manager-only value, determines whether two-way authentication is
enabled, which requires all Media Manager clients to have SSL RSA
certificate. Valid values are are
.B true
for two-way authentication and
.B false
for one-way authentication.
.RE

.sp
.ne 2
.mk
.na
.B ssl/cert_file
.ad
.sp .6
.RS 4n
Name of file that contains the SSL RSA certificate, private key, and RSA
certificate chain.
.RE

.sp
.ne 2
.mk
.na
.B ssl/pass_file
.ad
.sp .6
.RS 4n
Name of file for the private key password phrase if the RSA certificate is
encrypted.
.RE

.sp
.ne 2
.mk
.na
.B ssl/dh_file
.ad
.sp .6
.RS 4n
Media Manager-only value, name of file that stores the Diffie-Hellman
parameters.
.RE

.sp
.ne 2
.mk
.na
.B ssl/crl_file
.ad
.sp .6
.RS 4n
Name of optional CRL file.
.RE

.sp
.ne 2
.mk
.na
.B ssl/cipher
.ad
.sp .6
.RS 4n
Optional cipher change from
.BR EDH-RSA-DES-CBC3-SHA .
.RE

.sp
.ne 2
.mk
.na
.B ssl/peer_file
.ad
.sp .6
.RS 4n
Optional client only, name of file that stores the media manager
certificate. The certificate is checked against the certificate returned by
.B SSL_get_peer_certificate()
function.
.RE

.sp
.LP
The following are the MMS Database fault management resource identifier
(FMRI) configuration data:
.sp
.ne 2
.mk
.na
.B postgresql/bin
.ad
.sp .6
.RS 4n
Directory where the PostgreSQL binaries are located. The directory is
specific to the version of PostgreSQL qualified for use by the MMS
software.
.RE

.sp
.ne 2
.mk
.na
.B postgresql/data
.ad
.sp .6
.RS 4n
Directory where the PostgreSQL database is located. The default location is
a version-specific subdirectory of
.BR /var/mms/db .
.RE

.sp
.LP
The following are the MMS Media Manager FMRI configuration data:
.sp
.ne 2
.mk
.na
.B db/host
.ad
.sp .6
.RS 4n
For future use. Set to
.BR localhost .
.RE

.sp
.ne 2
.mk
.na
.B db/port
.ad
.sp .6
.RS 4n
Port number to use for PostgreSQL login. The default value is
.BR 7656 .
.RE

.sp
.ne 2
.mk
.na
.B db/user
.ad
.sp .6
.RS 4n
PostgreSQL user name. The default user name is
.BR postgres .
.RE

.sp
.ne 2
.mk
.na
.B db/name
.ad
.sp .6
.RS 4n
Name of PostgreSQL database to which to connect. The default value is
.BR mms .
.RE

.sp
.ne 2
.mk
.na
.B option/trace
.ad
.sp .6
.RS 4n
Optional. The Media Manager trace level before connecting to the PostgreSQL
database.
.RE

.sp
.ne 2
.mk
.na
.B option/db_reconnect_max_retry
.ad
.sp .6
.RS 4n
Number of times to wait for the database to accept a Media Manager
connection.
.RE

.sp
.ne 2
.mk
.na
.B option/db_reconnect_timeout
.ad
.sp .6
.RS 4n
Number of seconds to wait  between reconnect tries.
.RE

.sp
.LP
The following are the MMS Watcher FMRI configuration data:
.sp
.ne 2
.mk
.na
.B option/ssi_path
.ad
.sp .6
.RS 4n
Path to ACSLS SSI daemon.
.RE

.sp
.ne 2
.mk
.na
.B option/libapi_path
.ad
.sp .6
.RS 4n
Path to ACSLS API library.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
.BR svcs (1),
.BR mmsadm (1M),
.BR mmsclient (1M),
.BR mmsexplorer (1M),
.BR mmsinit (1M),
.BR mmsclient_script (4),
.BR attributes (5),
.BR rbac (5),
.BR smf (5)
