usr/src/man/man5/native.5
'\" te
.\" Copyright (c) 2009, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH native 5 "13 Feb 2009" "SunOS 5.11" "Standards, Environments, and Macros"
.SH NAME
native \- native branded zone
.SH DESCRIPTION
.sp
.LP
The native brand uses the branded zones framework described in
.BR brands (5)
to run zones installed with the same software as is
installed in the global zone. The system software must always be in sync
with the global zone when using a native brand.
.SH SUB-COMMANDS
.sp
.LP
The following native brand-specific subcommand options are supported in
.BR zoneadm (1M).
.sp
.ne 2
.mk
.na
\fBattach\fR [\fB-u\fR] [\fB-b\fR \fIpatchid\fR].\|.\|.\fR
.ad
.sp .6
.RS 4n
For native zones,
.B zoneadm
checks package and patch levels on the
machine to which the zone is to be attached. If the packages/patches that
the zone depends on from the global zone are different (have different
revision numbers) from the dependent packages/patches on the source machine,
.B zoneadm
reports these conflicts and does not perform the attach. If
the destination system has only newer dependent packages/patches (higher
.RB "revision numbers) than those on the source system, you can use the" " -u"
option to update the attached zone to match the
.B -revision
packages and
patches that exist on the new system. With
.BR -u ,
as in the default
behavior,
.B zoneadm
does not perform an attach if outdated
packages/patches are found on the target system.
.sp
For native zones, one or more
.B -b
options can be used to specify a
patch ID for a patch installed in the zone. These patches will be backed out
before the zone is attached or, if
.B -u
was also specified, updated.
.RE

.sp
.ne 2
.mk
.na
.B install
[\fB-a\fR \fIarchive\fR] | [\fB-d\fR \fIpath\fR]
[\fB-p\fR] [\fB-s\fR] [\fB-u\fR] [\fB-v\fR] [\fB-b\fR \fIpatchid\fR].\|.\|.\fR
.ad
.sp .6
.RS 4n
The native brand installer supports installing the zone from either the
software already installed on the system or from an image of an installed
system running the same release.  This can be a full flash archive (see
\fBflash_archive\fR(4)) or a \fBcpio\fR(1) or \fBpax\fR(1) "xustar" archive.
The
.B cpio
archive be compressed with
.B gzip
or
.BR bzip2 .
The
image can also be a level
.BR "0 ufsdump" (1M),
a path to the top-level
of a system's root tree, or a pre-existing zone path.
.sp
With no options the zone is installed using same software as is running the
global zone.
.sp
To install the zone from a system image either the
.B -a
or
.B -d
is
required. Either the
.B -u
or
.B -p
option is also required in this
case.
.sp
.ne 2
.mk
.na
.B -a
.I archive
.ad
.sp .6
.RS 4n
The path to a
.BR flash_archive (4),
.BR cpio (1),
or
.BR pax (1)
"xustar" archive, or a level\fB0 ufsdump\fR(1M), of an installed
system.
.B cpio
archives may be compressed using
.B gzip
or
.BR bzip2 .
.RE

.sp
.ne 2
.mk
.na
.B -b
.I patchid
.ad
.sp .6
.RS 4n
One or more
.B -b
options can be used to specify a patch ID for a patch
installed in the system image. These patches will be backed out during the
installation process.
.RE

.sp
.ne 2
.mk
.na
.B -d
.I path
.ad
.sp .6
.RS 4n
The path to the root directory of an installed system. If path is a hyphen
(\fB-\fR), the
.I zonepath
is presumed to be already populated with the
system image.
.RE

.sp
.ne 2
.mk
.na
.B -p
.ad
.sp .6
.RS 4n
Preserve the system configuration after installing the zone.
.RE

.sp
.ne 2
.mk
.na
.B -s
.ad
.sp .6
.RS 4n
Install silently.
.RE

.sp
.ne 2
.mk
.na
.B -u
.ad
.sp .6
.RS 4n
Run
.BR sys-unconfig (1M)
on the zone after installing it.
.RE

.sp
.ne 2
.mk
.na
.B -v
.ad
.sp .6
.RS 4n
Verbose output from the install process.
.RE

.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for a description of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
\fBATTRIBUTE TYPE\fR\fBATTRIBUTE VALUE\fR
_
AvailabilitySUNWzoneu
_
Interface StabilityUncommitted
.TE

.SH SEE ALSO
.sp
.LP
.BR cpio (1),
.BR pax (1),
.BR zlogin (1),
.BR zonename (1),
.BR sys-unconfig (1M),
.BR ufsdump (1M),
.BR zoneadm (1M),
.BR zonecfg (1M),
.BR flash_archive (4),
.BR attributes (5),
.BR brands (5),
.BR privileges (5),
.BR zones (5),
.BR lx_systrace (7D)
