usr/src/man/man5/nfssec.5
'\" te
.\" Copyright (c) 2001, Sun Microsystems, Inc. All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH nfssec 5 "16 Mar 2009" "SunOS 5.11" "Standards, Environments, and Macros"
.SH NAME
nfssec \- overview of NFS security modes
.SH DESCRIPTION
.sp
.LP
The \fBmount_nfs\fR(1M) and \fBshare_nfs\fR(1M) commands each provide a way
to specify the security mode to be used on an
.B NFS
file system through
the \fBsec=\fImode\fR option. \fImode\fR can be \fBsys\fR, \fBdh\fR,
.BR krb5 ,
.BR krb5i ,
.BR krb5p ,
or
.BR none .
These security modes
can also be added to the automount maps. Note that \fBmount_nfs\fR(1M) and
.BR automount (1M)
do not support
.B sec=none
at this time.
\fBmount_nfs\fR(1M) allows you to specify a single security mode;
\fBshare_nfs\fR(1M) allows you to specify multiple modes (or \fBnone\fR).
With multiple modes, an NFS client can choose any of the modes in the
list.
.sp
.LP
The \fBsec=\fImode\fR option on the \fBshare_nfs\fR(1M) command line
establishes the security mode of
.B NFS
servers. If the \fBNFS\fR
connection uses the
.B NFS
Version 3 protocol, the
.B NFS
clients must
query the server for the appropriate
.I mode
to use. If the \fBNFS\fR
connection uses the
.B NFS
Version 2 protocol, then the
.B NFS
client
uses the default security mode, which is currently
.BR sys .
.B NFS
clients may force the use of a specific security mode by specifying the
\fBsec=\fImode\fR option on the command line. However, if the file system
on the server is not shared with that security mode, the client may be
denied access.
.sp
.LP
If the
.B NFS
client wants to authenticate the
.B NFS
server using a
particular (stronger) security mode, the client wants to specify the
security mode to be used, even if the connection uses the
.B NFS
Version
3 protocol. This guarantees that an attacker masquerading as the server does
not compromise the client.
.sp
.LP
The
.B NFS
security modes are described below. Of these, the
.BR krb5 ,
.BR krb5i ,
\fBkrb5p\fR modes use the Kerberos V5 protocol for
authenticating and protecting the shared filesystems. Before these can be
used, the system must be configured to be part of a Kerberos realm. See
.BR kerberos (5).
.sp
.ne 2
.mk
.na
.B sys
.ad
.RS 9n
.rt
Use
.B AUTH_SYS
authentication. The user's UNIX user-id and group-ids
.RB "are passed in the clear on the network, unauthenticated by the" " NFS"
server. This is the simplest security method and requires no additional
administration. It is the default used by Solaris
.B NFS
Version 2
clients and Solaris
.B NFS
servers.
.RE

.sp
.ne 2
.mk
.na
.B dh
.ad
.RS 9n
.rt
Use a Diffie-Hellman public key system (\fBAUTH_DES\fR, which is referred
to as
.B AUTH_DH
in the forthcoming Internet
.BR RFC).
.RE

.sp
.ne 2
.mk
.na
.B krb5
.ad
.RS 9n
.rt
Use Kerberos V5 protocol to authenticate users before granting access to
the shared filesystem.
.RE

.sp
.ne 2
.mk
.na
.B krb5i
.ad
.RS 9n
.rt
Use Kerberos V5 authentication with integrity checking (checksums) to
verify that the data has not been tampered with.
.RE

.sp
.ne 2
.mk
.na
.B krb5p
.ad
.RS 9n
.rt
User Kerberos V5 authentication, integrity checksums, and privacy
protection (encryption) on the shared filesystem. This provides the most
secure filesystem sharing, as all traffic is encrypted. It should be noted
that performance might suffer on some systems when using
.BR krb5p ,
depending on the computational intensity of the encryption algorithm and the
amount of data being transferred.
.RE

.sp
.ne 2
.mk
.na
.B none
.ad
.RS 9n
.rt
Use null authentication
.RB ( AUTH_NONE ).
\fBNFS\fR clients using
\fBAUTH_NONE\fR have no identity and are mapped to the anonymous user
\fBnobody\fR by \fBNFS\fR servers. A client using a security mode other than
the one with which a Solaris
.B NFS
server shares the file system has its
security mode mapped to
.B AUTH_NONE.
In this case, if the file system is
shared with \fBsec=\fInone,\fR users from the client are mapped to the
anonymous user. The
.B NFS
security mode
.B none
is supported by
\fBshare_nfs\fR(1M), but not by \fBmount_nfs\fR(1M) or \fBautomount\fR(1M).

.RE

.SH FILES
.sp
.ne 2
.mk
.na
\fB/etc/nfssec.conf\fR
.ad
.RS 20n
.rt
\fBNFS\fR security service configuration file
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
lw(2.75i) lw(2.75i)
lw(2.75i) lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
AvailabilitySUNWnfscr
.TE

.SH SEE ALSO
.sp
.LP
.BR automount (1M),
.BR kclient (1M),
.BR mount_nfs (1M),
\fBshare_nfs\fR(1M), \fBrpc_clnt_auth\fR(3NSL), \fBsecure_rpc\fR(3NSL),
.BR nfssec.conf (4),
.BR attributes (5),
.BR kerberos (5)
.SH NOTES
.sp
.LP
\fB/etc/nfssec.conf\fR lists the \fBNFS\fR security services. Do not edit
this file. It is not intended to be user-configurable. See
.BR kclient (1M).
