usr/src/man/man5/pam_pkcs11.5
'\" te
.\" Portions Copyright (c) 2008, Sun Microsystems, Inc. All Right Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" This manual page is derived from documentation obtained from the OpenSC
.\" organization (www.opensc-project.org).
.\"
.\" This library is free software; you can redistribute it and/or
.\" modify it under the terms of the GNU Lesser General Public
.\" License as published by the Free Software Foundation; either
.\" version 2.1 of the License, or (at your option) any later version.
.\"
.\" This library is distributed in the hope that it will be useful,
.\" but WITHOUT ANY WARRANTY; without even the implied warranty of
.\" MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU
.\" Lesser General Public License for more details.
.\"
.\" You should have received a copy of the GNU Lesser General Public
.\" License along with this library; if not, write to the Free Software
.\" Foundation, Inc., 59 Temple Place, Suite 330, Boston, MA 02111-1307 USA
.\"
.TH pam_pkcs11 5 "21 Jul 2008" "SunOS 5.11" "Standards, Environments, and Macros"
.SH NAME
pam_pkcs11 \- PAM Authentication Module for the PKCS#11 token libraries
.SH SYNOPSIS
.LP
.nf
\fBpam_pkcs11.so\fR [debug] [config_file=\fIfilename\fR]
.fi

.SH DESCRIPTION
.sp
.LP
The
.B pam_pkcs11
module implements
.BR pam_sm_authenticate (3PAM),
which provides functionality to the PAM authentication stack. This module
allows a user to login a system, using a X.509 certificate and its dedicated
private key stored in a PKCS#11 token. This module currently supports the
RSA algorithm only.
.sp
.LP
To verify the dedicated private key is truly associated with the X.509
certificate, the following verification procedure is performed in this
module by default:
.RS +4
.TP
.ie t \(bu
.el o
Generate 128 random byte data
.RE
.RS +4
.TP
.ie t \(bu
.el o
Sign the random data with the private key and get a signature. This step is
done in the PKCS#11 token.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Verify the signature using the public key extracted from the certificate.
.RE
.sp
.LP
For the verification of the users' certificates, locally stored CA
certificates as well as either online or locally accessible CRLs are used.
.SS "PAM CONFIGURATION"
.sp
.LP
The
.B pam_pkcs11.so
service module can be used in the
.B <auth>
PAM
chain. The program that needs a PAM service should be configured in the
.B /etc/pam.conf
file. For details on how to configure PAM services, see
.BR pam.conf (4).
.sp
.LP
The following example uses only
.B pam_pkcs11
for authentication:
.sp
.in +2
.nf
login auth requisite pam_pkcs11.so.1
login autho required pam_unix_cred.so.1
.fi
.in -2

.sp
.LP
The following example uses
.B pam_pkcs11
for authentication with
fallback to standard UNIX authentication:
.sp
.in +2
.nf
login auth sufficient pam_pkcs11.so.1
login auth requisite  pam_authtok_get.so.1
login auth required   pam_dhkeys.so.1
login auth required   pam_unix_cred.so.1
login auth required   pam_unix_auth.so.1
.fi
.in -2

.SS "PAM_PKCS11 CONFIGURATION"
.sp
.LP
To configure the
.B pam_pkcs11
module, you must have the following
information:
.RS +4
.TP
.ie t \(bu
.el o
Which PKCS #11 token you are going to use
.RE
.RS +4
.TP
.ie t \(bu
.el o
Which mapper(s) you need, and if needed, how to create and edit the related
mapping files
.RE
.RS +4
.TP
.ie t \(bu
.el o
The root Certificate Authority files, and if required, the Certificate
Revocation Lists files
.RE
.RS +4
.TP
.ie t \(bu
.el o
The list of authorized users to login, and their corresponding
certificates
.RE
.sp
.LP
To configure the
.B pam_pkcs11
module, you need to modify the
.B pam_pkcs11.conf
configuration file which is in the
.B /etc/security/pam_pkcs11
directory by default. For detailed
information on how to configure the
.B pam_pkcs11
module, see the
.IR "PAM-PKCS11 User Manual" ,
available at the
.B http://www.opensc-project.org/
web site, under the
.B "PAM PKCS#11"
link.
.sp
.LP
The following example illustrates how to configure the
.BR pam_pkcs11
module for a user whose certificate and private key are stored in the
Solaris
.B pkcs11_softtoken
keystore. This example uses the default
certificate verification policy.
.RS +4
.TP
.ie t \(bu
.el o
Set up the PKCS#11 module.
.sp
On Solaris, the PKCS#11 module should be set to
.BR /usr/lib/libpkcs11.so.1 ,
the PKCS#11 Cryptographic Framework library.

.RE
.RS +4
.TP
.ie t \(bu
.el o
Set up the
.B slot_description
entry.
.sp
Specifies the slot to be used. For example, \fBslot_description = "Sun
Crypto Softtoken"\fR. The default value for this entry is
.B
none
which
means to use the first slot with an available token.
.sp
An administrator can use the
.BR "cryptoadm list -v" command
to find all the
available slots and their slot descriptions. For more information, see
.BR libpkcs11 (3LIB)
and
.BR cryptoadm (1M).
.RE
.RS +4
.TP
.ie t \(bu
.el o
Install or create user certificates and its dedicated private keys in the
specific PKCS#11 token.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Set up the certificate verification policy
.RB ( cert_policy ).
If needed,
set up CA certificate and CRL files.
.sp
The certificate verification policy includes:
.RS

.sp
.ne 2
.mk
.na
.B none
.ad
.RS 13n
.rt
Perform no verification
.RE

.sp
.ne 2
.mk
.na
.B ca
.ad
.RS 13n
.rt
Perform CA check
.RE

.sp
.ne 2
.mk
.na
.B signature
.ad
.RS 13n
.rt
Perform a signature check to ensure that private and public key matches
.RE

.sp
.ne 2
.mk
.na
.BI crl_ xxx
.ad
.RS 13n
.rt
Perform various certificate revocation checking
.RE

.RE

As this example uses the default policy,
.BR "cert_policy = ca,signature" ,
an administer needs to set up the CA certificates.
.RS +4
.TP
.ie t \(bu
.el o
Copy the CA certificate to the
.BR /etc/security/pam_pkcs11/cacerts
directory.
.sp
A certificate that is self-signed is its own CA certificate. Therefore, in
this example, the certificate is placed both in the Softtoken keystore and
in the CA certificate directory.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Make hash links for CA certificates
.sp
.in +2
.nf
$ /etc/security/pam_pkcs11/make_hash_link.sh \e
      /etc/security/pam_pkcs11/cacerts
.fi
.in -2
.sp

.RE
.RE
.RS +4
.TP
.ie t \(bu
.el o
Set up the mappers and mapfiles.
.sp
When a X509 certificate is provided, there are no direct ways to map a
certificate to a login. The
.B pam_pkcs11
module provides a configurable
way with mappers to specify
.B cert-to-user
mapping.
.sp
Many mappers are provided by the
.B pam_pkcs11
module, for example, the
common name (CN) mapper, the digest mapper, the Email mapper, or the LDAP
mapper.
.sp
A user can configure a mapper list in the
.B pam_pkcs11.conf
file. The
mappers in the list are used sequentially until the certificate is
successfully matched with the user.
.sp
The default mapper list is as follows:
.sp
.in +2
.nf
use_mappers = digest, cn, pwent, uid, mail, subject, null;
.fi
.in -2
.sp

Some mappers do not require the specification of a mapfile, for example,
the common name mapper. Other mappers require mapfiles, for example, the
digest mapper. Some sample mapping files can be found in the
.B /etc/security/pam_pkcs11
directory.
.RE
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
.BI config_file= filename
.ad
.RS 24n
.rt
Specify the configuration file. The default value is
.BR /etc/security/pam_pkcs11/pam_pkcs11.conf .
.RE

.sp
.ne 2
.mk
.na
.B debug
.ad
.RS 24n
.rt
Enable debugging output.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B /usr/lib/security/pam_pkcs11.so
.ad
.sp .6
.RS 4n
.B pam_pkcs11
module
.RE

.sp
.ne 2
.mk
.na
.B /usr/lib/pam_pkcs11/ldap_mapper.so
.ad
.sp .6
.RS 4n
Mapper module.
.RE

.sp
.ne 2
.mk
.na
.B /usr/lib/pam_pkcs11/opensc_mapper.so
.ad
.sp .6
.RS 4n
Mapper module.
.RE

.sp
.ne 2
.mk
.na
.B /usr/lib/pam_pkcs11/openssh_mapper.so
.ad
.sp .6
.RS 4n
Mapper module.
.RE

.sp
.ne 2
.mk
.na
.B /etc/security/pam_pkcs11/pam_pkcs11.conf
.ad
.sp .6
.RS 4n
Configuration file.
.RE

.sp
.ne 2
.mk
.na
.B /etc/security/pam_pkcs11/cacerts
.ad
.sp .6
.RS 4n
Configuration directory. Stores the CA certificates.
.RE

.sp
.ne 2
.mk
.na
.B /etc/security/pam_pkcs11/crls
.ad
.sp .6
.RS 4n
Configuration directory. Stores the CRL files.
.RE

.sp
.ne 2
.mk
.na
.B /etc/security/pam_pkcs11/digest_mapping.example
.ad
.sp .6
.RS 4n
Sample mapfile.
.RE

.sp
.ne 2
.mk
.na
.B /etc/security/pam_pkcs11/subject_mapping.example
.ad
.sp .6
.RS 4n
Sample mapfile.
.RE

.sp
.ne 2
.mk
.na
.B /etc/security/pam_pkcs11/mail_mapping.example
.ad
.sp .6
.RS 4n
Sample mapfile.
.RE

.sp
.ne 2
.mk
.na
.B /etc/security/pam_pkcs11/make_hash_link.sh
.ad
.sp .6
.RS 4n
Sample script.
.RE

.SH AUTHORS
.sp
.LP
.B PAM-pkcs11
was originally written by MarioStrasser ,
.BR mast@gmx.net .
.sp
.LP
Newer versions are from Juan Antonio Martinez,
.B jonsito@teleline.es
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for a description of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilityT{
SUNWpampkcs11u, SUNWpampkcs11r, SUNWpampkcs11-docs
T}
_
Interface StabilityUncommitted
.TE

.SH SEE ALSO
.sp
.LP
.BR pkcs11_inspect (1),
.BR pklogin_finder (1),
.BR cryptoadm (1M),
.BR libpkcs11\fR(3LIB)\fBlibpkcs11\fR(3LIB)\fBpam_sm_authenticate (3PAM),
.BR pam.conf (4),
.BR attributes (5),
.BR pkcs11_softtoken (5)
.sp
.LP
.IR "PAM-PKCS11 User Manual" ,
available at the
.B http://www.opensc-project.org/
web site, under the
.B "PAM PKCS#11"
link.
