usr/src/man/man5/pam_unix_auth.5
'\" te
.\" Copyright (c) 2008, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH pam_unix_auth 5 "23 Apr 2008" "SunOS 5.11" "Standards, Environments, and Macros"
.SH NAME
pam_unix_auth \- PAM authentication module for UNIX
.SH SYNOPSIS
.LP
.nf
\fBpam_unix_auth.so.1\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B pam_unix_auth
module implements
.BR pam_sm_authenticate() ,
which provides functionality to the PAM authentication stack. It provides
functions that use \fBcrypt\fR(3C) to verify that the password contained in
the
.B PAM
item
.B PAM_AUTHTOK
is the correct password for the user
specified in the item
.BR PAM_USER .
If
.B PAM_REPOSITORY
is specified,
then user's password is fetched from that repository. Otherwise, the default
.BR nsswitch.conf (4)
repository is searched for that user.
.sp
.LP
For accounts in the name services which support automatic account locking,
the account may be configured to be automatically locked (see
.BR user_attr (4)
and
.BR policy.conf (4))
after multiple failed login
attempts. For accounts that are configured for automatic locking, if
authentication failure is to be returned, the failed login counter is
incremented upon each failure. If the number of successive failures equals
or exceeds
.B RETRIES
as defined in
.BR login (1),
the account is locked
and \fBPAM_MAXTRIES\fR is returned. Currently, only the "files" repository
(see
.BR passwd (4)
and
.BR shadow (4))
supports automatic account
locking. A successful authentication by this module clears the failed login
counter and reports the number of failed attempts since the last successful
authentication.
.sp
.LP
Authentication service modules must implement both
.B pam_sm_authenticate()
and
.BR pam_sm_setcred() .
To allow the
authentication portion of UNIX authentication to be replaced,
.B pam_sm_setcred()
in this module always returns
.BR PAM_IGNORE .
This
module should be stacked with
.BR pam_unix_cred (5)
to ensure a successful
return from
.BR pam_setcred (3PAM).
.sp
.LP
The following options can be passed to the module:
.sp
.ne 2
.mk
.na
.B nowarn
.ad
.sp .6
.RS 4n
Turn off warning messages.
.RE

.sp
.ne 2
.mk
.na
.B server_policy
.ad
.sp .6
.RS 4n
If the account authority for the user, as specified by
.BR PAM_USER ,
is a
server, do not apply the UNIX policy from the
.B passwd
entry in the name
service switch.
.RE

.sp
.ne 2
.mk
.na
.B nolock
.ad
.sp .6
.RS 4n
Regardless of the automatic account locking setting for the account, do not
lock the account, increment or clear the failed login count. The
.B nolock
option allows for exempting account locking on a per service
basis.
.RE

.SH ERRORS
.sp
.LP
The following error codes are returned from
.BR pam_sm_authenticate() :
.sp
.ne 2
.mk
.na
.B PAM_AUTH_ERR
.ad
.sp .6
.RS 4n
Authentication failure.
.RE

.sp
.ne 2
.mk
.na
.B PAM_BUF_ERR
.ad
.sp .6
.RS 4n
Memory buffer error.
.RE

.sp
.ne 2
.mk
.na
.B PAM_IGNORE
.ad
.sp .6
.RS 4n
Ignores module, not participating in result.
.RE

.sp
.ne 2
.mk
.na
.B PAM_MAXTRIES
.ad
.sp .6
.RS 4n
Maximum number of retries exceeded.
.RE

.sp
.ne 2
.mk
.na
.B PAM_PERM_DENIED
.ad
.sp .6
.RS 4n
Permission denied.
.RE

.sp
.ne 2
.mk
.na
.B PAM_SUCCESS
.ad
.sp .6
.RS 4n
Successfully obtains authentication token.
.RE

.sp
.ne 2
.mk
.na
.B PAM_SYSTEM_ERR
.ad
.sp .6
.RS 4n
System error.
.RE

.sp
.ne 2
.mk
.na
.B PAM_USER_UNKNOWN
.ad
.sp .6
.RS 4n
No account present for user.
.RE

.sp
.LP
The following error codes are returned from
.BR pam_sm_setcred() :
.sp
.ne 2
.mk
.na
.B PAM_IGNORE
.ad
.sp .6
.RS 4n
Ignores this module regardless of the control flag.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityCommitted
_
MT LevelMT-Safe with exceptions
.TE

.SH SEE ALSO
.sp
.LP
.BR login (1),
.BR passwd (1),
.BR useradd (1M),
.BR usermod (1M),
.BR roleadd (1M),
.BR rolemod (1M),
.BR crypt (3C),
.BR libpam (3LIB),
.BR pam (3PAM),
.BR pam_authenticate (3PAM),
.BR pam_setcred (3PAM),
.BR syslog (3C),
.BR pam.conf (4),
.BR passwd (4),
.BR policy.conf (4),
.BR nsswitch.conf (4),
.BR shadow (4),
.BR user_attr (4),
.BR attributes (5),
.BR pam_authtok_check (5),
.BR pam_authtok_get (5),
.BR pam_authtok_store (5),
.BR pam_dhkeys (5),
.BR pam_passwd_auth (5),
.BR pam_unix_account (5),
.BR pam_unix_session (5)
.SH NOTES
.sp
.LP
The interfaces in \fBlibpam\fR(3LIB) are MT-Safe only if each thread within
the multi-threaded application uses its own
.B PAM
handle.
.sp
.LP
The
.BR pam_unix (5)
module is no longer supported. Similar functionality
is provided by
.BR pam_authtok_check (5),
.BR pam_authtok_get (5),
.BR pam_authtok_store (5),
.BR pam_dhkeys (5),
\fBpam_passwd_auth\fR(5),\fBpam_setcred\fR(3PAM), \fBpam_unix_account\fR(5),
.BR pam_unix_cred (5),
.BR pam_unix_session (5).
.sp
.LP
If the
.B PAM_REPOSITORY
.I item_type
is set and a service module
does not recognize the type, the service module does not process any
information, and returns
.BR PAM_IGNORE .
If the
.BR PAM_REPOSITORY
.I item_type
is not set, a service module performs its default action.
