usr/src/man/man5/pam_rhosts_auth.5
'\" te
.\" Copyright (c) 1995, Sun Microsystems, Inc.
.\"   All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH pam_rhosts_auth 5 "28 Oct 1996" "SunOS 5.11" "Standards, Environments, and Macros"
.SH NAME
pam_rhosts_auth \- authentication management PAM module using ruserok()
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/security/pam_rhosts_auth.so.1\fR
.fi

.SH DESCRIPTION
.sp
.LP
The rhosts
.B PAM
module,
.BR /usr/lib/security/pam_rhosts_auth.so.1 ,
authenticates a user via the
\fBrlogin\fR authentication protocol. Only \fBpam_sm_authenticate()\fR is
implemented within this module.
.B pam_sm_authenticate()
uses the
.BR ruserok (3SOCKET)
library function to authenticate the
.B rlogin
or
\fBrsh\fR user. \fBpam_sm_setcred()\fR is a null function.
.sp
.LP
\fB/usr/lib/security/pam_rhosts_auth.so.1\fR is designed to be stacked on
top of the
.B /usr/lib/security/pam_unix.so.1
module for both the
\fBrlogin\fR and \fBrsh\fR services. This module is normally configured as
\fIsufficient\fR so that subsequent authentication is performed only on
failure of
.BR pam_sm_authenticate() .
The following option may be passed
in to this service module:
.sp
.ne 2
.mk
.na
.B debug
.ad
.RS 10n
.rt
.BR syslog (3C)
debugging information at
.B LOG_DEBUG
level.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
lw(2.75i) lw(2.75i)
lw(2.75i) lw(2.75i)
.
\fBATTRIBUTE TYPE\fR\fBATTRIBUTE VALUE\fR
MT LevelMT-Safe with exceptions
.TE

.SH SEE ALSO
.sp
.LP
.BR pam (3PAM),
.BR pam_authenticate (3PAM),
.BR ruserok (3SOCKET),
.BR syslog (3C),
.BR libpam (3LIB),
.BR pam.conf (4),
.BR attributes (5)

.SH NOTES
.sp
.LP
The interfaces in
.B libpam()
are MT-Safe only if each thread within
the multi-threaded application uses its own
.B PAM
handle.
