usr/src/man/man5/pam_list.5
'\" te
.\" Copyright (c) 2009, Sun Microsystems, Inc. All Rights Reserved.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH pam_list 5 "26 Mar 2009" "SunOS 5.11" "Standards, Environments, and Macros"
.SH NAME
pam_list \- PAM account management module for UNIX
.SH SYNOPSIS
.LP
.nf
 pam_list.so.1
.fi

.SH DESCRIPTION
.sp
.LP
The
.B pam_list
module implements
.BR pam_sm_acct_mgmt "(3PAM), which"
provides functionality to the PAM account management stack.  The module
provides functions to validate  that  the  user's account  is  valid on this
host based on a list of users and/or netgroups in the given file. The users
and netgroups are separated by newline character. Netgroups are specified
with character '@' as prefix before name of netgroup in the list. The
maximum line lenght is 1023 characters.
.sp
.LP
The username is the value of
.BR PAM_USER .
The host is the value of
.B PAM_RHOST
or, if
.B PAM_RHOST
is not set, the value of the
localhost as returned by
.BR gethostname "(3C) is used."
.sp
.LP
If neither of the
.BR allow ,
.BR deny ,
or
.B compat
options are
specified, the module will look for +/- entries in the local
.B /etc/passwd
file.  If this style is used,
.BR nsswitch.conf (4)
must
not be configured with
.B compat
for the
.B passwd
database. If no
relevant +/- entry exists for the user,
.B pam_list
is not participating
in result.
.sp
.LP
If
.B compat
option is specified then the module will look for +/-
entries in the local
.B /etc/passwd
file. Other entries in this file will
be counted as + entries. If no relevant entry exits for the user,
.B pam_list
will deny the access.
.sp
.LP
The following options can be passed to the module:
.sp
.ne 2
.mk
.na
.B allow=
.ad
.RS 19n
.rt
The full pathname to a file of allowed users and/or netgroups. Only one of
.B allow=
or
.B deny=
can be specified.
.RE

.sp
.ne 2
.mk
.na
.B compat
.ad
.RS 19n
.rt
Activate
.B compat
mode.
.RE

.sp
.ne 2
.mk
.na
.B deny=
.ad
.RS 19n
.rt
The full pathname to a file of denied users and/or netgroups. Only one of
.B deny=
or
.B allow=
can be specified.
.RE

.sp
.ne 2
.mk
.na
.B debug
.ad
.RS 19n
.rt
Provide \fBsyslog\fR(3C) debugging information at the
.B LOG_AUTH
|
.B LOG_DEBUG
level.
.RE

.sp
.ne 2
.mk
.na
.B user
.ad
.RS 19n
.rt
The module should only perform netgroup matches on the username. This is
the default option.
.RE

.sp
.ne 2
.mk
.na
.B nouser
.ad
.RS 19n
.rt
The username should not be used in the netgroup match.
.RE

.sp
.ne 2
.mk
.na
.B host
.ad
.RS 19n
.rt
Only the host should be used in netgroup matches.
.RE

.sp
.ne 2
.mk
.na
.B nohost
.ad
.RS 19n
.rt
The hostname should not be used in netgroup matches.
.RE

.sp
.ne 2
.mk
.na
.B user_host_exact
.ad
.RS 19n
.rt
The user and hostname must be in the same netgroup.
.RE

.SH ERRORS
.sp
.LP
The following error values are returned:
.sp
.ne 2
.mk
.na
.B PAM_SERVICE_ERR
.ad
.RS 20n
.rt
An invalid set of module options was given in the
.BR pam.conf (4)
for
this module, or the
.B user/netgroup
file could not be opened.
.RE

.sp
.ne 2
.mk
.na
.B PAM_BUF_ERR
.ad
.RS 20n
.rt
A memory buffer error occurred.
.RE

.sp
.ne 2
.mk
.na
.B PAM_IGNORE
.ad
.RS 20n
.rt
The module is ignored, as it is not participating in the result.
.RE

.sp
.ne 2
.mk
.na
.B PAM_PERM_DENIED
.ad
.RS 20n
.rt
The user is not on the allow list or is on the deny list.
.RE

.sp
.ne 2
.mk
.na
.B PAM_SUCCESS
.ad
.RS 20n
.rt
The account is valid for use at this time.
.RE

.sp
.ne 2
.mk
.na
.B PAM_USER_UNKNOWN
.ad
.RS 20n
.rt
No account is present for the user
.RE

.SH EXAMPLES
.LP
.B Example 1
Using
.B pam_list
in default mode
.sp
.LP
.B /etc/pam.conf
modification looks like:

.sp
.in +2
.nf
other   account requisite       pam_roles.so.1
other   account required        pam_unix_account.so.1
other   account required        pam_list.so.1
.fi
.in -2

.sp
.LP
In the case of
.B default
mode or
.B compat
mode, the important lines
in
.B /etc/passwd
appear as follows:

.sp
.in +2
.nf
+loginname	- user is approved
-loginname	- user is disapproved
+@netgroup	- netgroup members are approved
-@netgroup	- netgroup members are disapproved
.fi
.in -2

.LP
.B Example 2
Using
.B pam_list
with allow file
.sp
.LP
.B /etc/pam.conf
modification looks like:

.sp
.in +2
.nf
other   account requisite       pam_roles.so.1
other   account required        pam_unix_account.so.1
other   account required        pam_list.so.1 allow=etc/user.allow
.fi
.in -2

.sp
.LP
.B /etc/users.allow
contains:
.sp
.in +2
.nf
root
localloginname
remoteloginname
@netgroup
.fi
.in -2

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityCommitted
_
MT-LevelMT-Safe with exceptions
.TE

.sp
.LP
The interfaces in \fBlibpam\fR(3LIB) are MT-Safe only if each thread within
the multithreaded application uses its own PAM handle.
.SH SEE ALSO
.sp
.LP
.BR pam (3PAM),
.BR pam_authenticate (3PAM),
.BR pam_sm_acct_mgmt (3PAM),
.BR syslog (3C),
.BR libpam (3LIB),
.BR nsswitch.conf (4),
.BR pam.conf (4),
.BR attributes (5)
