usr/src/man/man5/pam_dial_auth.5
'\" te
.\" Copyright (C) 2002, Sun Microsystems, Inc.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH pam_dial_auth 5 "9 Sept 2004" "SunOS 5.11" "Standards, Environments, and Macros"
.SH NAME
pam_dial_auth \- authentication management PAM module for dialups
.SH SYNOPSIS
.LP
.nf
\fBpam_dial_auth.so.1\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B pam_dial_auth
module implements
.BR pam_sm_authenticate (3PAM)
which authenticates the user according to the
.BR dialups (4)
and
.BR d_passwd (4)
files configuration.
.sp
.LP
Authentication service modules must implement both
.B pam_sm_authenticate()
and
.BR pam_sm_setcred() .
.B pam_sm_setcred()
in this module always returns
.BR PAM_IGNORE .
.sp
.LP
The value of the
.B PAM_TTY
item is checked against entries in
.BR dialups (4).
If there is a match, the user's shell is compared against
entries in
.BR d_passwd (4).
If there is a matching entry, the user is
prompted for a password which is validated against the entry found.
.sp
.LP
The following option may be passed in to this service module:
.sp
.ne 2
.mk
.na
.B debug
.ad
.RS 9n
.rt
.BR syslog (3C)
debugging information at
.B LOG_DEBUG
level.
.RE

.SH ERRORS
.sp
.LP
If
.BR dialups (4)
is not present,
.B PAM_IGNORE
is returned. Upon
successful completion of
.BR pam_sm_authenticate() ,
.B PAM_SUCCESS
is
returned. The following error codes are returned upon error:
.sp
.ne 2
.mk
.na
.B PAM_AUTH_ERR
.ad
.RS 20n
.rt
Authentication failure.
.RE

.sp
.ne 2
.mk
.na
.B PAM_SERVICE_ERR
.ad
.RS 20n
.rt
Error in the calling service,
.B PAM_TTY
is not set.
.RE

.sp
.ne 2
.mk
.na
.B PAM_SYSTEM_ERR
.ad
.RS 20n
.rt
System error (\fBd_passwd\fR(4) is not present).
.RE

.sp
.ne 2
.mk
.na
.B PAM_USER_UNKNOWN
.ad
.RS 20n
.rt
No account is present for
.IR user .
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for a description of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
MT LevelMT-Safe with exceptions
.TE

.SH SEE ALSO
.sp
.LP
.BR pam (3PAM),
.BR pam_authenticate (3PAM),
.BR pam_sm_authenticate (3PAM),
.BR d_passwd (4),
.BR dialups (4),
.BR libpam (3LIB),
.BR pam.conf (4),
.BR attributes (5),
.BR pam_authtok_check (5),
.BR pam_authtok_get (5),
.BR pam_authtok_store (5),
.BR pam_dhkeys (5),
.BR pam_passwd_auth (5),
.BR pam_unix_account (5),
.BR pam_unix_auth (5),
.BR pam_unix_session (5)
.SH NOTES
.sp
.LP
The interfaces in \fBlibpam\fR(3LIB) are MT-Safe only if each thread within
the multi-threaded application uses its own
.B PAM
handle.
.sp
.LP
The
.BR pam_unix (5)
module is no longer supported. Similar functionality is
provided by
.BR pam_authtok_check (5),
.BR pam_authtok_get (5),
.BR pam_authtok_store (5),
.BR pam_dhkeys (5),
.BR pam_passwd_auth (5),
.BR pam_unix_account (5),
.BR pam_unix_auth (5),
and
.BR pam_unix_session (5).
