usr/src/man/man5/pam_ldap.5
'\" te
.\" Copyright (C) 2005, Sun Microsystems, Inc. All Rights Reserved.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH pam_ldap 5 "21 Dec 2005" "SunOS 5.11" "Standards, Environments, and Macros"
.SH NAME
pam_ldap \- authentication and account management PAM module for LDAP
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/security/pam_ldap.so.1\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B pam_ldap
module implements
.BR pam_sm_authenticate "(3PAM) and"
.BR pam_sm_acct_mgmt (3PAM),
the functions that provide functionality for
.RB "the PAM authentication and account management stacks. The" " pam_ldap"
module ties the authentication and account management functionality to the
functionality of the supporting LDAP server. For authentication,
\fBpam_ldap\fR can authenticate the user directly to any LDAP directory
server by using any supported authentication mechanism, such as
.BR DIGEST-MD5 .
However, the account management component of
\fBpam_ldap\fR will work only with the Sun Java System Directory Server. The
server's user account management must be properly configured before it can
be used by
.BR pam_ldap .
Refer to the \fISun Java System Directory Server
Administration Guide\fR for information on how to configure user account
management, including password and account lockout policy.
.sp
.LP
\fBpam_ldap\fR must be used in conjunction with the modules that support
the UNIX authentication, password, and account management, which are
.BR pam_authtok_get (5),
.BR pam_passwd_auth (5),
.BR pam_unix_account (5),
and
.BR pam_unix_auth (5).
\fBpam_ldap\fR is
designed to be stacked directly below these modules. If other modules are
designed to be stacked in this manner, the modules can be stacked below the
\fBpam_ldap\fR module. The Examples section shows how the UNIX modules are
stacked with
.BR pam_ldap .
When stacked together, the UNIX modules are
used to control local accounts, such as
.BR root .
\fBpam_ldap\fR is used
to control network accounts, that is, LDAP users. For the stacks to work,
.BR pam_unix_auth ,
.BR pam_unix_account ,
and
.B pam_passwd_auth
must
be configured with the
.B binding
control flag and the
\fBserver_policy\fR option. This configuration allows local account override
of a network account.
.SS "LDAP Authentication Module"
.sp
.LP
The LDAP authentication module verifies the identity of a user. The
.BR pam_sm_authenticate (3PAM)
function uses the password entered by the
user to attempt to authenticate to the LDAP server. If successful, the user
is authenticated. See NOTES for information on password prompting.
.sp
.LP
The authentication method used is either defined in the client profile , or
the authentication method is configured by using the
.BR ldapclient (1M)
command. To determine the authentication method to use, this module first
attempts to use the authentication method that is defined, for service
.BR pam_ldap ,
for example,
.BR serviceAuthenticationMethod:pam_ldap:sasl/DIGEST-MD5 .
If no
authentication method is defined,
.B pam_ldap
uses the default
authentication method. If neither are set, the authentication fails. This
module skips the configured authentication method if the authentication
method is set to
.BR none .
.sp
.LP
The following options can be passed to the LDAP service module:
.sp
.ne 2
.mk
.na
.B debug
.ad
.RS 10n
.rt
.BR syslog (3C)
debugging information at
.B LOG_DEBUG
level.
.RE

.sp
.ne 2
.mk
.na
.B nowarn
.ad
.RS 10n
.rt
Turn off warning messages.
.RE

.sp
.LP
These options are case sensitive and must be used exactly as presented
here.
.SS "LDAP Account Management Module"
.sp
.LP
The LDAP account management module validates the user's account. The
.BR pam_sm_acct_mgmt (3PAM)
function authenticates to the LDAP server to
verify that the user's password has not expired, or that the user's account
has not been locked. In the event that there is no user authentication token
(\fBPAM_AUTHTOK\fR) available, the \fBpam_sm_acct_mgmt\fR(3PAM) function
attempts to retrieve the user's account status without authenticating to the
LDAP server as the user logging in. This procedure will succeed only if the
LDAP server is Sun Java System Directory server 5.2 patch 4 or newer. The
following options can be passed to the LDAP service module:
.sp
.ne 2
.mk
.na
.B debug
.ad
.RS 10n
.rt
.BR syslog (3C)
debugging information at
.B LOG_DEBUG
level.
.RE

.sp
.ne 2
.mk
.na
.B nowarn
.ad
.RS 10n
.rt
Turn off warning messages.
.RE

.sp
.LP
These options are case sensitive, and the options must be used exactly as
presented here.
.SS "LDAP Password Management Module"
.sp
.LP
LDAP password management is no longer supported by
.BR pam_ldap .
Use
.BR pam_authtok_store (5)
instead of
.B pam_ldap
for password change.
.BR pam_authtok_store (5)
handles both the local and LDAP accounts and
updates the passwords in all the repositories configured by
.BR nsswitch.conf (4).
.SH ERRORS
.sp
.LP
The authentication service returns the following error codes:
.sp
.ne 2
.mk
.na
.B PAM_SUCCESS
.ad
.RS 20n
.rt
The uthentication was successful.
.RE

.sp
.ne 2
.mk
.na
.B PAM_MAXTRIES
.ad
.RS 20n
.rt
The maximum number of authentication attempts was exceeded.
.RE

.sp
.ne 2
.mk
.na
.B PAM_AUTH_ERR
.ad
.RS 20n
.rt
The authentication failed.
.RE

.sp
.ne 2
.mk
.na
.B PAM_USER_UNKNOWN
.ad
.RS 20n
.rt
No account is present for the user.
.RE

.sp
.ne 2
.mk
.na
.B PAM_BUF_ERR
.ad
.RS 20n
.rt
A memory buffer error occurred.
.RE

.sp
.ne 2
.mk
.na
.B PAM_SYSTEM_ERR
.ad
.RS 20n
.rt
A system error occurred.
.RE

.sp
.ne 2
.mk
.na
.B PAM_IGNORE
.ad
.RS 20n
.rt
The user's account was inactivated.
.RE

.sp
.LP
The account management service returns the following error codes:
.sp
.ne 2
.mk
.na
.B PAM_SUCCESS
.ad
.RS 24n
.rt
The user was allowed access to the account.
.RE

.sp
.ne 2
.mk
.na
.B PAM_NEW_AUTHTOK_REQD
.ad
.RS 24n
.rt
A new authentication token is required.
.RE

.sp
.ne 2
.mk
.na
.B PAM_ACCT_EXPIRED
.ad
.RS 24n
.rt
The user account has expired.
.RE

.sp
.ne 2
.mk
.na
.B PAM_PERM_DENIED
.ad
.RS 24n
.rt
The user was denied access to the account at this time.
.RE

.sp
.ne 2
.mk
.na
.B PAM_USER_UNKNOWN
.ad
.RS 24n
.rt
No account is present for the user.
.RE

.sp
.ne 2
.mk
.na
.B PAM_BUF_ERROR
.ad
.RS 24n
.rt
A memory buffer error occurred.
.RE

.sp
.ne 2
.mk
.na
.B PAM_SYSTEM_ERR
.ad
.RS 24n
.rt
A system error occurred.
.RE

.SH EXAMPLES
.LP
\fBExample 1\fR Using \fBpam_ldap\fR With Authentication\fR
.sp
.LP
The following is a configuration for the login service when using
.BR pam_ldap .
The service name
.B login
can be substituted for any
other authentication service such as
.B dtlogin
or
.BR su .
Lines that
begin with the # symbol are comments and are ignored.

.sp
.in +2
.nf
# Authentication management for login service is stacked.
# If pam_unix_auth succeeds, pam_ldap is not invoked.
# The control flag "binding" provides a local overriding
# remote (LDAP) control. The "server_policy" option is used
# to tell pam_unix_auth.so.1 to ignore the LDAP users.

login   auth requisite  pam_authtok_get.so.1
login   auth required   pam_dhkeys.so.1
login   auth required   pam_unix_cred.so.1
login   auth binding    pam_unix_auth.so.1 server_policy
login   auth required   pam_ldap.so.1
.fi
.in -2

.LP
\fBExample 2\fR Using \fBpam_ldap\fR With Account Management
.sp
.LP
The following is a configuration for account management when using
.BR pam_ldap .
Lines that begin with the # symbol are comments and are
ignored.

.sp
.in +2
.nf
# Account management for all services is stacked
# If pam_unix_account succeeds, pam_ldap is not invoked.
# The control flag "binding" provides a local overriding
# remote (LDAP) control. The "server_policy" option is used
# to tell pam_unix_account.so.1 to ignore the LDAP users.

other   account  requisite      pam_roles.so.1
other   account  binding        pam_unix_account.so.1 server_policy
other   account  required       pam_ldap.so.1
.fi
.in -2

.LP
\fBExample 3\fR Using \fBpam_authtok_store\fR With Password Management For
Both Local and LDAP Accounts
.sp
.LP
The following is a configuration for password management when using
.BR pam_authtok_store .
Lines that begin with the # symbol are comments and
are ignored.

.sp
.in +2
.nf
# Password management (authentication)
# The control flag "binding" provides a local overriding
# remote (LDAP) control. The server_policy option is used
# to tell pam_passwd_auth.so.1 to ignore the LDAP users.

passwd  auth binding  pam_passwd_auth.so.1 server_policy
passwd  auth required pam_ldap.so.1

# Password management (updates)
# This updates passwords stored both in the local /etc
# files and in the LDAP directory. The "server_policy"
# option is used to tell pam_authtok_store to
# follow the LDAP server's policy when updating
# passwords stored in the LDAP directory

other password required   pam_dhkeys.so.1
other password requisite  pam_authtok_get.so.1
other password requisite  pam_authtok_check.so.1
other password required   pam_authtok_store.so.1 server_policy
.fi
.in -2

.SH FILES
.sp
.ne 2
.mk
.na
\fB/var/ldap/ldap_client_file\fR
.ad
.br
.na
.B /var/ldap/ldap_client_cred
.ad
.RS 30n
.rt
The LDAP configuration files of the client. Do not manually modify these
files, as these files might not be human readable. Use \fBldapclient\fR(1M)
to update these files.
.RE

.sp
.ne 2
.mk
.na
\fB/etc/pam.conf\fR
.ad
.RS 30n
.rt
PAM configuration file.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityEvolving
_
MT-LevelMT-Safe with exceptions
.TE

.SH SEE ALSO
.sp
.LP
.BR ldap (1),
\fBidsconfig\fR(1M), \fBldap_cachemgr\fR(1M),
.BR ldapclient (1M),
.BR libpam (3LIB),
.BR pam (3PAM),
.BR pam_sm_acct_mgmt (3PAM),
.BR pam_sm_authenticate (3PAM),
.BR pam_sm_chauthtok (3PAM),
.BR pam_sm_close_session (3PAM),
.BR pam_sm_open_session (3PAM),
.BR pam_sm_setcred (3PAM),
.BR syslog (3C),
\fBpam.conf\fR(4), \fBattributes\fR(5),
.BR pam_authtok_check (5),
.BR pam_authtok_get (5),
.BR pam_authtok_store (5),
.BR pam_passwd_auth (5),
.BR pam_unix_account (5),
.BR pam_unix_auth (5)
.SH NOTES
.sp
.LP
The interfaces in \fBlibpam\fR(3LIB) are MT-Safe only if each thread within
the multi-threaded application uses its own
.B PAM
handle.
.sp
.LP
The previously supported \fBuse_first_pass\fR and \fBtry_first_pass\fR
options are obsolete in this version, are no longer needed, can safely be
removed from
.BR pam.conf (4),
and are silently ignored. They might be
removed in a future release. Password prompting must be provided for by
stacking
.BR pam_authtok_get (5)
before
.B pam_ldap
in the
.BR auth
and
.B password
module stacks and
.BR pam_passwd_auth (5)
in the
\fBpasswd\fR service \fBauth\fR stack (as described in the EXAMPLES
section). The previously supported password update function is replaced in
this release by the previously recommended use of
.BR pam_authtok_store
with the
.B server_policy
option (as described in the EXAMPLES
section).
.sp
.LP
The functions: \fBpam_sm_setcred\fR(3PAM), \fBpam_sm_chauthtok\fR(3PAM),
.BR pam_sm_open_session (3PAM),
and
.BR pam_sm_close_session "(3PAM) do"
nothing and return
.B PAM_IGNORE
in
.BR pam_ldap .
