usr/src/man/man5/pam_krb5_migrate.5
'\" te
.\" Copyright (c) 2004, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH pam_krb5_migrate 5 "Jul 29 2004" "SunOS 5.11" "Standards, Environments, and Macros"
.SH NAME
pam_krb5_migrate \- authentication PAM module for the KerberosV5
auto-migration of users feature
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/security/pam_krb5_migrate.so.1\fR
.fi

.SH DESCRIPTION
.sp
.LP
The KerberosV5 auto-migrate service module for PAM provides functionality
for the PAM authentication component. The service module helps in the
automatic migration of
.B PAM_USER
to the client's local Kerberos realm,
using
.B PAM_AUTHTOK
(the PAM authentication token associated with
.BR PAM_USER )
as the new Kerberos principal's password.
.SS "KerberosV5 Auto-migrate Authentication Module"
.sp
.LP
The KerberosV5 auto-migrate authentication component provides the
.BR pam_sm_authenticate (3PAM)
function to migrate a user who does not have
a corresponding
.B krb5
principal account to the default Kerberos realm
of the client.
.sp
.LP
.BR pam_sm_authenticate (3PAM)
uses a host-based client service principal,
present in the local
.B keytab
(\fB/etc/krb5/krb5.keytab\fR) to
authenticate to \fBkadmind\fR(1M) (defaults to the \fBhost/nodename.fqdn\fR
service principal), for the principal creation operation. Also, for
successful creation of the
.B krb5
user principal account, the host-based
client service principal being used needs to be assigned the appropriate
privilege on the master KDC's
.BR kadm5.acl (4)
file.
.BR kadmind (1M)
checks for the appropriate privilege and validates the user password using
PAM by calling
.BR pam_authenticate "(3PAM) and"
.BR pam_acct_mgmt (3PAM)
for the
.B k5migrate
service.
.sp
.LP
If migration of the user to the KerberosV5 infrastructure is successful,
the module will inform users about it by means of a
.BR PAM_TEXT_INFO
message, unless instructed otherwise by the presence of the \fBquiet\fR
option.
.sp
.LP
The authentication component always returns
.B PAM_IGNORE
and is meant
to be stacked in
.B pam.conf
with a requirement that it be listed below
pam_authtok_get(5) in the authentication stack. Also, if
.B pam_krb5_migrate
is used in the authentication stack of a particular
service, it is mandatory that
.BR pam_krb5 (5)
be listed in the PAM account
stack of that service for proper operation (see EXAMPLES).
.SH OPTIONS
.sp
.LP
The following options can be passed to the KerberosV5 auto-migrate
authentication module:
.sp
.ne 2
.mk
.na
.B debug
.ad
.sp .6
.RS 4n
Provides \fBsyslog\fR(3C) debugging information at
.B LOG_DEBUG
level.
.RE

.sp
.ne 2
.mk
.na
\fBclient_service=\fI<service name>\fR
.ad
.sp .6
.RS 4n
Name of the service used to authenticate to \fBkadmind\fR(1M) defaults to
.BR host .
This means that the module uses \fBhost/\fI<nodename.fqdn>\fR
as its client service principal name, KerberosV5 user principal creation
operation or \fI<service>\fR/\fI<nodename.fqdn>\fR if this option is
provided.
.RE

.sp
.ne 2
.mk
.na
.B quiet
.ad
.sp .6
.RS 4n
Do not explain KerberosV5 migration to the user.
.sp
This has the same effect as passing the
.B PAM_SILENT
flag to
.BR pam_sm_authenticate (3PAM)
and is useful where applications cannot
handle
.B PAM_TEXT_INFO
messages.
.sp
If not set, the authentication component will issue a \fBPAM_TEXT_INFO\fR
message after creation of the Kerberos V5 principal, indicating that it has
done so.
.RE

.sp
.ne 2
.mk
.na
.B expire_pw
.ad
.sp .6
.RS 4n
Causes the creation of KerberosV5 user principals with password expiration
set to
.B now
(current time).
.RE

.SH EXAMPLES
.LP
.B Example 1
Sample Entries from \fBpam.conf\fR
.sp
.LP
The following entries from
.BR pam.conf (4)
demonstrate the use of the
.B pam_krb5_migrate.so.1
module:

.sp
.in +2
.nf
login       auth requisite          pam_authtok_get.so.1
login       auth required           pam_dhkeys.so.1
login       auth required           pam_unix_cred.so.1
login       auth sufficient         pam_krb5.so.1
login       auth requisite          pam_unix_auth.so.1
login       auth optional           pam_krb5_migrate.so.1 expire_pw
login       auth required           pam_dial_auth.so.1

other   account requisite       pam_roles.so.1
other   account required        pam_krb5.so.1
other   account required        pam_unix_account.so.1
.fi
.in -2

.sp
.LP
The
.B pam_krb5_migrate
module can generally be present on the
authentication stack of any service where the application calls
.BR pam_sm_authenticate (3PAM)
and an authentication token (in the
preceding example, the authentication token would be the user's Unix
password) is available for use as a Kerberos V5 password.

.LP
.B Example 2
Sample Entries from
.BR kadm5.acl
.sp
.LP
The following entries from
.BR kadm5.acl (4)
permit or deny privileges to
the host client service principal:

.sp
.in +2
.nf
host/*@ACME.COM U root
host/*@ACME.COM ui *
.fi
.in -2

.sp
.LP
The preceding entries permit the
.B "pam_krb5_migrate add"
privilege
to the host client service principal of any machine in the
.BR ACME.COM
KerberosV5 realm, but denies the
.B add
privilege to all host service
principals for addition of the root user account.

.LP
.B Example 3
Sample Entries in
.B pam.conf
of the Master KDC
.sp
.LP
The entries below enable
.BR kadmind "(1M) on the master KDC to use the"
.B k5migrate
PAM service in order to validate Unix user passwords for
accounts that require migration to the Kerberos realm.

.sp
.in +2
.nf
k5migrate        auth    required        pam_unix_auth.so.1
k5migrate        account required        pam_unix_account.so.1
.fi
.in -2

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for a description of the following attribute:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
\fBATTRIBUTE TYPE\fR\fBATTRIBUTE VALUE\fR
_
Interface StabilityEvolving
.TE

.SH SEE ALSO
.sp
.LP
.BR kadmind (1M),
.BR syslog (3C),
.BR pam_authenticate (3PAM),
.BR pam_acct_mgmt (3PAM),
.BR pam_sm_authenticate (3PAM),
.BR kadm5.acl (4),
.BR pam.conf (4),
.BR attributes (5),
.BR pam_authtok_get (5),
.BR pam_krb5 (5)
