usr/src/man/man5/pam_passwd_auth.5
'\" te
.\" Copyright (C) 2002, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH pam_passwd_auth 5 "10 Aug 2002" "SunOS 5.11" "Standards, Environments, and Macros"
.SH NAME
pam_passwd_auth \- authentication module for password
.SH SYNOPSIS
.LP
.nf
\fBpam_passwd_auth.so.1\fR
.fi

.SH DESCRIPTION
.sp
.LP
.B pam_passwd_auth
provides authentication functionality to the password
service as implemented by
.BR passwd (1).
It differs from the standard
.B PAM
authentication modules in its prompting behavior. It should be the
first module on the password service authentication stack.
.sp
.LP
The name of the user whose password attributes are to be updated must be
present in the
.B PAM_USER
item. This can be accomplished due to a
previous call to
.BR pam_start "(3PAM), or explicitly set by"
.BR pam_set_item (3PAM).
Based on the current user-id and the repository
that is to by updated, the module determines whether a password is necessary
for a successful update of the password repository, and if so, which
password is required.
.sp
.LP
The following options can be passed to the module:
.sp
.ne 2
.mk
.na
.B debug
.ad
.RS 17n
.rt
.BR syslog (3C)
debugging information at the
.B LOG_DEBUG
level
.RE

.sp
.ne 2
.mk
.na
.B nowarn
.ad
.RS 17n
.rt
Turn off warning messages
.RE

.sp
.ne 2
.mk
.na
.B server_policy
.ad
.RS 17n
.rt
If the account authority for the user, as specified by
.BR PAM_USER ,
is a
server, do not apply the Unix policy from the passwd entry in the name
service switch.
.RE

.SH ERRORS
.sp
.LP
The following error codes are returned:
.sp
.ne 2
.mk
.na
.B PAM_BUF_ERR
.ad
.RS 18n
.rt
Memory buffer error
.RE

.sp
.ne 2
.mk
.na
.B PAM_IGNORE
.ad
.RS 18n
.rt
Ignore module, not participating in result
.RE

.sp
.ne 2
.mk
.na
.B PAM_SUCCESS
.ad
.RS 18n
.rt
Successfully obtains authentication token
.RE

.sp
.ne 2
.mk
.na
.B PAM_SYSTEM_ERR
.ad
.RS 18n
.rt
System error
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityEvolving
_
MT LevelMT-Safe with exceptions
.TE

.SH SEE ALSO
.sp
.LP
.BR passwd (1),
.BR pam (3PAM),
.BR pam_authenticate (3PAM),
.BR pam_start (3PAM),
.BR pam_set_item (3PAM),
.BR syslog (3C),
.BR libpam (3LIB),
.BR pam.conf (4),
.BR attributes (5),
.BR pam_authtok_check (5),
.BR pam_authtok_get (5),
.BR pam_authtok_store (5),
.BR pam_dhkeys (5),
.BR pam_unix_account (5),
.BR pam_unix_auth (5),
.BR pam_unix_session (5)
.SH NOTES
.sp
.LP
The interfaces in
.BR libpam (3LIB)
are MT-Safe only if each thread within
the multi-threaded application uses its own PAM handle.
.sp
.LP
This module relies on the value of the current real
.BR UID ,
this module
is only safe for MT-applications that don't change
.BR UID s
during the
call to
.BR pam_authenticate (3PAM).
.sp
.LP
The
.BR pam_unix (5)
module is no longer supported. Similar functionality
is provided by
.BR pam_authtok_check (5),
.BR pam_authtok_get (5),
.BR pam_authtok_store (5),
.BR pam_dhkeys (5),
.BR pam_passwd_auth (5),
.BR pam_unix_account (5),
.BR pam_unix_auth (5),
and
.BR pam_unix_session (5).
