usr/src/man/man5/pam_smb_passwd.5
'\" te
.\" Copyright (c) 2008, Sun Microsystems, Inc. All Rights Reserved.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH pam_smb_passwd 5 "29 Apr 2008" "SunOS 5.11" "Standards, Environments, and Macros"
.SH NAME
pam_smb_passwd \- SMB password management module
.SH SYNOPSIS
.LP
.nf
\fBpam_smb_passwd.so.1\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B pam_smb_passwd
module enhances the PAM password management stack.
This functionality supports the changing or adding of SMB passwords for
local Solaris users. The Solaris CIFS server uses SMB passwords to
authenticate connected Solaris users. This module includes the
.BR pam_sm_chauthtok (3PAM)
function.
.sp
.LP
The
.B pam_sm_chauthtok()
function accepts the following flags:
.sp
.ne 2
.mk
.na
.B PAM_PRELIM_CHECK
.ad
.sp .6
.RS 4n
Always returns
.BR PAM_IGNORE .
.RE

.sp
.ne 2
.mk
.na
.B PAM_SILENT
.ad
.sp .6
.RS 4n
Suppresses messages.
.RE

.sp
.ne 2
.mk
.na
.B PAM_UPDATE_AUTHTOK
.ad
.sp .6
.RS 4n
Updates or creates a new \fBCIFS\fR local \fBLM\fR/\fBNTLM\fR hash for the
user that is specified in
.B PAM_USER
by using the authentication
information found in
.BR PAM_AUTHTOK .
The
.B LM
hash is only created if
the
.B smbd/lmauth_level
property value of the
.B smb/server
service
is set to 3 or less.
.B PAM_IGNORE
is returned if the user is not in the
local
.B /etc/passwd
repository.
.RE

.sp
.LP
The following options can be passed to the
.B pam_smb_passwd
module:
.sp
.ne 2
.mk
.na
.B debug
.ad
.sp .6
.RS 4n
Produces \fBsyslog\fR(3C) debugging information at the
.B LOG_AUTH
or
.B LOG_DEBUG
level.
.RE

.sp
.ne 2
.mk
.na
.B nowarn
.ad
.sp .6
.RS 4n
Suppresses warning messages.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B /var/smb/smbpasswd
.ad
.sp .6
.RS 4n
Stores SMB passwords for Solaris users.
.RE

.SH ERRORS
.sp
.LP
Upon successful completion of
.BR pam_sm_chauthtok() ,
.B PAM_SUCCESS
is returned. The following error codes are returned upon error:
.sp
.ne 2
.mk
.na
.B PAM_AUTHTOK_ERR
.ad
.sp .6
.RS 4n
Authentication token manipulation error
.RE

.sp
.ne 2
.mk
.na
.B PAM_AUTHTOK_LOCK_BUSY
.ad
.sp .6
.RS 4n
.B SMB
password file is locked
.RE

.sp
.ne 2
.mk
.na
.B PAM_PERM_DENIED
.ad
.sp .6
.RS 4n
Permissions are insufficient for accessing the
.B SMB
password file
.RE

.sp
.ne 2
.mk
.na
.B PAM_SYSTEM_ERR
.ad
.sp .6
.RS 4n
System error
.RE

.sp
.ne 2
.mk
.na
.B PAM_USER_UNKNOWN
.ad
.sp .6
.RS 4n
User is unknown
.RE

.SH ATTRIBUTES
.sp
.LP
See the
.BR attributes (5)
man page for descriptions of the following
attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityCommitted
_
MT LevelMT-Safe with exceptions
.TE

.SH SEE ALSO
.sp
.LP
.BR smbd (1M),
.BR syslog (3C),
.BR libpam (3LIB),
.BR pam (3PAM),
.BR pam_chauthtok (3PAM),
.BR pam_sm (3PAM),
.BR pam_sm_chauthtok (3PAM),
.BR pam.conf (4),
.BR attributes (5)
.SH NOTES
.sp
.LP
The interfaces in \fBlibpam\fR(3LIB) are MT-Safe \fBonly\fR if each thread
within the multi-threaded application uses its own PAM handle.
.sp
.LP
The
.B pam_smb_passwd.so.1
module should be stacked following all
password qualification modules in the
.B PAM
password stack.
