usr/src/man/man5/pam_list.5
'\" te
.\" Copyright (c) 2009, Sun Microsystems, Inc. All Rights Reserved.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH pam_list 5 "26 Mar 2009" "SunOS 5.11" "Standards, Environments, and Macros"
.SH NAME
pam_list \- PAM account management module for UNIX
.SH SYNOPSIS
.LP
.nf
 pam_list.so.1
.fi

.SH DESCRIPTION
.sp
.LP
The \fBpam_list\fR module implements \fBpam_sm_acct_mgmt\fR(3PAM), which
provides functionality to the PAM account management stack.  The module
provides functions to validate  that  the  user's account  is  valid on this
host based on a list of users and/or netgroups in the given file. The users
and netgroups are separated by newline character. Netgroups are specified
with character '@' as prefix before name of netgroup in the list. The
maximum line lenght is 1023 characters.
.sp
.LP
The username is the value of \fBPAM_USER\fR. The host is the value of
\fBPAM_RHOST\fR or, if \fBPAM_RHOST\fR is not set, the value of the
localhost as returned by \fBgethostname\fR(3C) is used.
.sp
.LP
If neither of the \fBallow\fR, \fBdeny\fR, or \fBcompat\fR options are
specified, the module will look for +/- entries in the local
\fB/etc/passwd\fR file.  If this style is used, \fBnsswitch.conf\fR(4) must
not be configured with \fBcompat\fR for the \fBpasswd\fR database. If no
relevant +/- entry exists for the user, \fBpam_list\fR is not participating
in result.
.sp
.LP
If \fBcompat\fR option is specified then the module will look for +/-
entries in the local \fB/etc/passwd\fR file. Other entries in this file will
be counted as + entries. If no relevant entry exits for the user,
\fBpam_list\fR will deny the access.
.sp
.LP
The following options can be passed to the module:
.sp
.ne 2
.mk
.na
\fBallow=\fR
.ad
.RS 19n
.rt
The full pathname to a file of allowed users and/or netgroups. Only one of
\fBallow=\fR or \fBdeny=\fR can be specified.
.RE

.sp
.ne 2
.mk
.na
\fBcompat\fR
.ad
.RS 19n
.rt
Activate \fBcompat\fR mode.
.RE

.sp
.ne 2
.mk
.na
\fBdeny=\fR
.ad
.RS 19n
.rt
The full pathname to a file of denied users and/or netgroups. Only one of
\fBdeny=\fR or \fBallow=\fR can be specified.
.RE

.sp
.ne 2
.mk
.na
\fBdebug\fR
.ad
.RS 19n
.rt
Provide \fBsyslog\fR(3C) debugging information at the \fBLOG_AUTH\fR |
\fBLOG_DEBUG\fR level.
.RE

.sp
.ne 2
.mk
.na
\fBuser\fR
.ad
.RS 19n
.rt
The module should only perform netgroup matches on the username. This is
the default option.
.RE

.sp
.ne 2
.mk
.na
\fBnouser\fR
.ad
.RS 19n
.rt
The username should not be used in the netgroup match.
.RE

.sp
.ne 2
.mk
.na
\fBhost\fR
.ad
.RS 19n
.rt
Only the host should be used in netgroup matches.
.RE

.sp
.ne 2
.mk
.na
\fBnohost\fR
.ad
.RS 19n
.rt
The hostname should not be used in netgroup matches.
.RE

.sp
.ne 2
.mk
.na
\fBuser_host_exact\fR
.ad
.RS 19n
.rt
The user and hostname must be in the same netgroup.
.RE

.SH ERRORS
.sp
.LP
The following error values are returned:
.sp
.ne 2
.mk
.na
\fBPAM_SERVICE_ERR\fR
.ad
.RS 20n
.rt
An invalid set of module options was given in the \fBpam.conf\fR(4) for
this module, or the \fBuser/netgroup\fR file could not be opened.
.RE

.sp
.ne 2
.mk
.na
\fBPAM_BUF_ERR\fR
.ad
.RS 20n
.rt
A memory buffer error occurred.
.RE

.sp
.ne 2
.mk
.na
\fBPAM_IGNORE\fR
.ad
.RS 20n
.rt
The module is ignored, as it is not participating in the result.
.RE

.sp
.ne 2
.mk
.na
\fBPAM_PERM_DENIED\fR
.ad
.RS 20n
.rt
The user is not on the allow list or is on the deny list.
.RE

.sp
.ne 2
.mk
.na
\fBPAM_SUCCESS\fR
.ad
.RS 20n
.rt
The account is valid for use at this time.
.RE

.sp
.ne 2
.mk
.na
\fBPAM_USER_UNKNOWN\fR
.ad
.RS 20n
.rt
No account is present for the user
.RE

.SH EXAMPLES
.LP
\fBExample 1 \fRUsing \fBpam_list\fR in default mode
.sp
.LP
\fB/etc/pam.conf\fR modification looks like:

.sp
.in +2
.nf
other   account requisite       pam_roles.so.1
other   account required        pam_unix_account.so.1
other   account required        pam_list.so.1
.fi
.in -2

.sp
.LP
In the case of \fBdefault\fR mode or \fBcompat\fR mode, the important lines
in \fB/etc/passwd\fR appear as follows:

.sp
.in +2
.nf
+loginname	- user is approved
-loginname	- user is disapproved
+@netgroup	- netgroup members are approved
-@netgroup	- netgroup members are disapproved
.fi
.in -2

.LP
\fBExample 2 \fRUsing \fBpam_list\fR with allow file
.sp
.LP
\fB/etc/pam.conf\fR modification looks like:

.sp
.in +2
.nf
other   account requisite       pam_roles.so.1
other   account required        pam_unix_account.so.1
other   account required        pam_list.so.1 allow=etc/user.allow
.fi
.in -2

.sp
.LP
\fB/etc/users.allow\fR contains:
.sp
.in +2
.nf
root
localloginname
remoteloginname
@netgroup
.fi
.in -2

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityCommitted
_
MT-LevelMT-Safe with exceptions
.TE

.sp
.LP
The interfaces in \fBlibpam\fR(3LIB) are MT-Safe only if each thread within
the multithreaded application uses its own PAM handle.
.SH SEE ALSO
.sp
.LP
\fBpam\fR(3PAM), \fBpam_authenticate\fR(3PAM),
\fBpam_sm_acct_mgmt\fR(3PAM), \fBsyslog\fR(3C), \fBlibpam\fR(3LIB),
\fBnsswitch.conf\fR(4), \fBpam.conf\fR(4), \fBattributes\fR(5)
