usr/src/man/man5/pam_smartcard.5
'\" te
.\" Copyright (C) 2002, Sun Microsystems, Inc. All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH pam_smartcard 5 "24 Oct 2002" "SunOS 5.11" "Standards, Environments, and Macros"
.SH NAME
pam_smartcard \- PAM authentication module for Smart Card
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/security/pam_smartcard.so\fR
.fi

.SH DESCRIPTION
.sp
.LP
The Smart Card service module for PAM,
.BR /usr/lib/security/pam_smartcard.so ,
provides functionality to obtain a
user's information (such as user name and password) for a smart card. The
\fBpam_smartcard.so\fR module is a shared object that can be dynamically
loaded to provide the necessary functionality upon demand. Its path is
specified in the PAM configuration file
.BR pam.conf .
See
.BR pam.conf (4).
.SS "Smart Card Authentication Module"
.sp
.LP
The Smart Card authentication component provides the
.BR pam_sm_authenticate (3PAM)
function to verify the identity of a smart
card user.
.sp
.LP
The
.B pam_sm_authenticate()
function collects as user input the PIN
number. It passes this data back to its underlying layer, OCF, to perform
PIN verification. If verification is successful, the module returns
.BR PAM_SUCCESS ,
and passes the username and password from the smart card
to PAM modules stacked below.\fBpam_smartcard\fR.
.sp
.LP
The following options can be passed to the Smart Card service module:
.sp
.ne 2
.mk
.na
.B debug
.ad
.RS 11n
.rt
.BR syslog (3C)
debugging information at
.B LOG_DEBUG
level.
.RE

.sp
.ne 2
.mk
.na
.B nowarn
.ad
.RS 11n
.rt
Turn off warning messages.
.RE

.sp
.ne 2
.mk
.na
.B verbose
.ad
.RS 11n
.rt
Turn on verbose authentication failure reporting to the user.
.RE

.SS "Smart Card Module Configuration"
.sp
.LP
The PAM smart card module (\fBpam_smartcard\fR) can be configured in the
PAM configuration file (\fB/etc/pam.conf\fR).  For example, the following
configuration on on the desktop (Common Desktop Environment) forces a user
to use a smart card for logging in.
.sp
.LP
The following are typical values set by '\fBsmartcard -c enable\fR',
if the command is applied to the default configuration.
.sp
.in +2
.nf
dtlogin         auth requisite          pam_smartcard.so.1
dtlogin         auth required           pam_authtok_get.so.1
dtlogin         auth required           pam_dhkeys.so.1

dtsession       auth requisite          pam_smartcard.so.1
dtsession       auth required           pam_authtok_get.so.1
dtsession       auth required           pam_dhkeys.so.1
.fi
.in -2

.SH SEE ALSO
.sp
.LP
.BR smartcard (1M),
.BR libpam (3LIB),
.BR pam (3PAM),
.BR pam_authenticate (3PAM),
.BR pam_start (3PAM),
.BR pam.conf (4),
.BR pam_authtok_check (5),
.BR pam_authtok_get (5),
.BR pam_authtok_store (5),
.BR pam_dhkeys (5),
.BR pam_passwd_auth (5),
.BR pam_unix_account (5),
.BR pam_unix_auth (5),
.BR pam_unix_session (5)
.SH NOTES
.sp
.LP
The
.BR pam_unix (5)
module is no longer supported. Similar functionality
is provided by
.BR pam_authtok_check (5),
.BR pam_authtok_get (5),
.BR pam_authtok_store (5),
.BR pam_dhkeys (5),
.BR pam_passwd_auth (5),
.BR pam_unix_account (5),
.BR pam_unix_auth (5),
and
.BR pam_unix_session (5).
