usr/src/man/man5/pam_tsol_account.5
'\" te
.\" Copyright (c) 2007, Sun Microsystems, Inc. All Rights Reserved.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH pam_tsol_account 5 "20 Jul 2007" "SunOS 5.11" "Standards, Environments, and Macros"
.SH NAME
pam_tsol_account \- PAM account management module for Trusted Extensions
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/security/pam_tsol_account.so.1\fR
.fi

.SH DESCRIPTION
.sp
.LP
The Solaris Trusted Extensions service module for
.BR PAM ,
.BR /usr/lib/security/pam_tsol_account.so.1 ,
checks account limitations
that are related to labels. The
.B pam_tsol_account.so.1
module is a
shared object that can be dynamically loaded to provide the necessary
functionality upon demand. Its path is specified in the \fBPAM\fR
configuration file.
.sp
.LP
\fBpam_tsol_account.so.1\fR contains a function to perform account
management,
.BR pam_sm_acct_mgmt() .
The function checks for the allowed
label range for the user.  The allowable label range is set by the defaults
in the
.BR label_encodings (4)
file. These defaults can be overridden by
entries in the
.BR user_attr (4)
database.
.sp
.LP
By default, this module requires that remote hosts connecting to the
global zone must have a CIPSO host type. To disable this policy, add the
\fBallow_unlabeled\fR keyword as an option to the entry in
\fBpam.conf\fR(4), as in:
.sp
.in +2
.nf
other  account required    pam_tsol_account allow_unlabeled
.fi
.in -2
.sp

.SH OPTIONS
.sp
.LP
The following options can be passed to the module:
.sp
.ne 2
.mk
.na
.B allow_unlabeled
.ad
.RS 19n
.rt
Allows remote connections from hosts with unlabeled template types.
.RE

.sp
.ne 2
.mk
.na
.B debug
.ad
.RS 19n
.rt
Provides debugging information at the
.B LOG_DEBUG
level. See
.BR syslog (3C).
.RE

.SH RETURN VALUES
.sp
.LP
The following values are returned:
.sp
.ne 2
.mk
.na
.B PAM_SUCCESS
.ad
.RS 19n
.rt
The account is valid for use at this time and label.
.RE

.sp
.ne 2
.mk
.na
.B PAM_PERM_DENIED
.ad
.RS 19n
.rt
The current process label is outside the user's label range, or the label
information for the process is unavailable, or the remote host type is not
valid.
.RE

.sp
.ne 2
.mk
.na
.B Other values
.ad
.RS 19n
.rt
Returns an error code that is consistent with typical PAM operations. For
information on error-related return values, see the
.BR pam (3PAM)
man
page.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for description of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityCommitted
_
MT LevelMT-Safe with exceptions
.TE

.sp
.LP
The interfaces in \fBlibpam\fR(3LIB) are MT-Safe only if each thread within
the multi-threaded application uses its own PAM handle.
.SH SEE ALSO
.sp
.LP
.BR keylogin (1),
.BR libpam (3LIB),
.BR pam (3PAM),
.BR pam_sm_acct_mgmt (3PAM),
.BR pam_start (3PAM),
.BR syslog (3C),
.BR label_encodings (4),
.BR pam.conf (4),
.BR user_attr (4),
.BR attributes (5)
.sp
.LP
Chapter 17,
.I "Using PAM,"
in \fISystem Administration Guide: Security
Services\fR
.SH NOTES
.sp
.LP
The functionality described on this manual page is available only if the
system is configured with Trusted Extensions.
