usr/src/man/man5/pam_authtok_check.5
'\" te
.\" Copyright (C) 2003, Sun Microsystems, Inc.
.\" All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH pam_authtok_check 5 "1 Mar 2005" "SunOS 5.11" "Standards, Environments, and Macros"
.SH NAME
pam_authtok_check \- authentication and password management module
.SH SYNOPSIS
.LP
.nf
\fBpam_authtok_check.so.1\fR
.fi

.SH DESCRIPTION
.sp
.LP
\fBpam_authtok_check\fR provides functionality to the Password Management stack.
The implementation of
.B pam_sm_chauthtok()
performs a number of checks on the
construction of the newly entered password.
.B pam_sm_chauthtok()
is invoked
twice by the PAM framework, once with flags set to
.BR PAM_PRELIM_CHECK ,
and
once with flags set to
.BR PAM_UPDATE_AUTHTOK .
This module only performs its
checks during the first invocation. This module expects the current
authentication token in the
.B PAM_OLDAUTHTOK
item, the new (to be checked)
password in the
.B PAM_AUTHTOK
.RB "item, and the login name in the" " PAM_USER"
item. The checks performed by this module are:
.sp
.ne 2
.mk
.na
.B length
.ad
.RS 20n
.rt
The password length should not be less that the minimum specified in
\fB/etc/default/passwd\fR.
.RE

.sp
.ne 2
.mk
.na
\fBcircular shift\fR
.ad
.RS 20n
.rt
The password should not be a circular shift of the login name. This check may be
disabled in \fB/etc/default/passwd\fR.
.RE

.sp
.ne 2
.mk
.na
.B complexity
.ad
.RS 20n
.rt
The password should contain at least the minimum number of characters described
by the parameters
.BR MINALPHA ,
.BR MINNONALPHA ,
.BR MINDIGIT ,
and
.BR MINSPECIAL .
Note that
.B MINNONALPHA
describes the same character
classes as
.B MINDIGIT
and
.B MINSPECIAL
combined; therefore the user
cannot specify both
.B MINNONALPHA
and
.B MINSPECIAL
(or \fBMINDIGIT\fR).
The user must choose which of the two options to use. Furthermore, the
\fBWHITESPACE\fR parameter determines whether whitespace characters are allowed.
If unspecified
.B MINALPHA
is 2,
.B MINNONALPHA
is 1 and
.BR WHITESPACE
is yes
.RE

.sp
.ne 2
.mk
.na
.B variation
.ad
.RS 20n
.rt
The old and new passwords must differ by at least the
.B MINDIFF
value
specified in
.BR /etc/default/passwd .
If unspecified, the default is 3. For
accounts in name services which support password history checking, if prior
history is defined, the new password must not match the prior passwords.
.RE

.sp
.ne 2
.mk
.na
.B dictionary check
.ad
.RS 20n
.rt
The password must not be based on a dictionary word. The list of words to be
used for the site's dictionary can be specified with
.BR DICTIONLIST .
It should
contain a comma-separated list of filenames, one word per line. The database that
is created from these files is stored in the directory named by
\fBDICTIONDBDIR\fR (defaults to
.BR /var/passwd ).
See \fBmkpwdict\fR(1M) for
information on pre-generating the database. If neither
.B DICTIONLIST
nor
\fBDICTIONDBDIR\fR is specified, no dictionary check is made.
.RE

.sp
.ne 2
.mk
.na
.B upper/lower case
.ad
.RS 20n
.rt
The password must contain at least the minimum of upper- and lower-case letters
specified by the
.B MINUPPER
and
.B MINLOWER
values in
\fB/etc/default/passwd\fR. If unspecified, the defaults are 0.
.RE

.sp
.ne 2
.mk
.na
.B maximum repeats
.ad
.RS 20n
.rt
The password must not contain more consecutively repeating characters than
specified by the
.B MAXREPEATS
value in
.BR /etc/default/passwd .
If
unspecified, no repeat character check is made.
.RE

.sp
.LP
The following option may be passed to the module:
.sp
.ne 2
.mk
.na
\fBforce_check\fR
.ad
.RS 15n
.rt
If the
.B PAM_NO_AUTHTOK_CHECK
flag set, \fBforce_check\fR ignores this flag.
The
.B PAM_NO_AUTHTOK_CHECK
flag can be set to bypass password checks (see
.BR pam_chauthtok (3PAM)).
.RE

.sp
.ne 2
.mk
.na
.B debug
.ad
.RS 15n
.rt
.BR syslog (3C)
debugging information at the
.B LOG_DEBUG
level
.RE

.SH RETURN VALUES
.sp
.LP
If the password in
.B PAM_AUTHTOK
passes all tests,
.B PAM_SUCCESS
is
returned. If any of the tests fail,
.B PAM_AUTHTOK_ERR
is returned.
.SH FILES
.sp
.ne 2
.mk
.na
\fB/etc/default/passwd\fR
.ad
.RS 23n
.rt
See
.BR passwd (1)
for a description of the contents.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityEvolving
_
MT LevelMT-Safe with exceptions
.TE

.SH SEE ALSO
.sp
.LP
.BR passwd (1),
.BR pam (3PAM),
.BR mkpwdict (1M),
.BR pam_chauthtok (3PAM),
.BR syslog (3C),
.BR libpam (3LIB),
\fBpam.conf\fR(4), \fBpasswd\fR(4),
.BR shadow (4),
.BR attributes (5),
.BR pam_authtok_get (5),
.BR pam_authtok_store (5),
.BR pam_dhkeys (5),
.BR pam_passwd_auth (5),
.BR pam_unix_account (5),
.BR pam_unix_auth (5),
.BR pam_unix_session (5)
.SH NOTES
.sp
.LP
The interfaces in \fBlibpam\fR(3LIB) are MT-Safe only if each thread within the
multi-threaded application uses its own
.B PAM
handle.
.sp
.LP
The
.BR pam_unix (5)
module is no longer supported. Similar functionality is
provided by
.BR pam_authtok_check (5),
.BR pam_authtok_get (5),
.BR pam_authtok_store (5),
.BR pam_dhkeys (5),
.BR pam_passwd_auth (5),
.BR pam_unix_account (5),
.BR pam_unix_auth (5),
and
.BR pam_unix_session (5).
