usr/src/man/man5/pam_rhosts_auth.5
'\" te
.\" Copyright (c) 1995, Sun Microsystems, Inc.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\"   All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH pam_rhosts_auth 5 "28 Oct 1996" "SunOS 5.11" "Standards, Environments, and Macros"
.SH NAME
pam_rhosts_auth \- authentication management PAM module using ruserok()
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/security/pam_rhosts_auth.so.1\fR
.fi

.SH DESCRIPTION
.sp
.LP
The rhosts
.B PAM
module,
.BR /usr/lib/security/pam_rhosts_auth.so.1 ,
authenticates a user via the
.B rlogin
authentication protocol. Only
.B pam_sm_authenticate()
is
implemented within this module.
.B pam_sm_authenticate()
uses the
.BR ruserok (3SOCKET)
library function to authenticate the
.B rlogin
or
.B rsh
user.
.B pam_sm_setcred()
is a null function.
.sp
.LP
.B /usr/lib/security/pam_rhosts_auth.so.1
is designed to be stacked on
top of the
.B /usr/lib/security/pam_unix.so.1
module for both the
.B rlogin
and
.B rsh
services. This module is normally configured as
.I sufficient
so that subsequent authentication is performed only on
failure of
.BR pam_sm_authenticate() .
The following option may be passed
in to this service module:
.sp
.ne 2
.mk
.na
.B debug
.ad
.RS 10n
.rt
.BR syslog (3C)
debugging information at
.B LOG_DEBUG
level.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
lw(2.75i) lw(2.75i)
lw(2.75i) lw(2.75i)
.
\fBATTRIBUTE TYPE\fR\fBATTRIBUTE VALUE\fR
MT LevelMT-Safe with exceptions
.TE

.SH SEE ALSO
.sp
.LP
.BR pam (3PAM),
.BR pam_authenticate (3PAM),
.BR ruserok (3SOCKET),
.BR syslog (3C),
.BR libpam (3LIB),
.BR pam.conf (4),
.BR attributes (5)

.SH NOTES
.sp
.LP
The interfaces in
.B libpam()
are MT-Safe only if each thread within
the multi-threaded application uses its own
.B PAM
handle.
