usr/src/man/man5/pam_authtok_store.5
'\" te
.\" Copyright (C) 2002, Sun Microsystems, Inc.
.\" All Rights Reserved.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH pam_authtok_store 5 "26 Jan 2004" "SunOS 5.11" "Standards, Environments, and Macros"
.SH NAME
pam_authtok_store \- password management module
.SH SYNOPSIS
.LP
.nf
\fBpam_authtok_store.so.1\fR
.fi

.SH DESCRIPTION
.sp
.LP
\fBpam_authtok_store\fR provides functionality to the PAM password management
stack. It provides one function:
.BR pam_sm_chauthtok() .
.sp
.LP
When invoked with flags set to
.BR PAM_UPDATE_AUTHTOK ,
this module updates
the authentication token for the user specified by
.BR PAM_USER .
.sp
.LP
The authentication token
.B PAM_OLDAUTHTOK
can be used to authenticate the
user against repositories that need updating (\fBNIS\fR,
.BR LDAP ).
After
successful updates, the new authentication token stored in \fBPAM_AUTHTOK\fR
is the user's valid password.
.sp
.LP
This module honors the
.B PAM_REPOSITORY
item, which, if set, specifies
which repository is to be updated. If
.B PAM_REPOSITORY
is unset, it
follows the
.BR nsswitch.conf (4).
.sp
.LP
The following option can be passed to the module:
.sp
.ne 2
.mk
.na
.B debug
.ad
.RS 17n
.rt
.BR syslog (3C)
debugging information at the
.B LOG_DEBUG
level
.RE

.sp
.ne 2
.mk
.na
.B server_policy
.ad
.RS 17n
.rt
If the account authority for the user, as specified by
.BR PAM_USER ,
is a
server, do not encrypt the authentication token before updating.
.RE

.SH ERRORS
.sp
.ne 2
.mk
.na
.B PAM_SUCCESS
.ad
.RS 18n
.rt
Successfully obtains authentication token
.RE

.sp
.ne 2
.mk
.na
.B PAM_SYSTEM_ERR
.ad
.RS 18n
.rt
Fails to get username, service name, old password or new password, user name
null or empty, or password null.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityEvolving
_
MT LevelMT-Safe with exceptions
.TE

.SH SEE ALSO
.sp
.LP
.BR pam (3PAM),
.BR pam_authenticate (3PAM),
.BR pam_chauthtok (3PAM),
.BR syslog (3C),
.BR libpam (3LIB),
.BR pam.conf (4),
.BR attributes (5),
.BR pam_authtok_check (5),
.BR pam_authtok_get (5),
.BR pam_dhkeys (5),
.BR pam_passwd_auth (5),
.BR pam_unix_account (5),
.BR pam_unix_auth (5),
.BR pam_unix_session (5)
.SH NOTES
.sp
.LP
The interfaces in \fBlibpam\fR(3LIB) are MT-Safe only if each thread within
the multi-threaded application uses its own
.B PAM
handle.
.sp
.LP
The
.BR pam_unix (5)
module is no longer supported. Similar functionality is
provided by
.BR pam_authtok_check (5),
.BR pam_authtok_get (5),
.BR pam_authtok_store (5),
.BR pam_dhkeys (5),
.BR pam_passwd_auth (5),
.BR pam_unix_account (5),
.BR pam_unix_auth (5),
and
.BR pam_unix_session (5).
.sp
.LP
If the
.B PAM_REPOSITORY
\fIitem_type\fR is set and a service module does
not recognize the type, the service module does not process any information,
and returns
.BR PAM_IGNORE .
If the
.B PAM_REPOSITORY
\fIitem_type\fR is
not set, a service module performs its default action.
