usr/src/man/man5/pam_unix_account.5
'\" te
.\" Copyright (C) 2003, Sun Microsystems, Inc.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH pam_unix_account 5 "14 Feb 2005" "SunOS 5.11" "Standards, Environments, and Macros"
.SH NAME
pam_unix_account \- PAM account management module for UNIX
.SH SYNOPSIS
.LP
.nf
\fBpam_unix_account.so.1\fR
.fi

.SH DESCRIPTION
.sp
.LP
.B pam_unix_account
module implements
.BR pam_sm_acct_mgmt() ,
which
provides functionality to the
.B PAM
account management stack. The module
provides functions to validate that the user's account is not locked or
expired and that the user's password does not need to be changed. The module
retrieves account information from the configured databases in
.BR nsswitch.conf (4).
.sp
.LP
The following options can be passed to the module:
.sp
.ne 2
.mk
.na
.B debug
.ad
.RS 17n
.rt
.BR syslog (3C)
debugging information at the
.B LOG_DEBUG
level
.RE

.sp
.ne 2
.mk
.na
.B nowarn
.ad
.RS 17n
.rt
Turn off warning messages
.RE

.sp
.ne 2
.mk
.na
.B server_policy
.ad
.RS 17n
.rt
If the account authority for the user, as specified by
.BR PAM_USER ,
is a
server, do not apply the Unix policy from the passwd entry in the name
service switch.
.RE

.SH ERRORS
.sp
.LP
The following values are returned:
.sp
.ne 2
.mk
.na
.B PAM_UNIX_ACCOUNT
.ad
.RS 24n
.rt
User account has expired
.RE

.sp
.ne 2
.mk
.na
.B PAM_AUTHTOK_EXPIRED
.ad
.RS 24n
.rt
Password expired and no longer usable
.RE

.sp
.ne 2
.mk
.na
.B PAM_BUF_ERR
.ad
.RS 24n
.rt
Memory buffer error
.RE

.sp
.ne 2
.mk
.na
.B PAM_IGNORE
.ad
.RS 24n
.rt
Ignore module, not participating in result
.RE

.sp
.ne 2
.mk
.na
.B PAM_NEW_AUTHTOK_REQD
.ad
.RS 24n
.rt
Obtain new authentication token from the user
.RE

.sp
.ne 2
.mk
.na
.B PAM_PERM_DENIED
.ad
.RS 24n
.rt
The account is locked or has been inactive for too long
.RE

.sp
.ne 2
.mk
.na
.B PAM_SERVICE_ERR
.ad
.RS 24n
.rt
Error in underlying service module
.RE

.sp
.ne 2
.mk
.na
.B PAM_SUCCESS
.ad
.RS 24n
.rt
The account is valid for use at this time
.RE

.sp
.ne 2
.mk
.na
.B PAM_USER_UNKNOWN
.ad
.RS 24n
.rt
No account is present for the user
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityEvolving
_
MT LevelMT-Safe with exceptions
.TE

.SH SEE ALSO
.sp
.LP
.BR pam (3PAM),
.BR pam_authenticate (3PAM),
.BR syslog (3C),
.BR libpam (3LIB),
.BR pam.conf (4),
.BR nsswitch.conf (4),
.BR attributes (5)
.SH NOTES
.sp
.LP
The interfaces in
.BR libpam (3LIB)
are MT-Safe only if each thread within
the multi-threaded application uses its own PAM handle.
.sp
.LP
Attempts to validate locked accounts are logged via
.BR syslog "(3C) to the"
.B LOG_AUTH
facility with a
.B LOG_NOTICE
severity.
