usr/src/man/man5/pam_unix_session.5
'\" te
.\" Copyright (C) 2002, Sun Microsystems, Inc.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH pam_unix_session 5 "9 Sept 2004" "SunOS 5.11" "Standards, Environments, and Macros"
.SH NAME
pam_unix_session \- session management PAM module for UNIX
.SH SYNOPSIS
.LP
.nf
\fBpam_unix_session.so.1\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B pam_unix_session
module implements
.BR pam_sm_open_session (3PAM)
and
.BR pam_sm_close_session (3PAM).
.sp
.LP
.B pam_sm_open_session()
updates the
.B /var/adm/lastlog
file with
the information contained in the
.BR PAM_USER ,
.BR PAM_TTY ,
and
.B PAM_RHOSTS
items.
.BR pam_unix_account (5)
uses this account to
determine the previous time the user logged in.
.sp
.LP
.B pam_sm_close_session()
is a null function.
.sp
.LP
The following options can be passed to the module:
.sp
.ne 2
.mk
.na
.B debug
.ad
.RS 9n
.rt
.BR syslog (3C)
debugging information at the
.B LOG_DEBUG
level
.RE

.SH ERRORS
.sp
.LP
Upon successful completion,
.B PAM_SUCCESS
is returned. The following
error codes are returned upon error:
.sp
.ne 2
.mk
.na
.B PAM_SESSION_ERR
.ad
.RS 20n
.rt
Cannot make or remove the entry for the specified session (PAM_TTY is not
present).
.RE

.sp
.ne 2
.mk
.na
.B PAM_USER_UNKNOWN
.ad
.RS 20n
.rt
No account is present for
.IR user .
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityEvolving
_
MT LevelMT-Safe with exceptions
.TE

.SH SEE ALSO
.sp
.LP
.BR pam (3PAM),
.BR pam_authenticate (3PAM),
.BR syslog (3C),
.BR libpam (3LIB),
.BR pam.conf (4),
.BR nsswitch.conf (4),
.BR attributes (5),
.BR pam_authtok_check (5),
.BR pam_authtok_get (5),
.BR pam_authtok_store (5),
.BR pam_dhkeys (5),
.BR pam_passwd_auth (5),
.BR pam_unix_account\fR(5),\fBpam_unix_auth (5),
.SH NOTES
.sp
.LP
The interfaces in
.BR libpam (3LIB)
are MT-Safe only if each thread within
the multi-threaded application uses its own PAM handle.
.sp
.LP
The
.BR pam_unix (5)
module is no longer supported. Similar functionality
is provided by
.BR pam_authtok_check (5),
.BR pam_authtok_get (5),
.BR pam_authtok_store (5),
.BR pam_dhkeys (5),
.BR pam_passwd_auth (5),
.BR pam_unix_account (5),
.BR pam_unix_auth (5),
and
.BR pam_unix_session (5).
