usr/src/man/man5/pam_roles.5
'\" te
.\" Copyright (C) 2007, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH pam_roles 5 "6 Mar 2007" "SunOS 5.11" "Standards, Environments, and Macros"
.SH NAME
pam_roles \- Solaris Roles account management module
.SH SYNOPSIS
.LP
.nf
pam_roles.so.1
.fi

.SH DESCRIPTION
.sp
.LP
The
.B pam_roles
module implements
.BR pam_sm_acct_mgmt "(3PAM). It"
provides functionality to verify that a user is authorized to assume a role.
It also prevents direct logins to a role. The
.BR user_attr (4)
database is
used to determine which users can assume which roles.
.sp
.LP
The
.B PAM
items
.B PAM_USER
and
.BR PAM_AUSER ,
and
.BR PAM_RHOST
are used to determine the outcome of this module.
.B PAM_USER
represents
the new identity being verified.
.BR PAM_AUSER ,
if set, represents the
user asserting a new identity. If
.B PAM_AUSER
is not set, the real user
.B ID
of the calling service implies that the user is asserting a new
identity. Notice that root can never have roles.
.sp
.LP
This module is generally stacked above the
.BR pam_unix_account (5)
module.
.sp
.LP
The following options are interpreted:
.sp
.ne 2
.mk
.na
.B allow_remote
.ad
.RS 16n
.rt
Allows a remote service to specify the user to enter as a role.
.RE

.sp
.ne 2
.mk
.na
.B debug
.ad
.RS 16n
.rt
Provides
.BR syslog (3C)
debugging information at the \fBLOG_DEBUG\fR
level.
.RE

.SH ERRORS
.sp
.LP
The following values are returned:
.sp
.ne 2
.mk
.na
.B PAM_IGNORE
.ad
.RS 20n
.rt
If the type of the new user identity (\fBPAM_USER\fR) is "\fBnormal\fR".
Or, if the type of the new user identity is "\fBrole\fR" and the user
asserting the new identity
.RB ( PAM_AUSER )
has the new identity name in
its list of roles.
.RE

.sp
.ne 2
.mk
.na
.B PAM_USER_UNKNOWN
.ad
.RS 20n
.rt
No account is present for user.
.RE

.sp
.ne 2
.mk
.na
.B PAM_PERM_DENIED
.ad
.RS 20n
.rt
If the type of the new user identity (\fBPAM_USER\fR) is "\fBrole\fR" and
the user asserting the new identity
.RB ( PAM_AUSER )
does not have the new
identity name in its list of roles.
.RE

.SH EXAMPLES
.LP
.B Example 1
Using the
.B pam_roles.so.1
Module
.sp
.LP
The following are sample entries from
.BR pam.conf (4).
These entries
demonstrate the use of the
.B pam_roles.so.1
module:

.sp
.in +2
.nf
cron account required pam_unix_account.so.1
#
other account requisite pam_roles.so.1
other account required pam_unix_account.so.1
#
.fi
.in -2
.sp

.sp
.LP
The
.B cron
service does not invoke
.BR pam_roles.so.1 .
Delayed jobs
are independent of role assumption. All other services verify that roles
cannot directly login. The "\fBsu\fR" service (covered by the "\fBother\fR"
service entry) verifies that if the new user is a role, the calling user is
authorized for that role.

.LP
.B Example 2
Allowing Remote Roles
.sp
.LP
Remote roles should only be allowed from remote services that can be
trusted to provide an accurate
.BR PAM_AUSER name.
This trust is a function
of the protocol (such as
.BR sshd -hostbased).

.sp
.LP
The following is a sample entry for a
.BR pam.conf (4)
file. It
demonstrates the use of
.B pam_roles
configuration for remote roles for
the
.BR sshd "-hostbased service."

.sp
.in +2
.nf
sshd-hostbased account requisite pam_roles.so.1 allow_remote
sshd-hostbased account required pam_unix_account
.fi
.in -2
.sp

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityEvolving
_
MT LevelMT-Safe with exceptions
.TE

.SH SEE ALSO
.sp
.LP
.BR roles (1),
.BR sshd (1M),
.BR su (1M),
.BR libpam (3LIB),
.BR pam (3PAM),
.BR pam_acct_mgmt (3PAM),
.BR pam_setcred (3PAM),
.BR pam_set_item (3PAM),
.BR pam_sm_acct_mgmt (3PAM),
.BR syslog (3C),
.BR pam.conf (4),
.BR user_attr (4),
.BR attributes (5),
.BR pam_authtok_check (5),
.BR pam_authtok_get (5),
.BR pam_authtok_store (5),
.BR pam_dhkeys (5),
.BR pam_passwd_auth (5),
.BR pam_unix_account (5),
.BR pam_unix_auth (5),
.BR pam_unix_session (5)
.SH NOTES
.sp
.LP
The interfaces in
.BR libpam (3LIB)
are MT-Safe only if each thread within
the multi-threaded application uses its own
.B PAM
handle.
.sp
.LP
This module should never be stacked alone. It never returns
.BR PAM_SUCCESS ,
as it never makes a positive decision.
.sp
.LP
The
.B allow_remote
option should only be specified for services that
are trusted to correctly identify the remote user (that is,
.BR sshd -hostbased).
.sp
.LP
.B PAM_AUSER
has replaced
.B PAM_RUSER
whose definition is limited to
.RB "the " rlogin / rsh " untrusted remote user name. See"
.BR pam_set_item (3PAM).
