usr/src/man/man5/pam_smbfs_login.5
'\" te
.\" Copyright (c) 2008, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH pam_smbfs_login 5 "25 Sep 2008" "SunOS 5.11" "Standards, Environments, and Macros"
.SH NAME
pam_smbfs_login \- PAM user credential authentication module for SMB/CIFS
client login
.SH SYNOPSIS
.LP
.nf
pam_smb_cred.so.1
.fi

.SH DESCRIPTION
.sp
.LP
The
.B pam_smbfs_login
module implements
.BR pam_sm_setcred (3PAM)
to
provide functions that act equivalently to the
.BR smbutil (1)
login
command.
.sp
.LP
This optional functionality is meant  to be used only in environments that
do not run Active Directory or Kerberos, but which synchronize passwords
between Solaris clients and their CIFS/SMB servers.
.sp
.LP
This module permits the login password to be stored as if the
.BR smbutil (1)
login command was used to store a password for PAM_USER in
the user or system default  domain. The choice of default domain is the
first of the following:
.br
.in +2
-Domain entry specified in the  default  section of the \fB$HOME/.nsmbrc\fR
file, if readable.
.in -2
.br
.in +2
-Domain entry specified in the default section shown by the sharectl get
smbfs command.
.in -2
.br
.in +2
-String WORKGROUP.
.in -2
.sp
.LP
Because
.B pam_smbfs_login
runs as root during the login process, a
.B $HOME/.nsmbrc
file accessed through NFS may only be readable if the
file permits reads by others. This conflicts with the requirement that
passwords stored in
.B $HOME/.nsmbrc
are ignored when permissions are
open.
.sp
.LP
To use this functionality,  add the following line to the
.B /etc/pam.conf
file:
.sp
.in +2
.nf
login  auth optional    pam_smbfs_login.so.1
.fi
.in -2

.sp
.LP
Authentication service modules must implement both
.BR pam_sm_authenticate (3PAM)
and
.BR pam_sm_setcred "(3PAM). In this"
module,
.BR pam_sm_authenticate (3PAM)
always returns
.BR PAM_IGNORE .
.sp
.LP
The \fBpam_sm_setcred\fR(3PAM) function accepts the following flags:
.sp
.ne 2
.mk
.na
.B PAM_REFRESH_CRED
.ad
.sp .6
.RS 4n
Returns PAM_IGNORE.
.RE

.sp
.ne 2
.mk
.na
.B PAM_SILENT
.ad
.sp .6
.RS 4n
Suppresses messages.
.RE

.sp
.ne 2
.mk
.na
.B PAM_ESTABLISH_CRED
.ad
.br
.na
.B PAM_REINITIALIZE_CRED
.ad
.sp .6
.RS 4n
Stores the authentication token for PAM_USER in the same manner as the
.BR smbutil (1)
login command.
.RE

.sp
.ne 2
.mk
.na
.B PAM_DELETE_CRED
.ad
.sp .6
.RS 4n
Deletes the stored password for PAM_USER in the same manner as the
.BR smbutil (1)
logout command.
.RE

.sp
.LP
The following options can be passed to the
.B pam_smbfs_login
module:
.sp
.ne 2
.mk
.na
.B debug
.ad
.sp .6
.RS 4n
Produces \fBsyslog\fR(3C) debugging information at the LOG_AUTH or
LOG_DEBUG level.
.RE

.sp
.ne 2
.mk
.na
.B nowarn
.ad
.sp .6
.RS 4n
Suppresses warning messages.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B $HOME/.nsmbrc
.ad
.RS 28n
.rt
Find default domain, if present.
.RE

.SH ERRORS
.sp
.LP
Upon successful completion of \fBpam_sm_setcred\fR(3PAM), \fBPAM_SUCCESS\fR
is returned. The  following  error codes are returned upon error:
.sp
.ne 2
.mk
.na
.B PAM_USER_UNKNOWN
.ad
.sp .6
.RS 4n
User is unknown.
.RE

.sp
.ne 2
.mk
.na
.B PAM_AUTHTOK_ERR
.ad
.sp .6
.RS 4n
Password is bad.
.RE

.sp
.ne 2
.mk
.na
.B PAM_AUTH_ERR
.ad
.sp .6
.RS 4n
Domain is bad.
.RE

.sp
.ne 2
.mk
.na
.B PAM_SYSTEM_ERR
.ad
.sp .6
.RS 4n
System error.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attribute:
.sp

.sp
.TS
tab() box;
cw(2.76i) |cw(2.74i)
lw(2.76i) |lw(2.74i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityCommitted
_
MT LevelMT-Safe with exceptions
.TE

.SH SEE ALSO
.sp
.LP
.BR smbutil (1),
.BR syslog (3C),
.BR libpam (3LIB),
.BR pam (3PAM),
.BR pam_setcred (3PAM),
.BR pam_sm (3PAM),
.BR pam_sm_authenticate (3PAM),
.BR pam_sm_chauthtok (3PAM),
.BR pam_sm_setcred (3PAM),
.BR pam.conf (4),
.BR attributes (5),
.BR smbfs (7FS)
.SH NOTES
.sp
.LP
The interfaces in \fBlibpam\fR(3LIB) are MT-Safe only  if each thread
within the multi-threaded application uses its own PAM handle.
