usr/src/man/man5/pam_deny.5
'\" te
.\" Copyright (c) 2005, Sun Microsystems, Inc.  All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH pam_deny 5 "16 Jun 2005" "SunOS 5.11" "Standards, Environments, and Macros"
.SH NAME
pam_deny \- PAM authentication, account, session and password management
PAM module to deny operations
.SH SYNOPSIS
.LP
.nf
\fBpam_deny.so.1\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B pam_deny
module implements all the PAM service module functions
and returns the module type default failure return code for all calls.
.sp
.LP
The following options are interpreted:
.sp
.ne 2
.mk
.na
.B debug
.ad
.RS 9n
.rt
.BR syslog (3C)
debugging information at the
\fBLOG_AUTH\fR|\fBLOG_DEBUG\fR levels
.RE

.SH ERRORS
.sp
.LP
The following error codes are returned:
.sp
.ne 2
.mk
.na
.B PAM_ACCT_EXPIRED
.ad
.RS 20n
.rt
If
.B pam_sm_acct_mgmt
is called.
.RE

.sp
.ne 2
.mk
.na
.B PAM_AUTH_ERR
.ad
.RS 20n
.rt
If
.B pam_sm_authenticate
is called.
.RE

.sp
.ne 2
.mk
.na
.B PAM_AUTHOK_ERR
.ad
.RS 20n
.rt
If
.B pam_sm_chauthtok
is called.
.RE

.sp
.ne 2
.mk
.na
.B PAM_CRED_ERR
.ad
.RS 20n
.rt
If
.B pam_sm_setcred
is called.
.RE

.sp
.ne 2
.mk
.na
.B PAM_SESSION_ERR
.ad
.RS 20n
.rt
If
.B pam_sm_open_session
or
.B pam_sm_close_session
is called.
.RE

.SH EXAMPLES
.LP
\fBExample 1\fR Disallowing ssh none authentication
.sp
.in +2
.nf
 sshd-none      auth       requisite   pam_deny.so.1
 sshd-none      account    requisite   pam_deny.so.1
 sshd-none      session    requisite   pam_deny.so.1
 sshd-none      password   requisite   pam_deny.so.1
.fi
.in -2
.sp

.LP
\fBExample 2\fR Disallowing any service not explicitly defined
.sp
.in +2
.nf
 other          auth       requisite   pam_deny.so.1
 other          account    requisite   pam_deny.so.1
 other          session    requisite   pam_deny.so.1
 other          password   requisite   pam_deny.so.1
.fi
.in -2
.sp

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for a description of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
\fBATTRIBUTE TYPE\fR\fBATTRIBUTE VALUE\fR
_
Interface StabilityEvolving
_
MT LevelMT-Safe with exceptions
.TE

.SH SEE ALSO
.sp
.LP
.BR su (1M),
.BR libpam (3LIB),
.BR pam (3PAM),
.BR pam_sm_authenticate (3PAM),
.BR syslog (3C),
\fBpam.conf\fR(4),
\fBnsswitch.conf\fR(4),
.BR attributes (5),
.BR pam_authtok_check (5),
.BR pam_authtok_get (5),
.BR pam_authtok_store (5),
.BR pam_dhkeys (5),
.BR pam_passwd_auth (5),
.BR pam_unix_account (5),
.BR pam_unix_auth (5),
.BR pam_unix_session (5),
.BR privileges (5)
.SH NOTES
.sp
.LP
The interfaces in \fBlibpam\fR(3LIB) are MT-Safe only if each thread within
the multi-threaded application uses its own PAM handle.
.sp
.LP
The
.B pam_deny
module is intended to deny access to a specified
service. The
.B other
service name may be used to deny access to services
not explicitly specified.
