usr/src/man/man5/pam_authtok_get.5
'\" te
.\" Copyright (C) 2003, Sun Microsystems, Inc. All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH pam_authtok_get 5 "14 Dec 2004" "SunOS 5.11" "Standards, Environments, and Macros"
.SH NAME
pam_authtok_get \- authentication and password management module
.SH SYNOPSIS
.LP
.nf
\fBpam_authtok_get.so.1\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B pam_authtok_get
service module provides password prompting
funtionality to the PAM stack. It implements
.B pam_sm_authenticate()
and
.BR pam_sm_chauthtok() ,
providing functionality to both the Authentication
Stack and the Password Management Stack.
.SS "Authentication Service"
.sp
.LP
The implementation of
.BR pam_sm_authenticate "(3PAM) prompts the user name"
if not set and then tries to get the authentication token from the pam
handle. If the token is not set, it then prompts the user for a password and
stores it in the
.B PAM
item
.BR PAM_AUTHTOK .
This module is meant to
be the first module on an authentication stack where users are to
authenticate using a keyboard.
.SS "Password Management Service"
.sp
.LP
Due to the nature of the PAM Password Management stack traversal mechanism,
the \fBpam_sm_chauthtok\fR(3PAM) function is called twice. Once with the
\fBPAM_PRELIM_CHECK\fR flag, and one with the \fBPAM_UPDATE_AUTHTOK\fR flag.

.sp
.LP
In the first (\fBPRELIM\fR) invocation, the implementation of
.BR pam_sm_chauthtok (3PAM)
moves the contents of the
.BR PAM_AUTHTOK
(current authentication token) to
.BR PAM_OLDAUTHTOK ,
and subsequentially
prompts the user for a new password. This new password is stored in
.BR PAM_AUTHTOK .
.sp
.LP
If a previous module has set
.B PAM_OLDAUTHTOK
prior to the invocation
of pam_authtok_get, this module turns into a
.B NO-OP
and immediately
returns
.BR PAM_SUCCESS .
.sp
.LP
In the second (\fBUPDATE\fR) invocation, the user is prompted to Re-enter
his password. The pam_sm_chauthtok implementation verifies this reentered
password with the password stored in
.BR PAM_AUTHTOK .
If the passwords
match, the module returns
.BR PAM_SUCCESS .
.sp
.LP
The following option can be passed to the module:
.sp
.ne 2
.mk
.na
.B debug
.ad
.RS 9n
.rt
.BR syslog (3C)
debugging information at the
.B LOG_DEBUG
level
.RE

.SH ERRORS
.sp
.LP
The authentication service returns the following error codes:
.sp
.ne 2
.mk
.na
.B PAM_SUCCESS
.ad
.RS 18n
.rt
Successfully obtains authentication token
.RE

.sp
.ne 2
.mk
.na
.B PAM_SYSTEM_ERR
.ad
.RS 18n
.rt
Fails to retrieve username, username is
.B NULL
or empty
.RE

.sp
.LP
The password management service returns the following error codes:
.sp
.ne 2
.mk
.na
.B PAM_SUCCESS
.ad
.RS 19n
.rt
Successfully obtains authentication token
.RE

.sp
.ne 2
.mk
.na
.B PAM_AUTHTOK_ERR
.ad
.RS 19n
.rt
Authentication token manipulation error
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityEvolving
_
MT LevelMT-Safe with exceptions
.TE

.SH SEE ALSO
.sp
.LP
.BR pam (3PAM),
.BR pam_authenticate (3PAM),
.BR syslog (3C),
.BR libpam (3LIB),
\fBpam.conf\fR(4), \fBattributes\fR(5),
.BR pam_authtok_check (5),
pam_authtok_get(5),
.BR pam_authtok_store (5),
.BR pam_dhkeys (5),
.BR pam_passwd_auth (5),
.BR pam_unix_account (5),
.BR pam_unix_auth (5),
.BR pam_unix_session (5)
.SH NOTES
.sp
.LP
The interfaces in \fBlibpam\fR(3LIB) are MT-Safe only if each thread within
the multi-threaded application uses its own PAM handle.
.sp
.LP
The
.BR pam_unix (5)
module is no longer supported. Similar functionality
is provided by
.BR pam_authtok_check (5),
.BR pam_authtok_get (5),
.BR pam_authtok_store (5),
.BR pam_dhkeys (5),
.BR pam_passwd_auth (5),
.BR pam_unix_account (5),
.BR pam_unix_auth (5),
and
.BR pam_unix_session (5).
