usr/src/man/man5/prof.5
'\" te
.\" Copyright 1989 AT&T
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH prof 5 "3 Jul 1990" "SunOS 5.11" "Standards, Environments, and Macros"
.SH NAME
prof \- profile within a function
.SH SYNOPSIS
.LP
.nf
#define MARK
#include <prof.h>

\fBvoid\fR \fBMARK\fR(\fIname\fR);
.fi

.SH DESCRIPTION
.sp
.LP
.B MARK
introduces a mark called
.I name
that is treated the same as
a function entry point.  Execution of the mark adds to a counter for that
mark, and program-counter time spent is accounted to the immediately
preceding mark or to the function if there are no preceding marks within the
active function.
.sp
.LP
.I name
may be any combination of letters, numbers, or underscores.
Each
.I name
in a single compilation must be unique, but may be the same
as any ordinary program symbol.
.sp
.LP
For marks to be effective, the symbol
.B MARK
must be defined before the
header
.B prof.h
is included, either by a  preprocessor directive as in
the synopsis, or by a command line argument:
.sp
.LP
.B cc -p -DMARK work.c
.sp
.LP
If
.B MARK
is not defined, the  \fBMARK(\fIname\fB)\fR statements
may be left in the source files  containing them and are ignored.
.B "prof -g"
must be used to get information on all labels.
.SH EXAMPLES
.sp
.LP
In this example, marks can be used to determine how much time is spent in
each loop. Unless this example is compiled with
.B MARK
defined on the
command line, the marks are ignored.
.sp
.in +2
.nf
#include <prof.h>
work( )
{
        int i, j;
        . . .
        MARK(loop1);
        for (i = 0; i < 2000; i++) {
                . . .
        }
        MARK(loop2);
        for (j = 0; j < 2000; j++) {
                . . .
        }
}
.fi
.in -2

.SH SEE ALSO
.sp
.LP
.BR profil (2),
.BR monitor (3C)
