usr/src/man/man5/smf_security.5
'\" te
.\" Copyright (c) 2009, Sun Microsystems, Inc. All Rights Reserved.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH smf_security 5 "20 May 2009" "SunOS 5.11" "Standards, Environments, and Macros"
.SH NAME
smf_security \- service management facility security behavior
.SH DESCRIPTION
.sp
.LP
The configuration subsystem for the service management facility,
.BR smf (5),
requires privilege to modify the configuration of a service.
Privileges are granted to a user by associating the authorizations described
below to the user through
.BR user_attr (4)
and
.BR prof_attr (4).
See
.BR rbac (5).
.sp
.LP
The following authorization is used to manipulate services and service
instances.
.sp
.ne 2
.mk
.na
.B solaris.smf.modify
.ad
.RS 22n
.rt
Authorized to add, delete, or modify services, service instances, or their
properties, and to read protected property values.
.RE

.SS "Property Group Authorizations"
.sp
.LP
The
.BR smf (5)
configuration subsystem associates properties with each
service and service instance. Related properties are grouped. Groups can
represent an execution method, credential information, application data, or
restarter state. The ability to create or modify property groups can cause
.BR smf (5)
components to perform actions that can require operating system
privilege. Accordingly, the framework requires appropriate authorization to
manipulate property groups.
.sp
.LP
Each property group has a type corresponding to its purpose. The core
property group types are
.BR method ,
.BR dependency ,
.BR application ,
and
.BR framework .
Additional property group types can be introduced,
provided they conform to the extended naming convention in
.BR smf (5).
The
following basic authorizations, however, apply only to the core property
group types:
.sp
.ne 2
.mk
.na
.B solaris.smf.modify.method
.ad
.sp .6
.RS 4n
Authorized to change values or create, delete, or modify a property group
of type
.BR method .
.RE

.sp
.ne 2
.mk
.na
.B solaris.smf.modify.dependency
.ad
.sp .6
.RS 4n
Authorized to change values or create, delete, or modify a property group
of type
.BR dependency .
.RE

.sp
.ne 2
.mk
.na
.B solaris.smf.modify.application
.ad
.sp .6
.RS 4n
Authorized to change values, read protected values, and create, delete, or
modify a property group of type application.
.RE

.sp
.ne 2
.mk
.na
.B solaris.smf.modify.framework
.ad
.sp .6
.RS 4n
Authorized to change values or create, delete, or modify a property group
of type
.BR framework .
.RE

.sp
.ne 2
.mk
.na
.B solaris.smf.modify
.ad
.sp .6
.RS 4n
Authorized to add, delete, or modify services, service instances, or their
properties, and to read protected property values.
.RE

.sp
.LP
Property group-specific authorization can be specified by properties
contained in the property group.
.sp
.ne 2
.mk
.na
.B modify_authorization
.ad
.RS 24n
.rt
Authorizations allow the addition, deletion, or modification of properties
within the property group, and the retrieval of property values from the
property group if protected.
.RE

.sp
.ne 2
.mk
.na
.B value_authorization
.ad
.RS 24n
.rt
Authorizations allow changing the values of any property of the property
group except
.BR modify_authorization ,
and the retrieval of any property
values except modify_authorization from the property group if protected.
.RE

.sp
.ne 2
.mk
.na
.B read_authorization
.ad
.RS 24n
.rt
Authorizations allow the retrieval of property values within the property
group. The presence of a string-valued property with this name identifies
the containing property group as protected. This property has no effect on
property groups of types other than application. See \fBProtected Property
Groups\fR.
.RE

.sp
.LP
The above authorization properties are only used if they have type
.BR astring .
If an instance property group does not have one of the
properties, but the instance's service has a property group of the same name
with the property, its values are used.
.SS "Protected Property Groups"
.sp
.LP
Normally, all property values in the repository can be read by any user
without explicit authorization. Property groups of non-framework types can
be used to store properties with values that require protection. They must
not be revealed except upon proper authorization. A property group's status
as protected is indicated by the presence of a string-valued
.B read_authorization
property. If this property is present, the values
of all properties in the property group is retrievable only as described in
.BR "Property Group Authorizations" .
.sp
.LP
Administrative domains with policies that prohibit backup of data
considered sensitive should exclude the SMF repository databases from their
backups. In the face of such a policy, non-protected property values can be
backed up by using the \fBsvccfg\fR(1M) archive command to create an archive
of the repository without protected property values.
.SS "Service Action Authorization"
.sp
.LP
Certain actions on service instances can result in service interruption or
deactivation. These actions require an authorization to ensure that any
denial of service is a deliberate administrative action. Such actions
include a request for execution of the refresh or restart methods, or
placement of a service instance in the maintenance or other non-operational
state. The following authorization allows such actions to be requested:
.sp
.ne 2
.mk
.na
.B solaris.smf.manage
.ad
.RS 22n
.rt
Authorized to request restart, refresh, or other state modification of any
service instance.
.RE

.sp
.LP
In addition, the
.B general/action_authorization
property can specify
additional authorizations that permit service actions to be requested for
that service instance. The
.B solaris.smf.manage
authorization is
required to modify this property.
.SS "Defined Rights Profiles"
.sp
.LP
Two rights profiles are included that offer grouped authorizations for
manipulating typical
.BR smf (5)
operations.
.sp
.ne 2
.mk
.na
.B Service Management
.ad
.RS 22n
.rt
A service manager can manipulate any service in the repository in any way.
It corresponds to the \fBsolaris.smf.manage\fR and \fBsolaris.smf.modify\fR
authorizations.
.sp
The service management profile is the minimum required to use the
.BR pkgadd (1M)
or \fBpkgrm\fR(1M) commands to add or remove software
packages that contain an inventory of services in its service manifest.
.RE

.sp
.ne 2
.mk
.na
.B Service Operator
.ad
.RS 22n
.rt
A service operator has the ability to enable or disable any service
instance on the system, as well as request that its restart or refresh
method be executed. It corresponds to the
.B solaris.smf.manage
and
.B solaris.smf.modify.framework
authorizations.
.sp
Sites can define additional rights profiles customized to their needs.
.RE

.SS "Remote Repository Modification"
.sp
.LP
Remote repository servers can deny modification attempts due to additional
privilege checks. See NOTES.
.SH SEE ALSO
.sp
.LP
.BR auths (1),
.BR profiles (1),
.BR pkgadd (1M),
.BR pkgrm (1M),
.BR svccfg (1M),
.BR prof_attr (4),
.BR user_attr (4),
.BR rbac (5),
.BR smf (5)
.SH NOTES
.sp
.LP
The present version of
.BR smf (5)
does not support remote repositories.
.sp
.LP
When a service is configured to be started as root but with privileges
different from
.BR limit_privileges ,
the resulting process is privilege
aware. This can be surprising to developers who expect \fBseteuid(<non-zero
UID>)\fR to reduce privileges to basic or less.
