wiedi/schillix-on/usr/src/man/man5/solaris10.5
'\" te
.\" Copyright (c) 2009, Sun Microsystems, Inc. All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH solaris10 5 "18 Oct 2009" "SunOS 5.11" "Standards, Environments, and Macros"
.SH NAME
solaris10 \- Solaris 10 branded zone
.SH DESCRIPTION
.sp
.LP
The
.B solaris10
brand uses the branded zones framework described in
.BR brands (5)
to enable Solaris 10 binary applications to run unmodified
on a machine with the latest Solaris Operating System kernel.
.sp
.LP
The
.B solaris10
brand only supports running the Solaris 10 10/09
(Solaris 10 update 8) release, or later, within the zone.
.sp
.LP
The
.B solaris10
brand includes the tools necessary to install a Solaris
10 system image into a non-global zone. It also supports the tools necessary
to migrate a Solaris 10 native zone to a
.B solaris10
branded zone. The
brand supports the execution of 32-bit and 64-bit Solaris 10 applications on
either SPARC or x86 machines running the latest Solaris operating system.
.SS "Configuration and Administration"
.sp
.LP
The
.B solaris10
brand supports the whole root non-global zone model.
All of the required Solaris 10 software and any additional packages are
installed into the private file systems of the zone.
.sp
.LP
The zone must reside on its own \fBzfs\fR(1M) dataset and only ZFS is
supported. The ZFS dataset created automatically when the zone is installed
or attached. If a ZFS dataset cannot be created, the zone is not installed
or attached.
.sp
.LP
The \fBzonecfg\fR(1M) utility is used to configure a \fBsolaris10\fR
branded zone. The
.B SUNWsolaris10
template can be used when creating the
zone or the configuration can be set up manually. Once a branded zone has
been installed, that zone's brand cannot be changed or removed. The
.BR zoneadm (1M)
utility is used to report the zone's brand type and
administer the zone. The
.BR zlogin (1)
utility is used to log in to the
zone.
.sp
.LP
The support for exclusive IP-stack or delegated ZFS dataset configurations
is currently experimental and has not yet been tested. Support for running
these zones in a para-virtualized xVM domain is experimental and there are
known problems with 64-bit x86 applications within the zone. The
\fB/dev/sound\fR device cannot be configured into the branded zone. In
addition,
.BR mdb (1)
and \fBdtrace\fR(1M) are not fully functional when
used in the global zone to examine processes executing within a
\fBsolaris10\fR branded zone.
.sp
.LP
The
.B solaris10
brand installer supports installing the zone from an
image of an installed Solaris 10 system. This can be a full
\fBflash_archive\fR(4),
.BR cpio (1),
or
.BR pax (1)
\fBxustar\fR archive.
The
.B cpio
archive can be compressed with gzip(1) or bzip2(1). The image
can also be a level 0 \fBufsdump\fR(1M), or a path to the top-level of a
Solaris 10 system's root directory tree. The zone cannot be installed from
standard Solaris 10 distribution media.
.sp
.LP
To migrate a native zone from a Solaris 10 system to the latest Solaris
Operating System kernel, the attach subcommand supports installing the zone
from an archive of an installed Solaris 10 native zone. As with the
installer, this can be a
.BR cpio (1)
or
.BR pax (1)
\fBxustar\fR archive
of the
.BR zonepath .
The
.B cpio
archive can be compressed with gzip(1)
or bzip2(1). The image can also be a path to the top-level of a Solaris 10
zone's
.B zonepath
directory tree. In addition to migrating from a
Solaris 10 native zone, the same migration options can be used when
migrating a
.B solaris10
branded zone from one host to another. When
migrating from Solaris 10, it is possible that the zone is configured as a
\fBsparseroot\fR zone. In this case, the zone should be readied on the host
before the archive is made. This ensures that the inherited directories are
included in the archive.
.SH SUB-COMMANDS
.sp
.LP
The following arguments of \fBzoneadm\fR(1M) brand-specific subcommand are
supported: 
.sp
.ne 2
.mk
.na
\fBattach\fR [\fB-a\fR \fIarchive\fR | \fB-d\fR \fIpath\fR]\fR
.ad
.sp .6
.RS 4n
Attach the specified Solaris 10 native zone  image  into the branded zone.
If neither
.B -a
or
.B -d
is specified, the          zone's
\fBzonepath\fR is  assumed  to  already  be  properly          installed
with the zone's files.
.sp
.ne 2
.mk
.na
\fB-a\fR \fIarchive\fR
.ad
.RS 14n
.rt
The path to a
.BR cpio (1)
or
.BR pax (1)
\fBxustar\fR archive of either
an installed Solaris 10 native zone or a
.B solaris10
branded zone's
.BR zonepath .
\fBcpio\fR archives can be compressed using \fBgzip\fR or
.BR bzip2 .
.RE

.sp
.ne 2
.mk
.na
\fB-d\fR \fIpath\fR
.ad
.RS 14n
.rt
The path to the
.B zonepath
directory of either an installed Solaris 10
native zone or a
.B solaris10
branded zone's \fBzonepath\fR.
.RE

.RE

.sp
.ne 2
.mk
.na
\fBinstall\fR [\fB-a\fR \fIarchive\fR] [\fB-d\fR \fIpath\fR] [\fB-p\fR]
[\fB-s\fR] [\fB-u\fR] [\fB-v\fR]\fR
.ad
.sp .6
.RS 4n
Install the specified Solaris 10 system image  into  the          zone.
Either the
.B -u
or
.B -p
option is required
.B and
either
the
.B -a
or
.B -d
option is required.
.sp
.ne 2
.mk
.na
\fB-a\fR \fIarchive\fR
.ad
.sp .6
.RS 4n
The path to a
.BR flash_archive (4),
.BR cpio (1),
.BR pax (1)
\fBxustar\fR archive, or a level \fB0 ufsdump\fR(1M) of an installed
Solaris 10 system. The
.B cpio
archives can be compressed using
\fBgzip\fR or \fBbzip2\fR.
.RE

.sp
.ne 2
.mk
.na
\fB-d\fR \fIpath\fR
.ad
.sp .6
.RS 4n
The path to the root directory of an installed Solaris 10 system.
.RE

.sp
.ne 2
.mk
.na
.B -p
.ad
.sp .6
.RS 4n
Preserve the system configuration after installing the zone.
.RE

.sp
.ne 2
.mk
.na
.B -s
.ad
.sp .6
.RS 4n
Install silently.
.RE

.sp
.ne 2
.mk
.na
.B -u
.ad
.sp .6
.RS 4n
Run \fBsys-unconfig\fR(1M) on the zone after installing it.
.RE

.sp
.ne 2
.mk
.na
.B -v
.ad
.sp .6
.RS 4n
Verbose output from the install process.
.RE

.RE

.SS "Application Support"
.sp
.LP
The
.B solaris10
zone only supports user-level Solaris 10 applications.
You cannot use Solaris 10 device drivers or Solaris 10 kernel modules from
inside a
.B solaris10
zone. However, depending on the kernel module, you
might be able to use the latest Solaris kernel module version with the
Solaris 10 user-level application.
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for a description of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWs10brandr, SUNWs10brandu
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
.BR cpio (1),
.BR mdb (1),
.BR pax (1),
.BR zlogin (1),
.BR dtrace (1M),
\fBufsdump\fR(1M), \fBsys-unconfig\fR(1M), \fBzfs\fR(1M),
.BR zoneadm (1M),
\fBzonecfg\fR(1M), \fBflash_archive\fR(4),
.BR attributes (5),
.BR brands (5),
.BR zones (5)
