usr/src/man/man5/trusted_extensions.5
'\" te
.\" Copyright (c) 2007, Sun Microsystems Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH trusted_extensions 5 "12 Nov 2007" "SunOS 5.11" "Standards, Environments, and Macros"
.SH NAME
trusted_extensions \- Solaris Trusted Extensions
.SH DESCRIPTION
.sp
.LP
Solaris\u\s-2TM\s+2\d Trusted Extensions software is a specific
configuration of the Solaris Operating System (Solaris OS). Solaris Trusted
Extensions (Trusted Extensions) provides labels for local objects and
processes, for the desktop and windowing system, for zones and file systems,
and for network communications. These labels are used to implement a
Multilevel Security (MLS) policy that restricts the flow of information
based on label relationships. In contrast to Discretionary Access Control
(DAC) based on ownership, the MLS policy enforced by Trusted Extensions is
an example of Mandatory Access Control (MAC).
.sp
.LP
By default, Trusted Extensions software is disabled. It is enabled and
disabled (but not configured) by the
.BR labeld (1M)
service, identified by
the FMRI:
.sp
.in +2
.nf
svc:/system/labeld:default
.fi
.in -2
.sp

.sp
.LP
Refer to the Administrator's Guide listed below for the required
configuration of Trusted Extensions software necessary before use. The
system must be rebooted after enabling or disabling
.B labeld
to activate
or deactivate Trusted Extensions software.
.SH SEE ALSO
.sp
.LP
.BR labeld (1M),
.BR label_encodings (4),
.BR labels (5)
.sp
.LP
.I
Solaris Trusted Extensions Administrator\&'s Procedures
.sp
.LP
.I
Solaris Trusted Extensions User\&'s Guide
