usr/src/man/man9p/inquiry-device-type.9p
'\" te
.\" Copyright (c) 2001, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH inquiry-device-type 9P "18 May 2001" "SunOS 5.11" "Kernel Properties for Drivers"
.SH NAME
inquiry-device-type, inquiry-vendor-id, inquiry-product-id,
inquiry-revision-id, inquiry-serial-no \- inquiry properties for SCSI
devices
.SH DESCRIPTION
.sp
.LP
These are optional properties, typically created by the system, for SCSI
target devices. References to these properties should use their
.B sys/scsi/impl/inquiry.h
defined names.
.sp
.LP
.B inquiry-device-type
is an integer property. When present, the least
significant byte of the value indicates the device type as defined by the
SCSI standard. Consumers of this property should compare the property values
with
.B DTYPE_*
values defined in
.BR sys/scsi/generic/inquiry.h .
.sp
.LP
.B inquiry-vendor-id
is a string property. When present, it contains the
vendor information. This information typically comes from the
\fBscsi_inquiry\fR(9S) "\fBinq_vid\fR" field.
.sp
.LP
.B inquiry-product-id
is a string property. When present, it contains
the product identification. This information typically comes from the
\fBscsi_inquiry\fR(9S) "\fBinq_pid\fR" field.
.sp
.LP
.B inquiry-revision-id
is a string property. When present, it contains
the product revision. This revision typically comes from the
\fBscsi_inquiry\fR(9S) "\fBinq_rev\fR" field.
.sp
.LP
.B inquiry-serial-no
is a string property. When present, it contains the
serial number. The serial number is typically obtained from the
.B EVPD
"Unit Serial Number" SCSI INQUIRY data (page 0x80).
.SH SEE ALSO
.sp
.LP
.BR scsi_inquiry (9S)
.sp
.LP
.I Writing Device Drivers
.SH NOTES
.sp
.LP
Values established at
.BR tran_tgt_init "(9E) time by an"
.B HBA
driver
take precedence over values established by the system, and
.B HBA
driver
values may not be the same length as the typical
.BR scsi_inquiry (9S)
field.
