usr/src/man/man9p/pm.9p
'\" te
.\" Copyright (c) 2004, Sun Microsystems, Inc.  All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH pm 9P "20 Jan 2004" "SunOS 5.11" "Kernel Properties for Drivers"
.SH NAME
pm \- Power Management properties
.SH DESCRIPTION
.sp
.LP
The
.B pm-hardware-state
property can be used to influence the behavior
of the Power Management framework. Its syntax and interpretation is
described below.
.sp
.LP
Note that this property is only interpreted by the system immediately after
the device has successfully attached. Changes in the property made by the
driver after the driver has attached will not be recognized.
.sp
.LP
.B pm-hardware-state
is a string-valued property. The existence of the
.B pm-hardware-state
property indicates that a device needs special
handling by the Power Management framework with regard to its hardware
state.
.sp
.LP
If the value of this property is
.BR needs-suspend-resume ,
the device has
a hardware state that cannot be deduced by the framework. The framework
definition of a device with hardware state is one with a
.B reg
property.
Some drivers, such as
.B SCSI
.RB "disk and tape drivers, have no" " reg"
property but manage devices with "remote" hardware. Such a device must have
a
.B pm-hardware-state
property with a value of
.B needs-suspend-resume
for the system to identify it as needing a call
to its
.BR detach "(9E) entry point with command"
.B DDI_SUSPEND
when
system is suspended, and a call to
.BR attach (9E)
with command
.B DDI_RESUME
when system is resumed. For devices using original Power
Management interfaces (which are now obsolete)
.BR detach (9E)
is also
called with
.B DDI_PM_SUSPEND
before power is removed from the device,
and
.BR attach (9E)
is called with \fBDDI_PM_RESUME\fR after power is
restored.
.sp
.LP
A value of
.B no-suspend-resume
indicates that, in spite of the
existence of a
.B reg
property, a device has no hardware state that needs
saving and restoring. A device exporting this property will not have its
.B detach()
entry point called with command
.B DDI_SUSPEND
when system
is suspended, nor will its
.B attach()
entry point be called with command
.B DDI_RESUME
when system is resumed. For devices using the original (and
now obsolete) Power Management interfaces,
.BR detach (9E)
will not be
called with
.B DDI_PM_SUSPEND
command before power is removed from the
device, nor
.BR attach (9E)
will be called with
.B DDI_PM_RESUME
command
after power is restored to the device.
.sp
.LP
A value of
.B parental-suspend-resume
indicates that the device does not
implement the
.BR detach (9E)
.B DDI_SUSPEND
semantics, nor the
.B attach() DDI_RESUME
semantics, but that a call should be made up
the device tree by the framework to effect the saving and/or restoring of
hardware state for this device. For devices using original Power Management
interfaces (which are now obsolete), it also indicates that the device does
not implement the
.BR detach (9E)
.B DDI_PM_SUSPEND
semantics, nor the
.BR attach (9E)
.B DDI_PM_RESUME
semantics, but that a call should be
made up the device tree by the framework to effect the saving and/or
restoring the hardware state for this device.
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface stabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
.BR power.conf (4),
.BR pm (7D),
.BR attach (9E),
.BR detach (9E),
.BR pm_busy_component (9F),
.BR pm_idle_component (9F),
.BR pm-components (9P)
.sp
.LP
.I Writing Device Drivers
