usr/src/man/man9p/size.9p
'\" te
.\" Copyright (c) 2008, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH size 9P "23 Janl2008" "SunOS 5.11" "Kernel Properties for Drivers"
.SH NAME
size, Nblock, blksize, device-nblocks, device-blksize \- device size
properties
.SH DESCRIPTION
.sp
.LP
A driver can communicate size information to the system by the values
associated with following properties. Size information falls into two
categories: device size associated with a
.B dev_info_t
node, and minor
node size associated with a
.BR ddi_create_minor_node (9F)
\fBdev_t\fR
(partition).
.sp
.LP
device size property names:
.sp
.ne 2
.mk
.na
.B device-nblocks
.ad
.RS 18n
.rt
An
.B int64_t
property representing device size in
.BR device-blksize blocks.
.RE

.sp
.ne 2
.mk
.na
.B device-blksize
.ad
.RS 18n
.rt
An integer property representing the size in bytes of a block. If defined,
the value must be a power of two. If not defined,
.B DEV_BSIZE
is
implied.
.RE

.sp
.LP
minor size property names:
.sp
.ne 2
.mk
.na
.B Size
.ad
.RS 11n
.rt
An
.B int64_t
property representing the size in bytes of a character
minor device (\fBS_IFCHR spec_type\fR in ddi_create_minor_node).
.RE

.sp
.ne 2
.mk
.na
.B Nblocks
.ad
.RS 11n
.rt
An
.B int64_t
property representing the number blocks, in
.B device-blksize
units, of a block minor device (\fBS_IFBLK\fR
.B spec_type
in ddi_create_minor_node).
.RE

.sp
.ne 2
.mk
.na
.B blksize
.ad
.RS 11n
.rt
An integer property representing the size in bytes of a block. If defined,
the value must be a power of two. If not defined,
.B DEV_BSIZE
is
implied.
.RE

.sp
.LP
A driver that implements both block and character minor device nodes should
support both "Size" and "Nblocks". Typically, the following is true: Size =
.B Nblocks
*
.BR blksize .
.sp
.LP
A driver where all ddi_create_minor_node(9F) calls for a given instance are
associated with the same physical block device should implement
"\fBdevice-nblocks\fR". If the device has a fixed block size with a value
other than \fBDEV_BSIZE\fR then "\fBdevice-blksize\fR" should be
implemented.
.sp
.LP
The driver is responsible for ensuring that property values are updated
when device, media, or partition sizes change. For each represented item, if
its size is know to be zero, the property value should be zero. If its size
is unknown, the property should not be defined.
.sp
.LP
A driver may choose to implement size properties within its prop_op(9E)
implementation. This reduces system memory since no space is used to store
the properties.
.sp
.LP
The DDI property interfaces deal in signed numbers. All Size(9P) values
should be considered unsigned. It is the responsibility of the code dealing
with the property value to ensure that an unsigned interpretation occurs.
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
attach(9E), detach(9E), prop_op(9E), ddi_create_minor_node(9F),
inquiry-vendor-id(9P)
.sp
.LP
.I Writing Device Drivers
