usr/src/man/man2/audit.2
'\" te
.\" Copyright (c) 2008, Sun Microsystems, Inc.  All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH audit 2 "16 Apr 2008" "SunOS 5.11" "System Calls"
.SH NAME
audit \- write a record to the audit log
.SH SYNOPSIS
.LP
.nf
cc [ \fIflag\fR .\|.\|. ] \fIfile\fR .\|.\|. \fB-lbsm\fR \fB -lsocket \fR \fB -lnsl \fR  [ \fIlibrary\fR.\|.\|. ]
#include <sys/param.h>
#include <bsm/libbsm.h>

\fBint\fR \fBaudit\fR(\fBcaddr_t\fR \fIrecord\fR, \fBint\fR \fIlength\fR);
.fi

.SH DESCRIPTION
.sp
.LP
The
.B audit()
function queues a record for writing to the system audit
log. The data pointed to by
.I record
is queued for the log after a
minimal consistency check, with the
.I length
parameter specifying the
size of the record  in bytes. The data should be a well-formed audit record
as described by
.BR audit.log (4).
.sp
.LP
The kernel validates the record header token type and length,  and sets the
time stamp value before writing the record to the audit log. The kernel does
not do any preselection for user-level generated events. If the audit policy
is set to  include sequence or trailer tokens, the kernel will append them
to the record.
.SH RETURN VALUES
.sp
.LP
Upon successful completion,
.B 0
is returned.  Otherwise,
.B \(mi1
is
returned and
.B errno
is set to indicate the error.
.SH ERRORS
.sp
.LP
The
.B audit()
function will fail if:
.sp
.ne 2
.mk
.na
.B E2BIG
.ad
.RS 11n
.rt
The record length is greater than the maximum allowed record length.
.RE

.sp
.ne 2
.mk
.na
.B EFAULT
.ad
.RS 11n
.rt
The
.I record
argument points outside the process's allocated address
space.
.RE

.sp
.ne 2
.mk
.na
.B EINVAL
.ad
.RS 11n
.rt
The header token in the record is invalid.
.RE

.sp
.ne 2
.mk
.na
.B ENOTSUP
.ad
.RS 11n
.rt
Solaris Audit is not defined for this system.
.RE

.sp
.ne 2
.mk
.na
.B EPERM
.ad
.RS 11n
.rt
The
.RB { PRIV_PROC_AUDIT }
privilege is not asserted in the effective set
of the calling process.
.RE

.SH USAGE
.sp
.LP
Only privileged processes can successfully execute this call.
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityCommitted
_
MT-LevelMT-Safe
.TE

.SH SEE ALSO
.sp
.LP
.BR bsmconv (1M),
.BR audit (1M),
.BR auditd (1M),
.BR svcadm (1M),
.BR auditon (2),
.BR getaudit (2),
.BR audit.log (4),
.BR attributes (5),
.BR privileges (5)
.SH NOTES
.sp
.LP
The functionality described in this man page is available only if the
Solaris Auditing has been enabled and the audit daemon
.BR auditd "(1M) has"
not been disabled by
.BR audit "(1M) or"
.BR svcadm (1M).
See
.BR bsmconv (1M)
for more information.
