usr/src/man/man2/getisax.2
'\" te
.\" Copyright (c) 2007, Sun Microsystems, Inc. All Rights Reserved.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH getisax 2 "7 bNov 2007" "SunOS 5.11" "System Calls"
.SH NAME
getisax \- extract valid instruction set extensions
.SH SYNOPSIS
.LP
.nf
#include <sys/auxv.h>

\fBuint_t\fR \fBgetisax\fR(\fBuint32_t *\fIarray\fR, \fBuint_t\fR \fIn\fR);
.fi

.SH DESCRIPTION
.sp
.LP
The
.B getisax()
function sets the vector
.I array
of
.I n
32-bit
integers to contain the bits from the \fBAV\fR_\fIxxx\fR_\fIyyy\fR namespace
of the given instruction set architecture.
.sp
.LP
Values for \fBAV\fR_\fIxxx\fR_\fIyyy\fR for SPARC and SPARCV9, and their
associated descriptions, can be found in \fB<sys/auxv_SPARC.h>\fR.
.sp
.LP
Values for \fBAV\fR_\fIxxx\fR_\fIyyy\fR for i386 and AMD64, and their
associated descriptions, can be found in \fB<sys/auxv_386.h>\fR.
.SH RETURN VALUES
.sp
.LP
The
.B getisax()
function returns the number of array elements that
contain non-zero values.
.SH EXAMPLES
.LP
\fBExample 1\fR Use \fBgetisax()\fR to determine if the SSE2 instruction
set is present.
.sp
.LP
In the following example, if the message is written, the SSE2 instruction
set is present and fully supportred by the operating system.

.sp
.in +2
.nf
uint_t ui;

(void) getisax(&ui, 1);

if (ui & AV_386_SSE2)
        printf("SSE2 instruction set extension is present.\en");
.fi
.in -2

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityCommitted
_
MT-LevelSafe
.TE

.SH SEE ALSO
.sp
.LP
\fBisainfo\fR(1), \fBld\fR(1),
.BR pargs (1),
.BR attributes (5)
.sp
.LP
.I Linker and Libraries Guide
.sp
.LP
\fISPARC Assembly Language Reference Manual\fR
.sp
.LP
\fIx86 Assembly Language Reference Manual\fR
