usr/src/man/man2/getisax.2
'\" te
.\" Copyright (c) 2007, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH getisax 2 "7 bNov 2007" "SunOS 5.11" "System Calls"
.SH NAME
getisax \- extract valid instruction set extensions
.SH SYNOPSIS
.LP
.nf
#include <sys/auxv.h>

\fBuint_t\fR \fBgetisax\fR(\fBuint32_t *\fIarray\fR, \fBuint_t\fR \fIn\fR);
.fi

.SH DESCRIPTION
.sp
.LP
The
.B getisax()
function sets the vector
.I array
of
.I n
32-bit
integers to contain the bits from the \fBAV\fR_\fIxxx\fR_\fIyyy\fR namespace
of the given instruction set architecture.
.sp
.LP
Values for \fBAV\fR_\fIxxx\fR_\fIyyy\fR for SPARC and SPARCV9, and their
associated descriptions, can be found in
.BR <sys/auxv_SPARC.h> .
.sp
.LP
Values for \fBAV\fR_\fIxxx\fR_\fIyyy\fR for i386 and AMD64, and their
associated descriptions, can be found in
.BR <sys/auxv_386.h> .
.SH RETURN VALUES
.sp
.LP
The
.B getisax()
function returns the number of array elements that
contain non-zero values.
.SH EXAMPLES
.LP
.B Example 1
Use
.B getisax()
to determine if the SSE2 instruction
set is present.
.sp
.LP
In the following example, if the message is written, the SSE2 instruction
set is present and fully supportred by the operating system.

.sp
.in +2
.nf
uint_t ui;

(void) getisax(&ui, 1);

if (ui & AV_386_SSE2)
        printf("SSE2 instruction set extension is present.\en");
.fi
.in -2

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityCommitted
_
MT-LevelSafe
.TE

.SH SEE ALSO
.sp
.LP
.BR isainfo (1),
.BR ld (1),
.BR pargs (1),
.BR attributes (5)
.sp
.LP
.I Linker and Libraries Guide
.sp
.LP
.I SPARC Assembly Language Reference Manual
.sp
.LP
.I x86 Assembly Language Reference Manual
