usr/src/man/man2/processor_info.2
'\" te
.\" Copyright (c) 2004, Sun Microsystems, Inc.  All Rights Reserved.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH processor_info 2 "28 Jun 2004" "SunOS 5.11" "System Calls"
.SH NAME
processor_info \- determine type and status of a processor
.SH SYNOPSIS
.LP
.nf
#include <sys/types.h>
#include <sys/processor.h>

\fBint\fR \fBprocessor_info\fR(\fBprocessorid_t\fR \fIprocessorid\fR, \fBprocessor_info_t *\fIinfop\fR);
.fi

.SH DESCRIPTION
.sp
.LP
The
.B processor_info()
function returns the status of the processor
specified by
.I processorid
in the
.B processor_info_t
structure
pointed to by
.IR infop .
.sp
.LP
The structure
.B processor_info_t
contains the following members:
.sp
.in +2
.nf
int      pi_state;
char     pi_processor_type[PI_TYPELEN];
char     pi_fputypes[PI_FPUTYPE];
int      pi_clock;
.fi
.in -2

.sp
.LP
The
.B pi_state
member is the current state of the processor, either
.BR P_ONLINE ,
.BR P_OFFLINE ,
.BR P_NOINTR ,
.BR P_FAULTED ,
.BR P_SPARE ,
or
.BR P_POWEROFF .
.sp
.LP
The
.B pi_processor_type
member is a null-terminated ASCII string
specifying the type of the processor.
.sp
.LP
The
.B pi_fputypes
member is a null-terminated ASCII string containing
the comma-separated types of floating-point units (FPUs) attached to the
processor. This string will be empty if no FPU is attached.
.sp
.LP
The
.B pi_clock
member is the processor clock frequency rounded to the
nearest megahertz. It may be
.B 0
if not known.
.SH RETURN VALUES
.sp
.LP
Upon successful completion,
.B 0
is returned. Otherwise,
.B \(mi1
is
returned and
.B errno
is set to indicate the error.
.SH ERRORS
.sp
.LP
The
.B processor_info()
function will fail if:
.sp
.ne 2
.mk
.na
.B EINVAL
.ad
.RS 10n
.rt
An non-existent processor
.B ID
was specified.
.sp
The caller is in a non-global zone, the pools facility is active, and the
processor is not a member of the zone's pool's processor set.
.RE

.sp
.ne 2
.mk
.na
.B EFAULT
.ad
.RS 10n
.rt
The  \fBprocessor_info_t\fR structure pointed to by  \fIinfop\fR was not
writable by the user.
.RE

.SH SEE ALSO
.sp
.LP
.BR pooladm (1M),
.BR psradm (1M),
.BR psrinfo (1M),
.BR zoneadm (1M),
.BR p_online (2),
.BR sysconf (3C)
