usr/src/man/man2/processor_bind.2
'\" te
.\" Copyright (c) 2009, Sun Microsystems, Inc.  All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH processor_bind 2 "13 Mar 2009" "SunOS 5.11" "System Calls"
.SH NAME
processor_bind \- bind LWPs to a processor
.SH SYNOPSIS
.LP
.nf
#include <sys/types.h>
#include <sys/processor.h>
#include <sys/procset.h>

\fBint\fR \fBprocessor_bind\fR(\fBidtype_t\fR \fIidtype\fR, \fBid_t\fR \fIid\fR, \fBprocessorid_t\fR \fIprocessorid\fR,
     \fBprocessorid_t *\fIobind\fR);
.fi

.SH DESCRIPTION
.sp
.LP
The
.B processor_bind()
function binds the LWP (lightweight process) or
set of LWPs specified by
.I idtype
and
.I id
to the processor
specified by
.IR processorid .
If
.I obind
is not
.IR NULL ,
this
function also sets the
.B processorid_t
variable pointed to by
.I obind
to the previous binding of one of the specified LWPs, or to
.B PBIND_NONE
if the selected LWP was not bound.
.sp
.LP
If
.I idtype
is
.BR P_PID ,
the binding affects all LWPs of the process
with process ID (PID)
.IR id .
.sp
.LP
If
.I idtype
is
.BR P_LWPID ,
the binding affects the LWP of the
current process with LWP ID
.IR id .
.sp
.LP
If
.I idtype
is
.BR P_TASKID ,
the binding affects all LWPs of all
processes with task ID
.IR id .
.sp
.LP
If
.I idtype
is
.BR P_PROJID ,
the binding affects all LWPs of all
processes with project ID
.IR id .
.sp
.LP
If
.I idtype
is
.BR P_CTID ,
the binding affects all LWPs of all
processes with process contract ID
.IR id .
.sp
.LP
If
.I idtype
is
.BR P_ZONEID ,
the binding affects all LWPs of all
processes with zone ID
.IR id .
.sp
.LP
If
.I id
is
.BR P_MYID ,
the specified LWP, process, task, or project
is the current one.
.sp
.LP
If
.I processorid
is
.BR PBIND_NONE ,
the processor bindings of the
specified LWPs are cleared.
.sp
.LP
If
.I processorid
is
.BR PBIND_QUERY ,
the processor bindings are not
changed.
.sp
.LP
The {\fBPRIV_PROC_OWNER\fR} privilege must be asserted in the effective set
of the calling process or the real or effective user ID of the calling
process must match the real or effective user ID of the
.BR LWP "s being"
bound. If the calling process does not have permission to change all of the
specified LWPs, the bindings of the LWPs for which it does have permission
will be changed even though an error is returned.
.sp
.LP
Processor bindings are inherited across
.BR fork (2)
and
.BR exec (2).
.SH RETURN VALUES
.sp
.LP
Upon successful completion,
.B 0
is returned.  Otherwise,
.B \(mi1
is
returned and
.B errno
is set to indicate the error.
.SH ERRORS
.sp
.LP
The
.B processor_bind()
function will fail if:
.sp
.ne 2
.mk
.na
.B EFAULT
.ad
.RS 11n
.rt
The location pointed to by
.I obind
was not
.I NULL
and not writable
by the user.
.RE

.sp
.ne 2
.mk
.na
.B EINVAL
.ad
.RS 11n
.rt
The specified processor is not on-line, or the
.I idtype
argument was
not
.BR P_PID ,
.BR P_LWPID ,
.BR P_PROJID ,
.BR P_TASKID ,
.BR P_CTID ,
or
.BR P_ZONEID .
.sp
The caller is in a non-global zone, the pools facility is active, and the
processor is not a member of the zone's pool's processor set.
.RE

.sp
.ne 2
.mk
.na
.B ENOTSUP
.ad
.RS 11n
.rt
Binding a system process to a processor set is not supported.
.RE

.sp
.ne 2
.mk
.na
.B EPERM
.ad
.RS 11n
.rt
The {\fBPRIV_PROC_OWNER\fR} privilege is not asserted in the effective set
of the calling process and its real or effective user ID does not match the
real or effective user
.B ID
of one of the
.BR LWP "s being bound."
.RE

.sp
.ne 2
.mk
.na
.B ESRCH
.ad
.RS 11n
.rt
No processes, \fBLWP\fRs, or tasks were found to match the criteria
specified by
.I idtype
and
.IR id .
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityCommitted
_
MT-LevelAsync-Signal-Safe
.TE

.SH SEE ALSO
.sp
.LP
.BR pooladm (1M),
.BR psradm (1M),
.BR psrinfo (1M),
.BR zoneadm (1M),
.BR exec (2),
.BR fork (2),
.BR p_online (2),
.BR pset_bind (2),
.BR sysconf (3C),
.BR process (4),
.BR project (4),
.BR attributes (5),
.BR privileges (5)
