usr/src/man/man2/pset_list.2
'\" te
.\" Copyright (c) 2004, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH pset_list 2 "28 Jun 2004" "SunOS 5.11" "System Calls"
.SH NAME
pset_list \- get list of processor sets
.SH SYNOPSIS
.LP
.nf
#include <sys/pset.h>

\fBint\fR \fBpset_list\fR(\fBpsetid_t *\fIpsetlist\fR, \fBuint_t *\fInumpsets\fR);
.fi

.SH DESCRIPTION
.sp
.LP
The
.B pset_list()
function returns a list of processor sets in the
system.
.sp
.LP
If
.I numpsets
is non-null, then on successful completion the number of
processor sets in the system will be stored in the location pointed to by
.IR numpsets .
.sp
.LP
If
.I numpsets
and
.I psetlist
.RI "are both non-null, then" " psetlist"
points to a buffer where a list of processor sets in the system is to be
stored, and
.I numpsets
points to the maximum number of processor set IDs
the buffer can hold.  On successful completion, the list of processor sets
up to the maximum buffer size is stored in the buffer pointed to by
.IR psetlist .
.SH RETURN VALUES
.sp
.LP
Upon successful completion, 0 is returned. Otherwise, -1  is returned and
.B errno
is set to indicate the error.
.SH ERRORS
.sp
.LP
The
.B pset_list()
function will fail if:
.sp
.ne 2
.mk
.na
.B EFAULT
.ad
.RS 10n
.rt
The location pointed to by
.I psetlist
or
.I numpsets
was not null
and not writable by the user.
.RE

.SH USAGE
.sp
.LP
If the caller is in a non-global zone and the pools facility is active,
.B pset_list()
returns only the processor set of the pool to which the
zone is bound.
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityStable
_
MT-LevelAsync-Signal-Safe
.TE

.SH SEE ALSO
.sp
.LP
.BR pooladm (1M),
.BR psrset (1M),
.BR zoneadm (1M),
.BR processor_info (2),
.BR pset_bind (2),
.BR pset_create (2),
.BR pset_info (2),
.BR pset_getloadavg (3C),
.BR attributes (5)
