usr/src/man/man2/pset_setattr.2
'\" te
.\" Copyright (c) 2004, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH pset_setattr 2 "28 Jun 2004" "SunOS 5.11" "System Calls"
.SH NAME
pset_setattr, pset_getattr \- set or get processor set attributes
.SH SYNOPSIS
.LP
.nf
#include <sys/pset.h>

\fBint\fR \fBpset_setattr\fR(\fBpsetid_t\fR \fIpset\fR, \fBuint_t\fR \fIattr\fR);
.fi

.LP
.nf
\fBint\fR \fBpset_getattr\fR(\fBpsetid_t\fR \fIpset\fR, \fBuint_t *\fIattr\fR);
.fi

.SH DESCRIPTION
.sp
.LP
The
.B pset_setattr()
function sets attributes of the processor set
specified by
.IR pset .
The bitmask of attributes to be set or cleared is
specified by
.IR attr .
.sp
.LP
The pset_getattr function returns attributes of the processor set specified
by
.IR pset .
On successful return,
.I attr
will contain the bitmask of
attributes for the specified processor set.
.sp
.LP
The value of the
.I attr
argument is the bitwise inclusive-OR of these
attributes, defined in <\fBsys/pset.h\fR>:
.sp
.ne 2
.mk
.na
.B PSET_NOESCAPE
.ad
.RS 17n
.rt
Unbinding of LWPs from the processor set with this attribute requires the
{\fBPRIV_SYS_RES_CONFIG\fR} privilege to be asserted in the effective set of
the calling process.
.RE

.sp
.LP
The binding of LWPs and processes to processor sets is controlled by
.BR pset_bind (2).
When the
.B PSET_NOESCAPE
attribute is cleared, a
process calling
.B pset_bind()
can clear the processor set binding of any
LWP whose real or effective user ID matches its own real of effective user
ID. Setting
.B PSET_NOESCAPE
attribute forces
.B pset_bind()
to
requires the {\fBPRIV_SYS_RES_CONFIG\fR} privilege to be asserted in the
effective set of the calling process.
.SH RETURN VALUES
.sp
.LP
Upon successful completion, these functions return 0. Otherwise, -1 is
returned and
.B errno
is set to indicate the error.
.SH ERRORS
.sp
.LP
These function will fail if:
.sp
.ne 2
.mk
.na
.B EFAULT
.ad
.RS 11n
.rt
The location pointed to by
.I attr
was not writable by the user.
.RE

.sp
.ne 2
.mk
.na
.B EINVAL
.ad
.RS 11n
.rt
An invalid processor set ID was specified.
.sp
The caller is in a non-global zone, the pools facility is active, and the
processor is not a member of the zone's pool's processor set.
.RE

.sp
.ne 2
.mk
.na
.B ENOTSUP
.ad
.RS 11n
.rt
The pools facility is active. See
.BR pooladm (1M)
and
.BR pool_set_status (3POOL)
for information about enabling and disabling
the pools facility.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityStable
_
MT-LevelAsync-Signal-Safe
.TE

.SH SEE ALSO
.sp
.LP
.BR pooladm (1M),
.BR pooladm (1M),
.BR psrset (1M),
.BR zoneadm (1M),
.BR pset_bind (2),
.BR pool_set_status (3POOL),
.BR attributes (5)
