usr/src/man/man2/pset_info.2
'\" te
.\" Copyright (c) 20034, Sun Microsystems, Inc.  All Rights Reserved.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH pset_info 2 "28 Jun 2004" "SunOS 5.11" "System Calls"
.SH NAME
pset_info \- get information about a processor set
.SH SYNOPSIS
.LP
.nf
#include <sys/pset.h>

\fBint\fR \fBpset_info\fR(\fBpsetid_t\fR \fIpset\fR, \fBint *\fItype\fR, \fBuint_t *\fInumcpus\fR,
     \fBprocessorid_t *\fIcpulist\fR);
.fi

.SH DESCRIPTION
.sp
.LP
The
.B pset_info()
function returns information on the processor set
.IR pset .
.sp
.LP
If
.I type
is non-null, then on successful completion the type of the
processor set will be stored in the location pointed to by
.IR type .
The
only type supported for active processor sets is
.BR PS_PRIVATE .
.sp
.LP
If
.I numcpus
is non-null, then on successful completion the number of
processors in the processor set will be stored in the location pointed to by
.IR numcpus .
.sp
.LP
If
.I numcpus
and
.I cpulist
.RI "are both non-null, then" " cpulist"
points to a buffer where a list of processors assigned to the processor set
is to be stored, and
.I numcpus
points to the maximum number of processor
IDs the buffer can hold. On successful completion, the list of processors up
to the maximum buffer size is stored in the buffer pointed to by
.IR cpulist .
.sp
.LP
If
.I pset
is
.BR PS_NONE ,
the list of processors not assigned to any
processor set will be stored in the buffer pointed to by
.IR cpulist ,
and
the number of such processors will be stored in the location pointed to by
.IR numcpus .
The location pointed to by
.I type
will be set to
.BR PS_NONE .
.sp
.LP
If
.I pset
is
.BR PS_MYID ,
the processor list and number of processors
returned will be those of the processor set to which the caller is bound. If
the caller is not bound to a processor set, the result will be equivalent to
setting pset to
.BR PS_NONE .
.SH RETURN VALUES
.sp
.LP
Upon successful completion,
.B 0
is returned. Otherwise,
.B \(mi1
is
returned and
.B errno
is set to indicate the error.
.SH ERRORS
.sp
.LP
The
.B pset_info()
function will fail if:
.sp
.ne 2
.mk
.na
.B EFAULT
.ad
.RS 10n
.rt
The location pointed to by
.IR type ,
.IR numcpus ,
or
.I cpulist
was
not null and not writable by the user.
.RE

.sp
.ne 2
.mk
.na
.B EINVAL
.ad
.RS 10n
.rt
An invalid processor set
.B ID
was specified.
.sp
The caller is in a non-global zone, the pools facility is active, and the
processor is not a member of the zone's pool's processor set.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityStable
_
MT-LevelAsync-Signal-Safe
.TE

.SH SEE ALSO
.sp
.LP
.BR pooladm (1M),
.BR psrinfo (1M),
.BR psrset (1M),
.BR zoneadm (1M),
.BR processor_info (2),
.BR pset_assign (2),
.BR pset_bind (2),
.BR pset_create (2),
.BR pset_destroy (2),
.BR pset_getloadavg (3C),
.BR attributes (5)
.SH NOTES
.sp
.LP
The processor set of type
.B PS_SYSTEM
is no longer supported.
