usr/src/man/man2/pset_create.2
'\" te
.\" Copyright (c) 2008, Sun Microsystems, Inc.  All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH pset_create 2 "22 Feb 2008" "SunOS 5.11" "System Calls"
.SH NAME
pset_create, pset_destroy, pset_assign \- manage sets of processors
.SH SYNOPSIS
.LP
.nf
#include <sys/pset.h>

\fBint\fR \fBpset_create\fR(\fBpsetid_t *\fInewpset\fR);
.fi

.LP
.nf
\fBint\fR \fBpset_destroy\fR(\fBpsetid_t\fR \fIpset\fR);
.fi

.LP
.nf
\fBint\fR \fBpset_assign\fR(\fBpsetid_t\fR \fIpset\fR, \fBprocessorid_t\fR \fIcpu\fR, \fBpsetid_t *\fIopset\fR);
.fi

.SH DESCRIPTION
.sp
.LP
These functions control the creation and management of sets of processors.
Processor sets allow a subset of the system's processors to be set aside for
exclusive use by specified
.BR LWP s
and processes. The binding of
.BR LWP s
and processes to processor sets is controlled by
.BR pset_bind (2).
.sp
.LP
The
.B pset_create()
function creates an empty processor set that
contains no processors.  On successful return,
.I newpset
will contain
the
.B ID
of the new processor set.
.sp
.LP
The
.B pset_destroy()
function destroys the processor set
.IR pset ,
releasing its constituent processors and processes. If
.I pset
is
.BR PS_MYID ,
the processor set to which the caller is bound is
destroyed.
.sp
.LP
The
.B pset_assign()
function assigns the processor
.I cpu
to the
processor set
.IR pset .
A processor that has been assigned to a processor
set will run only
.BR LWP "s and processes that have been explicitly bound"
to that processor set, unless another
.B LWP
requires a resource that is
only available on that processor.
.sp
.LP
On successful return, if
.I opset
is non-null,
.I opset
will contain
the processor set
.B ID
of the former processor set of the processor.
.sp
.LP
If
.I pset
is
.BR PS_NONE ,
.B pset_assign()
releases processor
.I cpu
from its current processor set.
.sp
.LP
If
.I pset
is
.BR PS_QUERY ,
.B pset_assign()
makes no change to
processor sets, but returns the current processor set
.B ID
of processor
.I cpu
in
.IR opset .
.sp
.LP
If
.I pset
is
.BR PS_MYID ,
processor
.I cpu
is assigned to the
processor set to which the caller belongs. If the caller does not belong to
a processor set, processor
.I cpu
is released from its current processor
set.
.sp
.LP
These functions are restricted to privileged processes, except for
.B pset_assign()
when
.I pset
is
.BR PS_QUERY .
.SH RETURN VALUES
.sp
.LP
Upon successful completion, these functions return
.BR 0 .
Otherwise,
.B
\(mi1 \c
is returned and
.B errno
is set to indicate the error.
.SH ERRORS
.sp
.LP
These functions will fail if:
.sp
.ne 2
.mk
.na
.B EBUSY
.ad
.RS 11n
.rt
The processor could not be moved to the specified processor set.
.RE

.sp
.ne 2
.mk
.na
.B EFAULT
.ad
.RS 11n
.rt
The location pointed to by
.I newpset
was not writable by the user, or
the location pointed to by
.I opset
was not
.I NULL
and not writable
by the user.
.RE

.sp
.ne 2
.mk
.na
.B EINVAL
.ad
.RS 11n
.rt
The specified processor does not exist, the specified processor  is not
on-line, or an invalid processor set was specified.
.RE

.sp
.ne 2
.mk
.na
.B ENOMEM
.ad
.RS 11n
.rt
There was insufficient space for
.B pset_create
to create a new
processor set.
.RE

.sp
.ne 2
.mk
.na
.B ENOTSUP
.ad
.RS 11n
.rt
The pools facility is active. See
.BR pooladm (1M)
and
.BR pool_set_status (3POOL)
for information about enabling and disabling
the pools facility.
.RE

.sp
.ne 2
.mk
.na
.B EPERM
.ad
.RS 11n
.rt
The
.RB { PRIV_SYS_RES_CONFIG }
privilege is not asserted in the effective
set of the calling process.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityCommitted
_
MT-LevelAsync-Signal-Safe
.TE

.SH SEE ALSO
.sp
.LP
.BR pooladm (1M),
.BR psradm (1M),
.BR psrinfo (1M),
.BR psrset (1M),
.BR p_online (2),
.BR processor_bind (2),
.BR pset_bind (2),
.BR pset_info (2),
.BR pool_set_status (3POOL),
.BR pset_getloadavg (3C),
.BR attributes (5),
.BR privileges (5)
.SH NOTES
.sp
.LP
The processor set type of
.B PS_SYSTEM
is no longer supported.
.sp
.LP
Processors with
.BR LWP "s bound to them using"
.BR processor_bind (2)
cannot be assigned to a new processor set. If  this is attempted,
.B pset_assign()
will fail and set
.B errno
to
.BR EBUSY .
