usr/src/man/man7fs/ctfs.7fs
'\" te
.\" Copyright (c) 2004, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ctfs 7FS "18 Nov 2004" "SunOS 5.11" "File Systems"
.SH NAME
ctfs \- contract file system
.SH DESCRIPTION
.sp
.LP
The
.B ctfs
filesystem is the interface to the contract sub-system.
.B ctfs
is mounted during boot at
.BR /system/contract .
For information
on contracts and the contents of this filesystem, see
.BR contract (4).
.SH FILES
.sp
.ne 2
.mk
.na
.B /system/contract
.ad
.RS 20n
.rt
Mount point for the
.B ctfs
file system
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWckr
.TE

.SH SEE ALSO
.sp
.LP
.BR contract (4),
.BR vfstab (4),
.BR attributes (5),
.BR smf (5)
