usr/src/man/man7fs/ctfs.7fs
'\" te
.\" Copyright (c) 2004, Sun Microsystems, Inc. All Rights Reserved.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ctfs 7FS "18 Nov 2004" "SunOS 5.11" "File Systems"
.SH NAME
ctfs \- contract file system
.SH DESCRIPTION
.sp
.LP
The \fBctfs\fR filesystem is the interface to the contract sub-system.
\fBctfs\fR is mounted during boot at
.BR /system/contract .
For information
on contracts and the contents of this filesystem, see \fBcontract\fR(4).
.SH FILES
.sp
.ne 2
.mk
.na
.B /system/contract
.ad
.RS 20n
.rt
Mount point for the \fBctfs\fR file system
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWckr
.TE

.SH SEE ALSO
.sp
.LP
.BR contract (4),
\fBvfstab\fR(4),
.BR attributes (5),
\fBsmf\fR(5)
