usr/src/man/man7fs/dev.7fs
'\" te
.\" Copyright (c) 2006, Sun Microsystems, Inc.  All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH dev 7FS "9 June 2006" "SunOS 5.11" "File Systems"
.SH NAME
dev \- Device name file system
.SH DESCRIPTION
.sp
.LP
The
.B dev
filesystem manages the name spaces of devices under the
Solaris operating environment. The global zone's instance of the \fBdev\fR
filesystem is mounted during boot on
.BR /dev .
.sp
.LP
A subdirectory under
.B /dev
may have unique operational semantics. Most
of the common device names under
.B /dev
are created automatically by
.BR devfsadm (1M).
Others, such as
.BR /dev/pts ,
are dynamic and reflect
the operational state of the system. You can manually generate device names
for newly attached hardware by invoking \fBdevfsadm\fR(1M) or implicitly, by
indirectly causing a lookup or readdir operation in the filesystem to occur.
For example, you can discover a disk that was attached when the system was
powered down (and generate a name for that device) by invoking
.BR format (1M)).
.SH FILES
.sp
.ne 2
.mk
.na
.B /dev
.ad
.RS 8n
.rt
Mount point for the
.B /dev
filesystem in the global zone.
.RE

.SH SEE ALSO
.sp
.LP
.BR devfsadm (1M),
.BR format (1M),
.BR devfs (7FS)
.SH NOTES
.sp
.LP
The global
.B /dev
instance cannot be unmounted.
