usr/src/man/man7fs/devfs.7fs
'\" te
.\" Copyright (c) 2004 Sun Microsystems, Inc.  All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH devfs 7FS "26 Oct 2004" "SunOS 5.11" "File Systems"
.SH NAME
devfs \- Devices file system
.SH DESCRIPTION
.sp
.LP
The
.B devfs
filesystem manages a name space of all devices under the
Solaris operating environment and is mounted during boot on the
.B /devices
name space.
.sp
.LP
The
.B /devices
name space is dynamic and reflects the current state of
accessible devices under the Solaris operating environment. The names of all
attached device instances are present under
.BR /devices .
.sp
.LP
The content under
.B /devices
is under the exclusive control of the
.B devfs
filesystem and cannot be changed.
.sp
.LP
The system may be configured to include a device in one of two ways:
.br
.in +2
By means of dynamic reconfiguration (DR), using, for example,
.BR cfgadm (1M).
.in -2
.br
.in +2
For devices driven by
.BR driver.conf (4)
enumeration, edit the
.B driver.conf
file to add a new entry, then use
.BR update_drv (1M)
to
cause the system to re-read the
.B driver.conf
file and thereby enumerate
the instance.
.in -2
.sp
.LP
The device may be attached through a number of system calls and programs,
including
.BR open (2),
.BR stat (2)
and
.BR ls (1).
During device
attach, the device driver typically creates minor nodes corresponding to the
device via
.BR ddi_create_minor_node (9F).
If the attach is successful, one
or more minor nodes referring to the device are created under
.BR /devices .
.sp
.LP
Operations like
.BR mknod (2),
.BR mkdir (2)
and
.BR creat (2)
are not
supported in
.BR /devices .
.SH FILES
.sp
.ne 2
.mk
.na
.B /devices
.ad
.RS 12n
.rt
Mount point for
.B devfs
file system
.RE

.SH SEE ALSO
.sp
.LP
.BR devfsadm (1M),
.BR vfstab (4),
.BR attach (9E)
.SH NOTES
.sp
.LP
The
.B /devices
name space cannot be unmounted.
.sp
.LP
All content at or below the
.B /devices
name space is an implementation
artifact and subject to incompatible change or removal without
notification.
