usr/src/man/man7fs/hsfs.7fs
'\" te
.\" Copyright (c) 2006, Sun Microsystems, Inc.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH hsfs 7FS "1 Nov 2006" "SunOS 5.11" "File Systems"
.SH NAME
hsfs \- High Sierra & ISO 9660 CD-ROM file system
.SH DESCRIPTION
.sp
.LP
.B HSFS
is a file system type that allows users to access files on High
Sierra or
.B ISO
9660 format
.B CD-ROM
disks from within the SunOS
operating system. Once mounted, a
.B HSFS
file system provides standard
SunOS read-only file system operations and semantics, meaning that you can
read and list files in a directory on a High Sierra or
.B ISO
9660
.B CD-ROM
and applications can use standard UNIX system calls on these
files and directories.
.sp
.LP
This file system contains support for Rock Ridge, ISO 9660 Version 2 and
Joliet extensions. These extensions provide support for file names with a
length of at least 207 bytes, but only Rock Ridge extensions (with the
exception of writability and hard links) can provide file system semantics
and file types as they are found in UFS. The presence of Rock Ridge, ISO
9660 Version 2  and Joliet is autodetected and the best-suitable available
extension is  used by the HSFS driver for file name and attribute lookup.
.sp
.LP
If  your
.B /etc/vfstab
file contains a line similar to the following:
.sp
.in +2
.nf
/dev/dsk/c0t6d0s0 \(mi/hsfs hsfs \fB-no\fR ro
.fi
.in -2

.sp
.LP
and \fB/hsfs\fR exists, you can mount an \fBHSFS\fR file system with either
of the following commands:
.sp
.in +2
.nf
mount \fB-F\fR hsfs \fB-o\fR ro \fIdevice-special\fR \fIdirectory-name\fR
.fi
.in -2

.sp
.LP
or
.sp
.in +2
.nf
mount /hsfs
.fi
.in -2

.sp
.LP
By default, Rock Ridge extensions are used if available, otherwise ISO
9660 Version 2, then Joliet are used. If neither extension is present HSFS
defaults to the standard capabilities of ISO  9660. Since so-called hybrid
CD-ROMs that contain multiple extensions are possible,  you can use the
following mount options to deliberately disable the  search for a specific
extension or to force the use of a specific extension even if a preferable
type is present:
.sp
.in +2
.nf
mount \fB-F\fR hsfs \fB-o\fR ro,nrr \fIdevice-special\fR \fIdirectory-name\fR
.fi
.in -2

.sp
.LP
Mount options are:
.sp
.LP
rr\(emrequest HSFS to use Rock Ridge extensions, if present. This is the
default behavior and does not need to be explicitly specified.
.sp
.LP
nrr\(emdisable detection and use of Rock Ridge extensions, even if
present.
.sp
.LP
vers2\(emrequest HSFS to use \fIISO 9660\fR Version 2 extensions, even if
Rock Ridge is available.
.sp
.LP
novers2\(emdisable detection and use of
.I "ISO 9660"
Version 2
extensions.
.sp
.LP
joliet\(emrequest HSFS to use Joliet extensions, even if Rock Ridge or
.I ISO 9660
Version 2 extensions are available.
.sp
.LP
nojoliet\(emdisable detection and use of Joliet extensions.
.sp
.LP
Files on a High Sierra or
.B ISO
9660
.B CD-ROM
disk have names of
the form
.IR filename.ext;version ,
where
.I filename
and the optional
.I ext
consist of a sequence of uppercase alphanumeric characters
(including ``_''), while the
.I version
consists of a sequence of digits,
representing the version number of  the file.
.B HSFS
converts all the
uppercase characters in a file name to lowercase, and truncates the ``;''
and version information. If more than one version of a file is present on
the
.BR CD-ROM ,
only the file with the highest version number is
accessible.
.sp
.LP
Conversion of uppercase to lowercase characters may be disabled by using
the
.B "-o nomaplcase"
option to
.BR mount "(1M). (See"
.BR mount_hsfs (1M)).
.sp
.LP
If the
.B CD-ROM
contains Rock Ridge, ISO  9660 version 2 or Joliet
extensions, the file names and directory names may contain any character
supported under
.B UFS.
The names may also be upper and/or lower case
and are case sensitive. File name lengths can be as long as those of
.BR UFS .
.sp
.LP
Files accessed through
.B HSFS
have mode 555 (owner, group and world
readable and executable),  uid 0 and gid 3. If a directory on the
.B CD-ROM
has read permission,
.B HSFS
grants execute permission to
the directory, allowing it to be searched.
.sp
.LP
With Rock Ridge extensions, files and directories can have any permissions
that are supported on a
.B UFS
file system. However, under all write
permissions, the file system is read-only, with
.B EROFS
returned to any
write operations.
.sp
.LP
Like High Sierra and
.B ISO
9660
.BR CD-ROMs ,
HSFS supports only
regular files and directories. A Rock Ridge
.B CD-ROM
can support regular
files, directories, and symbolic links, as well as device nodes, such as
block, character, and FIFO.
.SH EXAMPLES
.LP
.B Example 1
Sample Display of File System Files
.sp
.LP
If there is a file
.B BIG.BAR
on a High Sierra or
.B ISO
9660 format
.B CD-ROM
it will show up as
.B big.bar
when listed on a
.BR HSFS
file system.

.sp
.LP
If there are three files

.sp
.in +2
.nf
\fBBAR.BAZ;1\fR
.fi
.in -2

.sp
.in +2
.nf
\fBBAR.BAZ;2\fR
.fi
.in -2

.sp
.LP
and

.sp
.in +2
.nf
\fBBAR.BAZ;3\fR
.fi
.in -2

.sp
.LP
on a High Sierra or
.B ISO
9660 format
.B CD-ROM,
only the file
.B BAR.BAZ;3
will be accessible. It will be listed as
.BR bar.baz .

.SH SEE ALSO
.sp
.LP
.BR mount (1M),
.BR mount_hsfs (1M),
.BR vfstab (4)
.sp
.LP
N. V. Phillips and Sony Corporation, \fISystem Description Compact Disc
Digital Audio\fR, ("Red Book").
.sp
.LP
N. V. Phillips and Sony Corporation, \fISystem Description of Compact Disc
Read Only Memory\fR, ("Yellow Book").
.sp
.LP
IR "Volume and File Structure of CD-ROM for Information Interchange", ISO
9660:1988(E).
.SH DIAGNOSTICS
.sp
.ne 2
.mk
.na
\fBhsfs: Warning: the file system.\|.\|.\fR
.ad
.br
.na
.B "does not conform to the ISO-9660 spec
.ad
.sp .6
.RS 4n
The specific reason appears on the following line. You might be attempting
to mount a
.B CD-ROM
containing a different file system, such as
.BR UFS .
.RE

.sp
.ne 2
.mk
.na
\fBhsfs: Warning: the file system.\|.\|.\fR
.ad
.br
.na
.B "contains a file [with an] unsupported type
.ad
.sp .6
.RS 4n
The
.B hsfs
file system does not support the format of some file or
directory on the
.B CD-ROM,
for example a record structured file.
.RE

.sp
.ne 2
.mk
.na
.B "hsfs: hsnode table full, %d nodes allocated
.ad
.sp .6
.RS 4n
There are not enough
.B HSFS
internal data structure elements to handle
all the files currently open.  This problem may be overcome by adding a line
of the form \fBset hsfs:nhsnode=\fInumber\fR to the \fB/etc/system\fR
system configuration file and rebooting.  See
.BR system (4).
.RE

.SH WARNINGS
.sp
.LP
Do not physically eject a
.B CD-ROM
while the device is still mounted as
a
.B HSFS
file system.
.sp
.LP
Under
.B MS-DOS
(for which
.B CD-ROMs
are frequently targeted), files
with no extension may be represented either as:
.sp
.in +2
.nf
\fIfilename.\fR
.fi
.in -2

.sp
.LP
or
.sp
.in +2
.nf
\fIfilename\fR
.fi
.in -2

.sp
.LP
that is, with or without a trailing period. These names are not equivalent
under UNIX systems. For example, the names:
.sp
.in +2
.nf
\fBBAR.\fR
.fi
.in -2

.sp
.LP
and
.sp
.in +2
.nf
\fBBAR\fR
.fi
.in -2

.sp
.LP
are not names for the same file under the UNIX system. This may cause
confusion if you are consulting documentation for
.B CD-ROMs
originally
intended for
.B MS-DOS
systems.
.sp
.LP
Use of the
.B "-o notraildot"
option to
.BR mount "(1M) makes it"
optional to specify the trailing dot. (See \fBmount_hsfs\fR(1M)).
.SH NOTES
.sp
.LP
No translation of any sort is done on the contents of High Sierra or
.B ISO
9660 format
.BR CD-ROMs ;
only directory and file names are
subject to interpretation by
.BR HSFS.
