usr/src/man/man7fs/smbfs.7fs
'\" te
.\" Copyright (c) 2009, Sun Microsystems, Inc. All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH smbfs 7FS "9 Sep 2009" "SunOS 5.11" "File Systems"
.SH NAME
smbfs \- CIFS/SMB file system
.SH DESCRIPTION
.sp
.LP
The
.B smbfs
file system allows you to mount CIFS shares that are
exported from Windows or compatible systems. SMB is the historical name for
the CIFS protocol, which stands for Server Message Block and is more
commonly used in technical contexts.
.sp
.LP
The
.B smbfs
file system permits ordinary UNIX applications to change
directory into an
.B smbfs
mount and perform simple file and directory
operations. Supported operations include
.BR open ,
.BR close ,
.BR read ,
.BR write ,
.BR rename ,
.BR delete ,
.BR mkdir ,
.B rmdir
and
.BR ls .
.SS "Limitations"
.sp
.LP
Some local UNIX file systems (for example UFS) have features that are not
supported by
.BR smbfs .
These include:
.RS +4
.TP
.ie t \(bu
.el o
No mapped-file access because
.BR mmap (2)
returns
.BR ENOSYS .
.RE
.RS +4
.TP
.ie t \(bu
.el o
Locking is
.B "local only"
and is not sent to the server.
.RE
.sp
.LP
The following are limitations in the CIFS protocol:
.RS +4
.TP
.ie t \(bu
.el o
.B unlink()
or
.B rename()
of open files returns
.BR EBUSY .
.RE
.RS +4
.TP
.ie t \(bu
.el o
.B rename()
of extended attribute files returns
.BR EINVAL .
.RE
.RS +4
.TP
.ie t \(bu
.el o
Creation of files with any of the following illegal characters returns
.BR EINVAL :
colon
.RB ( : ),
backslash
.RB ( \e ),
slash
.RB ( / ),
asterisk (\fB*\fR), question mark (\fB?\fR), double quote (\fB"\fR), less
than
.RB ( < ),
greater than
.RB ( > ),
and vertical bar
.RB ( | ).
.RE
.RS +4
.TP
.ie t \(bu
.el o
.B chmod
and
.B chown
settings are silently discarded.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Links are not supported.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Symbolic links are not supported.
.RE
.RS +4
.TP
.ie t \(bu
.el o
.B mknod
is not supported. (Only file and directory objects are
supported.)
.RE
.sp
.LP
The current
.B smbfs
implementation does not support multi-user mounts.
Instead, each Unix user needs to make their own private mount points.
.sp
.LP
Currently, all access through an
.B smbfs
mount point uses the Windows
credentials established by the user that ran the
.B mount
command.
Normally, permissions on
.B smbfs
mount points should be
.B 0700
to
prevent Unix users from using each others' Windows credentials. See the
.B dirperms
option to \fBmount_smbfs\fR(1M) for details regarding how to
control
.B smbfs
mount point permissions.
.sp
.LP
An important implication of this limitation is that system-wide mounts,
such as those made using
.B /etc/vfstab
or automount maps are only useful
in cases where access control is not a concern, such as for public read-only
resources.
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.39i) |cw(3.11i)
lw(2.39i) |lw(3.11i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWsmbfsu
_
Interface StabilityUncommitted
.TE

.SH SEE ALSO
.sp
.LP
.BR smbutil (1),
.BR mount_smbfs (1M),
.BR nsmbrc (4),
.BR attributes (5)
