usr/src/man/man7fs/udfs.7fs
'\" te
.\" Copyright (c) 1999 Sun Microsystems, Inc.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\"  All Rights Reserved.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH udfs 7FS "29 Mar 1999" "SunOS 5.11" "File Systems"
.SH NAME
udfs \- universal disk format file system
.SH DESCRIPTION
.sp
.LP
The
.B udfs
file system is a file system type that allows user access to
files on Universal Disk Format (UDF) disks from within the Solaris operating
environment. Once mounted,  a
.B udfs
file system provides standard
Solaris file system operations and semantics. That is, users can read files,
write files,  and list files in a directory on a UDF device and applications
can use standard UNIX system calls on these files and directories.
.sp
.LP
Because
.B udfs
is a platform-independent file system, the same media
can be written to and read from by any operating system or vendor.
.SS "Mounting File Systems"
.sp
.LP
.B udfs
file systems are mounted using:
.sp
.in +2
.nf
mount\fB-F\fR udfs -o rw/ro device-special
.fi
.in -2
.sp

.sp
.LP
Use:
.sp
.in +2
.nf
mount /udfs
.fi
.in -2
.sp

.sp
.LP
if the
.B /udfs
and device special file
.B /dev/dsk/c0t6d0s0
are
valid and the following line (or similar line) appears in your
.B /etc/vfstab
file:
.sp
.in +2
.nf
/dev/dsk/c0t6d0s0 - /udfs udfs - no ro
.fi
.in -2
.sp

.sp
.LP
The
.B udfs
file system provides read-only support for ROM,  RAM,  and
sequentially-recordable media and  read-write  support on RAM media.
.sp
.LP
The
.B udfs
file system also supports regular files, directories, and
symbolic links, as well as device nodes such as block, character, FIFO, and
Socket.
.SH SEE ALSO
.sp
.LP
.BR mount (1M),
.BR mount_udfs (1M),
.BR vfstab (4)
.SH NOTES
.sp
.LP
Invalid characters such as "\fINULL\fR" and "\fB/\fR" and invalid file
names such as "\fB\&.\fR" and "\fB\&..\fR" will be translated according to
the following rule:
.sp
.LP
Replace the invalid character with an "\fB_\fR," then append the file name
with
.B #
followed by a 4 digit hex representation of the 16-bit CRC of
the original \fBFileIdentifier\fR. For example, the file name ".." will
become "__#4C05"
