usr/src/man/man7fs/ufs.7fs
'\" te
.\" Copyright (c) 2009, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" Copyright 1989 AT&T
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ufs 7FS "18 Jun 2009" "SunOS 5.11" "File Systems"
.SH NAME
ufs \- UFS file system
.SH SYNOPSIS
.LP
.nf
\fB#include <sys/param.h>\fR
.fi

.LP
.nf
\fB#include <sys/types.h>\fR
.fi

.LP
.nf
\fB#include <sys/fs/ufs_fs.h>\fR
.fi

.LP
.nf
\fB#include <sys/fs/ufs_inode.h>\fR
.fi

.SH DESCRIPTION
.sp
.LP
.B UFS
is the default disk-based file system for the Solaris
environment. The UFS file system is hierarchical, starting with its root
directory
.RB ( / )
and continuing downward through a number of directories.
The root of a UFS file system is
.BR "inode 2" .
A UFS file system's root
contents replace the contents of the directory upon which it is mounted.
.sp
.LP
Subsequent sections of this manpage provide details of the UFS file
systems.
.SS "State Flags (\fBfs_state\fR and \fBfs_clean\fR)"
.sp
.LP
UFS uses state flags to identify the state of the file system.
.B fs_state
is
.B FSOKAY
-
.BR fs_time .
.B fs_time
is the
timestamp that indicates when the last system write occurred.
.B fs_state
.RB "is updated whenever " fs_clean " changes. Some " fs_clean " values"
are:
.sp
.ne 2
.mk
.na
.B FSCLEAN
.ad
.RS 12n
.rt
Indicates an undamaged, cleanly unmounted file system.
.RE

.sp
.ne 2
.mk
.na
.B FSACTIVE
.ad
.RS 12n
.rt
Indicates a mounted file system that has modified data in memory. A mounted
file system with this state flag indicates that user data or metadata would
be lost if power to the system is interrupted.
.RE

.sp
.ne 2
.mk
.na
.B FSSTABLE
.ad
.RS 12n
.rt
Indicates an idle mounted file system. A mounted file system with this
state flag indicates that neither user data nor metadata would be lost if
power to the system is interrupted.
.RE

.sp
.ne 2
.mk
.na
.B FSBAD
.ad
.RS 12n
.rt
Indicates that this file system contains inconsistent file system data.
.RE

.sp
.ne 2
.mk
.na
.B FSLOG
.ad
.RS 12n
.rt
Indicates that the file system has logging enabled. A file system with this
flag set is either mounted or unmounted. If a file system has logging
enabled, the only flags that it can have are
.B FSLOG
or
.BR FSBAD .
A
non-logging file system can have
.BR FSACTIVE ,
.BR FSSTABLE ,
or
.BR FSCLEAN .
.RE

.sp
.LP
It is not necessary to run the
.B fsck
command on unmounted file systems
with a state of
.BR FSCLEAN ,
.BR FSSTABLE ,
or
.BR FSLOG .
.BR mount (2)
returns
.B ENOSPC
if an attempt is made to mount a
.B UFS
file system with a state of
.B FSACTIVE
for read/write access.

.sp
.LP
As an additional safeguard,
.B fs_clean
should be trusted only if
.B fs_state
contains a value equal to
.B FSOKAY
-
.BR fs_time ,
where
.B FSOKAY
is a constant integer defined in the
.B /usr/include/sys/fs/ufs_fs.h
file.  Otherwise,
.B fs_clean
is
treated as though it contains the value of
.BR FSACTIVE .
.SS "Extended Fundamental Types  (\fBEFT\fR)"
.sp
.LP
Extended Fundamental Types (EFT) provide 32-bit user ID (UID), group ID
(GID), and device numbers.
.sp
.LP
If a UID or GID contains an extended value, the short variable
.RB ( ic_suid ,
.BR ic_sgid )
contains the value 65535 and the
corresponding UID or GID is in
.B ic_uid
or
.BR ic_gid .
Because numbers
for block and character devices are stored in the first direct block pointer
of the inode
.RB ( ic_db[0] )
and the disk block addresses are already 32
bit values, no special encoding exists for device numbers (unlike UID or GID
fields).
.SS "Multiterabyte File System"
.sp
.LP
A multiterabyte file system enables creation of a UFS file system up to
approximately 16 terabytes of usable space, minus approximately one percent
overhead. A sparse file can have a logical size of one terabyte. However,
the actual amount of data that can be stored in a file is approximately one
percent less than one terabyte because of file system overhead.
.sp
.LP
On-disk format changes for a multiterabyte UFS file system include:
.RS +4
.TP
.ie t \(bu
.el o
The magic number in the superblock changes from
.B FS_MAGIC
to
.BR MTB_UFS_MAGIC .
For more information, see the
.B /usr/include/sys/fs/ufs_fs
file.
.RE
.RS +4
.TP
.ie t \(bu
.el o
The
.B fs_logbno
unit is a sector for UFS that is less than 1 terabyte
in size and fragments for a multiterabyte UFS file system.
.RE
.SS "UFS Logging"
.sp
.LP
UFS logging bundles the multiple metadata changes that comprise a complete
UFS operation into a transaction. Sets of transactions are recorded in an
on-disk log and are applied to the actual UFS file system's metadata.
.sp
.LP
UFS logging provides two advantages:
.RS +4
.TP
1.
A file system that is consistent with the transaction log eliminates the
need to run
.B fsck
after a system crash or an unclean shutdown.
.RE
.RS +4
.TP
2.
UFS logging often provides a significant performance improvement. This is
because a file system with logging enabled converts multiple updates to the
same data into single updates, thereby reducing the number of overhead disk
operations.
.RE
.sp
.LP
The UFS log is allocated from free blocks on the file system and is sized
at approximately 1 Mbyte per 1 Gbyte of file system, up to 256 Mbytes. The
log size may be larger (up to a maximum of 512 Mbytes), depending upon the
number of cylinder groups present in the file system. The log is continually
flushed as it fills up. The log is also flushed when the file system is
unmounted or as a result of a
.BR lockfs (1M)
command.
.SS "Mounting UFS File Systems"
.sp
.LP
You can mount a UFS file system in various ways using syntax similar to the
following:
.RS +4
.TP
1.
Use
.B mount
from the command line:
.sp
.in +2
.nf
# mount -F ufs /dev/dsk/c0t0d0s7 /export/home
.fi
.in -2
.sp

.RE
.RS +4
.TP
2.
Include an entry in the
.B /etc/vfstab
file to mount the file system at
boot time:
.sp
.in +2
.nf
/dev/dsk/c0t0d0s7 /dev/rdsk/c0t0d0s7 /export/home  ufs   2   yes  -
.fi
.in -2
.sp

.RE
.sp
.LP
For more information on mounting UFS file systems, see
.BR mount_ufs (1M).
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for a description of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityUncommitted
.TE

.SH SEE ALSO
.sp
.LP
.BR df (1M),
.BR fsck (1M),
.BR fsck_ufs (1M),
.BR fstyp (1M),
.BR lockfs (1M),
.BR mkfs_ufs (1M),
.BR newfs (1M),
.BR ufsdump (1M),
.BR ufsrestore (1M),
.BR tunefs (1M),
.BR mount (2),
.BR attributes (5)

.sp
.LP
.I Writing Device Drivers
.SH NOTES
.sp
.LP
For information about internal UFS structures, see
.BR newfs (1M)
and
.BR mkfs_ufs (1M).
For information about the
.B ufsdump
and
.B ufsrestore
commands, see
.BR ufsdump (1M),
\fBufsrestore\fR(1M), and
.BR /usr/include/protocols/dumprestore.h .
.sp
.LP
If you experience difficulty in allocating space on the ufs filesystem, it
may be due to framentation. Fragmentation can occur when you do not have
sufficient free blocks to satisfy an allocation request even though
.BR df (1M)
indicates that enough free space is available. (This may occur
because df only uses the available fragment count to calculate available
space, but the file system requires contiguous sets of fragments for most
allocations). If you suspect that you have exhausted contiguous fragments
on your file system, you can use the
.BR fstyp (1M)
utility with the -v
option. In the \fBfstyp\fR output,  look at the 
.I nbfree
(number  of
blocks free) and
.I nffree
(number of fragments free) fields. On
unmounted filesystems, you can use
.BR fsck (1M)
and observe  the last
line of output, which reports, among other items, the number of fragments
and the degree of fragmentation. To correct a fragmentation problem, run
.BR ufsdump (1M)
and
.BR ufsrestore (1M)
on the ufs filesystem.
