usr/src/man/man7ipp/dlcosmk.7ipp
'\" te
.\" Copyright (c) 2004, Sun Microsystems Inc.  All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH dlcosmk 7ipp "29 Sep 2004" "SunOS 5.11" "IP Quality of Service Modules"
.SH NAME
dlcosmk \- Data Layer Class of Service Marker
.SH DESCRIPTION
.sp
.LP
The
.B dlcosmk
marker is an action module that is executed as a result
of classifying or metering packets. It marks the packet with a user priority
defined by the\fI IEEE 801.D\fR standard. This feature is only possible on a
.B VLAN
device.
.sp
.LP
The 3-bit user priority is part of the
.I 802.1Q
.B VLAN
header tag
that is part of the ethernet header (carrying the IP packet).
.SH STATISTICS
.sp
.LP
The
.B dlcosmk
module exports the following statistics through
.BR kstat :
.sp
.LP
Global statistics:
.sp
.in +2
.nf
module: dlcosmk                          instance: <action id>
 name:  dlcosmk statistics               class <action name>
        crtime
        snaptime
        b_band                           <b_band value>
        dl_max                           <dl_max value>
        usr_pri                          <configured CoS>
        npackets                         <number of packets>
        epackets                         <number of packets in error>
        ipackets                         <number of packets not processed>
.fi
.in -2

.SH FILES
.sp
.ne 2
.mk
.na
.B /kernel/ipp/sparcv9/dlcosmk
.ad
.sp .6
.RS 4n
64-bit module (SPARC only.)
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWqos
.TE

.SH SEE ALSO
.sp
.LP
.BR ipqosconf (1M),
\fBdscpmk\fR(7ipp), \fBflowacct\fR(7ipp),
\fBipqos\fR(7ipp), \fBipgpc\fR(7ipp), \fBtokenmt\fR(7ipp),
.BR tswtclmt (7ipp)
