usr/src/man/man7ipp/flowacct.7ipp
'\" te
.\" Copyright (c) 2004, Sun Microsystems Inc.  All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH flowacct 7ipp "29 Sep 2004" "SunOS 5.11" "IP Quality of Service Modules"
.SH NAME
flowacct \- Flow Accouting module
.SH DESCRIPTION
.sp
.LP
The flow accounting module
.B flowacct
enables you to record flow
details. You use flow details to gather statistics and/or for billing
purposes. Accounting consists of recording flow details in a location you
designate and in a format that you can retrieve at a later stage. IPQoS
accounting relies on the exacct mechanism to store and retrieve flow
information.
.sp
.LP
A flow is defined by the 5-tuple - saddr, sport, daddr, dport and
protocol.
.sp
.LP
Typically, the accounting module is the last datapath element in a sequence
of actions. Flow attributes include ToS/DS, user id, project id, creation
time (time the flow was created), last seen (when pkts for the flow were
last seen), action name (instance that recorded the flow information),
.RB "nbytes and npackets. Attributes are split into groups entitled" " basic"
and
.BR extended .
The basic group records only the nbytes, npackets and
action name, while the extended group is a superset of the basic group and
records all attributes. The attributes to be recorded, in addition to the
accounting file that contains flow details, are selected using
.BR acctadm (1M).
The
.B flowacct
module does not provide a mechanism to
retrieve flow information from the accounting file nor to interpret the
retrieved information.
.SH STATISTICS
.sp
.LP
The flowacct module exports the following statistics available through
kstat:
.sp
.in +2
.nf
module: flowacct                   instance: <action id>
  name: Flowacct statistics        class <action name>
        bytes_in_tbl               <bytes in the flow table>
        epackets                   <packets in error>
        flows_in_tbl               <flow records in the flow table>
        nbytes                     <number of bytes through this instance>
        npackets                   <number of packets>
        usedmem                    <memory, in bytes, used by the flow table>
.fi
.in -2

.SH FILES
.sp
.ne 2
.mk
.na
.B /kernel/ipp/sparcv9/flowacct
.ad
.sp .6
.RS 4n
64-bit module (SPARC only.)
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWqos
.TE

.SH SEE ALSO
.sp
.LP
.BR ipqosconf (1M),
.BR acctadm (1M),
.BR libexacct3LIB ,
\fBdlcosmk\fR(7ipp), \fBdscpmk\fR(7ipp), \fBipqos\fR(7ipp),
\fBipgpc\fR(7ipp), \fBtokenmt\fR(7ipp), \fBtswtclmt\fR(7ipp)
