usr/src/man/man7ipp/ipgpc.7ipp
'\" te
.\" Copyright (c) 2004, Sun Microsystems Inc.  All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ipgpc 7ipp "29 Sep 2004" "SunOS 5.11" "IP Quality of Service Modules"
.SH NAME
ipgpc \- IP Generic Packet Classifier
.SH DESCRIPTION
.sp
.LP
The IP Generic Packet Classifier
.RB ( ipgpc )
module provides packet
classification at the Solaris IP layer.
.B ipgpc
is an implementation of
the Multi-Field (MF) classifier as described in
.IR "RFC2475: An Architecture for Differentiated Services" .
.sp
.LP
The classifier is configured, at startup or dynamically, using a set of
"filters." Filters describe selectors that are matched against input packets
that are processed by the classifier. Some selectors feature exact matching
data points, while others utilize non-exact or wildcard data points.
.sp
.LP
Each filter is associated with a class describing the next actions to
process a packet. There is a many-to-one (M-to-1) mapping relationship
between filters and a class. Additionally, each class is aware of which
filters are associated with it. A class is configured with a class name and
a next action.
.sp
.LP
Unlike traditional classifiers used in edge routers,
.B ipgpc
is
designed for a host or server device. A host-based classifier provides
access to more resources and data than edge routers. User, project, and
interface information are available at the host.
.SH STATISTICS
.sp
.LP
The
.B ipgpc
module exports global and per-class statistics (available
through kstat:)
.sp
.LP
Global statistics:
.sp
.in +2
.nf
module: ipgpc                           instance:<action id>
name:   ipgpc global stats              class: <action name>
        crtime
        snaptime
        nbytes                          <number of classified bytes>
        nclasses                        <number of classes>
        nfilters                        <number of filters>
        npackets                        <number of classified packets>
        epackets                        <number of packets in error>
.fi
.in -2

.sp
.LP
Per-class statistics:
.sp
.in +2
.nf
module: ipgpc                           instance:<action id>
name:   <class name>                    class: <action name>
        crtime
        snaptime
        last match                      <time of last match>
        nbytes                          <number of classified bytes>
        npackets                        <number of classified packets>
.fi
.in -2

.SH FILES
.sp
.ne 2
.mk
.na
.B /kernel/ipp/sparcv9/ipgpc
.ad
.RS 29n
.rt
64-bit module (SPARC only.)
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWqos
.TE

.SH SEE ALSO
.sp
.LP
.BR ipqosconf (1M),
\fBdlcosmk\fR(7ipp), \fBdscpmk\fR(7ipp),
\fBflowacct\fR(7ipp), \fBipqos\fR(7ipp), \fBtokenmt\fR(7ipp),
.BR tswtclmt (7ipp)
.sp
.LP
.I "RFC 2475, An Architecture for Differentiated Services
S. Blake, D.
Black, M. Carlson, E. Davies, Z. Wang, W. Weiss \(em The Internet Society,
1998
