usr/src/man/man7ipp/ipqos.7ipp
'\" te
.\" Copyright (c) 2002, Sun Microsystems Inc.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\"  All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ipqos 7ipp "25 Feb 2002" "SunOS 5.11" "IP Quality of Service Modules"
.SH NAME
ipqos \- IP Quality of Service
.SH DESCRIPTION
.sp
.LP
.B ipqos
is an implementation of the Differentiated Services model
defined in
.IR "RFC2475: An Architecture for Differentiated Services" ,
which
defines the following entities: multi-field classifier, meter, marker, and
dropper. The Solaris implementation of
.B ipqos
adds a flow accounting
entity.
.sp
.LP
These entities can be combined into processing paths that constitute a
series of actions that are performed on groups of flows. The classifier
groups together flows and directs them in a given processing path.
Classifier configuration and path construction are achieved using the
.BR ipqosconf (1M)
command.
.sp
.LP
A summary of the
.B ipqos
entities follows. For more information, refer
to the corresponding man page for each entity.
.sp
.ne 2
.mk
.na
.B ipgpc
.ad
.RS 21n
.rt
An implementation of the classifier defined in the model.
.B ipgpc
has
been extended and is able to select traffic based on IP header parameters,
user id, project id, interface name, interface group and direction.
.RE

.sp
.ne 2
.mk
.na
.B tokenmt, tswtclmt
.ad
.RS 21n
.rt
These modules implement different metering algorithms.
.B tokenmt
implements both
.I "RFC2697: A Single Rate Three Color Marker"
and \fIRFC 2698: A Two Rate Three Color Marker\fR.
.I tswtclmt
implements
.IR "RFC2859: A Time Sliding Window Three Color Marker" .
These modules only
implement the metering functions defined in the RFCs.
.RE

.sp
.ne 2
.mk
.na
.B dlcosmk
.ad
.RS 21n
.rt
A marker entity that allows the setting of the user priority field of
Ethernet frames as defined in the
.I "IEEE 802.1D"
specification.
.B dlcosmk
is only available with VLAN capable network
interfaces.
.RE

.sp
.ne 2
.mk
.na
.B dscpmk
.ad
.RS 21n
.rt
A marker entity that enables the setting of the Differentiated Services
Code Point Value in the IP header as defined in \fIRFC 2474: Definition of the Differentiated Services Field (DS Field)\fR in the IPv4 and IPv6
headers.
.RE

.sp
.ne 2
.mk
.na
.B flowacct
.ad
.RS 21n
.rt
An accounting module that utilizes the Solaris extended accounting
facility.
.B flowacct
logs all flows with parameters used to build a
charge back mechanism.
.RE

.SH STATISTICS
.sp
.LP
.B ipqos
modules export statistics through the
.B kstat
facility.
Exported statistics contain the following common parameters:
.sp
.ne 2
.mk
.na
.B module
.ad
.RS 12n
.rt
module name
.RE

.sp
.ne 2
.mk
.na
.B instance
.ad
.RS 12n
.rt
dynamic parameter identifying a specific instance
.RE

.sp
.ne 2
.mk
.na
.B name
.ad
.RS 12n
.rt
a string  for global statistics (for example, ipgpc global stat) or a class
name for per-class statistics for a classifier action
.RE

.sp
.LP
To verify classifier configuration, generate traffic for each of the
configured classes and check that the statistic counters for the expected
class are increased. If you're unsure about the parameters for your traffic,
you can use
.BR snoop "(1M) to determine them."
.sp
.LP
Some actions have the instance id of the next configured action in their
statistics. This instance id can be used to follow the action processing
path. Instance id's -1 and -2 are the built-in actions continue and drop,
respectively.
.sp
.LP
Examples:
.sp
.LP
To retrieve all statistics for ipgpc:
.sp
.LP
 \fBkstat -m ipgpc\fR
.sp
.LP
To retrieve statistics for the class http:
.sp
.LP
 \fBkstat -m ipgpc -c http\fR
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWqos (32-bit) SUNWqosx (64-bit)
.TE

.SH SEE ALSO
.sp
.LP
.BR ipqosconf (1M),
\fBdlcosmk\fR(7ipp), \fBdscpmk\fR(7ipp),
\fBflowacct\fR(7ipp), \fBipgpc\fR(7ipp), \fBtokenmt\fR(7ipp),
.BR tswtclmt (7ipp)
.sp
.LP
.I "RFC 2475, An Architecture for Differentiated Services
S. Blake, D.
Black, M. Carlson, E. Davies, Z. Wang, W. Weiss \(em The Internet Society,
1998
.sp
.LP
\fIRFC 2474, Definition of the Differentiated Services Field (DS Field) in
the IPv4 and IPv6 Headers\fR K. Nichols, S. Blake, F. Baker, D. Black \(em
The Internet Society, 1998
.sp
.LP
.I "RFC 2697, A Single Rate Three Color Marker
J. Heinanen, R. Guerin
\(em The Internet Society, 1999
.sp
.LP
.I "RFC 2698, A Two Rate Three Color Marker
J. Heinanen, R. Guerin \(em
The Internet Society, 1999
.sp
.LP
.I "RFC 2859, A Time Sliding Window Three Colour Marker (TSWTCM)
W. Fang,
N. Seddigh, B. Nandy \(em The Internet Society, 2000
