usr/src/man/man7ipp/tswtclmt.7ipp
'\" te
.\" Copyright (c) 2004, Sun Microsystems Inc.  All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH tswtclmt 7ipp "29 Sep 2004" "SunOS 5.11" "IP Quality of Service Modules"
.SH NAME
tswtclmt \- Time Sliding Window Three Conformance Level Meter
.SH DESCRIPTION
.sp
.LP
The Time Sliding Window Three Conformance level meter (\fBtswtcl\fR) meters
a traffic stream and determines the conformance level of its packets.
.sp
.LP
Packets are deemed to belong to one of the three levels, Red, Yellow or
Green, depending on the committed and peak rate.
.sp
.LP
The meter provides an estimate of the running average bandwidth. It takes
into account burstiness and smoothes out its estimate to  approximate the
longer-term measured sending rate of the traffic stream.
.sp
.LP
The estimated bandwidth approximates the running average bandwidth of the
traffic stream over a specific window (time interval).
.B tswtcl
estimates
the average bandwidth using a time-based estimator. When a packet arrives for
a class,
.B tswtcl
re-computes the average rate by using the rate in the
last window (time interval) and the size of the arriving packet. The window
is then slid to start at the current time (the packet arrival time). If the
computed rate is less than the committed configuration parameter, the packet
is deemed Green; else if the rate is less than the peak rate, it is Yellow;
else Red. To avoid dropping multiple packets within a TCP window,
.B tswtcl
probabilistically assigns one of the three conformance level to
the packet.
.SH STATISTICS
.sp
.LP
The
.B tswtcl
module exports global and per-class statistics through
kstat:
.sp
.LP
Global statistics:
.sp
.in +2
.nf
module: tswtclmt                         instance: <action id>
  name: tswtclmt statistics              class <action name>
        green_bits                      <number of bit in green>
        green_packets                   <number of packets in green>
        red_bits                        <number of bits in red>
        red_packets                     <number of packets in red>
        yellow_bits                     <number of bits in yellow>
        yellow_packets                  <number of packets in yellow>
.fi
.in -2

.SH FILES
.sp
.ne 2
.mk
.na
.B /kernel/ipp/sparcv9/tswtclmt
.ad
.sp .6
.RS 4n
64-bit module (SPARC only.)
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWqos
.TE

.SH SEE ALSO
.sp
.LP
.BR ipqosconf (1M),
\fBdlcosmk\fR(7ipp), \fBdscpmk\fR(7ipp),
\fBflowacct\fR(7ipp), \fBipqos\fR(7ipp), \fBipgpc\fR(7ipp),
.BR tokenmt (7ipp)
.sp
.LP
.I "RFC 2859, A Time Sliding Window Three Colour Marker (TSWTCM)
W. Fang,
N. Seddigh, B. Nandy \(em The Internet Society, 2000
