usr/src/man/man9f/atomic_bits.9f
'\" te
.\" Copyright (c) 2006, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH atomic_bits 9F "16 Jan 2006" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
atomic_bits, atomic_set_long_excl, atomic_clear_long_excl \- atomic set and
clear bit operations
.SH SYNOPSIS
.LP
.nf
#include <sys/atomic.h>

\fBint\fR \fBatomic_set_long_excl\fR(\fBvolatile ulong_t *\fItarget\fR, \fBuint_t\fR \fIbit\fR);
.fi

.LP
.nf
\fBint\fR \fBatomic_clear_long_excl\fR(\fBvolatile ulong_t *\fItarget\fR, \fBuint_t\fR \fIbit\fR);
.fi

.SH DESCRIPTION
.sp
.LP
The
.B atomic_set_long_excl()
and
.BR atomic_clear_long_excl()
functions perform an exclusive atomic bit set or clear operation on
.IR target .
The value of
.I bit
specifies the number of the bit to be
modified within target. Bits are numbered from zero to one less than the
maximum number of bits in a
.BR long .
If the value of bit falls outside of
this range, the result of the operation is undefined.
.SH RETURN VALUES
.sp
.LP
The
.B atomic_set_long_excl()
and
.BR atomic_clear_long_excl()
functions return 0 if
.I bit
was successfully set or cleared. They return
-1 if
.I bit
was already set or cleared.
.SH ERRORS
.sp
.LP
No errors are defined.
.SH CONTEXT
.sp
.LP
These functions can be called from user, interrupt, or kernel context.
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
.BR atomic_add (9F),
.BR atomic_and (9F),
.BR atomic_cas (9F),
.BR atomic_dec (9F),
.BR atomic_inc (9F),
.BR atomic_or (9F),
.BR atomic_swap (9F),
.BR membar_ops (9F),
.BR attributes (5),
.BR atomic_ops (3C)
