usr/src/man/man9f/backq.9f
'\" te
.\" Copyright 1989 AT&T
.\" Copyright (c) 2006, Sun Microsystems, Inc.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\"  All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH backq 9F "16 Jan 2006" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
backq \- get pointer to the queue behind the current queue
.SH SYNOPSIS
.LP
.nf
#include <sys/stream.h>



\fBqueue_t *\fBbackq\fR(\fBqueue_t *\fIcq\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Architecture independent level 1 (DDI/DKI).
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I cq
.ad
.RS 6n
.rt
The pointer to the current queue.
.B queue_t
is an alias for the
.BR queue (9S)
structure.
.RE

.SH DESCRIPTION
.sp
.LP
The
.B backq()
function returns a pointer to the queue preceding
.I cq
(the current queue). If
.I cq
is a read queue,
.B backq()
returns a pointer to the queue downstream from
.IR cq ,
unless it is the
stream end. If
.I cq
is a write queue,
.B backq()
returns a pointer to
the next queue upstream from
.IR cq ,
unless it is the stream head.
.SH RETURN VALUES
.sp
.LP
If successful,
.B backq()
returns a pointer to the queue preceding the
.RI "current queue. Otherwise, it returns" " NULL."
.SH CONTEXT
.sp
.LP
The
.B backq()
function can be called from user, interrupt, or kernel
context.
.SH SEE ALSO
.sp
.LP
.BR queue (9S)
.sp
.LP
.I Writing Device Drivers
.sp
.LP
.I STREAMS Programming Guide
