usr/src/man/man9f/bcanput.9f
'\" te
.\" Copyright 1989 AT&T
.\" Copyright (c) 2006, Sun Microsystems, Inc.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\"  All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH bcanput 9F "16 Jan 2006" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
bcanput \- test for flow control in specified priority band
.SH SYNOPSIS
.LP
.nf
#include <sys/stream.h>



\fBint\fR \fBbcanput\fR(\fBqueue_t *\fIq\fR, \fBunsigned char\fR \fIpri\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Architecture independent level 1 (DDI/DKI).
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I q
.ad
.RS 7n
.rt
Pointer to the message queue.
.RE

.sp
.ne 2
.mk
.na
.I pri
.ad
.RS 7n
.rt
Message priority.
.RE

.SH DESCRIPTION
.sp
.LP
The
.B bcanput()
function searches through the stream (starting at
.IR q )
until it finds a queue containing a service routine where the
message can be enqueued, or until it reaches the end of the stream. If
found, the queue containing the service routine is tested to see if there is
room for a message of priority
.I pri
in the queue.
.sp
.LP
If
.I pri
is
.BR 0 ,
.B bcanput()
is equivalent to a call with
.BR canput (9F).
.sp
.LP
\fBcanputnext(\fIq\fB)\fR and
\fBbcanputnext(\fIq\fB,\fIpri\fB)\fR should always be used in
preference to \fBcanput(\fIq\fB\(->q_next)\fR and
\fBbcanput(\fIq\fB\(->q_next,\fIpri\fB)\fR respectively.
.SH RETURN VALUES
.sp
.ne 2
.mk
.na
.B 1
.ad
.RS 5n
.rt
If a message of priority
.I pri
can be placed on the queue.
.RE

.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 5n
.rt
If the priority band is full.
.RE

.SH CONTEXT
.sp
.LP
The
.B bcanput()
function can be called from user, interrupt, or kernel
context.
.SH SEE ALSO
.sp
.LP
.BR bcanputnext (9F),
.BR canput (9F),
.BR canputnext (9F),
.BR putbq (9F),
.BR putnext (9F)
.sp
.LP
.I Writing Device Drivers
.sp
.LP
.I STREAMS Programming Guide
.SH WARNINGS
.sp
.LP
Drivers are responsible for both testing a queue with
.B bcanput()
and
refraining from placing a message on the queue if
.B bcanput()
fails.
