usr/src/man/man9f/bioerror.9f
'\" te
.\" Copyright (c) 1994, Sun Microsystems, Inc.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH bioerror 9F "26 May 1994" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
bioerror \- indicate error in buffer header
.SH SYNOPSIS
.LP
.nf
#include <sys/types.h>
#include <sys/buf.h>
#include <sys/ddi.h>



\fBvoid\fR \fBbioerror\fR(\fBstruct buf *\fIbp\fR, \fBint\fR \fIerror\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI)
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I bp
.ad
.RS 10n
.rt
Pointer to the
.BR buf (9S)
structure describing the transfer.
.RE

.sp
.ne 2
.mk
.na
.I error
.ad
.RS 10n
.rt
Error number to be set, or zero to clear an error indication.
.RE

.SH DESCRIPTION
.sp
.LP
If
.I error
is non-zero,
.B bioerror()
indicates an error has occured
in the
.BR buf (9S)
structure. A subsequent call to
.BR geterror (9F)
will
return
.IR error .
.sp
.LP
If
.I error
is
.BR 0 ,
the error indication is cleared and a
subsequent call to
.BR geterror "(9F) will return"
.BR 0 .
.SH CONTEXT
.sp
.LP
.B bioerror()
can be called from any context.
.SH SEE ALSO
.sp
.LP
.BR strategy (9E),
.BR geterror (9F),
.BR getrbuf (9F),
.BR buf (9S)
