usr/src/man/man9f/biofini.9f
'\" te
.\" Copyright (c) 2009 Sun Microsystems, Inc.,  All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH biofini 9F "20 Nov 1996" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
biofini \- uninitialize a buffer structure
.SH SYNOPSIS
.LP
.nf
#include <sys/ddi.h>
#include <sys/sunddi.h>

\fBvoid\fR \fBbiofini\fR(\fBstruct buf *\fIbp\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI).
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I bp
.ad
.RS 6n
.rt
Pointer to the buffer header structure.
.RE

.SH DESCRIPTION
.sp
.LP
The \fBbiofini()\fR function uninitializes a \fBbuf\fR(9S) structure. If a
buffer structure has been allocated and initialized using
.BR kmem_alloc (9F)
and
.BR bioinit "(9F) it needs to be uninitialized"
using \fBbiofini()\fR before calling \fBkmem_free\fR(9F). It is not
necessary to call
.B biofini()
before freeing a buffer structure using
.BR freerbuf (9F)
because \fBfreerbuf()\fR will call \fBbiofini()\fR
directly.
.SH CONTEXT
.sp
.LP
The
.B biofini()
function can be called from any context.
.SH EXAMPLES
.LP
.B Example 1
Using \fBbiofini()\fR
.sp
.in +2
.nf
struct buf *bp = kmem_alloc(biosize(), KM_SLEEP); 	
bioinit(bp); 	
/* use buffer */ 	
biofini(bp); 	
kmem_free(bp, biosize());
.fi
.in -2

.SH SEE ALSO
.sp
.LP
.BR bioinit (9F),
.BR bioreset (9F),
.BR biosize (9F),
.BR freerbuf (9F),
.BR kmem_alloc (9F),
.BR kmem_free (9F),
.BR buf (9S)

.sp
.LP
.I Writing Device Drivers
