usr/src/man/man9f/bioinit.9f
'\" te
.\" Copyright (c) 2009 Sun Microsystems, Inc.,  All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH bioinit 9F "20 Nov 1996" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
bioinit \- initialize a buffer structure
.SH SYNOPSIS
.LP
.nf
#include <sys/ddi.h>
#include <sys/sunddi.h>

\fBvoid\fR \fBbioinit\fR(\fBstruct buf *\fIbp\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI).
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I bp
.ad
.RS 6n
.rt
Pointer to the buffer header structure.
.RE

.SH DESCRIPTION
.sp
.LP
The
.B bioinit()
function initializes a \fBbuf\fR(9S) structure. A
buffer structure contains state information which has to be initialized if
the memory for the buffer was allocated using
.BR kmem_alloc "(9F). This is"
not necessary for a buffer allocated using \fBgetrbuf\fR(9F) because
.B getrbuf()
will call
.B bioinit()
directly.
.SH CONTEXT
.sp
.LP
The
.B bioinit()
function can be called from any context.
.SH EXAMPLES
.LP
.B Example 1
Using
.BR bioinit()
.sp
.in +2
.nf

struct buf *bp = kmem_alloc(biosize(), KM_SLEEP);
bioinit(bp);
/* use buffer */
.fi
.in -2

.SH SEE ALSO
.sp
.LP
.BR biofini (9F),
.BR bioreset (9F),
.BR biosize (9F),
.BR getrbuf (9F),
.BR kmem_alloc (9F),
.BR buf (9S)
.sp
.LP
.I Writing Device Drivers
