usr/src/man/man9f/biomodified.9f
'\" te
.\" Copyright (c) 2009 Sun Microsystems, Inc.  All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH biomodified 9F "20 Nov 1996" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
biomodified \- check if a buffer is modified
.SH SYNOPSIS
.LP
.nf
#include <sys/ddi.h>
#include <sys/sunddi.h>

\fBint\fR \fBbiomodified\fR(\fBstruct buf *\fIbp\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI).
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I bp
.ad
.RS 6n
.rt
Pointer to the buffer header structure.
.RE

.SH DESCRIPTION
.sp
.LP
The
.B biomodified()
function returns status to indicate if the buffer
is modified. The
.B biomodified()
function is only supported for paged-
.B I/O
request, that is the
.BR B_PAGEIO flag
must be set in the
.I b_flags
field of the
.BR buf (9S)
structure.  The
.B biomodified()
function will check the memory pages associated with
this buffer whether the Virtual Memory system's modification bit is set.  If
at least one of these pages is modified, the buffer is indicated as
modified. A filesystem will mark the pages
.B unmodified
when it writes
the pages to the backing store.  The
.B biomodified()
function can be
used to detect any modifications to the memory pages while
.B I/O
is in
progress.
.sp
.LP
A device driver can use
.B biomodified()
for disk mirroring.  An
application is allowed to mmap a file which can  reside on a disk which is
mirrored by multiple submirrors. If the file system writes the file to the
backing store, it is written to all  submirrors in parallel. It must be
ensured that the copies on all submirrors are identical. The
.B biomodified()
function can be used in the device driver to detect any
modifications to  the buffer by the user program during the time the buffer
is written to multiple submirrors.
.SH RETURN VALUES
.sp
.LP
The
.B biomodified()
function returns the following values:
.sp
.ne 2
.mk
.na
.B 1
.ad
.RS 6n
.rt
Buffer is modified.
.RE

.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 6n
.rt
Buffer is not modified.
.RE

.sp
.ne 2
.mk
.na
.B -1
.ad
.RS 6n
.rt
Buffer is not used for paged
.B I/O
request.
.RE

.SH CONTEXT
.sp
.LP
.B biomodified()
can be called from any context.
.SH SEE ALSO
.sp
.LP
.BR bp_mapin (9F),
.BR buf (9S)
.sp
.LP
.I Writing Device Drivers
