usr/src/man/man9f/bioreset.9f
'\" te
.\" Copyright (c) 1996, Sun Microsystems, Inc.,  All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH bioreset 9F "15 Nov 1996" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
bioreset \- reuse a private buffer header after I/O is complete
.SH SYNOPSIS
.LP
.nf
#include <sys/buf.h>
#include <sys/ddi.h>



\fBvoid\fR \fBbioreset\fR(\fBstruct buf *\fIbp\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI)
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I bp
.ad
.RS 7n
.rt
Pointer to the
.BR buf (9S)
structure.
.RE

.SH DESCRIPTION
.sp
.LP
.B bioreset()
is used by drivers that allocate private buffers with
.BR getrbuf (9F)
or
.BR kmem_alloc "(9F) and want to reuse them in multiple"
transfers before freeing them with
.BR freerbuf (9F)
or
.BR kmem_free (9F).
.B bioreset()
resets the buffer header to the state
it had when initially allocated by
.B getrbuf()
or initialized by
.BR bioinit (9F).
.SH CONTEXT
.sp
.LP
.B bioreset()
can be called from any context.
.SH SEE ALSO
.sp
.LP
.BR strategy (9E),
.BR bioinit (9F),
.BR biofini (9F),
.BR freerbuf (9F),
.BR getrbuf (9F),
.BR kmem_alloc (9F),
.BR kmem_free (9F),
.BR buf (9S)
.SH NOTES
.sp
.LP
.I bp
must not describe a transfer in progress.
