usr/src/man/man9f/biosize.9f
'\" te
.\" Copyright (c) 2009 Sun Microsystems, Inc.,  All Rights Reserved.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH biosize 9F "20 Nov 1996" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
biosize \- returns size of a buffer structure
.SH SYNOPSIS
.LP
.nf
#include <sys/ddi.h>
#include <sys/sunddi.h>

\fBsize_t\fR \fBbiosize\fR(void)
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI).
.SH DESCRIPTION
.sp
.LP
The 
.B biosize()
function returns the size in bytes of the
\fBbuf\fR(9S) structure. The  \fBbiosize()\fR function is used by drivers in
combination with
.BR kmem_alloc "(9F) and"
.BR bioinit (9F)
to allocate
buffer structures embedded in other data structures.
.SH CONTEXT
.sp
.LP
The
.B biosize()
function can be called from any context.
.SH SEE ALSO
.sp
.LP
\fBbiofini\fR(9F), \fBbioinit\fR(9F), \fBgetrbuf\fR(9F),
.BR kmem_alloc (9F),
\fBbuf\fR(9S)
.sp
.LP
.I Writing Device Drivers
