usr/src/man/man9f/biosize.9f
'\" te
.\" Copyright (c) 2009 Sun Microsystems, Inc.,  All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH biosize 9F "20 Nov 1996" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
biosize \- returns size of a buffer structure
.SH SYNOPSIS
.LP
.nf
#include <sys/ddi.h>
#include <sys/sunddi.h>

\fBsize_t\fR \fBbiosize\fR(void)
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI).
.SH DESCRIPTION
.sp
.LP
The
.B biosize()
function returns the size in bytes of the
.BR buf (9S)
structure. The
.B biosize()
function is used by drivers in
combination with
.BR kmem_alloc "(9F) and"
.BR bioinit (9F)
to allocate
buffer structures embedded in other data structures.
.SH CONTEXT
.sp
.LP
The
.B biosize()
function can be called from any context.
.SH SEE ALSO
.sp
.LP
.BR biofini (9F),
.BR bioinit (9F),
.BR getrbuf (9F),
.BR kmem_alloc (9F),
.BR buf (9S)
.sp
.LP
.I Writing Device Drivers
