usr/src/man/man9f/biowait.9f
'\" te
.\" Copyright 1989 AT&T
.\" Copyright (c) 1997, Sun Microsystems, Inc., All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH biowait 9F "11 Apr 1991" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
biowait \- suspend processes pending completion of block I/O
.SH SYNOPSIS
.LP
.nf
#include <sys/types.h>
#include <sys/buf.h>



\fBint\fR \fBbiowait\fR(\fBstruct buf *\fIbp\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Architecture independent level 1 (DDI/DKI).
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I bp
.ad
.RS 7n
.rt
Pointer to the
.B buf
structure describing the transfer.
.RE

.SH DESCRIPTION
.sp
.LP
.RB "Drivers allocating their own  " buf " structures with  " getrbuf (9F)
can use the
.B biowait()
function to suspend the current thread and wait
for completion of  the transfer.
.sp
.LP
Drivers  must call
.BR biodone (9F)
when the transfer is complete to
notify the thread blocked by
.BR biowait() .
.B biodone()
is usually
called in the interrupt routine.
.SH RETURN VALUES
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 12n
.rt
Upon success
.RE

.sp
.ne 2
.mk
.na
.B non-zero
.ad
.RS 12n
.rt
Upon
.B I/O
failure.
.B biowait()
calls
.BR geterror "(9F) to"
retrieve the error number which it returns.
.RE

.SH CONTEXT
.sp
.LP
.B biowait()
can be called from user context only.
.SH SEE ALSO
.sp
.LP
.BR biodone (9F),
.BR geterror (9F),
.BR getrbuf (9F),
.BR buf (9S)
.sp
.LP
.I Writing Device Drivers
