usr/src/man/man9f/bp_copyin.9f
'\" te
.\" Copyright (c) 2007, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH bp_copyin 9F "16 Oct 2007" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
bp_copyin \- copy from a buf(9S) into a driver buffer
.SH SYNOPSIS
.LP
.nf
#include <sys/types.h>
#include <sys/buf.h>




\fBint\fR \fBbp_copyin\fR(\fBstruct buf *\fIbp\fR, \fBvoid *\fIdriverbuf\fR, \fBoffset_t\fR \fIoffset\fR,
     \fBsize_t\fR \fIsize\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Architecture independent level 1 (DDI/DKI).
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I bp
.ad
.RS 13n
.rt
Pointer to the buffer header structure to copy from.
.RE

.sp
.ne 2
.mk
.na
.I driverbuf
.ad
.RS 13n
.rt
Driver buffer to copy to.
.RE

.sp
.ne 2
.mk
.na
.I offset
.ad
.RS 13n
.rt
Offset into
.I bp
where to start copying.
.RE

.sp
.ne 2
.mk
.na
.I size
.ad
.RS 13n
.rt
Size of copy.
.RE

.SH DESCRIPTION
.sp
.LP
The
.B bp_copyin()
function copies
.I size
bytes into the memory
associated with
.I bp
to the destination driver buffer
.IR driverbuf .
The
.I offset
only applies to
.IR bp .
.SH RETURN VALUES
.sp
.LP
Under normal conditions, 0 is returned to indicate a successful copy.
Otherwise, -1 is returned if
.I bp
references invalid pages.
.SH CONTEXT
.sp
.LP
The
.B bp_copyin()
function can be called from user or kernel context
only.
.SH SEE ALSO
.sp
.LP
.BR bp_copyout (9F),
.BR bp_mapin (9F),
.BR bp_mapout (9F),
.BR ddi_copyout (9F),
.BR buf (9S)
