usr/src/man/man9f/bp_mapin.9f
'\" te
.\" Copyright (c) 1992, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" Copyright 1989 AT&T
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH bp_mapin 9F "13 Sep 1992" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
bp_mapin \- allocate virtual address space
.SH SYNOPSIS
.LP
.nf
#include <sys/types.h>
#include <sys/buf.h>



\fBvoid\fR \fBbp_mapin\fR(\fBstruct buf *\fIbp\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Architecture independent level 1 (DDI/DKI).
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I bp
.ad
.RS 7n
.rt
Pointer to the buffer header structure.
.RE

.SH DESCRIPTION
.sp
.LP
.B bp_mapin()
is used to map virtual address space to a page list
maintained by the buffer header during a paged-
.B I/O
request.
.B bp_mapin()
allocates system virtual address space, maps that space to
the page list, and returns the starting address of the space in the
.B bp->b_un.b_addr
field of the \fBbuf\fR(9S) structure. Virtual address
space is then deallocated using the \fBbp_mapout\fR(9F) function.
.sp
.LP
If a null page list is encountered,
.B bp_mapin()
returns without
allocating space and no mapping is performed.
.SH CONTEXT
.sp
.LP
.B bp_mapin()
can be called from user and kernel contexts.
.SH SEE ALSO
.sp
.LP
.BR bp_mapout (9F),
.BR buf (9S)
.sp
.LP
.I Writing Device Drivers
