usr/src/man/man9f/bp_mapout.9f
'\" te
.\" Copyright 1989 AT&T
.\" Copyright (c) 1996, Sun Microsystems, Inc.  All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH bp_mapout 9F "15 Nov 1996" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
bp_mapout \- deallocate virtual address space
.SH SYNOPSIS
.LP
.nf
#include <sys/types.h>
#include <sys/buf.h>



\fBvoid\fR \fBbp_mapout\fR(\fBstruct buf *\fIbp\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Architecture independent level 1 (DDI/DKI).
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I bp
.ad
.RS 7n
.rt
Pointer to the buffer header structure.
.RE

.SH DESCRIPTION
.sp
.LP
.B bp_mapout()
deallocates system virtual address space allocated by a
previous call to  \fBbp_mapin\fR(9F)\fB\&.\fBbp_mapout()\fR should only
be called on buffers which have been allocated and are owned by the device
driver. It must not be called on buffers  passed to the driver through the
.BR strategy (9E)
entry point (for example a filesystem). Because
.BR bp_mapin (9F)
does not keep a reference count,
.B bp_mapout()
will
wipe out any kernel mapping that a layer above the device driver might rely
on.
.SH CONTEXT
.sp
.LP
.B bp_mapout()
can be called from user context only.
.SH SEE ALSO
.sp
.LP
.BR strategy (9E),
.BR bp_mapin (9F),
.BR buf (9S)
.sp
.LP
.I Writing Device Drivers
