usr/src/man/man9f/clrbuf.9f
'\" te
.\" Copyright 1989 AT&T
.\" Copyright (c) 2006, Sun Microsystems, Inc.  All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH clrbuf 9F "16 Jan 2006" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
clrbuf \- erase the contents of a buffer
.SH SYNOPSIS
.LP
.nf
#include <sys/types.h>
#include <sys/buf.h>



\fBvoid\fR \fBclrbuf\fR(\fBstruct buf *\fIbp\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Architecture independent level 1 (DDI/DKI).
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I bp
.ad
.RS 6n
.rt
Pointer to the
.BR buf (9S)
structure.
.RE

.SH DESCRIPTION
.sp
.LP
.RB "The " clrbuf() " function zeros a buffer and sets the " b_resid 
member of the
.BR buf (9S)
structure to
.BR 0 .
Zeros are placed in the
buffer starting at \fIbp\fB\(->b_un.b_addr\fR for a length of
\fIbp\fB\(->b_bcount\fR bytes. \fBb_un.b_addr\fR and
.B b_bcount
are
members of the
.BR buf (9S)
data structure.
.SH CONTEXT
.sp
.LP
The
.B clrbuf()
function can be called from user, interrupt, or kernel
context.
.SH SEE ALSO
.sp
.LP
.BR getrbuf (9F),
.BR buf (9S)
.sp
.LP
.I Writing Device Drivers
