usr/src/man/man9f/copyout.9f
'\" te
.\" Copyright 1989 AT&T  Copyright (c) 1996, Sun Microsystems, Inc.  All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH copyout 9F "27 Sep 2002" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
copyout \- copy data from a driver to a user program
.SH SYNOPSIS
.LP
.nf
#include <sys/types.h>
#include <sys/ddi.h>



\fBint\fR \fBcopyout\fR(\fBconst void *\fIdriverbuf\fR, \fBvoid *\fIuserbuf\fR, \fBsize_t\fR \fIcn\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
This interface is obsolete.
.BR ddi_copyout (9F)
should be used instead.
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I driverbuf
.ad
.RS 14n
.rt
Source address in the driver from which the data is transferred.
.RE

.sp
.ne 2
.mk
.na
.I userbuf
.ad
.RS 14n
.rt
Destination address in the user program to which the data is transferred.
.RE

.sp
.ne 2
.mk
.na
.I cn
.ad
.RS 14n
.rt
Number of bytes moved.
.RE

.SH DESCRIPTION
.sp
.LP
.B copyout()
copies data from driver buffers to user data space.
.sp
.LP
Addresses that are word-aligned are moved most efficiently.  However, the
driver developer is not obligated to ensure alignment.  This function
automatically finds the most efficient move algorithm according to address
alignment.
.SH RETURN VALUES
.sp
.LP
Under normal conditions, a
.B 0
is returned to indicate a successful copy.
Otherwise, a \(mi\fB1\fR is returned if one of the following occurs:
.RS +4
.TP
.ie t \(bu
.el o
Paging fault; the driver tried to access a page of memory for which it did not
have read or write access.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Invalid user address, such as a user area or stack area.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Invalid address that would have resulted in data being copied into the user
block.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Hardware fault; a hardware error prevented access to the specified user
memory. For example, an uncorrectable parity or
.B ECC
error occurred.
.RE
.sp
.LP
If a \(mi\fB1\fR is returned to the caller, driver entry point routines should
return
.BR EFAULT .
.SH CONTEXT
.sp
.LP
.B copyout()
can be called from user context only.
.SH EXAMPLES
.LP
.B Example 1
An
.B ioctl()
Routine
.sp
.LP
A driver
.BR ioctl "(9E) routine (line 10) can be used to get or set device"
attributes or registers.  In the
.B XX_GETREGS
condition (line 17), the
driver copies the current device register values to a user data area (line 18).
If the specified argument contains an invalid address, an error code is
returned.

.sp
.in +2
.nf
 1  struct device  {      /* layout of physical device registers  */
 2       int      control;     /* physical device control word  */
 3       int      status;      /* physical device status word   */
 4       short    recv_char;   /* receive character from device */
 5       short    xmit_char;   /* transmit character to device  */
 6  };
 7
 8  extern struct device xx_addr[]; /* phys. device regs. location */
 9    . . .
10  xx_ioctl(dev_t dev, int cmd, int arg, int mode,
11      cred_t *cred_p, int *rval_p)
12               ...
13  {
14      register struct device *rp = &xx_addr[getminor(dev) >> 4];
15      switch (cmd) {
16
17      case XX_GETREGS:     /* copy device regs. to user program */
18            if (copyout(rp, arg, sizeof(struct device)))
19                return(EFAULT);
20            break;
21               ...
22      }
23               ...
24  }
.fi
.in -2

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for a description of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
\fBATTRIBUTE TYPE\fR\fBATTRIBUTE VALUE\fR
_
Stability LevelObsolete
.TE

.SH SEE ALSO
.sp
.LP
.BR attributes (5),
.BR ioctl (9E),
.BR bcopy (9F),
.BR copyin (9F),
.BR ddi_copyin (9F),
.BR ddi_copyout (9F),
.BR uiomove (9F)
.sp
.LP
.I Writing Device Drivers
.SH NOTES
.sp
.LP
Driver writers who intend to support layered ioctls in their
.BR ioctl (9E)
routines should use
.BR ddi_copyout "(9F) instead."
.sp
.LP
Driver defined locks should not be held across calls to this function.
.sp
.LP
.B copyout()
should not be used from a streams driver. See \fBM_COPYIN\fR
and
.B M_COPYOUT
in
.IR "STREAMS Programming Guide" .
