usr/src/man/man9f/csx_ValidateCIS.9f
'\" te
.\" Copyright (c) 1996, Sun Microsystems, Inc.  All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH csx_ValidateCIS 9F "19 Jul 1996" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
csx_ValidateCIS \- validate the Card Information Structure (CIS)
.SH SYNOPSIS
.LP
.nf
#include <sys/pccard.h>



\fBint32_t\fR \fBcsx_ValidateCIS\fR(\fBclient_handle_t\fR \fIch\fR, \fBcisinfo_t *\fIci\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris
.B DDI
Specific (Solaris
.BR DDI )
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I ch
.ad
.RS 6n
.rt
Client handle returned from
.BR csx_RegisterClient (9F).
.RE

.sp
.ne 2
.mk
.na
.I ci
.ad
.RS 6n
.rt
Pointer to a
.B cisinfo_t
structure.
.RE

.SH DESCRIPTION
.sp
.LP
This function validates the Card Information Structure (CIS) on the
.B PC
Card in the specified socket.
.SH STRUCTURE MEMBERS
.sp
.LP
The structure members of
.B cisinfo_t
are:
.sp
.in +2
.nf
 uint32_t     Socket;    /* socket number to validate CIS on */
  uint32_t     Chains;    /* number of tuple chains in CIS */
  uint32_t     Tuples;    /* total number of tuples in CIS */
.fi
.in -2

.sp
.LP
The fields are defined as follows:
.sp
.ne 2
.mk
.na
.B Socket
.ad
.RS 10n
.rt
Not used in Solaris, but for portability with other Card Services
implementations, it should be set to the logical socket number.
.RE

.sp
.ne 2
.mk
.na
.B Chains
.ad
.RS 10n
.rt
This field returns the number of valid tuple chains located in the
.BR CIS .
If
.B 0
is returned, the
.B CIS
is not valid.
.RE

.sp
.ne 2
.mk
.na
.B Tuples
.ad
.RS 10n
.rt
This field is a Solaris-specific extension and it returns the total number
of tuples on all the chains in the
.B PC
Card's
.BR CIS .
.RE

.SH RETURN VALUES
.sp
.ne 2
.mk
.na
.B CS_SUCCESS
.ad
.RS 27n
.rt
Successful operation.
.RE

.sp
.ne 2
.mk
.na
.B CS_NO_CIS
.ad
.RS 27n
.rt
No
.B CIS
on
.B PC
Card or
.B CIS
is invalid.
.RE

.sp
.ne 2
.mk
.na
.B CS_NO_CARD
.ad
.RS 27n
.rt
No
.B PC
Card in socket.
.RE

.sp
.ne 2
.mk
.na
.B CS_UNSUPPORTED_FUNCTION
.ad
.RS 27n
.rt
No
.B PCMCIA
hardware installed.
.RE

.SH CONTEXT
.sp
.LP
This function may be called from user or kernel context.
.SH SEE ALSO
.sp
.LP
.BR csx_GetFirstTuple (9F),
.BR csx_GetTupleData (9F),
.BR csx_ParseTuple (9F),
.BR csx_RegisterClient (9F)
.sp
.LP
.IR "PC Card 95 Standard" ,
PCMCIA/JEIDA
