usr/src/man/man9f/csx_ModifyWindow.9f
'\" te
.\" Copyright (c) 2000, Sun Microsystems, Inc.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\"  All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH csx_ModifyWindow 9F "19 Jul 1996" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
csx_ModifyWindow \- modify window attributes
.SH SYNOPSIS
.LP
.nf
#include <sys/pccard.h>



\fBint32_t\fR \fBcsx_ModifyWindow\fR(\fBwindow_handle_t\fR \fIwh\fR, \fBmodify_win_t *\fImw\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris
.B DDI
Specific (Solaris
.B DDI)
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I wh
.ad
.RS 7n
.rt
Window handle returned from
.BR csx_RequestWindow (9F).
.RE

.sp
.ne 2
.mk
.na
.I mw
.ad
.RS 7n
.rt
Pointer to a
.B modify_win_t
structure.
.RE

.SH DESCRIPTION
.sp
.LP
This function modifies the attributes of a window allocated by the
.BR csx_RequestWindow (9F)
function.
.sp
.LP
Only some of the window attributes or the access speed field may be
modified by this request. The
.BR csx_MapMemPage (9F)
function is also used
to set the offset into
.B PC
Card memory to be mapped into system memory
for paged windows. The
.BR csx_RequestWindow (9F)
and
.BR csx_ReleaseWindow (9F)
functions must be used to change the window base
or size.
.SH STRUCTURE MEMBERS
.sp
.LP
The structure members of
.B modify_win_t
are:
.sp
.in +2
.nf
uint32_t       Attributes;          /* window flags */
uint32_t       AccessSpeed;         /* window access speed */
.fi
.in -2

.sp
.LP
The fields are defined as follows:
.sp
.ne 2
.mk
.na
.B Attributes
.ad
.RS 15n
.rt
This field is bit-mapped and defined as follows:
.sp
.ne 2
.mk
.na
.B WIN_MEMORY_TYPE_CM
.ad
.RS 26n
.rt
Window points to Common Memory area. Set this to map the window to Common
Memory.
.RE

.sp
.ne 2
.mk
.na
.B WIN_MEMORY_TYPE_AM
.ad
.RS 26n
.rt
Window points to Attribute Memory area. Set this to map the window to
Attribute Memory.
.RE

.sp
.ne 2
.mk
.na
.B WIN_ENABLE
.ad
.RS 26n
.rt
Enable Window. The client must set this to enable the window.
.RE

.sp
.ne 2
.mk
.na
.B WIN_ACCESS_SPEED_VALID
.ad
.RS 26n
.rt
.B AccessSpeed
valid. The client must set this when the
.B AccessSpeed
field has a value that the client wants set for the
window.
.RE

.RE

.sp
.ne 2
.mk
.na
.B AccessSpeed
.ad
.RS 15n
.rt
The bit definitions for this field use the format of the extended speed
byte of the Device
.B ID
tuple. If the mantissa is
.B 0
(noted as
reserved in the
.IR "PC Card 95 Standard" ),
the lower bits are a binary code
representing a speed from the list below. Numbers in the first column are
codes; items in the second column are speeds.
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 9n
.rt
Reserved: do not use
.RE

.sp
.ne 2
.mk
.na
.B 1
.ad
.RS 9n
.rt
.B 250 nsec
.RE

.sp
.ne 2
.mk
.na
.B 2
.ad
.RS 9n
.rt
.B 200 nsec
.RE

.sp
.ne 2
.mk
.na
.B 3
.ad
.RS 9n
.rt
.B 150 nsec
.RE

.sp
.ne 2
.mk
.na
.B 4
.ad
.RS 9n
.rt
.B 100 nsec
.RE

.sp
.ne 2
.mk
.na
.B 5 - 7
.ad
.RS 9n
.rt
Reserved: do not use
.RE

It is recommended that clients use the
.BR csx_ConvertSpeed (9F)
function
to generate the appropriate
.B AccessSpeed
values rather than manually
perturbing the
.B AccessSpeed
field.
.RE

.SH RETURN VALUES
.sp
.ne 2
.mk
.na
.B CS_SUCCESS
.ad
.RS 28n
.rt
Successful operation.
.RE

.sp
.ne 2
.mk
.na
.B CS_BAD_HANDLE
.ad
.RS 28n
.rt
Window handle is invalid.
.RE

.sp
.ne 2
.mk
.na
.B CS_NO_CARD
.ad
.RS 28n
.rt
No
.B PC
Card in socket.
.RE

.sp
.ne 2
.mk
.na
.B CS_BAD_OFFSET
.ad
.RS 28n
.rt
Error getting/setting window hardware parameters.
.RE

.sp
.ne 2
.mk
.na
.B CS_BAD_WINDOW
.ad
.RS 28n
.rt
Error getting/setting window hardware parameters.
.RE

.sp
.ne 2
.mk
.na
.B CS_BAD_SPEED
.ad
.RS 28n
.rt
.B AccessSpeed
is invalid.
.RE

.sp
.ne 2
.mk
.na
.B CS_UNSUPPORTED_FUNCTION
.ad
.RS 28n
.rt
No
.B PCMCIA
hardware installed.
.RE

.SH CONTEXT
.sp
.LP
This function may be called from user or kernel context.
.SH SEE ALSO
.sp
.LP
.BR csx_ConvertSpeed (9F),
.BR csx_MapMemPage (9F),
.BR csx_ReleaseWindow (9F),
.BR csx_RequestWindow (9F)
.sp
.LP
.I PC Card 95 Standard, PCMCIA/JEIDA
