usr/src/man/man9f/csx_RegisterClient.9f
'\" te
.\" Copyright (c) 2002, Sun Microsystems, Inc.  All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH csx_RegisterClient 9F "19 Jul 1996" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
csx_RegisterClient \- register a client
.SH SYNOPSIS
.LP
.nf
#include <sys/pccard.h>



\fBint32_t\fR \fBcsx_RegisterClient\fR(\fBclient_handle_t *\fIch\fR, \fBclient_reg_t *\fIcr\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris
.B DDI
Specific (Solaris
.BR DDI )
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I ch
.ad
.RS 6n
.rt
Pointer to a
.B client_handle_t
structure.
.RE

.sp
.ne 2
.mk
.na
.I mc
.ad
.RS 6n
.rt
Pointer to a
.B client_reg_t
structure.
.RE

.SH DESCRIPTION
.sp
.LP
This function registers a client with Card Services and returns a unique
client handle for the client. The client handle must be passed to
.BR csx_DeregisterClient (9F)
when the client terminates.
.SH STRUCTURE MEMBERS
.sp
.LP
The structure members of
.B client_reg_t
are:
.sp
.in +2
.nf
 uint32_t                 Attributes;
  uint32_t                 EventMask;
  event_callback_args_t    event_callback_args;
  uint32_t                 Version;             /* CS version to expect */
  csfunction_t             *event_handler;
  ddi_iblock_cookie_t      *iblk_cookie;        /* event iblk cookie */
  ddi_idevice_cookie_t     *idev_cookie;        /* event idev cookie */
  dev_info_t               *dip;                /* client's dip */
  char                     driver_name[MODMAXNAMELEN];
.fi
.in -2

.sp
.LP
The fields are defined as follows:
.sp
.ne 2
.mk
.na
.B Attributes
.ad
.RS 23n
.rt
This field is bit-mapped and defined as follows:
.sp
.ne 2
.mk
.na
.B INFO_MEM_CLIENT
.ad
.sp .6
.RS 4n
Memory client device driver.
.RE

.sp
.ne 2
.mk
.na
.B INFO_MTD_CLIENT
.ad
.sp .6
.RS 4n
Memory Technology Driver client.
.RE

.sp
.ne 2
.mk
.na
.B INFO_IO_CLIENT
.ad
.sp .6
.RS 4n
.B IO
client device driver.
.RE

.sp
.ne 2
.mk
.na
.B INFO_CARD_SHARE
.ad
.sp .6
.RS 4n
Generate artificial
.B CS_EVENT_CARD_INSERTION
and
.B CS_EVENT_REGISTRATION_COMPLETE
events.
.RE

.sp
.ne 2
.mk
.na
.B INFO_CARD_EXCL
.ad
.sp .6
.RS 4n
Generate artificial
.B CS_EVENT_CARD_INSERTION
and
.B CS_EVENT_REGISTRATION_COMPLETE
events.
.sp
.ne 2
.mk
.na
.B INFO_MEM_CLIENT
.ad
.br
.na
.B INFO_MTD_CLIENT
.ad
.br
.na
.B INFO_IO_CLIENT
.ad
.sp .6
.RS 4n
These bits are mutually exclusive (that is, only one bit may be set), but
one of the bits must be set.
.RE

.sp
.ne 2
.mk
.na
.B INFO_CARD_SHARE
.ad
.br
.na
.B INFO_CARD_EXCL
.ad
.sp .6
.RS 4n
If either of these bits is set, the client will receive a
.B CS_EVENT_REGISTRATION_COMPLETE
event when Card Services has completed
its internal client registration processing and after a sucessful call to
.BR csx_RequestSocketMask (9F).
.sp
Also, if either of these bits is set, and if a card of the type that the
client can control is currently inserted in the socket (and after a
successful call to
.BR csx_RequestSocketMask "(9F)), the client will receive"
an artificial
.B CS_EVENT_CARD_INSERTION
event.
.RE

.RE

.RE

.sp
.ne 2
.mk
.na
.B Event Mask
.ad
.RS 23n
.rt
This field is bit-mapped and specifies the client's global event mask. Card
Services performs event notification based on this field. See
.BR csx_event_handler (9E)
for valid event definitions and for additional
information about handling events.
.RE

.sp
.ne 2
.mk
.na
.B event_callback_args
.ad
.RS 23n
.rt
The
.B event_callback_args_t
structure members are:
.sp
.in +2
.nf
    void     *client_data;
.fi
.in -2

The
.B client_data
field may be used to provide data available to the
event handler (see
.BR csx_event_handler (9E)).
Typically, this is the
client driver's soft state pointer.
.RE

.sp
.ne 2
.mk
.na
.B Version
.ad
.RS 23n
.rt
This field contains the specific Card Services version number that the
.RB "client expects to use. Typically, the client will use the" " CS_VERSION"
macro to specify to Card Services which version of Card Services the client
expects.
.RE

.sp
.ne 2
.mk
.na
.B event_handler
.ad
.RS 23n
.rt
The client event callback handler entry point is passed in the
.B event_handler
field.
.RE

.sp
.ne 2
.mk
.na
.B iblk_cookie
.ad
.br
.na
.B idev_cookie
.ad
.RS 23n
.rt
These fields must be used by the client to set up mutexes that are used in
the client's event callback handler when handling high priority events.
.RE

.sp
.ne 2
.mk
.na
.B dip
.ad
.RS 23n
.rt
The client must set this field with a pointer to the client's dip.
.RE

.sp
.ne 2
.mk
.na
.B driver_name
.ad
.RS 23n
.rt
The client must copy a driver-unique name into this member. This name must
be identical across all instances of the driver.
.RE

.SH RETURN VALUES
.sp
.ne 2
.mk
.na
.B CS_SUCCESS
.ad
.RS 27n
.rt
Successful operation.
.RE

.sp
.ne 2
.mk
.na
.B CS_BAD_ATTRIBUTE
.ad
.RS 27n
.rt
No client type or more than one client type specified.
.RE

.sp
.ne 2
.mk
.na
.B CS_OUT_OF_RESOURCE
.ad
.RS 27n
.rt
Card Services is unable to register client.
.RE

.sp
.ne 2
.mk
.na
.B CS_BAD_VERSION
.ad
.RS 27n
.rt
Card Services version is incompatible with client.
.RE

.sp
.ne 2
.mk
.na
.B CS_BAD_HANDLE
.ad
.RS 27n
.rt
Client has already registered for this socket.
.RE

.sp
.ne 2
.mk
.na
.B CS_UNSUPPORTED_FUNCTION
.ad
.RS 27n
.rt
No
.B PCMCIA
hardware installed.
.RE

.SH CONTEXT
.sp
.LP
This function may be called from user or kernel context.
.SH SEE ALSO
.sp
.LP
.BR csx_DeregisterClient (9F),
.BR csx_RequestSocketMask (9F)
.sp
.LP
.IR "PC Card 95 Standard" ,
PCMCIA/JEIDA
