usr/src/man/man9f/csx_Parse_CISTPL_LONGLINK_MFC.9f
'\" te
.\" Copyright (c) 1997, Sun Microsystems, Inc.  All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH csx_Parse_CISTPL_LONGLINK_MFC 9F "24 Jan 1997" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
csx_Parse_CISTPL_LONGLINK_MFC \- parse the Multi-Function tuple
.SH SYNOPSIS
.LP
.nf
#include <sys/pccard.h>



\fBint32_t\fR \fBcsx_Parse_CISTPL_LONGLINK_MFC\fR(\fBclient_handle_t\fR \fIch\fR, \fBtuple_t *\fItu\fR,
     \fBcistpl_longlink_mfc_t *\fIpt\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris
.B DDI
Specific (Solaris
.B DDI)
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I ch
.ad
.RS 7n
.rt
Client handle returned from
.BR csx_RegisterClient (9F).
.RE

.sp
.ne 2
.mk
.na
.I tu
.ad
.RS 7n
.rt
Pointer to a
.B tuple_t
structure (see
.BR tuple (9S))
returned by a
call to
.BR csx_GetFirstTuple "(9F) or"
.BR csx_GetNextTuple (9F).
.RE

.sp
.ne 2
.mk
.na
.I pt
.ad
.RS 7n
.rt
Pointer to a
.B cistpl_longlink_mfc_t
structure which contains the
parsed
.B CISTPL_LONGLINK_MFC
tuple information upon return from this
function.
.RE

.SH DESCRIPTION
.sp
.LP
This function parses the Multi-Function tuple, \fBCISTPL_LONGLINK_MFC,\fR
into a form usable by
.B PC
Card drivers.
.sp
.LP
The
.B CISTPL_LONGLINK_MFC
tuple describes the start of the
function-specific
.B CIS
for each function on a multi-function card.
.SH STRUCTURE MEMBERS
.sp
.LP
The structure members of
.B cistpl_longlink_mfc_t
are:
.sp
.in +2
.nf
uint32_t    nfuncs;
uint32_t    nregs;
uint32_t    function[CIS_MAX_FUNCTIONS].tas
uint32_t    function[CIS_MAX_FUNCTIONS].addr
.fi
.in -2

.sp
.LP
The fields are defined as follows:
.sp
.ne 2
.mk
.na
.B nfuncs
.ad
.sp .6
.RS 4n
This field indicates the number of functions on the
.B PC
card.
.RE

.sp
.ne 2
.mk
.na
.B nregs
.ad
.sp .6
.RS 4n
This field indicates the number of configuration register sets.
.RE

.sp
.ne 2
.mk
.na
.B function[CIS_MAX_FUNCTIONS].tas
.ad
.sp .6
.RS 4n
This field provides the target address space for each function on the \fBPC
\fRcard. This field can be one of:
.sp
.ne 2
.mk
.na
.B CISTPL_LONGLINK_MFC_TAS_AM
.ad
.sp .6
.RS 4n
CIS in attribute memory
.RE

.sp
.ne 2
.mk
.na
.B CISTPL_LONGLINK_MFC_TAS_CM
.ad
.sp .6
.RS 4n
CIS in common memory
.RE

.sp
.ne 2
.mk
.na
.B function[CIS_MAX_FUNCTIONS].addr
.ad
.sp .6
.RS 4n
This field provides the target address offset for each function on the
.B PC
card.
.RE

.RE

.SH RETURN VALUES
.sp
.ne 2
.mk
.na
.B CS_SUCCESS
.ad
.RS 28n
.rt
Successful operation.
.RE

.sp
.ne 2
.mk
.na
.B CS_BAD_HANDLE
.ad
.RS 28n
.rt
Client handle is invalid.
.RE

.sp
.ne 2
.mk
.na
.B CS_UNKNOWN_TUPLE
.ad
.RS 28n
.rt
Parser does not know how to parse tuple.
.RE

.sp
.ne 2
.mk
.na
.B CS_NO_CARD
.ad
.RS 28n
.rt
No
.B PC
Card in socket.
.RE

.sp
.ne 2
.mk
.na
.B CS_NO_CIS
.ad
.RS 28n
.rt
No Card Information Structure (CIS) on
.B PC
Card.
.RE

.sp
.ne 2
.mk
.na
.B CS_UNSUPPORTED_FUNCTION
.ad
.RS 28n
.rt
No
.B PCMCIA
hardware installed.
.RE

.SH CONTEXT
.sp
.LP
This function may be called from user or kernel context.
.SH SEE ALSO
.sp
.LP
.BR csx_GetFirstTuple (9F),
.BR csx_GetTupleData (9F),
.BR csx_RegisterClient (9F),
.BR csx_ValidateCIS (9F),
.BR tuple (9S)
.sp
.LP
.I PC Card 95 Standard,
PCMCIA/JEIDA
