usr/src/man/man9f/csx_ParseTuple.9f
'\" te
.\" Copyright (c) 1996, Sun Microsystems, Inc.  All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH csx_ParseTuple 9F "20 Dec 1996" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
csx_ParseTuple \- generic tuple parser
.SH SYNOPSIS
.LP
.nf
#include <sys/pccard.h>



\fBint32_t\fR \fBcsx_ParseTuple\fR(\fBclient_handle_t\fR \fIch\fR, \fBtuple_t *\fItu\fR, \fBcisparse_t *\fIcp\fR,
     \fBcisdata_t\fR \fIcd\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris
.B DDI
Specific (Solaris
.BR DDI )
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I ch
.ad
.RS 7n
.rt
Client handle returned from
.BR csx_RegisterClient (9F).
.RE

.sp
.ne 2
.mk
.na
.I tu
.ad
.RS 7n
.rt
Pointer to a
.B tuple_t
structure (see
.BR tuple (9S))
returned by a
call to
.BR csx_GetFirstTuple "(9F) or"
.BR csx_GetNextTuple (9F).
.RE

.sp
.ne 2
.mk
.na
.I cp
.ad
.RS 7n
.rt
Pointer to a
.B cisparse_t
structure that unifies all tuple parsing
structures.
.RE

.sp
.ne 2
.mk
.na
.I cd
.ad
.RS 7n
.rt
Extended tuple data for some tuples.
.RE

.SH DESCRIPTION
.sp
.LP
This function is the generic tuple parser entry point.
.SH STRUCTURE MEMBERS
.sp
.LP
The structure members of
.B cisparse_t
are:
.sp
.in +2
.nf
  typedef union cisparse_t {
     cistpl_config_t           cistpl_config;
     cistpl_device_t           cistpl_device;
     cistpl_vers_1_t           cistpl_vers_1;
     cistpl_vers_2_t           cistpl_vers_2;
     cistpl_jedec_t            cistpl_jedec;
     cistpl_format_t           cistpl_format;
     cistpl_geometry_t         cistpl_geometry;
     cistpl_byteorder_t        cistpl_byteorder;
     cistpl_date_t             cistpl_date;
     cistpl_battery_t          cistpl_battery;
     cistpl_org_t              cistpl_org;
     cistpl_manfid_t           cistpl_manfid;
     cistpl_funcid_t           cistpl_funcid;
     cistpl_funce_t            cistpl_funce;
     cistpl_cftable_entry_t    cistpl_cftable_entry;
     cistpl_linktarget_t       cistpl_linktarget;
     cistpl_longlink_ac_t      cistpl_longlink_ac;
     cistpl_longlink_mfc_t     cistpl_longlink_mfc;
     cistpl_spcl_t             cistpl_spcl;
     cistpl_swil_t             cistpl_swil;
     cistpl_bar_t              cistpl_bar;
     cistpl_devicegeo_t        cistpl_devicegeo;
     cistpl_longlink_cb_t      cistpl_longlink_cb;
     cistpl_get_tuple_name_t   cistpl_get_tuple_name;
  } cisparse_t;
.fi
.in -2

.SH RETURN VALUES
.sp
.ne 2
.mk
.na
.B CS_SUCCESS
.ad
.RS 28n
.rt
Successful operation.
.RE

.sp
.ne 2
.mk
.na
.B CS_BAD_HANDLE
.ad
.RS 28n
.rt
Client handle is invalid.
.RE

.sp
.ne 2
.mk
.na
.B CS_UNKNOWN_TUPLE
.ad
.RS 28n
.rt
Parser does not know how to parse tuple.
.RE

.sp
.ne 2
.mk
.na
.B CS_NO_CARD
.ad
.RS 28n
.rt
No
.B PC
Card in socket.
.RE

.sp
.ne 2
.mk
.na
.B CS_BAD_CIS
.ad
.RS 28n
.rt
Generic parser error.
.RE

.sp
.ne 2
.mk
.na
.B CS_NO_CIS
.ad
.RS 28n
.rt
No Card Information Structure (\fBCIS\fR) on
.B PC
Card.
.RE

.sp
.ne 2
.mk
.na
.B CS_UNSUPPORTED_FUNCTION
.ad
.RS 28n
.rt
No
.B PCMCIA
hardware installed.
.RE

.SH CONTEXT
.sp
.LP
This function may be called from user or kernel context.
.SH SEE ALSO
.sp
.LP
.BR csx_GetFirstTuple (9F),
.BR csx_GetTupleData (9F),
.BR csx_Parse_CISTPL_BATTERY (9F),
.BR csx_Parse_CISTPL_BYTEORDER (9F),
.BR csx_Parse_CISTPL_CFTABLE_ENTRY (9F),
.BR csx_Parse_CISTPL_CONFIG (9F),
.BR csx_Parse_CISTPL_DATE (9F),
.BR csx_Parse_CISTPL_DEVICE (9F),
.BR csx_Parse_CISTPL_FUNCE (9F),
.BR csx_Parse_CISTPL_FUNCID (9F),
.BR csx_Parse_CISTPL_JEDEC_C (9F),
.BR csx_Parse_CISTPL_MANFID (9F),
.BR csx_Parse_CISTPL_SPCL (9F),
.BR csx_Parse_CISTPL_VERS_1 (9F),
.BR csx_Parse_CISTPL_VERS_2 (9F),
.BR csx_RegisterClient (9F),
.BR csx_ValidateCIS (9F),
.BR tuple (9S)
.sp
.LP
.IR "PC Card 95 Standard" ,
PCMCIA/JEIDA
