usr/src/man/man9f/csx_GetFirstClient.9f
'\" te
.\" Copyright (c) 1997, Sun Microsystems, Inc.  All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH csx_GetFirstClient 9F "16 May 1997" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
csx_GetFirstClient, csx_GetNextClient \- return first or next client
.SH SYNOPSIS
.LP
.nf
#include <sys/pccard.h>



\fBint32_t\fR \fBcsx_GetFirstClient\fR(\fBget_firstnext_client_t *\fIfnc\fR);
.fi

.LP
.nf
\fBint32_t\fR \fBcsx_GetNextClient\fR(\fBget_firstnext_client_t *\fIfnc\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris
.B DDI
Specific (Solaris
.B DDI)
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I fnc
.ad
.RS 8n
.rt
Pointer to a
.B get_firstnext_client_t
structure.
.RE

.SH DESCRIPTION
.sp
.LP
The functions
.B csx_GetFirstClient()
and
.BR csx_GetNextClient()
return information about the first or subsequent
.B PC
cards,
respectively, that are installed in the system.
.SH STRUCTURE MEMBERS
.sp
.LP
The structure members of
.B get_firstnext_client_t
are:
.sp
.in +2
.nf
uint32_t          Socket;          /* socket number */
uint32_t          Attributes;      /* attributes */
client_handle_t   client_handle;   /* client handle */
uint32_t          num_clients;     /* number of clients */
.fi
.in -2

.sp
.LP
The fields are defined as follows:
.sp
.ne 2
.mk
.na
.B Socket
.ad
.RS 18n
.rt
If the
.B CS_GET_FIRSTNEXT_CLIENT_SOCKET_ONLY
attribute is set, return
information only on the
.B PC
card installed in this socket.
.RE

.sp
.ne 2
.mk
.na
.B Attributes
.ad
.RS 18n
.rt
This field indicates the type of client. The field is bit-mapped; the
following bits are defined:
.sp
.ne 2
.mk
.na
.B CS_GET_FIRSTNEXT_CLIENT_ALL_CLIENTS
.ad
.sp .6
.RS 4n
Return information on all clients.
.RE

.sp
.ne 2
.mk
.na
.B CS_GET_FIRSTNEXT_CLIENT_SOCKET_ONLY
.ad
.sp .6
.RS 4n
Return client information for the specified socket only.
.RE

.RE

.sp
.ne 2
.mk
.na
.B client_handle
.ad
.RS 18n
.rt
The client handle of the
.B PC
card driver is returned in this field.
.RE

.sp
.ne 2
.mk
.na
.B num_clients
.ad
.RS 18n
.rt
The number of clients is returned in this field.
.RE

.SH RETURN VALUES
.sp
.ne 2
.mk
.na
.B CS_SUCCESS
.ad
.RS 28n
.rt
Successful operation.
.RE

.sp
.ne 2
.mk
.na
.B CS_BAD_HANDLE
.ad
.RS 28n
.rt
Client handle is invalid.
.RE

.sp
.ne 2
.mk
.na
.B CS_BAD_SOCKET
.ad
.RS 28n
.rt
Socket number is invalid.
.RE

.sp
.ne 2
.mk
.na
.B CS_NO_CARD
.ad
.RS 28n
.rt
No
.B PC
Card in socket.
.RE

.sp
.ne 2
.mk
.na
.B CS_NO_MORE_ITEMS
.ad
.RS 28n
.rt
.B PC
Card driver does not handle the
.BR CS_EVENT_CLIENT_INFO
event.
.RE

.sp
.ne 2
.mk
.na
.B CS_UNSUPPORTED_FUNCTION
.ad
.RS 28n
.rt
No
.B PCMCIA
hardware installed.
.RE

.SH CONTEXT
.sp
.LP
This function may be called from user or kernel context.
.SH SEE ALSO
.sp
.LP
.BR csx_event_handler (9E)
.sp
.LP
.I PC Card 95 Standard,
PCMCIA/JEIDA
