usr/src/man/man9f/csx_Parse_CISTPL_SPCL.9f
'\" te
.\" Copyright (c) 1996, Sun Microsystems, Inc.  All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH csx_Parse_CISTPL_SPCL 9F "20 Dec 1996" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
csx_Parse_CISTPL_SPCL \- parse the Special Purpose tuple
.SH SYNOPSIS
.LP
.nf
#include <sys/pccard.h>



\fBint32_t\fR \fBcsx_Parse_CISTPL_SPCL\fR(\fBclient_handle_t\fR \fIch\fR, \fBtuple_t *\fItu\fR,
    \fBcistpl_spcl_t *\fIcsp\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris \fBDDI \fRSpecific (Solaris \fBDDI) \fR
.SH PARAMETERS
.sp
.ne 2
.mk
.na
\fIch\fR
.ad
.RS 7n
.rt
Client handle returned from \fBcsx_RegisterClient\fR(9F).
.RE

.sp
.ne 2
.mk
.na
\fItu\fR
.ad
.RS 7n
.rt
Pointer to a \fBtuple_t\fR structure (see \fBtuple\fR(9S)) returned by a
call to \fBcsx_GetFirstTuple\fR(9F) or \fBcsx_GetNextTuple\fR(9F).
.RE

.sp
.ne 2
.mk
.na
\fIcsp\fR
.ad
.RS 7n
.rt
Pointer to a \fBcistpl_spcl_t\fR structure which contains the parsed
\fBCISTPL_SPCL\fR tuple information upon return from this function.
.RE

.SH DESCRIPTION
.sp
.LP
This function parses the Special Purpose tuple, \fBCISTPL_SPCL,\fR into a
form usable by \fBPC \fRCard drivers.
.sp
.LP
The \fBCISTPL_SPCL\fR tuple is identified by an identification field that
is assigned by \fBPCMCIA \fRor JEIDA. A sequence field allows a series of
\fBCISTPL_SPCL\fR tuples to be used when the data exceeds the size that can
be stored in a single tuple; the maximum data area of a series of
\fBCISTPL_SPCL\fR tuples is unlimited. Another field gives the number of
bytes in the data field in this tuple.
.SH STRUCTURE MEMBERS
.sp
.LP
The structure members of \fBcistpl_date_t\fR are:
.sp
.in +2
.nf
uint32_t    id;       /* tuple contents identification */
uint32_t    seq;      /* data sequence number */
uint32_t    bytes;    /* number of bytes following */
uchar_t     data[CIS_MAX_TUPLE_DATA_LEN];
.fi
.in -2

.sp
.LP
The fields are defined as follows:
.sp
.ne 2
.mk
.na
\fBid\fR
.ad
.RS 9n
.rt
This field contains a \fBPCMCIA \fRor \fBJEIDA \fRassigned value that
identifies this series of one or more \fBCISTPL_SPCL\fR tuples. These field
values are assigned by contacting either \fBPCMCIA \fRor \fBJEIDA\fR.
.RE

.sp
.ne 2
.mk
.na
\fBseq\fR
.ad
.RS 9n
.rt
This field contains a data sequence number. \fBCISTPL_SPCL_SEQ_END\fR is
the last tuple in sequence.
.RE

.sp
.ne 2
.mk
.na
\fBbytes\fR
.ad
.RS 9n
.rt
This field contains the number of data bytes in the
\fBdata[CIS_MAX_TUPLE_DATA_LEN]\fR. 
.RE

.sp
.ne 2
.mk
.na
\fBdata\fR
.ad
.RS 9n
.rt
The data component of this tuple.
.RE

.SH RETURN VALUES
.sp
.ne 2
.mk
.na
\fBCS_SUCCESS\fR
.ad
.RS 27n
.rt
Successful operation.
.RE

.sp
.ne 2
.mk
.na
\fBCS_BAD_HANDLE\fR
.ad
.RS 27n
.rt
Client handle is invalid.
.RE

.sp
.ne 2
.mk
.na
\fBCS_UNKNOWN_TUPLE\fR
.ad
.RS 27n
.rt
Parser does not know how to parse tuple.
.RE

.sp
.ne 2
.mk
.na
\fBCS_NO_CARD\fR
.ad
.RS 27n
.rt
No \fBPC \fRCard in socket.
.RE

.sp
.ne 2
.mk
.na
\fBCS_NO_CIS\fR
.ad
.RS 27n
.rt
No Card Information Structure (CIS) on \fBPC \fRCard.
.RE

.sp
.ne 2
.mk
.na
\fBCS_UNSUPPORTED_FUNCTION\fR
.ad
.RS 27n
.rt
No \fBPCMCIA \fRhardware installed.
.RE

.SH CONTEXT
.sp
.LP
This function may be called from user or kernel context.
.SH SEE ALSO
.sp
.LP
\fBcsx_GetFirstTuple\fR(9F), \fBcsx_GetTupleData\fR(9F),
\fBcsx_RegisterClient\fR(9F), \fBcsx_ValidateCIS\fR(9F), \fBtuple\fR(9S)
.sp
.LP
\fIPC Card 95 Standard,\fR PCMCIA/JEIDA
