usr/src/man/man9f/csx_Parse_CISTPL_VERS_2.9f
'\" te
.\" Copyright (c) 1996, Sun Microsystems, Inc.  All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH csx_Parse_CISTPL_VERS_2 9F "20 Dec 1996" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
csx_Parse_CISTPL_VERS_2 \- parse Level-2 Version and Information tuple
.SH SYNOPSIS
.LP
.nf
#include <sys/pccard.h>



\fBint32_t\fR \fBcsx_Parse_CISTPL_VERS_2\fR(\fBclient_handle_t\fR \fIch\fR, \fBtuple_t *\fItu\fR,
     \fBcistpl_vers_2_t *\fIcv2\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris \fBDDI \fRSpecific (Solaris \fBDDI) \fR
.SH PARAMETERS
.sp
.ne 2
.mk
.na
\fIch\fR
.ad
.RS 7n
.rt
Client handle returned from \fBcsx_RegisterClient\fR(9F).
.RE

.sp
.ne 2
.mk
.na
\fItu\fR
.ad
.RS 7n
.rt
Pointer to a \fBtuple_t\fR structure (see \fBtuple\fR(9S)) returned by a
call to \fBcsx_GetFirstTuple\fR(9F) or \fBcsx_GetNextTuple\fR(9F).
.RE

.sp
.ne 2
.mk
.na
\fIcv2\fR
.ad
.RS 7n
.rt
Pointer to a \fBcistpl_vers_2_t\fR structure which contains the parsed
\fBCISTPL_VERS_2\fR tuple information upon return from this function.
.RE

.SH DESCRIPTION
.sp
.LP
This function parses the Level-2 Version and Information tuple,
\fBCISTPL_VERS_2,\fR into a form usable by \fBPC \fRCard drivers.
.sp
.LP
The \fBCISTPL_VERS_2\fR tuple is used to describe the card Level-2
information which has the logical organization of the card's data.
.SH STRUCTURE MEMBERS
.sp
.LP
The structure members of \fBcistpl_vers_2_t\fR are:
.sp
.in +2
.nf
uint32_t   vers;     /* version number */
uint32_t   comply;   /* level of compliance */
uint32_t   dindex;   /* byte address of first data byte in card */
uint32_t   vspec8;   /* vendor specific (byte 8) */
uint32_t   vspec9;   /* vendor specific (byte 9) */
uint32_t   nhdr;     /* number of copies of CIS present on device */
char       oem[CIS_MAX_TUPLE_DATA_LEN];
                     /* Vendor of software that formatted card */
char       info[CIS_MAX_TUPLE_DATA_LEN];
                     /* Informational message about card */
.fi
.in -2

.SH RETURN VALUES
.sp
.ne 2
.mk
.na
\fBCS_SUCCESS\fR
.ad
.RS 27n
.rt
Successful operation.
.RE

.sp
.ne 2
.mk
.na
\fBCS_BAD_HANDLE\fR
.ad
.RS 27n
.rt
Client handle is invalid.
.RE

.sp
.ne 2
.mk
.na
\fBCS_UNKNOWN_TUPLE\fR
.ad
.RS 27n
.rt
Parser does not know how to parse tuple.
.RE

.sp
.ne 2
.mk
.na
\fBCS_NO_CARD\fR
.ad
.RS 27n
.rt
No \fBPC \fRCard in socket.
.RE

.sp
.ne 2
.mk
.na
\fBCS_NO_CIS\fR
.ad
.RS 27n
.rt
No Card Information Structure (CIS) on \fBPC \fRCard.
.RE

.sp
.ne 2
.mk
.na
\fBCS_UNSUPPORTED_FUNCTION\fR
.ad
.RS 27n
.rt
No \fBPCMCIA \fRhardware installed.
.RE

.SH CONTEXT
.sp
.LP
This function may be called from user or kernel context.
.SH SEE ALSO
.sp
.LP
\fBcsx_GetFirstTuple\fR(9F), \fBcsx_GetTupleData\fR(9F),
\fBcsx_RegisterClient\fR(9F), \fBcsx_ValidateCIS\fR(9F), \fBtuple\fR(9S)
.sp
.LP
\fIPC Card 95 Standard,\fR PCMCIA/JEIDA
