usr/src/man/man9f/csx_Parse_CISTPL_FUNCID.9f
'\" te
.\" Copyright (c) 1996, Sun Microsystems, Inc.  All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH csx_Parse_CISTPL_FUNCID 9F "20 Dec 1996" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
csx_Parse_CISTPL_FUNCID \- parse Function Identification tuple
.SH SYNOPSIS
.LP
.nf
#include <sys/pccard.h>



\fBint32_t\fR \fBcsx_Parse_CISTPL_FUNCID\fR(\fBclient_handle_t\fR \fIch\fR, \fBtuple_t *\fItu\fR,
     \fBcistpl_funcid_t *\fIcf\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris
.B DDI
Specific (Solaris
.B DDI)
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I ch
.ad
.RS 6n
.rt
Client handle returned from
.BR csx_RegisterClient (9F).
.RE

.sp
.ne 2
.mk
.na
.I tu
.ad
.RS 6n
.rt
Pointer to a
.B tuple_t
structure (see
.BR tuple (9S))
returned by a
call to
.BR csx_GetFirstTuple "(9F) or"
.BR csx_GetNextTuple (9F).
.RE

.sp
.ne 2
.mk
.na
.I cf
.ad
.RS 6n
.rt
Pointer to a
.B cistpl_funcid_t
structure which contains the parsed
.B CISTPL_FUNCID
tuple information upon return from this function.
.RE

.SH DESCRIPTION
.sp
.LP
This function parses the Function Identification tuple,
.B CISTPL_FUNCID,
into a form usable by
.B PC
Card drivers.
.sp
.LP
The
.B CISTPL_FUNCID
tuple is used to describe information about the
functionality provided by a
.B PC
Card. Information is also provided to
enable system utilities to decide if the
.B PC
Card should be configured
during system initialization. If additional function specific information is
available, one or more function extension tuples of type
.B CISTPL_FUNCE
follow this tuple (see
.BR csx_Parse_CISTPL_FUNCE (9F)).
.SH STRUCTURE MEMBERS
.sp
.LP
The structure members of
.B cistpl_funcid_t
are:
.sp
.in +2
.nf
uint32_t     function;     /* PC Card function code */
uint32_t     sysinit;      /* system initialization mask */
.fi
.in -2

.sp
.LP
The fields are defined as follows:
.sp
.ne 2
.mk
.na
.B function
.ad
.RS 12n
.rt
This is the function type for
.BR CISTPL_FUNCID:
.sp
.ne 2
.mk
.na
.B TPLFUNC_MULTI
.ad
.RS 27n
.rt
Vendor-specific multifunction card
.RE

.sp
.ne 2
.mk
.na
.B TPLFUNC_MEMORY
.ad
.RS 27n
.rt
Memory card
.RE

.sp
.ne 2
.mk
.na
.B TPLFUNC_SERIAL
.ad
.RS 27n
.rt
Serial I/O port
.RE

.sp
.ne 2
.mk
.na
.B TPLFUNC_PARALLEL
.ad
.RS 27n
.rt
Parallel printer port
.RE

.sp
.ne 2
.mk
.na
.B TPLFUNC_FIXED
.ad
.RS 27n
.rt
Fixed disk, silicon or removable
.RE

.sp
.ne 2
.mk
.na
.B TPLFUNC_VIDEO
.ad
.RS 27n
.rt
Video interface
.RE

.sp
.ne 2
.mk
.na
.B TPLFUNC_LAN
.ad
.RS 27n
.rt
Local Area Network adapter
.RE

.sp
.ne 2
.mk
.na
.B TPLFUNC_AIMS
.ad
.RS 27n
.rt
Auto Incrementing Mass Storage
.RE

.sp
.ne 2
.mk
.na
.B TPLFUNC_SCSI
.ad
.RS 27n
.rt
SCSI bridge
.RE

.sp
.ne 2
.mk
.na
.B TPLFUNC_SECURITY
.ad
.RS 27n
.rt
Security cards
.RE

.sp
.ne 2
.mk
.na
.B TPLFUNC_VENDOR_SPECIFIC
.ad
.RS 27n
.rt
Vendor specific
.RE

.sp
.ne 2
.mk
.na
.B TPLFUNC_UNKNOWN
.ad
.RS 27n
.rt
Unknown function(s)
.RE

.RE

.sp
.ne 2
.mk
.na
.B sysinit
.ad
.RS 11n
.rt
This field is bit-mapped and defined as follows:
.sp
.ne 2
.mk
.na
.B TPLINIT_POST
.ad
.RS 16n
.rt
POST should attempt configure
.RE

.sp
.ne 2
.mk
.na
.B TPLINIT_ROM
.ad
.RS 16n
.rt
Map ROM during sys init
.RE

.RE

.SH RETURN VALUES
.sp
.ne 2
.mk
.na
.B CS_SUCCESS
.ad
.RS 27n
.rt
Successful operation.
.RE

.sp
.ne 2
.mk
.na
.B CS_BAD_HANDLE
.ad
.RS 27n
.rt
Client handle is invalid.
.RE

.sp
.ne 2
.mk
.na
.B CS_UNKNOWN_TUPLE
.ad
.RS 27n
.rt
Parser does not know how to parse tuple.
.RE

.sp
.ne 2
.mk
.na
.B CS_NO_CARD
.ad
.RS 27n
.rt
No
.B PC
Card in socket.
.RE

.sp
.ne 2
.mk
.na
.B CS_NO_CIS
.ad
.RS 27n
.rt
No Card Information Structure (CIS) on
.B PC
Card.
.RE

.sp
.ne 2
.mk
.na
.B CS_UNSUPPORTED_FUNCTION
.ad
.RS 27n
.rt
No
.B PCMCIA
hardware installed.
.RE

.SH CONTEXT
.sp
.LP
This function may be called from user or kernel context.
.SH SEE ALSO
.sp
.LP
.BR csx_GetFirstTuple (9F),
.BR csx_GetTupleData (9F),
.BR csx_Parse_CISTPL_FUNCE (9F),
.BR csx_RegisterClient (9F),
.BR csx_ValidateCIS (9F),
.BR tuple (9S)
.sp
.LP
.I PC Card 95 Standard, PCMCIA/JEIDA
