usr/src/man/man9f/csx_Parse_CISTPL_JEDEC_C.9f
'\" te
.\" Copyright (c) 1996, Sun Microsystems, Inc.  All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH csx_Parse_CISTPL_JEDEC_C 9F "20 Dec 1996" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
csx_Parse_CISTPL_JEDEC_C, csx_Parse_CISTPL_JEDEC_A \- parse JEDEC
Identifier tuples
.SH SYNOPSIS
.LP
.nf
#include <sys/pccard.h>



\fBint32_t\fR \fBcsx_Parse_CISTPL_JEDEC_C\fR(\fBclient_handle_t\fR \fIch\fR, \fBtuple_t *\fItu\fR,
     \fBcistpl_jedec_t *\fIcj\fR);
.fi

.LP
.nf
\fBint32_t\fR \fBcsx_Parse_CISTPL_JEDEC_A\fR(\fBclient_handle_t\fR \fIch\fR, \fBtuple_t *\fItu\fR,
     \fBcistpl_jedec_t *\fIcj\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris
.B DDI
Specific (Solaris
.BR DDI )
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I ch
.ad
.RS 6n
.rt
Client handle returned from
.BR csx_RegisterClient (9F).
.RE

.sp
.ne 2
.mk
.na
.I tu
.ad
.RS 6n
.rt
Pointer to a
.B tuple_t
structure (see
.BR tuple (9S))
returned by a
call to
.BR csx_GetFirstTuple "(9F) or"
.BR csx_GetNextTuple (9F).
.RE

.sp
.ne 2
.mk
.na
.I cj
.ad
.RS 6n
.rt
Pointer to a
.B cistpl_jedec_t
structure which contains the parsed
.B CISTPL_JEDEC_C
or
.B CISTPL_JEDEC_A
tuple information upon return
from these functions, respectively.
.RE

.SH DESCRIPTION
.sp
.LP
.B csx_Parse_CISTPL_JEDEC_C()
and
.B csx_Parse_CISTPL_JEDEC_A()
parse
the
.B JEDEC
Identifier tuples,
.B CISTPL_JEDEC_C
and
.B CISTPL_JEDEC_A,
respectively, into a form usable by
.B PC
Card
drivers.
.sp
.LP
The
.B CISTPL_JEDEC_C
and
.B CISTPL_JEDEC_A
tuples are optional
tuples provided for cards containing programmable devices. They describe
information for Common Memory or Attribute Memory space, respectively.
.SH STRUCTURE MEMBERS
.sp
.LP
The structure members of
.B cistpl_jedec_t
are:
.sp
.in +2
.nf
 uint32_t        nid;   /* # of JEDEC identifiers present */
  jedec_ident_t   jid[CISTPL_JEDEC_MAX_IDENTIFIERS];
.fi
.in -2

.sp
.LP
The structure members of
.B jedec_ident_t
are:
.sp
.in +2
.nf
 uint32_t        id;    /* manufacturer id */
  uint32_t        info;  /* manufacturer specific info */
.fi
.in -2

.SH RETURN VALUES
.sp
.ne 2
.mk
.na
.B CS_SUCCESS
.ad
.RS 27n
.rt
Successful operation.
.RE

.sp
.ne 2
.mk
.na
.B CS_BAD_HANDLE
.ad
.RS 27n
.rt
Client handle is invalid.
.RE

.sp
.ne 2
.mk
.na
.B CS_UNKNOWN_TUPLE
.ad
.RS 27n
.rt
Parser does not know how to parse tuple.
.RE

.sp
.ne 2
.mk
.na
.B CS_NO_CARD
.ad
.RS 27n
.rt
No
.B PC
Card in socket.
.RE

.sp
.ne 2
.mk
.na
.B CS_NO_CIS
.ad
.RS 27n
.rt
No Card Information Structure
.RB ( CIS )
on
.B PC
Card.
.RE

.sp
.ne 2
.mk
.na
.B CS_UNSUPPORTED_FUNCTION
.ad
.RS 27n
.rt
No
.B PCMCIA
hardware installed.
.RE

.SH CONTEXT
.sp
.LP
These functions may be called from user or kernel context.
.SH SEE ALSO
.sp
.LP
.BR csx_GetFirstTuple (9F),
.BR csx_GetTupleData (9F),
.BR csx_Parse_CISTPL_DEVICE (9F),
.BR csx_RegisterClient (9F),
.BR csx_ValidateCIS (9F),
.BR tuple (9S)
.sp
.LP
.IR "PC Card 95 Standard" ,
PCMCIA/JEIDA
