usr/src/man/man9f/csx_Parse_CISTPL_BATTERY.9f
'\" te
.\" Copyright (c) 1996, Sun Microsystems, Inc.  All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH csx_Parse_CISTPL_BATTERY 9F "20 Dec 1996" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
csx_Parse_CISTPL_BATTERY \- parse the Battery Replacement Date tuple
.SH SYNOPSIS
.LP
.nf
#include <sys/pccard.h>



\fBint32_t\fR \fBcsx_Parse_CISTPL_BATTERY\fR(\fBclient_handle_t\fR \fIch\fR, \fBtuple_t *\fItu\fR,
     \fBcistpl_battery_t *\fIcb\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris \fBDDI \fRSpecific (Solaris \fBDDI) \fR
.SH PARAMETERS
.sp
.ne 2
.mk
.na
\fIch\fR
.ad
.RS 6n
.rt
Client handle returned from \fBcsx_RegisterClient\fR(9F).
.RE

.sp
.ne 2
.mk
.na
\fItu\fR
.ad
.RS 6n
.rt
Pointer to a \fBtuple_t\fR structure (see \fBtuple\fR(9S)) returned by a
call to \fBcsx_GetFirstTuple\fR(9F) or \fBcsx_GetNextTuple\fR(9F).
.RE

.sp
.ne 2
.mk
.na
\fIcb\fR
.ad
.RS 6n
.rt
Pointer to a \fBcistpl_battery_t\fR structure which contains the parsed
\fBCISTPL_BATTERY\fR tuple information upon return from this function.
.RE

.SH DESCRIPTION
.sp
.LP
This function parses the Battery Replacement Date tuple,
\fBCISTPL_BATTERY,\fR into a form usable by \fBPC \fRCard drivers.
.sp
.LP
The \fBCISTPL_BATTERY\fR tuple is an optional tuple which shall be present
only in \fBPC \fRCards with battery-backed storage. It indicates the date on
which the battery was replaced, and the date on which the battery is
expected to need replacement. Only one \fBCISTPL_BATTERY\fR tuple is allowed
per \fBPC \fRCard.
.SH STRUCTURE MEMBERS
.sp
.LP
The structure members of \fBcistpl_battery_t\fR are:
.sp
.in +2
.nf
uint32_t     rday;     /* date battery last replaced */
uint32_t     xday;     /* date battery due for replacement */
.fi
.in -2

.sp
.LP
The fields are defined as follows:
.sp
.ne 2
.mk
.na
\fBrday\fR
.ad
.RS 8n
.rt
This field indicates the date on which the battery was last replaced.
.RE

.sp
.ne 2
.mk
.na
\fBxday\fR
.ad
.RS 8n
.rt
This field indicates the date on which the battery should be replaced.
.RE

.SH RETURN VALUES
.sp
.ne 2
.mk
.na
\fBCS_SUCCESS\fR
.ad
.RS 27n
.rt
Successful operation.
.RE

.sp
.ne 2
.mk
.na
\fBCS_BAD_HANDLE\fR
.ad
.RS 27n
.rt
Client handle is invalid.
.RE

.sp
.ne 2
.mk
.na
\fBCS_UNKNOWN_TUPLE\fR
.ad
.RS 27n
.rt
Parser does not know how to parse tuple.
.RE

.sp
.ne 2
.mk
.na
\fBCS_NO_CARD\fR
.ad
.RS 27n
.rt
No \fBPC \fRCard in socket.
.RE

.sp
.ne 2
.mk
.na
\fBCS_NO_CIS\fR
.ad
.RS 27n
.rt
No Card Information Structure (CIS) on \fBPC \fRCard.
.RE

.sp
.ne 2
.mk
.na
\fBCS_UNSUPPORTED_FUNCTION\fR
.ad
.RS 27n
.rt
No \fBPCMCIA \fRhardware installed.
.RE

.SH CONTEXT
.sp
.LP
This function may be called from user or kernel context.
.SH SEE ALSO
.sp
.LP
\fBcsx_GetFirstTuple\fR(9F), \fBcsx_GetTupleData\fR(9F),
\fBcsx_RegisterClient\fR(9F), \fBcsx_ValidateCIS\fR(9F), \fBtuple\fR(9S)
.sp
.LP
\fIPC Card 95 Standard, PCMCIA/JEIDA\fR
