usr/src/man/man9f/csx_ConvertSize.9f
'\" te
.\" Copyright (c) 1996, Sun Microsystems, Inc.  All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH csx_ConvertSize 9F "19 Jul 1996" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
csx_ConvertSize \- convert device sizes
.SH SYNOPSIS
.LP
.nf
#include <sys/pccard.h>



\fBint32_t\fR \fBcsx_ConvertSize\fR(\fBconvert_size_t *\fIcs\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris
.B DDI
Specific (Solaris
.B DDI)
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I cs
.ad
.RS 7n
.rt
Pointer to a
.B convert_size_t
structure.
.RE

.SH DESCRIPTION
.sp
.LP
\fBcsx_ConvertSize()\fR is a Solaris-specific extension that provides a
method for clients to convert from one type of device size representation to
another, that is, from
.I devsize
format to
.I bytes
and vice versa.
.SH STRUCTURE MEMBERS
.sp
.LP
The structure members of
.B convert_size_t
are:
.sp
.in +2
.nf
uint32_t    Attributes;
uint32_t    bytes;
uint32_t    devsize;
.fi
.in -2

.sp
.LP
The fields are defined as follows:
.sp
.ne 2
.mk
.na
.B Attributes
.ad
.RS 15n
.rt
This is a bit-mapped field that identifies the type of size conversion to
be performed. The field is defined as follows:
.sp
.ne 2
.mk
.na
.B CONVERT_BYTES_TO_DEVSIZE
.ad
.RS 28n
.rt
Converts
.I bytes
to
.I devsize
format.
.RE

.sp
.ne 2
.mk
.na
.B CONVERT_DEVSIZE_TO_BYTES
.ad
.RS 28n
.rt
Converts
.I devsize
format to
.IR bytes .
.RE

.RE

.sp
.ne 2
.mk
.na
.B bytes
.ad
.RS 15n
.rt
If
.B CONVERT_BYTES_TO_DEVSIZE
.RB "is set, the value in the" " bytes"
field is converted to a
.I devsize
format and returned in the
\fBdevsize\fR field.
.RE

.sp
.ne 2
.mk
.na
.B devsize
.ad
.RS 15n
.rt
If
.B CONVERT_DEVSIZE_TO_BYTES
.RB "is set, the value in the" " devsize"
field is converted to a
.I bytes
value and returned in the
.BR bytes
field.
.RE

.SH RETURN VALUES
.sp
.ne 2
.mk
.na
.B CS_SUCCESS
.ad
.RS 28n
.rt
Successful operation.
.RE

.sp
.ne 2
.mk
.na
.B CS_BAD_SIZE
.ad
.RS 28n
.rt
Invalid
.I bytes
or
.IR devsize .
.RE

.sp
.ne 2
.mk
.na
.B CS_UNSUPPORTED_FUNCTION
.ad
.RS 28n
.rt
No
.B PCMCIA
hardware installed.
.RE

.SH CONTEXT
.sp
.LP
This function may be called from user or kernel context.
.SH SEE ALSO
.sp
.LP
.BR csx_ModifyWindow (9F),
.BR csx_RequestWindow (9F)
.sp
.LP
.I PCCard 95 Standard, PCMCIA/JEIDA
