usr/src/man/man9f/csx_Parse_CISTPL_DEVICEGEO_A.9f
'\" te
.\" Copyright (c) 1997, Sun Microsystems, Inc.  All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH csx_Parse_CISTPL_DEVICEGEO_A 9F "16 May 1997" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
csx_Parse_CISTPL_DEVICEGEO_A \- parse the Device Geo A tuple
.SH SYNOPSIS
.LP
.nf
#include <sys/pccard.h>



\fBint32_t\fR \fBcsx_Parse_CISTPL_DEVICEGEO_A\fR(\fBclient_handle_t\fR \fIch\fR, \fBtuple_t *\fItp\fR,
     \fBcistpl_devicegeo_t *\fIpt\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris
.B DDI
Specific (Solaris
.B DDI)
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I ch
.ad
.RS 7n
.rt
Client handle returned from
.BR csx_RegisterClient (9F).
.RE

.sp
.ne 2
.mk
.na
.I tp
.ad
.RS 7n
.rt
Pointer to a
.B tuple_t
structure (see
.BR tuple (9S))
returned by a
call to
.BR csx_GetFirstTuple "(9F) or"
.BR csx_GetNextTuple (9F).
.RE

.sp
.ne 2
.mk
.na
.I pt
.ad
.RS 7n
.rt
Pointer to a
.B cistpl_devicegeo_t
structure which contains the parsed
Device Geo A tuple information upon return from this function.
.RE

.SH DESCRIPTION
.sp
.LP
This function parses the Device Geo A tuple,
.B CISTPL_DEVICEGEO_A,
into
a form usable by
.B PC
Card drivers.
.sp
.LP
The
.B CISTPL_DEVICEGEO_A
tuple describes the device geometry of
attribute memory partitions.
.SH STRUCTURE MEMBERS
.sp
.LP
The structure members of
.B cistpl_devicegeo_t
are:
.sp
.in +2
.nf
uint32_t     info[CISTPL_DEVICEGEO_MAX_PARTITIONS].bus;
uint32_t     info[CISTPL_DEVICEGEO_MAX_PARTITIONS].ebs;
uint32_t     info[CISTPL_DEVICEGEO_MAX_PARTITIONS].rbs;
uint32_t     info[CISTPL_DEVICEGEO_MAX_PARTITIONS].wbs;
uint32_t     info[CISTPL_DEVICEGEO_MAX_PARTITIONS].part;
uint32_t     info[CISTPL_DEVICEGEO_MAX_PARTITIONS].hwil;
.fi
.in -2

.sp
.LP
The fields are defined as follows:
.sp
.ne 2
.mk
.na
.B info[CISTPL_DEVICEGEO_MAX_PARTITIONS].bus
.ad
.sp .6
.RS 4n
This field indicates the card interface width in bytes for the given
partition.
.RE

.sp
.ne 2
.mk
.na
.B info[CISTPL_DEVICEGEO_MAX_PARTITIONS].ebs
.ad
.sp .6
.RS 4n
This field indicates the minimum erase block size for the given
partition.
.RE

.sp
.ne 2
.mk
.na
.B info[CISTPL_DEVICEGEO_MAX_PARTITIONS].rbs
.ad
.sp .6
.RS 4n
This field indicates the minimum read block size for the given partition.
.RE

.sp
.ne 2
.mk
.na
.B info[CISTPL_DEVICEGEO_MAX_PARTITIONS].wbs
.ad
.sp .6
.RS 4n
This field indicates the minimum write block size for the given
partition.
.RE

.sp
.ne 2
.mk
.na
.B info[CISTPL_DEVICEGEO_MAX_PARTITIONS].part
.ad
.sp .6
.RS 4n
This field indicates the segment partition subdivisions for the given
partition.
.RE

.sp
.ne 2
.mk
.na
.B info[CISTPL_DEVICEGEO_MAX_PARTITIONS].hwil
.ad
.sp .6
.RS 4n
This field indicates the hardware interleave for the given partition.
.RE

.SH RETURN VALUES
.sp
.ne 2
.mk
.na
.B CS_SUCCESS
.ad
.RS 28n
.rt
Successful operation.
.RE

.sp
.ne 2
.mk
.na
.B CS_BAD_HANDLE
.ad
.RS 28n
.rt
Client handle is invalid.
.RE

.sp
.ne 2
.mk
.na
.B CS_UNKNOWN_TUPLE
.ad
.RS 28n
.rt
Parser does not know how to parse tuple.
.RE

.sp
.ne 2
.mk
.na
.B CS_NO_CARD
.ad
.RS 28n
.rt
No
.B PC
Card in socket.
.RE

.sp
.ne 2
.mk
.na
.B CS_NO_CIS
.ad
.RS 28n
.rt
No Card Information Structure (CIS) on
.B PC
Card.
.RE

.sp
.ne 2
.mk
.na
.B CS_UNSUPPORTED_FUNCTION
.ad
.RS 28n
.rt
No
.B PCMCIA
hardware installed.
.RE

.SH CONTEXT
.sp
.LP
This function may be called from user or kernel context.
.SH SEE ALSO
.sp
.LP
.BR csx_GetFirstTuple (9F),
.BR csx_GetNextTuple (9F),
.BR csx_GetTupleData (9F),
.BR csx_Parse_CISTPL_DEVICEGEO (9F),
.BR csx_RegisterClient (9F),
.BR tuple (9S)
.sp
.LP
.I PC Card 95 Standard, PCMCIA/JEIDA
