usr/src/man/man9f/csx_MapMemPage.9f
'\" te
.\" Copyright (c) 1996, Sun Microsystems, Inc.  All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH csx_MapMemPage 9F "19 Jul 1996" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
csx_MapMemPage \- map the memory area on a PC Card
.SH SYNOPSIS
.LP
.nf
#include <sys/pccard.h>



\fBint32_t\fR \fBcsx_MapMemPage\fR(\fBwindow_handle_t\fR \fIwh\fR, \fBmap_mem_page_t *\fImp\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris
.B DDI
Specific (Solaris
.B DDI)
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I wh
.ad
.RS 7n
.rt
Window handle returned from
.BR csx_RequestWindow (9F).
.RE

.sp
.ne 2
.mk
.na
.I mp
.ad
.RS 7n
.rt
Pointer to a
.B map_mem_page_t
structure.
.RE

.SH DESCRIPTION
.sp
.LP
This function maps the memory area on a
.B PC
Card into a page of a
window allocated with the \fBcsx_RequestWindow\fR(9F) function.
.SH STRUCTURE MEMBERS
.sp
.LP
The structure members of
.B map_mem_page_t
are:
.sp
.in +2
.nf
uint32_t     CardOffset;       /* card offset */
uint32_t     Page;             /* page number */
.fi
.in -2

.sp
.LP
The fields are defined as follows:
.sp
.ne 2
.mk
.na
.B CardOffset
.ad
.RS 15n
.rt
The absolute offset in bytes from the beginning of the
.B PC
Card to map
into system memory.
.RE

.sp
.ne 2
.mk
.na
.B Page
.ad
.RS 15n
.rt
Used internally by Card Services; clients must set this field to \fB0\fR
before calling this function.
.RE

.SH RETURN VALUES
.sp
.ne 2
.mk
.na
.B CS_SUCCESS
.ad
.RS 28n
.rt
Successful operation.
.RE

.sp
.ne 2
.mk
.na
.B CS_BAD_HANDLE
.ad
.RS 28n
.rt
Client handle is invalid.
.RE

.sp
.ne 2
.mk
.na
.B CS_BAD_OFFSET
.ad
.RS 28n
.rt
Offset is invalid.
.RE

.sp
.ne 2
.mk
.na
.B CS_BAD_PAGE
.ad
.RS 28n
.rt
Page is not zero.
.RE

.sp
.ne 2
.mk
.na
.B CS_NO_CARD
.ad
.RS 28n
.rt
No
.B PC
Card in socket.
.RE

.sp
.ne 2
.mk
.na
.B CS_UNSUPPORTED_FUNCTION
.ad
.RS 28n
.rt
No
.B PCMCIA
hardware installed.
.RE

.SH CONTEXT
.sp
.LP
This function may be called from user or kernel context.
.SH SEE ALSO
.sp
.LP
.BR csx_ModifyWindow (9F),
.BR csx_ReleaseWindow (9F),
.BR csx_RequestWindow (9F)
.sp
.LP
.I PC Card 95 Standard, PCMCIA/JEIDA
