usr/src/man/man9f/csx_ModifyConfiguration.9f
'\" te
.\" Copyright (c) 2002, Sun Microsystems, Inc.  All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH csx_ModifyConfiguration 9F "19 Jul 1996" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
csx_ModifyConfiguration \- modify socket and PC Card Configuration
Register
.SH SYNOPSIS
.LP
.nf
#include <sys/pccard.h>



\fBint32_t\fR \fBcsx_ModifyConfiguration\fR(\fBclient_handle_t\fR \fIch\fR, \fBmodify_config_t *\fImc\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris
.B DDI
Specific (Solaris
.B DDI)
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I ch
.ad
.RS 7n
.rt
Client handle returned from
.BR csx_RegisterClient (9F).
.RE

.sp
.ne 2
.mk
.na
.I mc
.ad
.RS 7n
.rt
Pointer to a
.B modify_config_t
structure.
.RE

.SH DESCRIPTION
.sp
.LP
This function allows a socket and
.B PC
Card configuration to be
modified. This function can only modify a configuration requested via
.BR csx_RequestConfiguration (9F).
.SH STRUCTURE MEMBERS
.sp
.LP
The structure members of
.B modify_config_t
are:
.sp
.in +2
.nf
uint32_t     Socket;        /* socket number */
uint32_t     Attributes;    /* attributes to modify */
uint32_t     Vpp1;          /* Vpp1 value */
uint32_t     Vpp2;          /* Vpp2 value */
.fi
.in -2

.sp
.LP
The fields are defined as follows:
.sp
.ne 2
.mk
.na
.B Socket
.ad
.RS 15n
.rt
Not used in Solaris, but for portability with other Card Services
implementations, it should be set to the logical socket number.
.RE

.sp
.ne 2
.mk
.na
.B Attributes
.ad
.RS 15n
.rt
This field is bit-mapped. The following bits are defined:
.sp
.ne 2
.mk
.na
.B CONF_ENABLE_IRQ_STEERING
.ad
.RS 28n
.rt
Enable IRQ steering. Set to connect the
.B PC
Card
.B IREQ
line to a
previously selected system interrupt.
.RE

.sp
.ne 2
.mk
.na
.B CONF_IRQ_CHANGE_VALID
.ad
.RS 28n
.rt
IRQ change valid. Set to request the
.B IRQ
steering enable to be
changed.
.RE

.sp
.ne 2
.mk
.na
.B CONF_VPP1_CHANGE_VALID
.ad
.RS 28n
.rt
Vpp1 change valid. These bits are set to request a change to the
corresponding voltage level for the
.B PC
Card.
.RE

.sp
.ne 2
.mk
.na
.B CONF_VPP2_CHANGE_VALID
.ad
.RS 28n
.rt
Vpp2 change valid. These bits are set to request a change to the
corresponding voltage level for the
.B PC
Card.
.RE

.sp
.ne 2
.mk
.na
.B CONF_VSOVERRIDE
.ad
.RS 28n
.rt
Override VS pins. For Low Voltage keyed cards, must be set if a client
desires to apply a voltage inappropriate for this card to any pin. After
card insertion and prior to the first \fBcsx_RequestConfiguration\fR(9F)
call for this client, the voltage levels applied to the card will be those
specified by the Card Interface Specification. (See
.BR WARNINGS .)
.RE

.RE

.sp
.ne 2
.mk
.na
.BR Vpp1 ,
.B Vpp2
.ad
.RS 15n
.rt
Represent voltages expressed in tenths of a volt. Values from
.B 0
to
.B 25.5
volts may be set. To be valid, the exact voltage must be
available from the system. To be compliant with the \fIPC Card 95 Standard,
PCMCIA/JEIDA\fR, systems must always support \fB5.0\fR volts for both
.B Vcc
and
.BR Vpp .
(See
.BR WARNINGS .)
.RE

.SH RETURN VALUES
.sp
.ne 2
.mk
.na
.B CS_SUCCESS
.ad
.RS 28n
.rt
Successful operation.
.RE

.sp
.ne 2
.mk
.na
.B CS_BAD_HANDLE
.ad
.RS 28n
.rt
Client handle is invalid or \fBcsx_RequestConfiguration\fR(9F) not done.
.RE

.sp
.ne 2
.mk
.na
.B CS_BAD_SOCKET
.ad
.RS 28n
.rt
Error getting/setting socket hardware parameters.
.RE

.sp
.ne 2
.mk
.na
.B CS_BAD_VPP
.ad
.RS 28n
.rt
Requested
.B Vpp
is not available on socket.
.RE

.sp
.ne 2
.mk
.na
.B CS_NO_CARD
.ad
.RS 28n
.rt
No
.B PC
Card in socket.
.RE

.sp
.ne 2
.mk
.na
.B CS_UNSUPPORTED_FUNCTION
.ad
.RS 28n
.rt
No
.B PCMCIA
hardware installed.
.RE

.SH CONTEXT
.sp
.LP
This function may be called from user or kernel context.
.SH SEE ALSO
.sp
.LP
.BR csx_RegisterClient (9F),
.BR csx_ReleaseConfiguration (9F),
.BR csx_ReleaseIO (9F),
.BR csx_ReleaseIRQ (9F),
.BR csx_RequestConfiguration (9F),
.BR csx_RequestIO (9F),
.BR csx_RequestIRQ (9F)
.sp
.LP
.I PC Card 95 Standard, PCMCIA/JEIDA
.SH WARNINGS
.RS +4
.TP
1.
.B CONF_VSOVERRIDE
is provided for clients that have a need to override
the information provided in the CIS. The client must exercise caution when
setting this as it overrides any voltage level protection provided by Card
Services.
.RE
.RS +4
.TP
2.
Using
.B csx_ModifyConfiguration()
to set
.B Vpp
to
.B 0
volts may
result in the loss of a
.B PC
.RB "Card's state. Any client setting" " Vpp"
to
.B 0
volts is responsible for insuring that the
.B PC
Card's state
is restored when power is re-applied to the card.
.RE
.SH NOTES
.sp
.LP
Mapped
.B IO
addresses can only be changed by first releasing the
current configuration and
.B IO
resources with
.BR csx_ReleaseConfiguration (9F)
and
.BR csx_ReleaseIO "(9F), requesting"
new
.B IO
resources and a new configuration with
.BR csx_RequestIO (9F),
followed by \fBcsx_RequestConfiguration\fR(9F).
.sp
.LP
.B IRQ
priority can only be changed by first releasing the current
configuration and
.B IRQ
resources with
.BR csx_ReleaseConfiguration (9F)
and
.BR csx_ReleaseIRQ "(9F), requesting"
new
.B IRQ
resources and a new configuration with
.BR csx_RequestIRQ (9F),
followed by \fBcsx_RequestConfiguration\fR(9F).
.sp
.LP
.B Vcc
can not be changed using \fBcsx_ModifyConfiguration()\fR.
.B Vcc
may be changed by first invoking
.BR csx_ReleaseConfiguration (9F),
followed by
.BR csx_RequestConfiguration (9F)
with a new
.B Vcc
value.
