usr/src/man/man9f/csx_Parse_CISTPL_SPCL.9f
'\" te
.\" Copyright (c) 1996, Sun Microsystems, Inc.  All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH csx_Parse_CISTPL_SPCL 9F "20 Dec 1996" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
csx_Parse_CISTPL_SPCL \- parse the Special Purpose tuple
.SH SYNOPSIS
.LP
.nf
#include <sys/pccard.h>



\fBint32_t\fR \fBcsx_Parse_CISTPL_SPCL\fR(\fBclient_handle_t\fR \fIch\fR, \fBtuple_t *\fItu\fR,
    \fBcistpl_spcl_t *\fIcsp\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris
.B DDI
Specific (Solaris
.B DDI)
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I ch
.ad
.RS 7n
.rt
Client handle returned from
.BR csx_RegisterClient (9F).
.RE

.sp
.ne 2
.mk
.na
.I tu
.ad
.RS 7n
.rt
Pointer to a
.B tuple_t
structure (see
.BR tuple (9S))
returned by a
call to \fBcsx_GetFirstTuple\fR(9F) or \fBcsx_GetNextTuple\fR(9F).
.RE

.sp
.ne 2
.mk
.na
.I csp
.ad
.RS 7n
.rt
Pointer to a
.B cistpl_spcl_t
structure which contains the parsed
\fBCISTPL_SPCL\fR tuple information upon return from this function.
.RE

.SH DESCRIPTION
.sp
.LP
This function parses the Special Purpose tuple,
.B CISTPL_SPCL,
into a
form usable by
.B PC
Card drivers.
.sp
.LP
The
.B CISTPL_SPCL
tuple is identified by an identification field that
is assigned by
.B PCMCIA
or JEIDA. A sequence field allows a series of
\fBCISTPL_SPCL\fR tuples to be used when the data exceeds the size that can
be stored in a single tuple; the maximum data area of a series of
\fBCISTPL_SPCL\fR tuples is unlimited. Another field gives the number of
bytes in the data field in this tuple.
.SH STRUCTURE MEMBERS
.sp
.LP
The structure members of
.B cistpl_date_t
are:
.sp
.in +2
.nf
uint32_t    id;       /* tuple contents identification */
uint32_t    seq;      /* data sequence number */
uint32_t    bytes;    /* number of bytes following */
uchar_t     data[CIS_MAX_TUPLE_DATA_LEN];
.fi
.in -2

.sp
.LP
The fields are defined as follows:
.sp
.ne 2
.mk
.na
.B id
.ad
.RS 9n
.rt
This field contains a
.B PCMCIA
or
.B JEIDA
assigned value that
identifies this series of one or more
.B CISTPL_SPCL
tuples. These field
values are assigned by contacting either
.B PCMCIA
or
.BR JEIDA .
.RE

.sp
.ne 2
.mk
.na
.B seq
.ad
.RS 9n
.rt
This field contains a data sequence number.
.B CISTPL_SPCL_SEQ_END
is
the last tuple in sequence.
.RE

.sp
.ne 2
.mk
.na
.B bytes
.ad
.RS 9n
.rt
This field contains the number of data bytes in the
.BR data[CIS_MAX_TUPLE_DATA_LEN] .
.RE

.sp
.ne 2
.mk
.na
.B data
.ad
.RS 9n
.rt
The data component of this tuple.
.RE

.SH RETURN VALUES
.sp
.ne 2
.mk
.na
.B CS_SUCCESS
.ad
.RS 27n
.rt
Successful operation.
.RE

.sp
.ne 2
.mk
.na
.B CS_BAD_HANDLE
.ad
.RS 27n
.rt
Client handle is invalid.
.RE

.sp
.ne 2
.mk
.na
.B CS_UNKNOWN_TUPLE
.ad
.RS 27n
.rt
Parser does not know how to parse tuple.
.RE

.sp
.ne 2
.mk
.na
.B CS_NO_CARD
.ad
.RS 27n
.rt
No
.B PC
Card in socket.
.RE

.sp
.ne 2
.mk
.na
.B CS_NO_CIS
.ad
.RS 27n
.rt
No Card Information Structure (CIS) on
.B PC
Card.
.RE

.sp
.ne 2
.mk
.na
.B CS_UNSUPPORTED_FUNCTION
.ad
.RS 27n
.rt
No
.B PCMCIA
hardware installed.
.RE

.SH CONTEXT
.sp
.LP
This function may be called from user or kernel context.
.SH SEE ALSO
.sp
.LP
.BR csx_GetFirstTuple (9F),
.BR csx_GetTupleData (9F),
.BR csx_RegisterClient (9F),
.BR csx_ValidateCIS (9F),
.BR tuple (9S)
.sp
.LP
\fIPC Card 95 Standard,\fR PCMCIA/JEIDA
