usr/src/man/man9f/csx_Parse_CISTPL_BYTEORDER.9f
'\" te
.\" Copyright (c) 2000, Sun Microsystems, Inc.
.\"  All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH csx_Parse_CISTPL_BYTEORDER 9F "20 Dec 1996" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
csx_Parse_CISTPL_BYTEORDER \- parse the Byte Order tuple
.SH SYNOPSIS
.LP
.nf
#include <sys/pccard.h>



\fBint32_t\fR \fBcsx_Parse_CISTPL_BYTEORDER\fR(\fBclient_handle_t\fR \fIch\fR, \fBtuple_t *\fItu\fR,
     \fBcistpl_byteorder_t *\fIcbo\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris
.B DDI
Specific (Solaris
.B DDI)
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I ch
.ad
.RS 8n
.rt
Client handle returned from
.BR csx_RegisterClient (9F).
.RE

.sp
.ne 2
.mk
.na
.I tu
.ad
.RS 8n
.rt
Pointer to a
.B tuple_t
structure (see
.BR tuple (9S))
returned by a
call to \fBcsx_GetFirstTuple\fR(9F) or \fBcsx_GetNextTuple\fR(9F).
.RE

.sp
.ne 2
.mk
.na
.I cbo
.ad
.RS 8n
.rt
Pointer to a
.B cistpl_byteorder_t
structure which contains the parsed
\fBCISTPL_BYTEORDER\fR tuple information upon return from this function.
.RE

.SH DESCRIPTION
.sp
.LP
This function parses the Byte Order tuple,
.BR CISTPL_BYTEORDER ,
into a
form usable by
.B PC
Card drivers.
.sp
.LP
The
.B CISTPL_BYTEORDER
tuple shall only appear in a partition tuple set
for a memory-like partition. It specifies two parameters: the order for
multi-byte data, and the order in which bytes map into words for 16-bit
cards.
.SH STRUCTURE MEMBERS
.sp
.LP
The structure members of
.B cistpl_byteorder_t
are:
.sp
.in +2
.nf
uint32_t     order;     /* byte order code */
uint32_t     map;       /* byte mapping code */
.fi
.in -2

.sp
.LP
The fields are defined as follows:
.sp
.ne 2
.mk
.na
.B order
.ad
.RS 10n
.rt
This field specifies the byte order for multi-byte numeric data.
.sp
.ne 2
.mk
.na
.B TPLBYTEORD_LOW
.ad
.RS 18n
.rt
Little endian order
.RE

.sp
.ne 2
.mk
.na
.B TPLBYTEORD_VS
.ad
.RS 18n
.rt
Vendor specific
.RE

.RE

.sp
.ne 2
.mk
.na
.B map
.ad
.RS 10n
.rt
This field specifies the byte mapping for 16-bit or wider cards.
.sp
.ne 2
.mk
.na
.B TPLBYTEMAP_LOW
.ad
.RS 19n
.rt
Byte zero is least significant byte
.RE

.sp
.ne 2
.mk
.na
.B TPLBYTEMAP_HIGH
.ad
.RS 19n
.rt
Byte zero is most significant byte
.RE

.sp
.ne 2
.mk
.na
.B TPLBYTEMAP_VS
.ad
.RS 19n
.rt
Vendor specific mapping
.RE

.RE

.SH RETURN VALUES
.sp
.ne 2
.mk
.na
.B CS_SUCCESS
.ad
.RS 28n
.rt
Successful operation.
.RE

.sp
.ne 2
.mk
.na
.B CS_BAD_HANDLE
.ad
.RS 28n
.rt
Client handle is invalid.
.RE

.sp
.ne 2
.mk
.na
.B CS_UNKNOWN_TUPLE
.ad
.RS 28n
.rt
Parser does not know how to parse tuple.
.RE

.sp
.ne 2
.mk
.na
.B CS_NO_CARD
.ad
.RS 28n
.rt
No
.B PC
Card in socket.
.RE

.sp
.ne 2
.mk
.na
.B CS_NO_CIS
.ad
.RS 28n
.rt
No Card Information Structure (CIS)
.B PC
Card.
.RE

.sp
.ne 2
.mk
.na
.B CS_UNSUPPORTED_FUNCTION
.ad
.RS 28n
.rt
No
.B PCMCIA
hardware installed.
.RE

.SH CONTEXT
.sp
.LP
This function may be called from user or kernel context.
.SH SEE ALSO
.sp
.LP
.BR csx_GetFirstTuple (9F),
.BR csx_GetTupleData (9F),
.BR csx_RegisterClient (9F),
.BR csx_ValidateCIS (9F),
.BR tuple (9S)
.sp
.LP
.I PC Card 95 Standard, PCMCIA/JEIDA
