usr/src/man/man9f/csx_ReleaseConfiguration.9f
'\" te
.\" Copyright (c) 1996, Sun Microsystems, Inc.  All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH csx_ReleaseConfiguration 9F "19 Jul 1996" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
csx_ReleaseConfiguration \- release PC Card and socket configuration
.SH SYNOPSIS
.LP
.nf
#include <sys/pccard.h>



\fBint32_t\fR \fBcsx_ReleaseConfiguration\fR(\fBclient_handle_t\fR \fIch\fR, \fBrelease_config_t *\fIrc\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris
.B DDI
Specific (Solaris
.BR DDI )
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I ch
.ad
.RS 7n
.rt
Client handle returned from
.BR csx_RegisterClient (9F).
.RE

.sp
.ne 2
.mk
.na
.I rc
.ad
.RS 7n
.rt
Pointer to a
.B release_config_t
structure.
.RE

.SH DESCRIPTION
.sp
.LP
This function returns a
.B PC
Card and socket to a simple memory only
interface and sets the card to configuration zero by writing a
.B 0
to
the
.B PC
card's
.B COR
(Configuration Option Register).
.sp
.LP
Card Services may remove power from the socket if no clients have indicated
their usage of the socket by an active \fBcsx_RequestConfiguration\fR(9F) or
.BR csx_RequestWindow (9F).
.sp
.LP
Card Services is prohibited from resetting the
.B PC
Card and is not
required to cycle power through zero (\fB0\fR) volts.
.sp
.LP
After calling
.B csx_ReleaseConfiguration()
any resources requested via
the request functions
.BR csx_RequestIO (9F),
.BR csx_RequestIRQ (9F),
or
.BR csx_RequestWindow (9F)
that are no longer needed should be returned to
Card Services via the corresponding
.BR csx_ReleaseIO (9F),
.BR csx_ReleaseIRQ (9F),
or
.BR csx_ReleaseWindow (9F)
functions.
.B csx_ReleaseConfiguration()
must be called to release the current card
and socket configuration before releasing any resources requested by the
driver via the request functions named above.
.SH STRUCTURE MEMBERS
.sp
.LP
The structure members of
.B release_config_t
are:
.sp
.in +2
.nf
uint32_t     Socket;     /* socket number */
.fi
.in -2

.sp
.LP
The
.B Socket
field is not used in Solaris, but for portability with
other Card Services implementations, it should be set to the logical socket
number.
.SH RETURN VALUES
.sp
.ne 2
.mk
.na
.B CS_SUCCESS
.ad
.RS 28n
.rt
Successful operation.
.RE

.sp
.ne 2
.mk
.na
.B CS_BAD_HANDLE
.ad
.RS 28n
.rt
Client handle is invalid or \fBcsx_RequestConfiguration\fR(9F) not done.
.RE

.sp
.ne 2
.mk
.na
.B CS_BAD_SOCKET
.ad
.RS 28n
.rt
Error getting or setting socket hardware parameters.
.RE

.sp
.ne 2
.mk
.na
.B CS_NO_CARD
.ad
.RS 28n
.rt
No
.B PC
card in socket.
.RE

.sp
.ne 2
.mk
.na
.B CS_UNSUPPORTED_FUNCTION
.ad
.RS 28n
.rt
No
.B PCMCIA
hardware installed.
.RE

.SH CONTEXT
.sp
.LP
This function may be called from user or kernel context.
.SH SEE ALSO
.sp
.LP
.BR csx_RegisterClient (9F),
.BR csx_RequestConfiguration (9F),
.BR csx_RequestIO (9F),
.BR csx_RequestIRQ (9F),
.BR csx_RequestWindow (9F)
.sp
.LP
.IR "PC Card 95 Standard" ,
PCMCIA/JEIDA
