usr/src/man/man9f/csx_Parse_CISTPL_DEVICE.9f
'\" te
.\" Copyright (c) 2002, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH csx_Parse_CISTPL_DEVICE 9F "20 Dec 1996" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
csx_Parse_CISTPL_DEVICE, csx_Parse_CISTPL_DEVICE_A,
csx_Parse_CISTPL_DEVICE_OC, csx_Parse_CISTPL_DEVICE_OA \- parse Device
Information tuples
.SH SYNOPSIS
.LP
.nf
#include <sys/pccard.h>



\fBint32_t\fR \fBcsx_Parse_CISTPL_DEVICE\fR(\fBclient_handle_t\fR \fIch\fR, \fBtuple_t *\fItu\fR,
     \fBcistpl_device_t *\fIcd\fR);
.fi

.LP
.nf
\fBint32_t\fR \fBcsx_Parse_CISTPL_DEVICE_A\fR(\fBclient_handle_t\fR \fIch\fR, \fBtuple_t *\fItu\fR,
     \fBcistpl_device_t *\fIcd\fR);
.fi

.LP
.nf
\fBint32_t\fR \fBcsx_Parse_CISTPL_DEVICE_OC\fR(\fBclient_handle_t\fR \fIch\fR, \fBtuple_t *\fItu\fR,
     \fBcistpl_device_t *\fIcd\fR);
.fi

.LP
.nf
\fBint32_t\fR \fBcsx_Parse_CISTPL_DEVICE_OA\fR(\fBclient_handle_t\fR \fIch\fR, \fBtuple_t *\fItu\fR,
     \fBcistpl_device_t *\fIcd\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris
.B DDI
Specific (Solaris
.B DDI)
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I ch
.ad
.RS 6n
.rt
Client handle returned from
.BR csx_RegisterClient (9F).
.RE

.sp
.ne 2
.mk
.na
.I tu
.ad
.RS 6n
.rt
Pointer to a
.B tuple_t
structure (see
.BR tuple (9S))
returned by a
call to
.BR csx_GetFirstTuple "(9F) or"
.BR csx_GetNextTuple (9F).
.RE

.sp
.ne 2
.mk
.na
.I cd
.ad
.RS 6n
.rt
Pointer to a
.B cistpl_device_t
structure which contains the parsed
.B "CISTPL_DEVICE, CISTPL_DEVICE_A,"
.B CISTPL_DEVICE_OC,
or
.B CISTPL_DEVICE_OA
tuple information upon return from these functions,
respectively.
.RE

.SH DESCRIPTION
.sp
.LP
.B csx_Parse_CISTPL_DEVICE()
and
.B csx_Parse_CISTPL_DEVICE_A()
parse
the 5 volt Device Information tuples,
.B CISTPL_DEVICE
and
.B CISTPL_DEVICE_A,
respectively, into a form usable by
.B PC
Card
drivers.
.sp
.LP
.B csx_Parse_CISTPL_DEVICE_OC()
and
.BR csx_Parse_CISTPL_DEVICE_OA()
parse the Other Condition Device Information tuples,
.B CISTPL_DEVICE_OC
and
.B CISTPL_DEVICE_OA,
respectively, into a form usable by \fBPC \fRCard drivers.
.sp
.LP
The
.B CISTPL_DEVICE
and
.B CISTPL_DEVICE_A
tuples are used to
describe the card's device information, such as device speed, device size,
device type, and address space layout information for Common Memory or
Attribute Memory space, respectively.
.sp
.LP
The
.B CISTPL_DEVICE_OC
and
.B CISTPL_DEVICE_OA
tuples are used to
describe the information about the card's device under a set of operating
conditions for Common Memory or Attribute Memory space, respectively.
.SH STRUCTURE MEMBERS
.sp
.LP
The structure members of
.B cistpl_device_t
are:
.sp
.in +2
.nf
uint32_t               num_devices;    /* number of devices found */
cistpl_device_node_t   devnode[CISTPL_DEVICE_MAX_DEVICES];
.fi
.in -2

.sp
.LP
The structure members of
.B cistpl_device_node_t
are:
.sp
.in +2
.nf
uint32_t     flags;             /* flags specific to this device */
uint32_t     speed;             /* device speed in device
                                /*  speed code format */
uint32_t     nS_speed;          /* device speed in nS */
uint32_t     type;              /* device type */
uint32_t     size;              /* device size */
uint32_t     size_in_bytes;     /* device size in bytes */
.fi
.in -2

.sp
.LP
The fields are defined as follows:
.sp
.ne 2
.mk
.na
.B flags
.ad
.RS 9n
.rt
This field indicates whether or not the device is writable, and describes a
.B Vcc
voltage at which the
.B PC
Card can be operated.
.sp
.ne 2
.mk
.na
.B CISTPL_DEVICE_WPS
.ad
.RS 21n
.rt
Write Protect Switch bit is set
.RE

Bits which are applicable only for
.B CISTPL_DEVICE_OC
and
.B CISTPL_DEVICE_OA
are:
.sp
.ne 2
.mk
.na
.B CISTPL_DEVICE_OC_MWAIT
.ad
.RS 29n
.rt
Use MWAIT
.RE

.sp
.ne 2
.mk
.na
.B CISTPL_DEVICE_OC_Vcc_MASK
.ad
.RS 29n
.rt
Mask for
.B Vcc
value
.RE

.sp
.ne 2
.mk
.na
.B CISTPL_DEVICE_OC_Vcc5
.ad
.RS 29n
.rt
5.0 volt operation
.RE

.sp
.ne 2
.mk
.na
.B CISTPL_DEVICE_OC_Vcc33
.ad
.RS 29n
.rt
3.3 volt operation
.RE

.sp
.ne 2
.mk
.na
.B CISTPL_DEVICE_OC_VccXX
.ad
.RS 29n
.rt
X.X volt operation
.RE

.sp
.ne 2
.mk
.na
.B CISTPL_DEVICE_OC_VccYY
.ad
.RS 29n
.rt
Y.Y volt operation
.RE

.RE

.sp
.ne 2
.mk
.na
.B speed
.ad
.RS 17n
.rt
The device speed value described in the device speed code unit. If this
field is set to
.B CISTPL_DEVICE_SPEED_SIZE_IGNORE,
then the speed
information will be ignored.
.RE

.sp
.ne 2
.mk
.na
.B nS_speed
.ad
.RS 17n
.rt
The device speed value described in nanosecond units.
.RE

.sp
.ne 2
.mk
.na
.B size
.ad
.RS 17n
.rt
The device size value described in the device size code unit. If this field
is set to
.B CISTPL_DEVICE_SPEED_SIZE_IGNORE,
then the size information
will be ignored.
.RE

.sp
.ne 2
.mk
.na
.B size_in_bytes
.ad
.RS 17n
.rt
The device size value described in byte units.
.RE

.sp
.ne 2
.mk
.na
.B type
.ad
.RS 17n
.rt
This is the device type code field which is defined as follows:
.sp
.ne 2
.mk
.na
.B CISTPL_DEVICE_DTYPE_NULL
.ad
.sp .6
.RS 4n
No device
.RE

.sp
.ne 2
.mk
.na
.B CISTPL_DEVICE_DTYPE_ROM
.ad
.sp .6
.RS 4n
Masked ROM
.RE

.sp
.ne 2
.mk
.na
.B CISTPL_DEVICE_DTYPE_OTPROM
.ad
.sp .6
.RS 4n
One Time Programmable ROM
.RE

.sp
.ne 2
.mk
.na
.B CISTPL_DEVICE_DTYPE_EPROM
.ad
.sp .6
.RS 4n
UV EPROM
.RE

.sp
.ne 2
.mk
.na
.B CISTPL_DEVICE_DTYPE_EEPROM
.ad
.sp .6
.RS 4n
EEPROM
.RE

.sp
.ne 2
.mk
.na
.B CISTPL_DEVICE_DTYPE_FLASH
.ad
.sp .6
.RS 4n
FLASH
.RE

.sp
.ne 2
.mk
.na
.B CISTPL_DEVICE_DTYPE_SRAM
.ad
.sp .6
.RS 4n
Static RAM
.RE

.sp
.ne 2
.mk
.na
.B CISTPL_DEVICE_DTYPE_DRAM
.ad
.sp .6
.RS 4n
Dynamic RAM
.RE

.sp
.ne 2
.mk
.na
.B CISTPL_DEVICE_DTYPE_FUNCSPEC
.ad
.sp .6
.RS 4n
Function-specific memory address range
.RE

.sp
.ne 2
.mk
.na
.B CISTPL_DEVICE_DTYPE_EXTEND
.ad
.sp .6
.RS 4n
Extended type follows
.RE

.RE

.SH RETURN VALUES
.sp
.ne 2
.mk
.na
.B CS_SUCCESS
.ad
.RS 27n
.rt
Successful operation.
.RE

.sp
.ne 2
.mk
.na
.B CS_BAD_HANDLE
.ad
.RS 27n
.rt
Client handle is invalid.
.RE

.sp
.ne 2
.mk
.na
.B CS_UNKNOWN_TUPLE
.ad
.RS 27n
.rt
Parser does not know how to parse tuple.
.RE

.sp
.ne 2
.mk
.na
.B CS_NO_CARD
.ad
.RS 27n
.rt
No
.B PC
Card in socket.
.RE

.sp
.ne 2
.mk
.na
.B CS_NO_CIS
.ad
.RS 27n
.rt
No Card Information Structure (CIS) on
.B PC
Card.
.RE

.sp
.ne 2
.mk
.na
.B CS_UNSUPPORTED_FUNCTION
.ad
.RS 27n
.rt
No
.B PCMCIA
hardware installed.
.RE

.SH CONTEXT
.sp
.LP
These functions may be called from user or kernel context.
.SH SEE ALSO
.sp
.LP
.BR csx_GetFirstTuple (9F),
.BR csx_GetTupleData (9F),
.BR csx_Parse_CISTPL_JEDEC_C (9F),
.BR csx_RegisterClient (9F),
.BR csx_ValidateCIS (9F),
.BR tuple (9S)
.sp
.LP
.I PC Card 95 Standard, PCMCIA/JEIDA
