usr/src/man/man9f/datamsg.9f
'\" te
.\" Copyright 1989 AT&T
.\" Copyright (c) 2006, Sun Microsystems, Inc.  All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH datamsg 9F "16 Jan 2006" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
datamsg \- test whether a message is a data message
.SH SYNOPSIS
.LP
.nf
#include <sys/stream.h>
#include <sys/ddi.h>



\fBint\fR \fBdatamsg\fR(\fBunsigned char\fR \fItype\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Architecture independent level 1 (DDI/DKI).
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I type
.ad
.RS 8n
.rt
The type of message to be tested. The
.B db_type
field of the
.BR datab (9S)
structure contains the message type. This field may be
accessed through the message block using
.BR mp->b_datap->db_type .
.RE

.SH DESCRIPTION
.sp
.LP
The
.B datamsg()
function tests the type of message to determine if it
is a data message type
.RB ( M_DATA ,
.BR M_DELAY ,
.B M_PROTO
, or
.BR M_PCPROTO ).
.SH RETURN VALUES
.sp
.LP
.B datamsg
returns
.sp
.ne 2
.mk
.na
.B 1
.ad
.RS 5n
.rt
if the message is a data message
.RE

.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 5n
.rt
otherwise.
.RE

.SH CONTEXT
.sp
.LP
The
.B datamsg()
function can be called from user, interrupt, or kernel
context.
.SH EXAMPLES
.sp
.LP
The
.BR put (9E)
routine enqueues all data messages for handling by the
.BR srv (9E)
(service) routine. All non-data messages are handled in the
.BR put (9E)
routine.
.sp
.in +2
.nf
1 \fIxxx\fRput(q, mp)
2      queue_t *q;
3      mblk_t *mp;
4 {
5    if (datamsg(mp->b_datap->db_type)) {
6            putq(q, mp);
7            return;
8    }
9    switch (mp->b_datap->db_type) {
10    case M_FLUSH:
		       \&.\|.\|.
11    }
12 }
.fi
.in -2

.SH SEE ALSO
.sp
.LP
.BR put (9E),
.BR srv (9E),
.BR allocb (9F),
.BR datab (9S),
.BR msgb (9S)
.sp
.LP
.I Writing Device Drivers
.sp
.LP
.I STREAMS Programming Guide
