usr/src/man/man9f/ddi_dma_htoc.9f
'\" te
.\" Copyright (c) 2006, Sun Microsystems, Inc.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ddi_dma_htoc 9F "16 Jan 2006" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
ddi_dma_htoc \- convert a DMA handle to a DMA address cookie
.SH SYNOPSIS
.LP
.nf
#include <sys/conf.h>
#include <sys/ddi.h>
#include <sys/sunddi.h>



\fBint\fR \fBddi_dma_htoc\fR(\fBddi_dma_handle_t\fR \fIhandle\fR, \fBoff_t\fR \fIoff\fR,
     \fBddi_dma_cookie_t *\fIcookiep\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
This interface is obsolete.
.BR ddi_dma_addr_bind_handle (9F)
or
.BR ddi_dma_buf_bind_handle (9F)
should be used instead.
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I handle
.ad
.RS 11n
.rt
The handle filled in by a call to
.BR ddi_dma_setup (9F).
.RE

.sp
.ne 2
.mk
.na
.I off
.ad
.RS 11n
.rt
An offset into the object that
.I handle
maps.
.RE

.sp
.ne 2
.mk
.na
.I cookiep
.ad
.RS 11n
.rt
A pointer to a
.BR ddi_dma_cookie "(9S) structure."
.RE

.SH DESCRIPTION
.sp
.LP
The
.B ddi_dma_htoc()
function takes a
.B DMA
handle (established by
.BR ddi_dma_setup (9F)),
and fills in the cookie pointed to by
.I cookiep
with the appropriate address, length, and bus type to be used
to program the
.B DMA
engine.
.SH RETURN VALUES
.sp
.LP
The
.B ddi_dma_htoc()
function returns:
.sp
.ne 2
.mk
.na
.B DDI_SUCCESS
.ad
.RS 15n
.rt
Successfully filled in the cookie pointed to by
.IR cookiep .
.RE

.sp
.ne 2
.mk
.na
.B DDI_FAILURE
.ad
.RS 15n
.rt
Failed to successfully fill in the cookie.
.RE

.SH CONTEXT
.sp
.LP
The
.B ddi_dma_htoc()
function can be called from user, interrupt, or
kernel context.
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for a description of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
\fBATTRIBUTE TYPE\fR\fBATTRIBUTE VALUE\fR
_
Stability LevelObsolete
.TE

.SH SEE ALSO
.sp
.LP
.BR attributes (5),
.BR ddi_dma_addr_bind_handle (9F),
.BR ddi_dma_addr_setup (9F),
.BR ddi_dma_buf_bind_handle (9F),
.BR ddi_dma_buf_setup (9F),
.BR ddi_dma_setup (9F),
.BR ddi_dma_sync (9F),
.BR ddi_dma_cookie (9S)
.sp
.LP
.I Writing Device Drivers
