usr/src/man/man9f/ddi_fm_handler_register.9f
'\" te
.\" Copyright (c) 2007, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ddi_fm_handler_register 9F "14 May 2007" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
ddi_fm_handler_register, ddi_fm_handler_unregister \- register or
unregister an error handling callback
.SH SYNOPSIS
.LP
.nf
#include <sys/ddifm.h>

\fBvoid\fR \fBddi_fm_handler_register\fR(\fBdev_info_t\fR *\fIdip\fR,
     \fBddi_err_func_t\fR \fIerror_handler\fR, \fBvoid\fR *\fIimpl_data\fR);
.fi

.LP
.nf
\fBvoid\fR \fBddi_fm_handler_unregister\fR(\fBdev_info_t\fR *\fIdip\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI)
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I dip
.ad
.RS 17n
.rt
Pointer to the
.B dev_info
structure
.RE

.sp
.ne 2
.mk
.na
.I error_handler
.ad
.RS 17n
.rt
Pointer to an error handler callback function
.RE

.sp
.ne 2
.mk
.na
.I impl_data
.ad
.RS 17n
.rt
Pointer to private data for use by the caller
.RE

.SH DESCRIPTION
.sp
.LP
The
.B ddi_fm_handler_register()
function registers an error handler
callback routine with the
.B I/O
Fault Management framework. The error
handler callback,
.IR error_handler ,
is called to process error conditions
detected by the system. In addition to its device instance,
.IR dip ,
the
error handler is called with a pointer to a fault management error status
structure,
.BR ddi_fm_error_t .
For example:
.sp
.in +2
.nf
int (*ddi_err_func_t)(dev_info_t *dip, ddi_fm_error_t *error_status);
.fi
.in -2

.sp
.LP
A driver error handling callback is passed the following arguments:
.RS +4
.TP
.ie t \(bu
.el o
a pointer to the device instance registered for this callback.
.RE
.RS +4
.TP
.ie t \(bu
.el o
a data structure containing common fault management data and status for
error handling.
.RE
.sp
.LP
The primary responsibilities of the error handler include:
.RS +4
.TP
.ie t \(bu
.el o
to check for outstanding hardware or software errors.
.RE
.RS +4
.TP
.ie t \(bu
.el o
where possible, to isolate the device that might have caused the errors.
.RE
.RS +4
.TP
.ie t \(bu
.el o
to report errors that were detected.
.RE
.sp
.LP
During the invocation of an error handler, a device driver  might need to
quiesce or suspend all
.B I/O
activities in order to check for error
conditions or status in:
.RS +4
.TP
.ie t \(bu
.el o
hardware control and status registers.
.RE
.RS +4
.TP
.ie t \(bu
.el o
outstanding
.B I/O
transactions.
.RE
.RS +4
.TP
.ie t \(bu
.el o
access or
.B DMA
handles.
.RE
.sp
.LP
For each error detected, the driver must formulate and post an error report
via
.B ddi_fm_ereport_post()
for problem analysis by the Solaris Fault
Manager
.BR fmd (1M).
.sp
.LP
For a
.BR PCI ,
.BR PCI/X ,
or
.B "PCI Express"
leaf device, the
.B pci_ereport_post()
function is provided to carry out reporting
responsibilities on behalf of the driver. In many cases, an error handler
callback function of the following form can be used:
.sp
.in +2
.nf
xxx_err_cb(dev_info_t *dip, ddi_fm_error_t *errp) {
      pci_ereport_post(dip, errp, NULL);
      return (errp->fme_status);
}
.fi
.in -2

.sp
.LP
In addition, the driver might be able to carry out further device specific
checks within the error handler.
.sp
.LP
Error handlers can be called from kernel, interrupt, or high-level
interrupt context. The interrupt block cookie returned from
.B ddi_fm_init()
should be used to allocate and initialize any
synchronization variables and locks that might be used within the error
handler callback function. Such locks may not be held by the driver when a
device register is accessed with functions such as
.BR ddi_get8 "(9F) and"
.BR ddi_put8 (9F).
.sp
.LP
The data structure,
.BR ddi_fm_error_t ,
contains an
.B FMA
protocol
(format 1)
.B ENA
for the current error propagation chain, the status of
the error handler callback, an error expectation flag, and any potential
access or
.B DMA
handles associated with an error detected by the parent
nexus.
.sp
.LP
The
.B ddi_fm_handler_unregister()
function removes a previously
registered error handling callback for the device instance specified by the
.IR dip .
.SH CONTEXT
.sp
.LP
.RB "The " ddi_fm_handler_register() " and " ddi_fm_handler_unregister() 
functions must be called from kernel context in an
.BR attach "(9E) or"
.BR detach (9E)
entry point. The registered error handler,
.IR error_handler ,
callback can be called from kernel, interrupt, or high
level interrupt context.
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
.BR fmd (1M),
.BR attributes (5),
.BR attach (9E),
.BR detach (9E),
.BR ddi_fm_ereport_post (9F),
.BR ddi_fm_init (9F),
.BR ddi_get8 (9F),
.BR ddi_put8 (9F),
.BR pci_ereport_post (9F),
.BR ddi_fm_error (9S)
.sp
.LP
.I Writing Device Drivers
