usr/src/man/man9f/ddi_intr_get_pri.9f
'\" te
.\" Copyright (c) 2007, Sun Microsystems, Inc. All Rights Reserved.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ddi_intr_get_pri 9F "04 Jun 2007" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
ddi_intr_get_pri, ddi_intr_set_pri \- get or set priority of a given
interrupt
.SH SYNOPSIS
.LP
.nf
#include <sys/types.h>
#include <sys/conf.h>
#include <sys/ddi.h>
#include <sys/sunddi.h>

\fBint\fR \fBddi_intr_get_pri\fR(\fBddi_intr_handle_t\fR \fIh\fR, \fBuint_t\fR *\fIprip\fR);
.fi

.LP
.nf
\fBint\fR \fBddi_intr_set_pri\fR(\fBddi_intr_handle_t\fR \fIh\fR, \fBuint_t\fR \fIpri\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI).
.SH PARAMETERS
.sp
.LP
.B ddi_intr_get_pri()
.sp
.ne 2
.mk
.na
.I h
.ad
.RS 8n
.rt
DDI interrupt handle
.RE

.sp
.ne 2
.mk
.na
.I prip
.ad
.RS 8n
.rt
Pointer to the priority returned for this handle
.RE

.sp
.LP
.B ddi_intr_set_pri()
.sp
.ne 2
.mk
.na
.I h
.ad
.RS 7n
.rt
DDI interrupt handle
.RE

.sp
.ne 2
.mk
.na
.I pri
.ad
.RS 7n
.rt
Contains the priority to be set
.RE

.SH DESCRIPTION
.sp
.LP
The
.B ddi_intr_get_pri()
function returns the current priority of the
interrupt handle
.I h
of a given device. Upon a successful return,
.I prip
points to a small integer value, typically in the
\fBDDI_INTR_PRI_MIN\fR.\|.\|.\fBDDI_INTR_PRI_MAX\fR range, that represents the
current software priority setting for the interrupt. See
<\fBsys/ddi_intr.h\fR> for values of \fBDDI_INTR_PRI_MIN\fR or
.BR DDI_INTR_PRI_MAX .
.sp
.LP
The
.B ddi_intr_get_pri()
function can be called any time, even if the
driver adds an interrupt handler for the interrupt specification.
.sp
.LP
The software priority returned from
.B ddi_intr_get_pri()
can be used in
calls to
.B mutex_init()
and
.BR rw_init() .
.sp
.LP
The
.B ddi_intr_set_pri()
function sets the priority
.I pri
of the
interrupt handle
.I h
of a given device. The function validates that the
argument is within the supported range.
.sp
.LP
The
.B ddi_intr_set_pri()
function can only be called prior to adding
the interrupt handler or when an interrupt handler is unassigned.
.B DDI_FAILURE
is returned in all other cases.
.SH RETURN VALUES
.sp
.LP
The
.B ddi_intr_get_pri()
and
.B ddi_intr_set_pri()
functions
return:
.sp
.ne 2
.mk
.na
.B DDI_SUCCESS
.ad
.RS 15n
.rt
On success.
.RE

.sp
.ne 2
.mk
.na
.B DDI_EINVAL
.ad
.RS 15n
.rt
On encountering invalid input parameters.
.RE

.sp
.ne 2
.mk
.na
.B DDI_FAILURE
.ad
.RS 15n
.rt
On any implementation specific failure.
.RE

.sp
.ne 2
.mk
.na
.B DDI_ENOTSUP
.ad
.RS 15n
.rt
On device not supporting operation.
.RE

.SH CONTEXT
.sp
.LP
The
.B ddi_intr_get_pri()
and
.B ddi_intr_set_pri()
functions can be
called from kernel non-interrupt context.
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
.BR attributes (5),
.BR ddi_intr_alloc (9F),
.BR ddi_intr_enable (9F),
.BR mutex_init (9F),
.BR rw_init (9F)
.sp
.LP
.I Writing Device Drivers
.SH NOTES
.sp
.LP
The priority returned from
.B ddi_intr_get_pri()
should be typecast by
calling the
.B DDI_INTR_PRI
macro before passing it onto
.BR mutex_init (9F).
.sp
.LP
Consumers of these interfaces should verify that the return value is not
equal to
.BR DDI_SUCCESS .
Incomplete checking for failure codes could
result in inconsistent behavior among platforms.
