usr/src/man/man9f/ddi_removing_power.9f
'\" te
.\" Copyright (c) 2002, Sun Microsystems, Inc. All Rights Reserved.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ddi_removing_power 9F "14 March 2001" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
ddi_removing_power \- check whether
.B DDI_SUSPEND
might result in power
being removed from a device
.SH SYNOPSIS
.LP
.nf
#include <sys/ddi.h>
#include <sys/sunddi.h>



\fBint\fR \fBddi_removing_power\fR(\fBdev_info_t\fR \fI*dip\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI)
.SH DESCRIPTION
.sp
.LP
The
.B ddi_removing_power()
function indicates whether a currently
pending call into a driver's \fBdetach\fR(9E) entry point with a command of
\fBDDI_SUSPEND\fR is likely to result in power being removed from the
device.
.sp
.LP
\fBddi_removing_power()\fR can return true and power still not be removed
from the device due to a failure to suspend and power off the system.
.SH PARAMETERS
.sp
.LP
The
.B ddi_removing_power()
function supports the following parameter:
.sp
.ne 2
.mk
.na
.I dip
.ad
.RS 7n
.rt
pointer to the device's \fBdev_info\fR structure
.RE

.SH RETURN VALUES
.sp
.LP
The
.B ddi_removing_power()
function returns:
.sp
.ne 2
.mk
.na
.B 1
.ad
.RS 5n
.rt
Power might be removed by the framework as a result of the pending
\fBDDI_SUSPEND\fR call.
.RE

.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 5n
.rt
Power will not be removed by the framework as a result of the pending
\fBDDI_SUSPEND\fR call.
.RE

.SH EXAMPLES
.LP
\fBExample 1\fR Protecting a Tape from Abrupt Power Removal
.sp
.LP
A tape driver that has hardware that would damage the tape if power is
removed might include this code in its
.BR detach "(9E) code:"

.sp
.in +2
.nf
int
     xxdetach(dev_info_t *dip, ddi_detach_cmd_t cmd)
     {

     ...
          case DDI_SUSPEND:
          /*
           * We do not allow DDI_SUSPEND if power will be removed and
           * we have a device that damages tape when power is removed
           * We do support DDI_SUSPEND for Device Reconfiguration,
           * however.
           */
             if (ddi_removing_power(dip) && xxdamages_tape(dip))
                return (DDI_FAILURE);
          ...
.fi
.in -2

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
.BR attributes (5),
.BR cpr (7),
.BR attach (9E),
.BR detach (9E)
.sp
.LP
.I Writing Device Drivers
