usr/src/man/man9f/ddi_dma_movwin.9f
'\" te
.\" Copyright (c) 2006, Sun Microsystems, Inc.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ddi_dma_movwin 9F "16 Jan 2006" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
ddi_dma_movwin \- shift current DMA window
.SH SYNOPSIS
.LP
.nf
#include <sys/ddi.h>
#include <sys/sunddi.h>



\fBint\fR \fBddi_dma_movwin\fR(\fBddi_dma_handle_t\fR \fIhandle\fR, \fBoff_t *\fIoffp\fR,
     \fBuint_t *\fIlenp\fR, \fBddi_dma_cookie_t *\fIcookiep\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
This interface is obsolete.
.BR ddi_dma_getwin (9F)
should be used
instead.
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I handle
.ad
.RS 11n
.rt
The
.B DMA
handle filled in by a call to
.BR ddi_dma_setup (9F).
.RE

.sp
.ne 2
.mk
.na
.I offp
.ad
.RS 11n
.rt
A pointer to an offset to set the
.B DMA
window to. Upon a successful
return, it will be filled in with the new offset from the beginning of the
object resources are allocated for.
.RE

.sp
.ne 2
.mk
.na
.I lenp
.ad
.RS 11n
.rt
A pointer to a value which must either be the current size of the
.BR DMA
window (as known from a call to
.BR ddi_dma_curwin (9F)
or from a previous
call to
.BR ddi_dma_movwin() ).
Upon a successful return, it will be filled
in with the size, in bytes, of the current window.
.RE

.sp
.ne 2
.mk
.na
.I cookiep
.ad
.RS 11n
.rt
A pointer to a
.B DMA
cookie (see
.BR ddi_dma_cookie (9S)).
Upon a
successful return, cookiep is filled in just as if an implicit
.BR ddi_dma_htoc (9F)
had been made.
.RE

.SH DESCRIPTION
.sp
.LP
The
.B ddi_dma_movwin()
function shifts the current
.B DMA
window. If
a
.B DMA
request allows the system to allocate resources for less than
the entire object by setting the
.B DDI_DMA_PARTIAL
flag in the
.BR ddi_dma_req (9S)
structure, the current
.B DMA
window can be shifted
by a call to
.BR ddi_dma_movwin() .
.sp
.LP
The caller must first determine the current
.B DMA
window size by a call
to
.BR ddi_dma_curwin (9F).
Using the current offset and size of the window
thus retrieved, the caller of
.B ddi_dma_movwin()
may change the window
onto the object by changing the offset by a value which is some multiple of
the size of the
.B DMA
window.
.sp
.LP
The
.B ddi_dma_movwin()
function takes care of underlying resource
synchronizations required to
.B shift
the window. However, if you want to
.B access
the data prior to or after moving the window, further
synchronizations using
.BR ddi_dma_sync "(9F) are required."
.sp
.LP
This function is normally called from an interrupt routine. The first
invocation of the
.B DMA
engine is done from the driver. All subsequent
invocations of the
.B DMA
engine are done from the interrupt routine. The
interrupt routine checks to see if the request has been completed. If it
has, it returns without invoking another
.B DMA
transfer. Otherwise it
calls
.B ddi_dma_movwin()
to shift the current window and starts another
.B DMA
transfer.
.SH RETURN VALUES
.sp
.LP
The
.B ddi_dma_movwin()
function returns:
.sp
.ne 2
.mk
.na
.B DDI_SUCCESS
.ad
.RS 15n
.rt
The current length and offset are legal and have been set.
.RE

.sp
.ne 2
.mk
.na
.B DDI_FAILURE
.ad
.RS 15n
.rt
Otherwise.
.RE

.SH CONTEXT
.sp
.LP
The
.B ddi_dma_movwin()
function can be called from user, interrupt, or
kernel context.
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for a description of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
\fBATTRIBUTE TYPE\fR\fBATTRIBUTE VALUE\fR
_
Stability LevelObsolete
.TE

.SH SEE ALSO
.sp
.LP
.BR attributes (5),
.BR ddi_dma_curwin (9F),
.BR ddi_dma_getwin (9F),
.BR ddi_dma_htoc (9F),
.BR ddi_dma_setup (9F),
.BR ddi_dma_sync (9F),
.BR ddi_dma_cookie (9S),
.BR ddi_dma_req (9S)
.sp
.LP
.I Writing Device Drivers
.SH WARNINGS
.sp
.LP
The caller must guarantee that the resources used by the object are
inactive prior to calling this function.
