usr/src/man/man9f/ddi_io_put8.9f
'\" te
.\" Copyright (c) 2005, Sun Microsystems, Inc.  All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ddi_io_put8 9F "1 Nov 2005" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
ddi_io_put8, ddi_io_put16, ddi_io_put32, ddi_io_putb, ddi_io_putl,
ddi_io_putw \- write data to the mapped device register in I/O space
.SH SYNOPSIS
.LP
.nf
#include <sys/ddi.h>
#include <sys/sunddi.h>



\fBvoid\fR \fBddi_io_put8\fR(\fBddi_acc_handle_t\fR \fIhandle\fR, \fBuint8_t *\fIdev_addr\fR,
     uint8_t \fIvalue\fR);
.fi

.LP
.nf
\fBvoid\fR \fBddi_io_put16\fR(\fBddi_acc_handle_t\fR \fIhandle\fR, \fBuint16_t *\fIdev_addr\fR,
     uint16_t \fIvalue\fR);
.fi

.LP
.nf
\fBvoid\fR \fBddi_io_put32\fR(\fBddi_acc_handle_t\fR \fIhandle\fR, \fBuint32_t *\fIdev_addr\fR,
     uint32_t \fIvalue\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI). The
.BR ddi_io_put8() ,
.BR ddi_io_put16() ,
.BR ddi_io_put32() ,
.BR ddi_io_putb() ,
.BR ddi_io_putl() ,
and
.B ddi_io_putw()
functions are obsolete. The
.BR ddi_put8 (9F)
function replaces
.BR ddi_io_put8() .
The
.BR ddi_put16 (9F)
function replaces
.BR ddi_io_put16() .
The
.BR ddi_put32 (9F)
function replaces
.BR ddi_io_put32() .
The
.BR ddi_put8 (9F)
function replaces
.BR ddi_io_putb() .
The
.BR ddi_put32 (9F)
function replaces
.BR ddi_io_putl() .
The
.BR ddi_put16 (9F)
function replaces
.BR ddi_io_putw() .
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I handle
.ad
.RS 12n
.rt
Data access handle returned from setup calls, such as
.BR ddi_regs_map_setup (9F).
.RE

.sp
.ne 2
.mk
.na
.I dev_addr
.ad
.RS 12n
.rt
Base device address.
.RE

.sp
.ne 2
.mk
.na
.I value
.ad
.RS 12n
.rt
Data to be written to the device.
.RE

.SH DESCRIPTION
.sp
.LP
These routines generate a write of various sizes to the device address,
.IR dev_addr ,
in I/O space. The
.BR ddi_io_put8() ,
.BR ddi_io_put16() ,
and
.B ddi_io_put32()
functions write 8 bits, 16 bits, and 32 bits of
data, respectively, to the device address,
.IR dev_addr .
.sp
.LP
Each individual datum will automatically be translated to maintain a
consistent view between the host and the device based on the encoded
information in the data access handle.  The translation may involve
byte-swapping if the host and the device have incompatible endian
characteristics.
.SH CONTEXT
.sp
.LP
These functions can be called from user, kernel, or interrupt context.
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityObsolete
.TE

.SH SEE ALSO
.sp
.LP
.BR isa (4),
.BR ddi_io_get8 (9F),
.BR ddi_io_rep_get8 (9F),
.BR ddi_io_rep_put8 (9F),
.BR ddi_put8 (9F),
.BR ddi_put16 (9F),
.BR ddi_put32 (9F),
.BR ddi_regs_map_setup (9F),
.BR ddi_device_acc_attr (9S)
