usr/src/man/man9f/ddi_dma_devalign.9f
'\" te
.\" Copyright (c) 2006, Sun Microsystems, Inc.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ddi_dma_devalign 9F "04 Apr 2006" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
ddi_dma_devalign \- find DMA mapping alignment and minimum transfer size
.SH SYNOPSIS
.LP
.nf
#include <sys/conf.h>
#include <sys/ddi.h>
#include <sys/sunddi.h>



\fBint\fR \fBddi_dma_devalign\fR(\fBddi_dma_handle_t\fR \fIhandle\fR, \fBuint_t *\fIalignment\fR,
     \fBuint_t *\fIminxfr\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI). This interface is obsolete.
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I handle
.ad
.RS 13n
.rt
The DMA\fBhandle\fR filled in by a successful call to
.BR ddi_dma_setup (9F).
.RE

.sp
.ne 2
.mk
.na
.I alignment
.ad
.RS 13n
.rt
A pointer to an unsigned integer to be filled in with the minimum required
alignment for
.BR DMA .
The alignment is guaranteed to be a power of two.
.RE

.sp
.ne 2
.mk
.na
.I minxfr
.ad
.RS 13n
.rt
A pointer to an unsigned integer to be filled in with the minimum effective
transfer size (see
.BR ddi_iomin (9F),
.BR ddi_dma_lim_sparc (9S)
and
.BR ddi_dma_lim_x86 (9S)).
This also is guaranteed to be a power of two.
.RE

.SH DESCRIPTION
.sp
.LP
The
.B ddi_dma_devalign()
Function determines after a successful
.B DMA
mapping (see
.BR ddi_dma_setup (9F))
the minimum required data
alignment and minimum
.B DMA
transfer size.
.SH RETURN VALUES
.sp
.LP
The
.B ddi_dma_devalign()
function returns:
.sp
.ne 2
.mk
.na
.B DDI_SUCCESS
.ad
.RS 15n
.rt
The
.I alignment
and
.I minxfr
values have been filled.
.RE

.sp
.ne 2
.mk
.na
.B DDI_FAILURE
.ad
.RS 15n
.rt
The handle was illegal.
.RE

.SH CONTEXT
.sp
.LP
The
.B ddi_dma_devalign()
function can be called from user, interrupt,
or kernel context.
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityObsolete
.TE

.SH SEE ALSO
.sp
.LP
.BR ddi_dma_setup (9F),
.BR ddi_iomin (9F),
.BR ddi_dma_lim_sparc (9S),
.BR ddi_dma_lim_x86 (9S),
.BR ddi_dma_req (9S)
.sp
.LP
.I Writing Device Drivers
