usr/src/man/man9f/ddi_ffs.9f
'\" te
.\" Copyright (c) 2006 Sun Microsystems, Inc.  All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ddi_ffs 9F "16 Jan 2006" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
ddi_ffs, ddi_fls \- find first (last) bit set in a long integer
.SH SYNOPSIS
.LP
.nf
#include <sys/conf.h>
#include <sys/ddi.h>
#include <sys/sunddi.h>



\fBint\fBddi_ffs\fR(\fBlong\fR \fImask\fR);
.fi

.LP
.nf
\fBint\fR \fBddi_fls\fR(\fBlong\fR \fImask\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI).
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I mask
.ad
.RS 8n
.rt
A 32-bit argument value to search through.
.RE

.SH DESCRIPTION
.sp
.LP
The function
.B ddi_ffs()
takes its argument and returns the shift count
that the first (least significant) bit set in the argument corresponds to. The
function
.B ddi_fls()
does the same, only it returns the shift count for
the last (most significant) bit set in the argument.
.SH RETURN VALUES
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 5n
.rt
No bits are set in mask.
.RE

.sp
.ne 2
.mk
.na
.I N
.ad
.RS 5n
.rt
Bit
.I N
is the least significant
.RB ( ddi_ffs )
or most significant
.RB ( ddi_fls ") bit set in mask. Bits are numbered from  " 1 " to"
.BR 32 ,
with bit
.B 1
being the least significant bit position and bit
.B 32
the
most significant position.
.RE

.SH CONTEXT
.sp
.LP
This function can be called from user, interrupt, or kernel context.
.SH SEE ALSO
.sp
.LP
.I Writing Device Drivers
