usr/src/man/man9f/ddi_fm_ereport_post.9f
'\" te
.\" Copyright (c) 2007, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ddi_fm_ereport_post 9F "14 May 2007" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
ddi_fm_ereport_post \- post an FMA Protocol Error Report Event
.SH SYNOPSIS
.LP
.nf
#include <sys/ddifm.h>

\fBvoid\fR \fBddi_fm_ereport_post\fR(\fBdev_info_t\fR *\fIdip\fR, \fBchar\fR *\fIereport_class\fR,
     \fBuint64_t\fR \fIena\fR, \fBint\fR *\fIsflag\fR, .\|.\|. /* name-value pair args */);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI)
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I dip
.ad
.RS 17n
.rt
Pointer to the
.B dev_info
structure
.RE

.sp
.ne 2
.mk
.na
.I ereport_class
.ad
.RS 17n
.rt
.B FMA
Event Protocol error class
.RE

.sp
.ne 2
.mk
.na
.I ena
.ad
.RS 17n
.rt
Error Numeric Association
.RE

.sp
.ne 2
.mk
.na
.I sflag
.ad
.RS 17n
.rt
Determines whether caller can sleep for memory or other event resources.
.RE

.SH DESCRIPTION
.sp
.LP
The
.B ddi_fm_ereport_post()
function causes an encoded fault management
error report name-value pair list to be queued for delivery to the Fault
Manager daemon, \fBfmd\fR(1M). The \fIsflag\fR parameter indicates whether
or not the caller is willing to wait for system memory and event channel
resources to become available.
.sp
.LP
The following
.I ereport_class
strings are available for use by any leaf
device driver:
.sp
.ne 2
.mk
.na
.B device.inval_state
.ad
.RS 24n
.rt
A leaf driver discovers that the device is in an invalid or inconsistent
state. For example, the driver might detect that receive or send ring
descriptor indices are corrupted. It might also find an invalid value in a
register or a driver-to-device protocol violation.
.RE

.sp
.ne 2
.mk
.na
.B device.no_response
.ad
.RS 24n
.rt
A leaf driver times out waiting for a response from the device. For
example, timeouts can occur when no confirmation is seen after resetting,
enabling, or disabling part of the device.
.RE

.sp
.ne 2
.mk
.na
.B device.badint_limit
.ad
.RS 24n
.rt
A leaf device sends too many consecutive interrupts with no work to do.
.RE

.sp
.ne 2
.mk
.na
.B device.intern_corr
.ad
.RS 24n
.rt
A leaf device reports to the driver that it has itself detected an internal
correctable error.
.RE

.sp
.ne 2
.mk
.na
.B device.intern_uncorr
.ad
.RS 24n
.rt
A leaf device reports to the driver that it has itself detected an internal
uncorrectable error.
.RE

.sp
.ne 2
.mk
.na
.B device.stall
.ad
.RS 24n
.rt
A leaf driver determines that data transmission has stalled indefinitely.
.RE

.sp
.LP
The
.I ena
indicates the Format 1 Error Numeric Association for this
error report. It might have already been initialized by another
error-detecting software module. For example, if \fBddi_fm_ereport_post()\fR
is called from an error handler callback function, the
.I fme_ena
field
from the passed-in
.B ddi_fm_error
argument should be used. Otherwise it
should be set to
.B 0
and will be initialized by
.BR ddi_fm_ereport_post() .
.sp
.LP
The name-value pair
.I args
variable argument list contains one or more
(names, type, value pointer) nvpair tuples for non-array \fBdata_type_t\fR
types or one or more (name, type, number of elements, value pointer) tuples
for
.B data_type_t
array types. There is one mandatory tuple to describe
the
.B ereport
version. This should contain the following values:
.RS +4
.TP
.ie t \(bu
.el o
.RB "name -" " FM_VERSION"
.RE
.RS +4
.TP
.ie t \(bu
.el o
.RB "type -" " DATA_TYPE_UINT8"
.RE
.RS +4
.TP
.ie t \(bu
.el o
.RB "value -" " FM_EREPORT_VERS0"
.RE
.sp
.LP
Additional nvpair tuples can describe error conditions for logging
purposes, but are not interpreted by the
.B I/O
framework or fault
manager. The end of the argument list is specified by
.IR NULL .
.SH CONTEXT
.sp
.LP
The
.B ddi_fm_ereport_post()
function can be called from user, kernel,
or high-level interrupt context.
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
.BR fmd (1M),
.BR attributes (5),
.BR ddi_fm_service_impact (9F)
