usr/src/man/man9f/ddi_binding_name.9f
'\" te
.\" Copyright (c) 1996, Sun Microsystems, Inc.  All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ddi_binding_name 9F "3 May  1996" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
ddi_binding_name, ddi_get_name \- return driver binding name
.SH SYNOPSIS
.LP
.nf
#include <sys/ddi.h>
#include <sys/sunddi.h>



\fBchar *\fBddi_binding_name\fR(\fBdev_info_t *\fIdip\fR);
.fi

.LP
.nf
\fBchar *\fBddi_get_name\fR(\fBdev_info_t *\fIdip\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI).
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I dip
.ad
.RS 8n
.rt
A pointer to the device's
.B dev_info
structure.
.RE

.SH DESCRIPTION
.sp
.LP
.B ddi_binding_name()
and
.B ddi_get_name()
return the driver binding
name. This is the name used to select a driver for the device. This name is
typically derived from the device
.B name
property or the device
.B compatible
property. The name returned may be a driver alias or the
driver name.
.SH RETURN VALUES
.sp
.LP
.B ddi_binding_name()
and
.B ddi_get_name()
return the name used to
bind a driver to a device.
.SH CONTEXT
.sp
.LP
.B ddi_binding_name()
and
.B ddi_get_name()
can be called from user,
kernel, or interrupt context.
.SH SEE ALSO
.sp
.LP
.BR ddi_node_name (9F)
.sp
.LP
.I Writing Device Drivers
.SH WARNINGS
.sp
.LP
The name returned by
.B ddi_binding_name()
and
.B ddi_get_name()
is
read-only.
