usr/src/man/man9f/ddi_remove_event_handler.9f
'\" te
.\" Copyright (c) 2003, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ddi_remove_event_handler 9F "2 May 2003" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
ddi_remove_event_handler \- remove an NDI event service callback handler
.SH SYNOPSIS
.LP
.nf
#include <sys/dditypes.h>
#include <sys/sunddi.h>

\fBint\fR \fBddi_remove_event_handler\fR(\fBddi_registration_id_t\fR \fIid\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI).
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.BI "ddi_registration_id_t " id
.ad
.RS 28n
.rt
Unique system wide registration ID return by
.BR ddi_add_event_handler (9F)
upon successful registration.
.RE

.SH DESCRIPTION
.sp
.LP
The
.B ddi_remove_event_handler()
function removes the callback handler
specified by the registration
.IR id
.RB ( ddi_registration_id_t ).
Upon
successful removal, the callback handler is removed from the system and will
not be invoked in the face of the event.
.SH RETURN VALUES
.sp
.ne 2
.mk
.na
.B DDI_SUCCESS
.ad
.RS 15n
.rt
Callback handler removed successfully.
.RE

.sp
.ne 2
.mk
.na
.B DDI_FAILURE
.ad
.RS 15n
.rt
Failed to remove callback handler.
.RE

.SH CONTEXT
.sp
.LP
The
.B ddi_remove_event_handler()
function can be called from user and
kernel contexts only.
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for a description of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
\fBATTRIBUTE TYPE\fR\fBATTRIBUTE VALUE\fR
_
Stability LevelCommitted
.TE

.SH SEE ALSO
.sp
.LP
.BR attributes (5),
.BR ddi_add_event_handler (9F),
.BR ddi_get_eventcookie (9F)
.sp
.LP
.I Writing Device Drivers
.SH NOTES
.sp
.LP
Device drivers must remove all registered callback handlers before
.BR detach (9E)
processing for that device instance is complete.
