usr/src/man/man9f/ddi_dma_curwin.9f
'\" te
.\" Copyright (c) 2006, Sun Microsystems, Inc.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ddi_dma_curwin 9F "16 Jan 2006" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
ddi_dma_curwin \- report current DMA window offset and size
.SH SYNOPSIS
.LP
.nf
#include <sys/conf.h>
#include <sys/ddi.h>
#include <sys/sunddi.h>



\fBint\fR \fBddi_dma_curwin\fR(\fBddi_dma_handle_t\fR \fIhandle\fR, \fBoff_t *\fIoffp\fR, \fBuint_t *\fIlenp\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
This interface is obsolete.
.BR ddi_dma_getwin (9F)
should be used
instead.
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I handle
.ad
.RS 10n
.rt
The
.B DMA
handle filled in by a call to
.BR ddi_dma_setup (9F).
.RE

.sp
.ne 2
.mk
.na
.I offp
.ad
.RS 10n
.rt
A pointer to a value which will be filled in with the current offset from
the beginning of the object that is mapped for
.BR DMA .
.RE

.sp
.ne 2
.mk
.na
.I lenp
.ad
.RS 10n
.rt
A pointer to a value which will be filled in with the size, in bytes, of
the current window onto the object that is mapped for
.BR DMA .
.RE

.SH DESCRIPTION
.sp
.LP
The
.B ddi_dma_curwin()
function reports the current
.B DMA
window
offset and size. If a
.B DMA
mapping allows partial mapping, that is if
the
.B DDI_DMA_PARTIAL
flag in the
.BR ddi_dma_req "(9S) structure is"
set, its current (effective)
.B DMA
window offset and size can be
obtained by a call to
.BR ddi_dma_curwin() .
.SH RETURN VALUES
.sp
.LP
The
.B ddi_dma_curwin()
function returns:
.sp
.ne 2
.mk
.na
.B DDI_SUCCESS
.ad
.RS 15n
.rt
The current length and offset can be established.
.RE

.sp
.ne 2
.mk
.na
.B DDI_FAILURE
.ad
.RS 15n
.rt
Otherwise.
.RE

.SH CONTEXT
.sp
.LP
The
.B ddi_dma_curwin()
function can be called from user, interrupt, or
kernel context.
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for a description of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
\fBATTRIBUTE TYPE\fR\fBATTRIBUTE VALUE\fR
_
Stability LevelObsolete
.TE

.SH SEE ALSO
.sp
.LP
.BR attributes (5),
.BR ddi_dma_getwin (9F),
.BR ddi_dma_movwin (9F),
.BR ddi_dma_setup (9F),
.BR ddi_dma_req (9S)
.sp
.LP
.I Writing Device Drivers
