usr/src/man/man9f/ddi_enter_critical.9f
'\" te
.\" Copyright (c) 2006, Sun Microsystems, Inc.  All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ddi_enter_critical 9F "16 Jan 2006" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
ddi_enter_critical, ddi_exit_critical \- enter and exit a critical region
of control
.SH SYNOPSIS
.LP
.nf
#include <sys/conf.h>
#include <sys/ddi.h>
#include <sys/sunddi.h>



\fBunsigned int\fR \fBddi_enter_critical\fR(\fBvoid\fR);
.fi

.LP
.nf
\fBvoid\fR \fBddi_exit_critical\fR(\fBunsignedint\fR \fIddic\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI).
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I ddic
.ad
.RS 8n
.rt
The returned value from the call to
.B ddi_enter_critical()
must be
passed to
.BR ddi_exit_critical() .
.RE

.SH DESCRIPTION
.sp
.LP
Nearly all driver operations can be done without any special
synchronization and protection mechanisms beyond those provided by, for
example, mutexes (see
.BR mutex (9F)).
However, for certain devices there
can exist a very short critical region of code which
.B must
be allowed
to run uninterrupted. The function
.B ddi_enter_critical()
provides a
mechanism by which a driver can ask the system to guarantee to the best of
its ability that the current thread of execution will neither be preempted
nor interrupted. This stays in effect until a bracketing call to
.B ddi_exit_critical()
is made (with an argument which was the returned
value from
.BR ddi_enter_critical() ).
.sp
.LP
The driver may not call any functions external to itself in between the
time it calls
.B ddi_enter_critical()
and the time it calls
.BR ddi_exit_critical() .
.SH RETURN VALUES
.sp
.LP
The
.B ddi_enter_critical()
function returns an opaque unsigned integer
which must be used in the subsequent call to
.BR ddi_exit_critical() .
.SH CONTEXT
.sp
.LP
This function can be called from user, interrupt, or kernel context.
.SH WARNINGS
.sp
.LP
Driver writers should note that in a multiple processor system this
function does not temporarily suspend other processors from executing. This
function also cannot guarantee to actually block the hardware from doing
such things as interrupt acknowledge cycles. What it
.B can
do is
guarantee that the currently executing thread will not be preempted.
.sp
.LP
Do not write code bracketed by
.B ddi_enter_critical()
and
.B ddi_exit_critical()
that can get caught in an infinite loop, as the
machine may crash if you do.
.SH SEE ALSO
.sp
.LP
.BR mutex (9F)
.sp
.LP
.I Writing Device Drivers
