usr/src/man/man9f/ddi_no_info.9f
'\" te
.\" Copyright (c) 2002, Sun Microsystems, Inc. All Rights Reserved.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ddi_no_info 9F "9 Jul 2002" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
ddi_no_info \- stub for getinfo(9E)
.SH SYNOPSIS
.LP
.nf
#include <sys/ddi.h>
#include <sys/sunddi.h>



\fBint\fR \fBddi_no_info\fR(\fBdev_info_t *\fIdip\fR, \fBddi_info_cmd_t\fR \fIinfocmd\fR, \fBvoid *\fIarg\fR,
    \fBvoid **\fIresult\fR
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI)
.SH PARAMETERS
.sp
.ne 2
.mk
.na
\fBdev_info_t *\fIdip\fR
.ad
.RS 26n
.rt
Pointer to \fBdev_info\fR structure.
.RE

.sp
.ne 2
.mk
.na
\fBddi_info_cmd_t \fIinfocmd\fR
.ad
.RS 26n
.rt
Command argument. Valid command values are:
.B DDI_INFO_DEVT2DEVINFO
and
.BR DDI_INFO_DEVT2INSTANCE .
.RE

.sp
.ne 2
.mk
.na
.BI "void *" arg
.ad
.RS 26n
.rt
Command-specific argument.
.RE

.sp
.ne 2
.mk
.na
.BI "void **" result
.ad
.RS 26n
.rt
Pointer to where the requested information is stored.
.RE

.SH DESCRIPTION
.sp
.LP
The \fBddi_no_info()\fR function always returns
.BR DDI_FAILURE .
It is
provided as a convenience routine for drivers not providing a
.BR cb_ops (9S)
or for network drivers only providing DLPI-2 services. Such
drivers can use \fBddi_no_info()\fR in the \fBdevo_getinfo\fR entry point
(see \fBgetinfo\fR(9E)) of the \fBdev_ops\fR(9S) structure.
.SH RETURN VALUES
.sp
.LP
The \fBddi_no_info()\fR function always returns
.BR DDI_FAILURE .
.SH SEE ALSO
.sp
.LP
.BR getinfo (9E),
.BR qassociate (9F),
.BR cb_ops (9S),
.BR dev_ops (9S)
