usr/src/man/man9f/ddi_dma_free.9f
'\" te
.\" Copyright (c) 2006, Sun Microsystems, Inc.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ddi_dma_free 9F "16 Jan 2006" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
ddi_dma_free \- release system DMA resources
.SH SYNOPSIS
.LP
.nf
#include <sys/ddi.h>
#include <sys/sunddi.h>



\fBint\fR \fBddi_dma_free\fR(\fBddi_dma_handle_t\fR \fIhandle\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
This interface is obsolete.
.BR ddi_dma_free_handle (9F)
should be used
instead.
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I handle
.ad
.RS 10n
.rt
The handle filled in by a call to
.BR ddi_dma_setup (9F).
.RE

.SH DESCRIPTION
.sp
.LP
The
.B ddi_dma_free()
function releases system
.B DMA
resources set
up by
.BR ddi_dma_setup (9F).
When a \fBDMA\fR transfer completes, the
driver should free up system
.B DMA
resources established by a call to
.BR ddi_dma_setup (9F).
This is done by a call to
.BR ddi_dma_free() .
.B ddi_dma_free()
does an implicit
.BR ddi_dma_sync (9F)
for you so any
further synchronization steps are not necessary.
.SH RETURN VALUES
.sp
.LP
The
.B ddi_dma_free()
function returns:
.sp
.ne 2
.mk
.na
.B DDI_SUCCESS
.ad
.RS 15n
.rt
Successfully released resources
.RE

.sp
.ne 2
.mk
.na
.B DDI_FAILURE
.ad
.RS 15n
.rt
Failed to free resources
.RE

.SH CONTEXT
.sp
.LP
The
.B ddi_dma_free()
function can be called from user, interrupt, or
kernel context.
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for a description of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
\fBATTRIBUTE TYPE\fR\fBATTRIBUTE VALUE\fR
_
Stability LevelObsolete
.TE

.SH SEE ALSO
.sp
.LP
.BR attributes (5),
.BR ddi_dma_addr_setup (9F),
.BR ddi_dma_buf_setup (9F),
.BR ddi_dma_free_handle (9F),
.BR ddi_dma_htoc (9F),
.BR ddi_dma_sync (9F),
.BR ddi_dma_req (9S)
.sp
.LP
.I Writing Device Drivers
