usr/src/man/man9f/ddi_fm_init.9f
'\" te
.\" Copyright (c) 2007, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ddi_fm_init 9F "14 May 2007" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
ddi_fm_init, ddi_fm_fini, ddi_fm_capable \- initialize and get the FM
capabilities for a device instance
.SH SYNOPSIS
.LP
.nf
#include <sys/ddifm.h>

\fBvoid\fR \fBddi_fm_init\fR(\fBdev_info_t\fR *\fIdip\fR, \fBint\fR *\fIfm_capability\fR,
     \fBddi_iblock_cookie_t\fR *\fIibcp\fR);
.fi

.LP
.nf
\fBvoid\fR \fBddi_fm_fini\fR(\fBdev_info_t\fR *\fIdip\fR);
.fi

.LP
.nf
\fBint\fR \fBddi_fm_capable\fR(\fBdev_info_t\fR *\fIdip\fR, \fBint\fR *\fIfm_capability\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI)
.SH PARAMETERS
.sp
.LP
.B ddi_fm_init()
.sp
.ne 2
.mk
.na
.I dip
.ad
.RS 17n
.rt
Pointer to the
.B dev_info
structure
.RE

.sp
.ne 2
.mk
.na
.I fm_capability
.ad
.RS 17n
.rt
Fault Management capability bit mask
.RE

.sp
.ne 2
.mk
.na
.I ibcp
.ad
.RS 17n
.rt
Pointer to where the interrupt block cookie should be returned.
.RE

.SH DESCRIPTION
.sp
.LP
A device driver can declare its fault management capabilities to the
.B I/O
Fault Management framework by calling
.BR ddi_fm_init() .
The
.B ddi_fm_init()
function allocates and initializes resources according
to the bitwise-inclusive-OR of the fault management capabilities, described
in the following and supported by the driver's immediate nexus parent.
.sp
.ne 2
.mk
.na
.B DDI_FM_NOT_CAPABLE
.ad
.RS 26n
.rt
The driver does not support any
.B FMA
features. This is the default
value assigned to device drivers.
.RE

.sp
.ne 2
.mk
.na
.B DDI_FM_EREPORT_CAPABLE
.ad
.RS 26n
.rt
The driver generates
.B FMA
protocol error events
.RB ( ereports )
upon
the detection of an error condition.
.RE

.sp
.ne 2
.mk
.na
.B DDI_FM_ACCCHK_CAPABLE
.ad
.RS 26n
.rt
The driver checks for errors upon the completion of one or more access
.B I/O
transactions.
.RE

.sp
.ne 2
.mk
.na
.B DDI_FM_DMACHK_CAPABLE
.ad
.RS 26n
.rt
The driver checks for errors upon the completion of one or more
.BR DMA
.B I/O
transactions.
.RE

.sp
.ne 2
.mk
.na
.B DDI_FM_ERRCB_CAPABLE
.ad
.RS 26n
.rt
The driver is capable of error handler callback registration.
.RE

.sp
.LP
If the parent nexus is not capable of supporting any one of the requested
capabilities, the associated bit will not be set and returned as such to the
driver. Before returning from
.BR ddi_fm_init() ,
the
.B I/O
Fault
Management framework creates a set of fault management capability
properties:
.BR fm-ereport-capable ,
.BR fm-errcb-capable ,
.BR fm-accchk-capable ,
and
.BR fm-dmachk-capable .
The current supported
fault management capability levels are observable via
.BR prtconf (1M).
.sp
.LP
A driver can support the administrative selection of fault management
capabilities by exporting and setting a fault management capability level
property in its
.BR driver.conf (4)
file to the values described above. The
.B fm_capable
properties must be set and read prior to calling
.B ddi_fm_init()
with the desired capability list.
.sp
.ne 2
.mk
.na
.B ddi_fm_fini()
.ad
.RS 17n
.rt
This function cleans up resources allocated to support fault management for
the
.I dip
structure.
.RE

.sp
.ne 2
.mk
.na
.B ddi_fm_capable()
.ad
.RS 20n
.rt
This function returns the capability bit mask currently set for the
.I dip
structure.
.RE

.SH CONTEXT
.sp
.LP
These functions can be called from kernel context in a driver
.BR attach (9E)
or
.BR detach "(9E) operation."
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
.BR prtconf (1M),
.BR driver.conf (4),
.BR attributes (5),
.BR attach (9E),
.BR detach (9E)
.sp
.LP
.I Writing Device Drivers
