usr/src/man/man9f/ddi_intr_get_nintrs.9f
'\" te
.\" Copyright (c) 2006, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ddi_intr_get_nintrs 9F "13 November 2006" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
ddi_intr_get_nintrs, ddi_intr_get_navail \- return number of interrupts
supported or available for a given interrupt type
.SH SYNOPSIS
.LP
.nf
#include <sys/types.h>
#include <sys/conf.h>
#include <sys/ddi.h>
#include <sys/sunddi.h>

\fBint\fR \fBddi_intr_get_nintrs\fR(\fBdev_info_t *\fIdip\fR, \fBint\fR \fItype\fR, \fBint *\fInintrsp\fR);
.fi

.LP
.nf
\fBint\fR \fBddi_intr_get_navail\fR(\fBdev_info_t *\fIdip\fR, \fBint\fR \fItype\fR, \fBint *\fInavailp\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI).
.SH PARAMETERS
.sp
.LP
.B ddi_intr_get_nintrs()
.sp
.ne 2
.mk
.na
.I dip
.ad
.RS 11n
.rt
Pointer to
.B dev_info
structure
.RE

.sp
.ne 2
.mk
.na
.I type
.ad
.RS 11n
.rt
Interrupt type
.RE

.sp
.ne 2
.mk
.na
.I nintrsp
.ad
.RS 11n
.rt
Pointer to number of interrupts of the given type that are supported by the
system
.RE

.sp
.LP
.B ddi_intr_get_navail()
.sp
.ne 2
.mk
.na
.I dip
.ad
.RS 11n
.rt
Pointer to
.B dev_info
structure
.RE

.sp
.ne 2
.mk
.na
.I type
.ad
.RS 11n
.rt
Interrupt type
.RE

.sp
.ne 2
.mk
.na
.I navailp
.ad
.RS 11n
.rt
Pointer to number of interrupts of the given type that are currently
available from the system
.RE

.SH DESCRIPTION
.sp
.LP
The
.B ddi_intr_get_nintrs()
function returns the number of interrupts
of the given
.I type
supported by a particular hardware device. On a
successful return, the number of supported interrupts is returned as an
integer pointed to by the
.I nintrsp
argument.
.sp
.LP
If the hardware device is not found to support any interrupts of the given
.IR type ,
the
.B DDI_INTR_NOTFOUND
failure is returned rather than a
zero in
.IR nintrsp .
.sp
.LP
The
.B ddi_intr_get_navail()
function returns the number of interrupts
of a given
.I type
that is available to a particular hardware device. On
a successful return, the number of available interrupts is returned as an
integer pointed to by
.IR navailp .
.sp
.LP
The hardware device may support more than one interrupt and can request
that all interrupts be allocated. The host software can then use
policy-based decisions to determine how many interrupts are made available
to the device. Based on the determination, a value is returned that should
be used to allocate interrupts with the
.B ddi_int_alloc()
function.
.sp
.LP
The
.BR ddi_intr_get_supported_types (9F)
function returns a list of valid
supported types for the given hardware device. It must be called prior to
calling either the
.B ddi_intr_get_nintrs()
or
.BR ddi_intr_get_navail() .
.SH RETURN VALUES
.sp
.LP
The
.B ddi_intr_get_nintrs()
and
.B ddi_intr_get_navail()
functions
return:
.sp
.ne 2
.mk
.na
.B DDI_SUCCESS
.ad
.RS 21n
.rt
On success.
.RE

.sp
.ne 2
.mk
.na
.B DDI_EINVAL
.ad
.RS 21n
.rt
On encountering invalid input parameters.
.RE

.sp
.ne 2
.mk
.na
.B DDI_INTR_NOTFOUND
.ad
.RS 21n
.rt
On not finding any interrupts for the given interrupt type.
.RE

.sp
.ne 2
.mk
.na
.B DDI_FAILURE
.ad
.RS 21n
.rt
On any implementation specific failure.
.RE

.SH CONTEXT
.sp
.LP
The
.B ddi_intr_get_nintrs()
and
.B ddi_intr_get_navail()
functions
can be called from either user or kernel non-interrupt context.
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
.BR attributes (5),
.BR ddi_intr_alloc (9F),
.BR ddi_intr_enable (9F),
.BR ddi_intr_get_supported_types (9F)
.sp
.LP
.I Writing Device Drivers
.SH NOTES
.sp
.LP
The
.B ddi_intr_get_nintrs()
and
.B ddi_intr_get_navail()
functions
can be called at any time, even if the driver has added an interrupt handler
for a given interrupt specification.
.sp
.LP
On x86 platforms, the number of interrupts returned by the
.B ddi_intr_get_navail()
function might need to be further reduced by the
number of interrupts available for each interrupt priority on the system. In
that case, drivers should use different priorities for some of the
interrupts.
.sp
.LP
Consumers of these interfaces should verify that the return value is not
equal to
.BR DDI_SUCCESS .
Incomplete checking for failure codes could
result in inconsistent behavior among platforms.
