usr/src/man/man9f/ddi_get_eventcookie.9f
'\" te
.\" Copyright (c) 2003, Sun Microsystems, Inc. All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ddi_get_eventcookie 9F "6 Nov 2003" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
ddi_get_eventcookie \- retrieve a NDI event service cookie handle
.SH SYNOPSIS
.LP
.nf
#include <sys/dditypes.h>
#include <sys/sunddi.h>

\fBint\fR \fBddi_get_eventcookie\fR(\fBdev_info_t *\fIdip\fR, \fBchar *\fIname\fR,
     \fBddi_eventcookie_t *\fIevent_cookiep\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI).
.SH PARAMETERS
.sp
.ne 2
.mk
.na
\fBdev_info_t *\fIdip\fR
.ad
.sp .6
.RS 4n
Child device node requesting the cookie.
.RE

.sp
.ne 2
.mk
.na
.BI "char *" name
.ad
.sp .6
.RS 4n
NULL-terminated string containing the name of the event.
.RE

.sp
.ne 2
.mk
.na
.BI "ddi_eventcookie_t *" event_cookiep
.ad
.sp .6
.RS 4n
Pointer to cookie where event cookie will be returned.
.RE

.SH DESCRIPTION
.sp
.LP
The
.B ddi_get_eventcookie()
function queries the device tree for a
cookie matching the given event name and returns a reference to that cookie.
The search is performed by a calling up the device tree hierarchy until the
request is satisfied by a bus nexus driver, or the top of the \fBdev_info\fR
tree is reached.
.sp
.LP
The cookie returned by this function can be used to register a callback
handler, unregister a callback handler, or post an event.
.SH RETURN VALUES
.sp
.ne 2
.mk
.na
.B DDI_SUCCESS
.ad
.RS 15n
.rt
Cookie handle is returned.
.RE

.sp
.ne 2
.mk
.na
.B DDI_FAILURE
.ad
.RS 15n
.rt
Request was not serviceable by any nexus driver in the driver's ancestral
device tree hierarchy.
.RE

.SH CONTEXT
.sp
.LP
The
.B ddi_get_eventcookie()
function can be called from user and kernel
contexts only.
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for a description of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
\fBATTRIBUTE TYPE\fR\fBATTRIBUTE VALUE\fR
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
.BR attributes (5),
.BR ddi_add_event_handler (9F),
.BR ddi_remove_event_handler (9F)
.sp
.LP
.I Writing Device Drivers
