usr/src/man/man9f/ddi_dma_curwin.9f
'\" te
.\" Copyright (c) 2006, Sun Microsystems, Inc.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ddi_dma_curwin 9F "16 Jan 2006" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
ddi_dma_curwin \- report current DMA window offset and size
.SH SYNOPSIS
.LP
.nf
#include <sys/conf.h>
#include <sys/ddi.h>
#include <sys/sunddi.h>



\fBint\fR \fBddi_dma_curwin\fR(\fBddi_dma_handle_t\fR \fIhandle\fR, \fBoff_t *\fIoffp\fR, \fBuint_t *\fIlenp\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
This interface is obsolete. \fBddi_dma_getwin\fR(9F) should be used
instead.
.SH PARAMETERS
.sp
.ne 2
.mk
.na
\fIhandle\fR
.ad
.RS 10n
.rt
The \fBDMA\fR handle filled in by a call to \fBddi_dma_setup\fR(9F).
.RE

.sp
.ne 2
.mk
.na
\fIoffp\fR
.ad
.RS 10n
.rt
A pointer to a value which will be filled in with the current offset from
the beginning of the object that is mapped for \fBDMA\fR.
.RE

.sp
.ne 2
.mk
.na
\fIlenp\fR
.ad
.RS 10n
.rt
A pointer to a value which will be filled in with the size, in bytes, of
the current window onto the object that is mapped for \fBDMA\fR.
.RE

.SH DESCRIPTION
.sp
.LP
The \fBddi_dma_curwin()\fR function reports the current \fBDMA\fR window
offset and size. If a \fBDMA\fR mapping allows partial mapping, that is if
the \fBDDI_DMA_PARTIAL\fR flag in the \fBddi_dma_req\fR(9S) structure is
set, its current (effective) \fBDMA\fR window offset and size can be
obtained by a call to \fBddi_dma_curwin()\fR.
.SH RETURN VALUES
.sp
.LP
The \fBddi_dma_curwin()\fR function returns:
.sp
.ne 2
.mk
.na
\fBDDI_SUCCESS\fR
.ad
.RS 15n
.rt
The current length and offset can be established.
.RE

.sp
.ne 2
.mk
.na
\fBDDI_FAILURE\fR
.ad
.RS 15n
.rt
Otherwise.
.RE

.SH CONTEXT
.sp
.LP
The \fBddi_dma_curwin()\fR function can be called from user, interrupt, or
kernel context.
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for a description of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
\fBATTRIBUTE TYPE\fR\fBATTRIBUTE VALUE\fR
_
Stability LevelObsolete
.TE

.SH SEE ALSO
.sp
.LP
\fBattributes\fR(5), \fBddi_dma_getwin\fR(9F), \fBddi_dma_movwin\fR(9F),
\fBddi_dma_setup\fR(9F), \fBddi_dma_req\fR(9S)
.sp
.LP
\fIWriting Device Drivers\fR
