usr/src/man/man9f/ddi_prop_get_int.9f
'\" te
.\" Copyright (c) 2001, Sun Microsystems, Inc.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ddi_prop_get_int 9F "25 Aug 2001" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
ddi_prop_get_int, ddi_prop_get_int64 \- lookup integer property
.SH SYNOPSIS
.LP
.nf
#include <sys/ddi.h>
#include <sys/sunddi.h>



\fBint\fR \fBddi_prop_get_int\fR(\fBdev_t\fR \fImatch_dev\fR, \fBdev_info_t *\fIdip\fR, \fBuint_t\fR \fIflags\fR,
     \fBchar *\fIname\fR, \fBint\fR \fIdefvalue\fR);
.fi

.LP
.nf
\fBint64_t\fR \fBddi_prop_get_int64\fR(\fBdev_t\fR \fImatch_dev\fR, \fBdev_info_t *\fIdip\fR, \fBuint_t\fR \fIflags\fR,
     \fBchar *\fIname\fR, \fBint64_t\fR \fIdefvalue\fR);
.fi

.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I match_dev
.ad
.RS 13n
.rt
Device number associated with property or
.BR DDI_DEV_T_ANY.
.RE

.sp
.ne 2
.mk
.na
.I dip
.ad
.RS 13n
.rt
Pointer to the device info node of device whose property list should be
searched.
.RE

.sp
.ne 2
.mk
.na
.I flags
.ad
.RS 13n
.rt
Possible flag values are some combination of:
.sp
.ne 2
.mk
.na
.B DDI_PROP_DONTPASS
.ad
.RS 21n
.rt
Do not pass request to parent device information node if property not
found.
.RE

.sp
.ne 2
.mk
.na
.B DDI_PROP_NOTPROM
.ad
.RS 21n
.rt
Do not look at
.B PROM
properties (ignored on platforms that do not
support
.B PROM
properties).
.RE

.RE

.sp
.ne 2
.mk
.na
.I name
.ad
.RS 13n
.rt
String containing the name of the property.
.RE

.sp
.ne 2
.mk
.na
.I defvalue
.ad
.RS 13n
.rt
An integer value that is returned if the property cannot be found.
.RE

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI).
.SH DESCRIPTION
.sp
.LP
The
.B ddi_prop_get_int()
and
.B ddi_prop_get_int64()
functions
search for an integer property and, if found, returns the value of the
property.
.sp
.LP
Properties are searched for based on the
.IR dip ,
.IR name ,
.IR match_dev ,
and the type of the data (integer). The property search
order is as follows:
.RS +4
.TP
1.
Search software properties created by the driver.
.RE
.RS +4
.TP
2.
Search the software properties created by the system (or nexus nodes in the
device info tree).
.RE
.RS +4
.TP
3.
Search the driver global properties list.
.RE
.RS +4
.TP
4.
If
.B DDI_PROP_NOTPROM
is not set, search the
.B PROM
properties (if
they exist).
.RE
.RS +4
.TP
5.
If
.B DDI_PROP_DONTPASS
is not set, pass this request to the parent
device information node.
.RE
.RS +4
.TP
6.
Return
.IR defvalue .
.RE
.sp
.LP
Usually, the
.I match_dev
argument should be set to the actual device
number that this property is associated with. However, if the
.I match_dev
argument is
.B DDI_DEV_T_ANY,
then
.B ddi_prop_get_int()
and
.B ddi_prop_get_int()
will match the request
regardless of the
.I match_dev
the property was created with. If a
property was created with
.I match_dev
set to
.B DDI_DEV_T_NONE,
then
the only way to look up this property is with a
.I match_dev
set to
.B DDI_DEV_T_ANY. PROM
properties are always created with
.I match_dev
set to
.BR DDI_DEV_T_NONE.
.sp
.LP
.I name
must always be set to the name of the property being looked
up.
.sp
.LP
The return value of the routine is the value of the property. If the
property is not found, the argument
.I defvalue
is returned as the value
of the property.
.sp
.LP
.B ddi_prop_get_int64()
will not search the PROM for 64-bit property
values.
.SH RETURN VALUES
.sp
.LP
.B ddi_prop_get_int()
and
.B ddi_prop_get_int64()
return the value of
the property. If the property is not found, the argument
.B defvalue
is
returned. If the property is found, but cannot be decoded into an \fBint\fR
or an
.BR int64 ,
then
.B DDI_PROP_NOT_FOUND
is returned.
.SH CONTEXT
.sp
.LP
.B ddi_prop_get_int()
and
.B ddi_prop_get_int64()
can be called from
user or kernel context.
.SH EXAMPLES
.LP
.B Example 1
Using
.BR ddi_prop_get_int()
.sp
.LP
The following example demonstrates the use of
.BR ddi_prop_get_int() .

.sp
.in +2
.nf
\fB	
/*
	* Get the value of the integer "width" property, using
	* our own default if no such property exists
	*/
	width = ddi_prop_get_int(xx_dev, xx_dip, 0, "width",
	           XX_DEFAULT_WIDTH);\fR
.fi
.in -2

.SH SEE ALSO
.sp
.LP
.BR ddi_prop_exists (9F),
.BR ddi_prop_lookup (9F),
.BR ddi_prop_remove (9F),
.BR ddi_prop_update (9F)
.sp
.LP
.I Writing Device Drivers
