usr/src/man/man9f/ddi_io_get8.9f
'\" te
.\" Copyright (c) 2005, Sun Microsystems, Inc.  All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ddi_io_get8 9F "1 Nov 2005" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
ddi_io_get8, ddi_io_get16, ddi_io_get32, ddi_io_getb, ddi_io_getl,
ddi_io_getw \- read data from the mapped device register in I/O space
.SH SYNOPSIS
.LP
.nf
#include <sys/ddi.h>
#include <sys/sunddi.h>



\fBuint8_t\fR \fBddi_io_get8\fR(\fBddi_acc_handle_t\fR \fIhandle\fR, \fBuint8_t *\fIdev_addr\fR);
.fi

.LP
.nf
\fBuint16_t\fR \fBddi_io_get16\fR(\fBddi_acc_handle_t\fR \fIhandle\fR, \fBuint16_t  *\fIdev_addr\fR);
.fi

.LP
.nf
\fBuint32_t\fR \fBddi_io_get32\fR(\fBddi_acc_handle_t\fR \fIhandle\fR, \fBuint32_t  *\fIdev_addr\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI). The \fBddi_io_get8()\fR,
.BR ddi_io_get16() ,
.BR ddi_io_get32() ,
.BR ddi_io_getb() ,
.BR ddi_io_getl() ,
and
.B ddi_io_getw()
functions are obsolete. The
.BR ddi_get8 (9F)
function replaces
.BR ddi_io_get8() .
The
.BR ddi_get16 (9F)
function replaces
.BR ddi_io_get16() .
The
.BR ddi_get32 (9F)
function replaces
.BR ddi_io_get32() .
The
.BR ddi_get8 (9F)
function replaces
.BR ddi_io_getb() .
The
.BR ddi_get32 (9F)
function replaces
.BR ddi_io_getl() .
The
.BR ddi_get16 (9F)
function replaces
.BR ddi_io_getw() .
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I handle
.ad
.RS 12n
.rt
Data access handle returned from setup calls, such as
.BR ddi_regs_map_setup (9F).
.RE

.sp
.ne 2
.mk
.na
.I dev_addr
.ad
.RS 12n
.rt
Device address.
.RE

.SH DESCRIPTION
.sp
.LP
These routines generate a read of various sizes from the device address,
.IR dev_addr ,
in I/O space. The
.BR ddi_io_get8() ,
.BR ddi_io_get16() ,
and
.B ddi_io_get32()
functions read 8 bits, 16 bits, and 32 bits of
data, respectively, from the device address, \fIdev_addr\fR.
.sp
.LP
Each individual datum will automatically be translated to maintain a
consistent view between the host and the device based on the encoded
information in the data access handle.  The translation may involve
byte-swapping if the host and the device have incompatible endian
characteristics.
.SH CONTEXT
.sp
.LP
These functions can be called from user, kernel, or interrupt context.
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityObsolete
.TE

.SH SEE ALSO
.sp
.LP
.BR isa (4),
.BR ddi_get8 (9F),
.BR ddi_get16 (9F),
.BR ddi_get32 (9F),
.BR ddi_io_put8 (9F),
.BR ddi_io_rep_get8 (9F),
.BR ddi_io_rep_put8 (9F),
\fBddi_regs_map_free\fR(9F), \fBddi_regs_map_setup\fR(9F),
.BR ddi_device_acc_attr (9S)
