usr/src/man/man9f/ddi_ffs.9f
'\" te
.\" Copyright (c) 2006 Sun Microsystems, Inc.  All Rights Reserved.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ddi_ffs 9F "16 Jan 2006" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
ddi_ffs, ddi_fls \- find first (last) bit set in a long integer
.SH SYNOPSIS
.LP
.nf
#include <sys/conf.h>
#include <sys/ddi.h>
#include <sys/sunddi.h>



\fBint\fBddi_ffs\fR(\fBlong\fR \fImask\fR);
.fi

.LP
.nf
\fBint\fR \fBddi_fls\fR(\fBlong\fR \fImask\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI).
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I mask
.ad
.RS 8n
.rt
A 32-bit argument value to search through.
.RE

.SH DESCRIPTION
.sp
.LP
The function \fBddi_ffs()\fR takes its argument and returns the shift count
that the first (least significant) bit set in the argument corresponds to. The
function \fBddi_fls()\fR does the same, only it returns the shift count for
the last (most significant) bit set in the argument.
.SH RETURN VALUES
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 5n
.rt
No bits are set in mask.
.RE

.sp
.ne 2
.mk
.na
.I N
.ad
.RS 5n
.rt
Bit 
.I N
is the least significant (\fBddi_ffs\fR) or most significant
(\fBddi_fls\fR) bit set in mask. Bits are numbered from  \fB1\fR to  \fB32\fR,
with bit
.B 1
being the least significant bit position and bit
.B 32
the
most significant position.
.RE

.SH CONTEXT
.sp
.LP
This function can be called from user, interrupt, or kernel context.
.SH SEE ALSO
.sp
.LP
.I Writing Device Drivers
