usr/src/man/man9f/ddi_cred.9f
'\" te
.\" Copyright (c) 2003, Sun Microsystems, Inc.  All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ddi_cred 9F "6 Aug 2003" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
ddi_cred, crgetuid, crgetruid, crgetsuid, crgetgid, crgetrgid, crgetsgid,
crgetzoneid, crgetgroups, crgetngroups \- access and change parts of the
cred_t structure
.SH SYNOPSIS
.LP
.nf
#include <sys/cred.h>



\fBuid_t\fR \fBcrgetuid\fR(\fBconst cred_t *\fIcr\fR);
.fi

.LP
.nf
\fBuid_t\fR \fBcrgetruid\fR(\fBconst cred_t *\fIcr\fR);
.fi

.LP
.nf
\fBuid_t\fR \fBcrgetsuid\fR(\fBconst cred_t *\fIcr\fR);
.fi

.LP
.nf
\fBgid_t\fR \fBcrgetgid\fR(\fBconst cred_t *\fIcr\fR);
.fi

.LP
.nf
\fBgid_t\fR \fBcrgetrgid\fR(\fBconst cred_t *\fIcr\fR);
.fi

.LP
.nf
\fBgid_t\fR \fBcrgetsgid\fR(\fBconst cred_t *\fIcr\fR);
.fi

.LP
.nf
\fBzoneid_t\fR \fBcrgetzoneid\fR(\fBconst cred_t *\fIcr\fR);
.fi

.LP
.nf
\fBconst gid_t *\fBcrgetgroups\fR(\fBconst cred_t *\fIcr\fR);
.fi

.LP
.nf
\fBint\fR \fBcrgetngroups\fR(\fBconst cred_t *\fIcr\fR);
.fi

.LP
.nf
\fBint\fR \fBcrsetresuid\fR(\fBcred_t *\fIcr\fR, \fBuid_t\fR \fIruid\fR, \fBuid_t\fR \fIeuid\fR, \fBuid_t\fR \fIsuid\fR);
.fi

.LP
.nf
\fBint\fR \fBcrsetresgid\fR(\fBcred_t *\fIcr\fR, \fBgid_t\fR \fIrgid\fR, \fBgid_t\fR \fIegid\fR, \fBgid_t\fR \fIsgid\fR);
.fi

.LP
.nf
\fBint\fR \fBcrsetugid\fR(\fBcred_t *\fIcr\fR, \fBuid_t\fR \fIuid\fR, \fBgid_t\fR \fIgid\fR);
.fi

.LP
.nf
\fBint\fR \fBcrsetgroups\fR(\fBcred_t *\fIcr\fR, \fBint\fR \fIngroups\fR, \fBgid_t\fR \fIgids\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI).
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I cr
.ad
.RS 25n
.rt
pointer to the user credential structure
.RE

.sp
.ne 2
.mk
.na
.IR uid ,
.IR ruid ,
.IR euid ,
.I suid
.ad
.RS 25n
.rt
new user id, real, effective and saved user id
.RE

.sp
.ne 2
.mk
.na
.IR gid ,
.IR rgid ,
.IR egid ,
.I sgid
.ad
.RS 25n
.rt
new group id, real, effective and saved group id
.RE

.sp
.ne 2
.mk
.na
.I ngroups
.ad
.RS 25n
.rt
number of groups in the group array
.RE

.sp
.ne 2
.mk
.na
.I gids
.ad
.RS 25n
.rt
pointer to array of new groups
.RE

.SH DESCRIPTION
.sp
.LP
The user credential is a shared, read-only, ref-counted data structure. Its
actual size and layout are subject to change. The functions described in
this page allow the programmer to retrieve fields from the structure and to
initialize newly allocated credential structures.
.sp
.LP
.BR crgetuid() ,
.BR crgetruid() ,
and
.B crgetsuid()
return,
respectively, the effective, real, and saved user id from the user
credential pointed to by
.IR cr .
.sp
.LP
.BR crgetgid() ,
.BR crgetrgid() ,
and
.B crgetsgid()
return,
respectively, the effective, real, and saved group id from the user
credential pointed to by
.IR cr .
.sp
.LP
.B crgetzoneid()
returns the zone id from the user credential pointed to
by
.IR cr .
.sp
.LP
.B crgetgroups()
returns the group list of the user credential pointed
to by
.IR cr .
.sp
.LP
.B crgetngroups()
returns the number of groups in the user credential
pointed to by
.IR cr .
.sp
.LP
.B crsetresuid()
sets the real, effective and saved user id. All but one
can be specified as -1, which causes the original value not to change.
.sp
.LP
.B crsetresgid()
sets the real, effective and saved group id. All but
one can be specified as -1, which causes the original value not to change.
.sp
.LP
.B crsetugid()
initializes the real, effective and saved user id
.B all
to
.IR uid .
It initializes the real, effective, and saved group
id
.B all
to
.IR gid .
.sp
.LP
.B crsetgroups()
sets the number of groups in the user credential to
.I ngroups
and copies the groups from
.I gids
to the user credential.
If
.I ngroups
is 0,
.I gids
need not point to valid storage.
.sp
.LP
It is an error to call this any of the
.B crset*()
functions on a user
credential structure that was newly allocated.
.SH RETURN VALUES
.sp
.LP
The
.B crget*()
functions return the requested information.
.sp
.LP
The
.B crset*id()
functions return 0 on success and -1 if any of the
specified ids are invalid. The functions might cause a system panic if
called on a user credential structure that is referenced by other parts of
the system.
.SH CONTEXT
.sp
.LP
These functions can be called from user and kernel contexts.
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for a description of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
\fBATTRIBUTE TYPE\fR\fBATTRIBUTE VALUE\fR
_
ArchitectureAll
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
.BR attributes (5),
.BR privileges (5),
.BR drv_priv (9F)
.sp
.LP
.I Writing Device Drivers
