usr/src/man/man9f/ddi_dma_coff.9f
'\" te
.\" Copyright (c) 2006, Sun Microsystems, Inc.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ddi_dma_coff 9F "16 Jan 2006" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
ddi_dma_coff \- convert a DMA cookie to an offset within a DMA handle.
.SH SYNOPSIS
.LP
.nf
#include <sys/conf.h>
#include <sys/ddi.h>
#include <sys/sunddi.h>



\fBint\fR \fBddi_dma_coff\fR(\fBddi_dma_handle_t\fR \fIhandle\fR, \fBddi_dma_cookie_t *\fIcookiep\fR,
     \fBoff_t *\fIoffp\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris SPARC DDI (Solaris SPARC DDI). This interface is obsolete.
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I handle
.ad
.RS 11n
.rt
The
.I handle
filled in by a call to
.BR ddi_dma_setup (9F).
.RE

.sp
.ne 2
.mk
.na
.I cookiep
.ad
.RS 11n
.rt
A pointer to a
.B DMA
cookie (see
.BR ddi_dma_cookie (9S))
that
contains the appropriate address, length and bus type to be used in
programming the
.B DMA
engine.
.RE

.sp
.ne 2
.mk
.na
\fIoffp\fR
.ad
.RS 11n
.rt
A pointer to an offset to be filled in.
.RE

.SH DESCRIPTION
.sp
.LP
The \fBddi_dma_coff()\fR function converts the values in
.B DMA
cookie
pointed to by
.I cookiep
to an offset (in bytes) from the beginning of
the object that the DMA\fBhandle\fR has mapped.
.sp
.LP
The \fBddi_dma_coff()\fR function allows a driver to update a \fBDMA\fR
cookie with values it reads from its device's
.B DMA
engine after a
transfer completes and convert that value into an offset into the object
that is mapped for
.BR DMA .
.SH RETURN VALUES
.sp
.LP
The \fBddi_dma_coff()\fR function returns:
.sp
.ne 2
.mk
.na
.B DDI_SUCCESS
.ad
.RS 15n
.rt
Successfully filled in \fIoffp\fR.
.RE

.sp
.ne 2
.mk
.na
.B DDI_FAILURE
.ad
.RS 15n
.rt
Failed to successfully fill in \fIoffp\fR.
.RE

.SH CONTEXT
.sp
.LP
The \fBddi_dma_coff()\fR function can be called from user, interrupt, or
kernel context.
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityObsolete
.TE

.SH SEE ALSO
.sp
.LP
.BR ddi_dma_setup (9F),
.BR ddi_dma_sync (9F),
.BR ddi_dma_cookie (9S)

.sp
.LP
.I Writing Device Drivers
