usr/src/man/man9f/ddi_dev_nregs.9f
'\" te
.\" Copyright (c) 2006, Sun Microsystems, Inc.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ddi_dev_nregs 9F "16 Jan 2006" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
ddi_dev_nregs \- return the number of register sets a device has
.SH SYNOPSIS
.LP
.nf
#include <sys/conf.h>
#include <sys/ddi.h>
#include <sys/sunddi.h>



\fBint\fR \fBddi_dev_nregs\fR(\fBdev_info_t *\fIdip\fR, \fBint *\fIresultp\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI).
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I dip
.ad
.RS 11n
.rt
A pointer to the device's
.B dev_info
structure.
.RE

.sp
.ne 2
.mk
.na
.I resultp
.ad
.RS 11n
.rt
Pointer to an integer that holds the number of register sets on return.
.RE

.SH DESCRIPTION
.sp
.LP
The
.B ddi_dev_nregs()
function returns the number of sets of registers
the device has.
.SH RETURN VALUES
.sp
.LP
The
.B ddi_dev_nregs()
function returns:
.sp
.ne 2
.mk
.na
.B DDI_SUCCESS
.ad
.RS 15n
.rt
A successful return. The number of register sets is returned in
.IR resultp .
.RE

.sp
.ne 2
.mk
.na
.B DDI_FAILURE
.ad
.RS 15n
.rt
The device has no registers.
.RE

.SH CONTEXT
.sp
.LP
The
.B ddi_dev_nregs()
function can be called from user, interrupt, or
kernel context.
.SH SEE ALSO
.sp
.LP
.BR ddi_dev_nintrs (9F),
.BR ddi_dev_regsize (9F)
.sp
.LP
.I Writing Device Drivers
