usr/src/man/man9f/ddi_umem_iosetup.9f
'\" te
.\" Copyright (c) 2003, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ddi_umem_iosetup 9F "4 Feb 2003" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
ddi_umem_iosetup \- Setup I/O requests to application memory
.SH SYNOPSIS
.LP
.nf
#include <sys/ddi.h>
#include <sys/sunddi.h>



\fBstruct buf *\fBddi_umem_iosetup\fR(\fBddi_umem_cookie_t\fR \fIcookie,\fRoff_t off,	
     size_t \fIlen\fR, int \fIdirection\fR, dev_t \fIdev\fR, daddr_t \fIblkno\fR,	
     int (*iodone) (struct buf *), int \fIsleepflag\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI)
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I cookie
.ad
.RS 14n
.rt
The kernel memory cookie allocated by
.BR ddi_umem_lock (9F).
.RE

.sp
.ne 2
.mk
.na
.I off
.ad
.RS 14n
.rt
Offset from the start of the cookie.
.RE

.sp
.ne 2
.mk
.na
.I len
.ad
.RS 14n
.rt
Length of the I/O request in bytes.
.RE

.sp
.ne 2
.mk
.na
.I direction
.ad
.RS 14n
.rt
Must be set to
.B B_READ
for reads from the device or
.B B_WRITE
for
writes to the device.
.RE

.sp
.ne 2
.mk
.na
.I dev
.ad
.RS 14n
.rt
Device number
.RE

.sp
.ne 2
.mk
.na
.I blkno
.ad
.RS 14n
.rt
Block number on device.
.RE

.sp
.ne 2
.mk
.na
.I iodone
.ad
.RS 14n
.rt
Specific
.BR biodone "(9F) routine."
.RE

.sp
.ne 2
.mk
.na
.I sleepflag
.ad
.RS 14n
.rt
Determines whether caller can sleep for memory. Possible flags are
.B DDI_UMEM_SLEEP
to allow sleeping until memory is available, or
.B DDI_UMEM_NOSLEEP
to return
.B NULL
immediately if memory is not
available.
.RE

.SH DESCRIPTION
.sp
.LP
The
.BR ddi_umem_iosetup (9F)
function is used by drivers to setup I/O requests
to application memory which has been locked down using
.BR ddi_umem_lock (9F).
.sp
.LP
The
.BR ddi_umem_iosetup (9F)
function returns a pointer to a \fBbuf\fR(9S)
structure corresponding to the memory cookie
.BR cookie .
Drivers can setup
multiple buffer structures simultaneously active using the same memory cookie.
The
.BR buf (9S)
structures can span all or part of the region represented by
the cookie and can overlap each other. The
.BR buf (9S)
structure can be passed
to
.BR ddi_dma_buf_bind_handle (9F)
to initiate DMA transfers to or from the
locked down memory.
.sp
.LP
The
.I off
parameter specifies the offset from the start of the cookie. The
.I len
parameter represents the length of region to be mapped by the buffer.
The
.I direction
parameter must be set to either
.B B_READ
or
.BR B_WRITE ,
to indicate the action that will be performed by the device. (Note
that this direction is in the opposite sense of the VM system's direction of
.B DDI_UMEMLOCK_READ
and
.BR DDI_UMEMLOCK_WRITE .)
The direction must be
compatible with the flags used to create the memory cookie in
.BR ddi_umem_lock (9F).
For example, if
.B ddi_umem_lock()
is called with the
.I flags
parameter set to DDI_UMEMLOCK_READ, the
.I direction
parameter in
.B ddi_umem_iosetup()
should be set to
.BR B_WRITE .
.sp
.LP
The
.I dev
parameter specifies the device to which the buffer is to perform
I/O.The
.I blkno
parameter represents the block number on the device. It will
be assigned to the
.B b_blkno
field of the returned buffer structure. The
.I iodone
parameter enables the driver to identify a specific
.BR biodone (9F)
routine to be called by the driver when the I/O is complete.
The
.I sleepflag
parameter determines if the caller can sleep for memory.
.B DDI_UMEM_SLEEP
allocations may sleep but are guaranteed to succeed.
.B DDI_UMEM_NOSLEEP
allocations do not sleep but may fail (return
.BR NULL )
if memory is currently not available.
.sp
.LP
After the I/O has completed and the buffer structure is no longer needed, the
driver calls
.BR freerbuf (9F)
to free the buffer structure.
.SH RETURN VALUES
.sp
.LP
The
.BR ddi_umem_iosetup (9F)
function returns a pointer to the initialized
buffer header, or
.B NULL
if no space is available.
.SH CONTEXT
.sp
.LP
The
.BR ddi_umem_iosetup (9F)
function can be called from any context only if
flag is set to
.BR DDI_UMEM_NOSLEEP .
If
.B DDI_UMEM_SLEEP
is set,
.BR ddi_umem_iosetup (9F)
can be called from user and kernel context only.
.SH SEE ALSO
.sp
.LP
.BR ddi_umem_lock (9F),
.BR ddi_dma_buf_bind_handle (9F),
.BR freerbuf (9F),
.BR physio (9F),
.BR buf (9S)
