usr/src/man/man9f/ddi_dma_get_attr.9f
'\" te
.\" Copyright (c) 2005, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ddi_dma_get_attr 9F "12 Oct 2005" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
ddi_dma_get_attr \- get the device DMA attribute structure from a DMA
handle
.SH SYNOPSIS
.LP
.nf
#include <sys/ddi.h>
#include <sys/sunddi.h>



\fBint\fR \fBddi_dma_get_attr\fR(\fBddi_dma_handle_t\fR \fIhandle\fR, \fBddi_dma_attr_t *\fIattrp\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI). This interface is obsolete.
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I handle
.ad
.RS 10n
.rt
The handle filled in by a call to
.BR ddi_dma_alloc_handle (9F).
.RE

.sp
.ne 2
.mk
.na
.I attrp
.ad
.RS 10n
.rt
Pointer to a buffer suitable for holding a DMA attribute structure. See
.BR ddi_dma_attr (9S).
.RE

.SH DESCRIPTION
.sp
.LP
.B ddi_dma_get_attr()
is used to get a
.BR ddi_dma_attr "(9S) structure."
This structure describes the attributes of the DMA data path to which any
memory object bound to the given handle will be subject.
.SH RETURN VALUES
.sp
.ne 2
.mk
.na
.B DDI_SUCCESS
.ad
.RS 19n
.rt
Successfully passed back attribute structure in buffer pointed to by
.IR attrp .
.RE

.sp
.ne 2
.mk
.na
.B DDI_DMA_BADATTR
.ad
.RS 19n
.rt
A valid attribute structure could not be passed back.
.RE

.SH CONTEXT
.sp
.LP
.B ddi_dma_get_attr()
can be called from any context.
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityObsolete
.TE

.SH SEE ALSO
.sp
.LP
.BR ddi_dma_alloc_handle (9F),
.BR ddi_dma_attr (9S)
