usr/src/man/man9f/ddi_add_softintr.9f
'\" te
.\" Copyright (c) 2005, Sun Microsystems, Inc.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ddi_add_softintr 9F "19 Oct 2005" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
ddi_add_softintr, ddi_get_soft_iblock_cookie, ddi_remove_softintr,
ddi_trigger_softintr \- software interrupt handling routines
.SH SYNOPSIS
.LP
.nf
#include <sys/types.h>
#include <sys/conf.h>
#include <sys/ddi.h>
#include <sys/sunddi.h>



\fBint\fR \fBddi_get_soft_iblock_cookie\fR(\fBdev_info_t *\fIdip\fR,
\fBint\fR \fIpreference\fR, \fBddi_iblock_cookie_t *\fIiblock_cookiep\fR);
.fi

.LP
.nf
\fBint\fR \fBddi_add_softintr\fR(\fBdev_info_t *\fIdip\fR, \fBint\fR \fIpreference\fR, \fBddi_softintr_t *\fIidp\fR,
     \fBddi_iblock_cookie_t *\fIiblock_cookiep\fR, \fBddi_idevice_cookie_t *\fR
     \fIidevice_cookiep\fR,
     \fBuint_t(*\fIint_handler\fR) (caddr_t \fIint_handler_arg\fR), \fBcaddr_t\fR
     \fIint_handler_arg\fR);
.fi

.LP
.nf
\fBvoid\fR \fBddi_remove_softintr\fR(\fBddi_softintr_t\fR \fIid\fR);
.fi

.LP
.nf
\fBvoid\fR \fBddi_trigger_softintr\fR(\fBddi_softintr_t\fR \fIid\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI). These interfaces are obsolete. Use the new
interrupt interfaces referenced in
.BR Intro (9F).
Refer to
.I
Writing Device Drivers
for more information.
.SH PARAMETERS
.sp
.LP
.B ddi_get_soft_iblock_cookie()
.sp
.ne 2
.mk
.na
.I dip
.ad
.RS 18n
.rt
Pointer to a
.B dev_info
structure.
.RE

.sp
.ne 2
.mk
.na
.I preference
.ad
.RS 18n
.rt
The type of soft interrupt to retrieve the cookie for.
.RE

.sp
.ne 2
.mk
.na
.I iblock_cookiep
.ad
.RS 18n
.rt
Pointer to a location to store the interrupt block cookie.
.RE

.sp
.LP
.B ddi_add_softintr()
.sp
.ne 2
.mk
.na
.I dip
.ad
.RS 19n
.rt
Pointer to
.B dev_info
structure.
.RE

.sp
.ne 2
.mk
.na
.I preference
.ad
.RS 19n
.rt
A hint value describing the type of soft interrupt to generate.
.RE

.sp
.ne 2
.mk
.na
.I idp
.ad
.RS 19n
.rt
Pointer to a soft interrupt identifier where a returned soft interrupt
identifier is stored.
.RE

.sp
.ne 2
.mk
.na
.I iblock_cookiep
.ad
.RS 19n
.rt
Optional pointer to an interrupt block cookie where a returned interrupt block
cookie is stored.
.RE

.sp
.ne 2
.mk
.na
.I idevice_cookiep
.ad
.RS 19n
.rt
Optional pointer to an interrupt device cookie where a returned interrupt
device
cookie is stored (not used).
.RE

.sp
.ne 2
.mk
.na
.I int_handler
.ad
.RS 19n
.rt
Pointer to interrupt handler.
.RE

.sp
.ne 2
.mk
.na
.I int_handler_arg
.ad
.RS 19n
.rt
Argument for interrupt handler.
.RE

.sp
.LP
.B ddi_remove_softintr()
.sp
.ne 2
.mk
.na
.I id
.ad
.RS 6n
.rt
The identifier specifying which soft interrupt handler to remove.
.RE

.sp
.LP
.B ddi_trigger_softintr()
.sp
.ne 2
.mk
.na
.I id
.ad
.RS 6n
.rt
The identifier specifying which soft interrupt to trigger and which soft
interrupt handler will be called.
.RE

.SH DESCRIPTION
.sp
.LP
For
.BR ddi_get_soft_iblock_cookie() :
.sp
.LP
.B ddi_get_soft_iblock_cookie()
retrieves the interrupt block cookie
associated with a particular soft interrupt preference level. This routine
should
be called before
.B ddi_add_softintr()
to retrieve the interrupt block cookie
needed to initialize locks (
.BR mutex (9F),
.BR rwlock (9F))
used by the
software interrupt routine.
.I preference
determines which type of soft
interrupt to retrieve the cookie for. The possible values for
.I preference
are:
.sp
.ne 2
.mk
.na
.B DDI_SOFTINT_LOW
.ad
.RS 20n
.rt
Low priority soft interrupt.
.RE

.sp
.ne 2
.mk
.na
.B DDI_SOFTINT_MED
.ad
.RS 20n
.rt
Medium priority soft interrupt.
.RE

.sp
.ne 2
.mk
.na
.B DDI_SOFTINT_HIGH
.ad
.RS 20n
.rt
High priority soft interrupt.
.RE

.sp
.LP
On a successful return,
.I iblock_cookiep
contains information needed for
initializing locks associated with this soft interrupt (see
.BR mutex_init (9F)
and
.BR rw_init "(9F)). The driver can then initialize mutexes acquired by the"
interrupt routine before calling
.B ddi_add_softintr()
which prevents a
possible race condition where the driver's soft interrupt handler is called
immediately
.BR after " the driver has called "
.B ddi_add_softintr()
but
.B before
the driver has initialized the mutexes. This can happen when a soft
interrupt for a different device occurs on the same soft interrupt priority
level. If the soft interrupt routine acquires the mutex before it has been
initialized, undefined behavior may result.
.sp
.LP
For
.BR ddi_add_softintr() :
.sp
.LP
.B ddi_add_softintr()
adds a soft interrupt to the system. The user specified
hint
.I preference
identifies three suggested levels for the system to attempt
to allocate the soft interrupt priority at. The value for
.I preference
should
be the same as that used in the corresponding call to
.BR ddi_get_soft_iblock_cookie() .
Refer to the description of
.B ddi_get_soft_iblock_cookie()
above.
.sp
.LP
The value returned in the location pointed at by
.I idp
is the soft interrupt
identifier. This value is used in later calls to
.B ddi_remove_softintr()
and
.B ddi_trigger_softintr()
to identify the soft interrupt and the soft
interrupt handler.
.sp
.LP
The value returned in the location pointed at by
.I iblock_cookiep
is an
interrupt block cookie which contains information used for initializing mutexes
associated with this soft interrupt (see
.BR mutex_init (9F)
and
.BR rw_init (9F)).
Note that the interrupt block cookie is normally obtained
using
.B ddi_get_soft_iblock_cookie()
to avoid the race conditions described
above (refer to the description of
.B ddi_get_soft_iblock_cookie()
above). For
this reason,
.I iblock_cookiep
is no longer useful and should be set to
.IR NULL .
.sp
.LP
.I idevice_cookiep
is not used and should be set to
.IR NULL .
.sp
.LP
The routine
.IR int_handler ,
with its argument
.IR int_handler_arg ,
is
called upon receipt of a software interrupt. Software interrupt handlers must
not
assume that they have work to do when they run, since (like hardware interrupt
handlers) they may run because a soft interrupt occurred for some other reason.
For example, another driver may have triggered a soft interrupt at the same
level. For this reason, before triggering the soft interrupt, the driver must
indicate to its soft interrupt handler that it should do work. This is usually
done by setting a flag in the state structure. The routine
.I int_handler
checks this flag, reachable through
.IR int_handler_arg ,
to determine if it
should claim the interrupt and do its work.
.sp
.LP
The interrupt handler must return
.B DDI_INTR_CLAIMED
if the interrupt was
claimed,
.B DDI_INTR_UNCLAIMED
otherwise.
.sp
.LP
If successful,
.B ddi_add_softintr()
will return
.BR DDI_SUCCESS ;
if the
interrupt information cannot be found, it will return
.BR DDI_FAILURE .
.sp
.LP
For
.BR ddi_remove_softintr() :
.sp
.LP
.B ddi_remove_softintr()
removes a soft interrupt from the system. The soft
interrupt identifier
.IR id ,
which was returned from a call to
.BR ddi_add_softintr() ,
is used to determine which soft interrupt and which
soft interrupt handler to remove. Drivers must remove any soft interrupt
handlers
before allowing the system to unload the driver.
.sp
.LP
For
.BR ddi_trigger_softintr() :
.sp
.LP
.B ddi_trigger_softintr()
triggers a soft interrupt. The soft interrupt
identifier
.I id
is used to determine which soft interrupt to trigger. This
function is used by device drivers when they wish to trigger a soft interrupt
which has been set up using
.BR ddi_add_softintr() .
.SH RETURN VALUES
.sp
.LP
.B ddi_add_softintr()
and
.B ddi_get_soft_iblock_cookie()
return:
.sp
.ne 2
.mk
.na
.B DDI_SUCCESS
.ad
.RS 15n
.rt
on success
.RE

.sp
.ne 2
.mk
.na
.B DDI_FAILURE
.ad
.RS 15n
.rt
on failure
.RE

.SH CONTEXT
.sp
.LP
These functions can be called from user or kernel context.
.B ddi_trigger_softintr()
may be called from high-level interrupt context as
well.
.SH EXAMPLES
.LP
.B Example 1
device using high-level interrupts
.sp
.LP
In the following example, the device uses high-level interrupts. High-level
interrupts are those that interrupt at the level of the scheduler and above.
High
level interrupts must be handled without using system services that manipulate
thread or process states, because these interrupts are not blocked by the
scheduler. In addition, high level interrupt handlers must take care to do a
minimum of work because they are not preemptable. See
.BR ddi_intr_hilevel (9F).

.sp
.LP
In the example, the high-level interrupt routine minimally services the device,
and enqueues the data for later processing by the soft interrupt handler. If
the
soft interrupt handler is not currently running, the high-level interrupt
routine
triggers a soft interrupt so the soft interrupt handler can process the data.
Once running, the soft interrupt handler processes all the enqueued data before
returning.

.sp
.LP
The state structure contains two mutexes. The high-level mutex is used to
protect data shared between the high-level interrupt handler and the soft
interrupt handler. The low-level mutex is used to protect the rest of the
driver
from the soft interrupt handler.

.sp
.in +2
.nf
struct xxstate {
      .\|.\|.
      ddi_softintr_t             id;
         ddi_iblock_cookie_t     high_iblock_cookie;
         kmutex_t                      high_mutex;
         ddi_iblock_cookie_t     low_iblock_cookie;
         kmutex_t                      low_mutex;
         int                              softint_running;
      .\|.\|.
};
struct xxstate *xsp;
static uint_t xxsoftintr(caddr_t);
static uint_t xxhighintr(caddr_t);
\&.\|.\|.
.fi
.in -2

.LP
.B Example 2
sample
.B attach()
routine
.sp
.LP
The following code fragment would usually appear in the driver's
.BR attach (9E)
routine.
.BR ddi_add_intr (9F)
is used to add the high-level
interrupt handler and
.B ddi_add_softintr()
is used to add the low-level
interrupt routine.

.sp
.in +2
.nf
static uint_t
xxattach(dev_info_t *dip, ddi_attach_cmd_t cmd)
{
         struct xxstate *xsp;
         .\|.\|.
      /* get high-level iblock cookie */
         if (ddi_get_iblock_cookie(dip, \fIinumber\fR,
                &xsp->high_iblock_cookie) != DDI_SUCCESS)  {
                      /* clean up */
                      return (DDI_FAILURE); /* fail attach */
         }

         /* initialize high-level mutex */
         mutex_init(&xsp->high_mutex, "xx high mutex", MUTEX_DRIVER,
               (void *)xsp->high_iblock_cookie);

         /* add high-level routine - xxhighintr() */
         if (ddi_add_intr(dip, \fIinumber\fR, NULL, NULL,
                xxhighintr, (caddr_t) xsp) != DDI_SUCCESS)  {
                      /* cleanup */
                      return (DDI_FAILURE); /* fail attach */
         }

         /* get soft iblock cookie */
         if (ddi_get_soft_iblock_cookie(dip, DDI_SOFTINT_MED,
                &xsp->low_iblock_cookie) != DDI_SUCCESS)  {
                      /* clean up */
                      return (DDI_FAILURE); /* fail attach */
         }

         /* initialize low-level mutex */
         mutex_init(&xsp->low_mutex, "xx low mutex", MUTEX_DRIVER,
                (void *)xsp->low_iblock_cookie);

         /* add low level routine - xxsoftintr() */
         if ( ddi_add_softintr(dip, DDI_SOFTINT_MED, &xsp->id,
                NULL, NULL, xxsoftintr, (caddr_t) xsp) != DDI_SUCCESS) {
                      /* cleanup */
                      return (DDI_FAILURE);  /* fail attach */
         }

         .\|.\|.
}
.fi
.in -2

.LP
.B Example 3
High-level interrupt routine
.sp
.LP
The next code fragment represents the high-level interrupt routine. The
high-level interrupt routine minimally services the device, and enqueues the
data
for later processing by the soft interrupt routine. If the soft interrupt
routine
is not already running,
.B ddi_trigger_softintr()
is called to start the
routine. The soft interrupt routine will run until there is no more data on the
queue.

.sp
.in +2
.nf
static uint_t
xxhighintr(caddr_t arg)
{
      struct xxstate *xsp = (struct xxstate *) arg;
         int need_softint;
         .\|.\|.
         mutex_enter(&xsp->high_mutex);
         /*
         * Verify this device generated the interrupt
         * and disable the device interrupt.
         * Enqueue data for xxsoftintr() processing.
         */

         /* is xxsoftintr() already running ? */
         if (xsp->softint_running)
                need_softint = 0;
          else
                need_softint = 1;
          mutex_exit(&xsp->high_mutex);

          /* read-only access to xsp->id, no mutex needed */
          if (need_softint)
                ddi_trigger_softintr(xsp->id);
          .\|.\|.
          return (DDI_INTR_CLAIMED);
}

static uint_t
xxsoftintr(caddr_t arg)
{
      struct xxstate *xsp = (struct xxstate *) arg;
      .\|.\|.
         mutex_enter(&xsp->low_mutex);
      mutex_enter(&xsp->high_mutex);

      /* verify there is work to do */
      if (\fBwork queue empty\fR || xsp->softint_running )  {
                mutex_exit(&xsp->high_mutex);
                mutex_exit(&xsp->low_mutex);
                return (DDI_INTR_UNCLAIMED);
      }

      xsp->softint_running = 1;

         while ( \fBdata on queue\fR )  {
                ASSERT(mutex_owned(&xsp->high_mutex));

                /* de-queue data */

                mutex_exit(&xsp->high_mutex);

                /* Process data on queue */

                mutex_enter(&xsp->high_mutex);
          }

          xsp->softint_running = 0;
          mutex_exit(&xsp->high_mutex);
          mutex_exit(&xsp->low_mutex);

          return (DDI_INTR_CLAIMED);
}
.fi
.in -2

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityObsolete
.TE

.SH SEE ALSO
.sp
.LP
.BR ddi_add_intr (9F),
.BR ddi_in_panic (9F),
.BR ddi_intr_hilevel (9F),
.BR ddi_remove_intr (9F),
.BR Intro (9F),
.BR mutex_init (9F)
.sp
.LP
.I Writing Device Drivers
.SH NOTES
.sp
.LP
.B ddi_add_softintr()
may not be used to add the same software interrupt
handler more than once. This is true even if a different value is used for
.I int_handler_arg
in each of the calls to
.BR ddi_add_softintr() .
Instead,
the argument passed to the interrupt handler should indicate what service(s) the
interrupt handler should perform. For example, the argument could be a pointer
to
the device's soft state structure, which could contain a 'which_service' field
that the handler examines. The driver must set this field to the appropriate
value before calling
.BR ddi_trigger_softintr() .
