usr/src/man/man9f/ddi_intr_get_supported_types.9f
'\" te
.\" Copyright (c) 2005, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ddi_intr_get_supported_types 9F "07 Apr 2005" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
ddi_intr_get_supported_types \- return information on supported hardware
interrupt types
.SH SYNOPSIS
.LP
.nf
#include <sys/types.h>
#include <sys/conf.h>
#include <sys/ddi.h>
#include <sys/sunddi.h>

\fBint\fR \fBddi_intr_get_supported_types\fR(\fBdev_info_t *\fIdip\fR, \fBint *\fItypesp\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI)
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I dip
.ad
.RS 10n
.rt
Pointer to
.B dev_info
structure
.RE

.sp
.ne 2
.mk
.na
.I typesp
.ad
.RS 10n
.rt
Pointer to supported interrupt types
.RE

.SH DESCRIPTION
.sp
.LP
The
.B ddi_intr_get_supported_types()
function retrieves the interrupt types
supported by a particular hardware device and by the system software. Upon
successful return, the supported types are returned as a bit mask in the
integer
pointed to by the
.I typesp
argument. See
.RB < sys/ddi_intr.h >
for a list
of interrupts that can be returned by a hardware device.
.sp
.LP
For PCI devices that support MSI and/or MSI-X based hardware, this interface
returns only the interrupt types that are supported by all the hardware in the
path to the hardware device.
.sp
.LP
An interrupt type is usable by the hardware device if it is returned by the
.B ddi_intr_get_supported_types()
function. The device driver can be
programmed to use one of the returned interrupt types to receive hardware
interrupts.
.SH RETURN VALUES
.sp
.LP
The
.B ddi_intr_get_supported_types()
function returns:
.sp
.ne 2
.mk
.na
.B DDI_SUCCESS
.ad
.RS 21n
.rt
On success.
.RE

.sp
.ne 2
.mk
.na
.B DDI_EINVAL
.ad
.RS 21n
.rt
On encountering invalid input parameters.
.RE

.sp
.ne 2
.mk
.na
.B DDI_INTR_NOTFOUND
.ad
.RS 21n
.rt
Returned when the hardware device is found not to support any hardware
interrupts.
.RE

.SH CONTEXT
.sp
.LP
The
.B ddi_intr_get_supported_types()
function can be called from user or
kernel non-interrupt context.
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
.BR pci (4),
.BR attributes (5),
.BR pcmcia (7D),
.BR sysbus (4),
.BR ddi_intr_add_handler (9F),
.BR ddi_intr_alloc (9F),
.BR ddi_intr_enable (9F)
.sp
.LP
.I Writing Device Drivers
.SH NOTES
.sp
.LP
The
.B ddi_intr_get_supported_types()
function can be called by the device
driver even at any time if the driver has added an interrupt handler for a
given
interrupt type.
.sp
.LP
Soft interrupts are always usable and are not returned by this interface.
.sp
.LP
Any consumer of this interface should verify that the return value is not equal
to
.BR DDI_SUCCESS .
Incomplete checking for failure codes could result in
inconsistent behavior among platforms.
