usr/src/man/man9f/ddi_report_dev.9f
'\" te
.\" Copyright (c) 1993, Sun Microsystems, Inc.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ddi_report_dev 9F "7 Jun 1993" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
ddi_report_dev \- announce a device
.SH SYNOPSIS
.LP
.nf
#include <sys/conf.h>
#include <sys/ddi.h>
#include <sys/sunddi.h>



\fBvoid\fR \fBddi_report_dev\fR(\fBdev_info_t *\fIdip\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI).
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I dip
.ad
.RS 8n
.rt
a pointer the device's \fBdev_info\fR structure.
.RE

.SH DESCRIPTION
.sp
.LP
\fBddi_report_dev()\fR prints a banner at boot time,  announcing the device
pointed to by
.IR dip .
The banner is always placed in the system logfile
(displayed by \fBdmesg\fR(1M)), but is only displayed on the console if the
system was booted with the verbose (\fB-v\fR) argument.
.SH CONTEXT
.sp
.LP
\fBddi_report_dev()\fR can be called from user context.
.SH SEE ALSO
.sp
.LP
.BR dmesg (1M),
.BR kernel (1M)
.sp
.LP
.I Writing Device Drivers
