usr/src/man/man9f/ddi_iopb_alloc.9f
'\" te
.\" Copyright (c) 2006, Sun Microsystems, Inc.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ddi_iopb_alloc 9F "04 Apr 2006" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
ddi_iopb_alloc, ddi_iopb_free \- allocate and free non-sequentially
accessed memory
.SH SYNOPSIS
.LP
.nf
#include <sys/ddi.h>
#include <sys/sunddi.h>

\fBint\fR \fBddi_iopb_alloc\fR(\fBdev_info_t *\fIdip\fR, \fBddi_dma_lim_t *\fIlimits\fR,
     \fBuint_t\fR \fIlength\fR, \fBcaddr_t *\fIiopbp\fR);
.fi

.LP
.nf
\fBvoid\fR \fBddi_iopb_free\fR(\fBcaddr_t\fR \fIiopb\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
These interfaces are obsolete. Use \fBddi_dma_mem_alloc\fR(9F) instead of
.BR ddi_iopb_alloc() .
Use
.BR ddi_dma_mem_free (9F)
instead of
.BR ddi_iopb_free() .
.SH PARAMETERS
.SS "\fBddi_iopb_alloc()\fR"
.sp
.ne 2
.mk
.na
.I dip
.ad
.RS 10n
.rt
A pointer to the device's
.B dev_info
structure.
.RE

.sp
.ne 2
.mk
.na
.I limits
.ad
.RS 10n
.rt
A pointer to a
.B DMA
limits structure for this device (see
.BR ddi_dma_lim_sparc (9S)
or \fBddi_dma_lim_x86\fR(9S)). If this pointer
is
.IR NULL ,
a default set of
.B DMA
limits is assumed.
.RE

.sp
.ne 2
.mk
.na
.I length
.ad
.RS 10n
.rt
The length in bytes of the desired allocation.
.RE

.sp
.ne 2
.mk
.na
.I iopbp
.ad
.RS 10n
.rt
A pointer to a
.BR caddr_t .
On a successful return,
.I *iopbp
points
to the allocated storage.
.RE

.SS "\fBddi_iopb_free()\fR"
.sp
.ne 2
.mk
.na
.I iopb
.ad
.RS 8n
.rt
The
.I iopb
returned from a successful call to
.BR ddi_iopb_alloc() .
.RE

.SH DESCRIPTION
.sp
.LP
The
.B ddi_iopb_alloc()
function allocates memory for
.BR DMA
transfers and should be used if the device accesses memory in a
non-sequential fashion, or if synchronization steps using
.BR ddi_dma_sync (9F)
should be as lightweight as possible, due to frequent
use on small objects. This type of access is commonly known as
.I consistent
access. The allocation will obey the alignment and padding
constraints as specified in the
.I limits
argument and other limits
imposed by the system.
.sp
.LP
Note that you still must use
.B DMA
resource allocation functions (see
.BR ddi_dma_setup (9F))
to establish
.B DMA
resources for the memory
allocated using
.BR ddi_iopb_alloc() .
.sp
.LP
In order to make the view of a memory object shared between a
.B CPU
and
a
.B DMA
device consistent, explicit synchronization steps using
.BR ddi_dma_sync (9F)
or \fBddi_dma_free\fR(9F) are still required. The
.B DMA
resources will be allocated so that these synchronization steps
are as efficient as possible.
.sp
.LP
The
.B ddi_iopb_free()
function frees up memory allocated by
.BR ddi_iopb_alloc() .
.SH RETURN VALUES
.sp
.LP
The
.B ddi_iopb_alloc()
function returns:
.sp
.ne 2
.mk
.na
.B DDI_SUCCESS
.ad
.RS 15n
.rt
Memory successfully allocated.
.RE

.sp
.ne 2
.mk
.na
.B DDI_FAILURE
.ad
.RS 15n
.rt
Allocation failed.
.RE

.SH CONTEXT
.sp
.LP
These functions can be called from user, interrupt, or kernel context.
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for a description of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Stability LevelObsolete
.TE

.SH SEE ALSO
.sp
.LP
.BR attributes (5),
.BR ddi_dma_free (9F),
.BR ddi_dma_mem_alloc (9F),
.BR ddi_dma_mem_free (9F),
.BR ddi_dma_setup (9F),
.BR ddi_dma_sync (9F),
.BR ddi_mem_alloc (9F),
.BR ddi_dma_lim_sparc (9S),
.BR ddi_dma_lim_x86 (9S),
.BR ddi_dma_req (9S)
.sp
.LP
.I Writing Device Drivers
.SH NOTES
.sp
.LP
This function uses scarce system resources. Use it selectively.
