usr/src/man/man9f/ddi_fm_service_impact.9f
'\" te
.\" Copyright (c) 2007, Sun Microsystems, Inc. All Rights Reserved.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ddi_fm_service_impact 9F "14 May 2007" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
ddi_fm_service_impact \- report the impact of an error
.SH SYNOPSIS
.LP
.nf
#include <sys/ddifm.h>

\fBvoid\fR \fBddi_fm_service_impact\fR(\fBdev_info_t\fR *\fIdip\fR, \fBint\fR *\fIimpact\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI)
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I dip
.ad
.RS 10n
.rt
Pointer to the \fBdev_info\fR structure
.RE

.sp
.ne 2
.mk
.na
.I impact
.ad
.RS 10n
.rt
Impact of error
.RE

.SH DESCRIPTION
.sp
.LP
The following service impact values are accepted by
.BR ddi_fm_service_impact() :
.sp
.ne 2
.mk
.na
.B DDI_SERVICE_LOST
.ad
.RS 26n
.rt
The service provided by the device is unavailable due to an error. The
operational state of the device will transition to
.BR DEVI_DEVICE_DOWN .
.RE

.sp
.ne 2
.mk
.na
.B DDI_SERVICE_DEGRADED
.ad
.RS 26n
.rt
The driver is unable to provide normal service, but it can provide a
partial or degraded level of service. The driver might have to make repeated
attempts to perform an operation before it succeeds, or it may be running at
less than its configured speed. A driver may use this value to indicate that
an alternative device should be used if available, but that it can continue
operation if no alternative exists. The operational state of the device will
transition to
.BR DEVI_DEVICE_DEGRADED .
.RE

.sp
.ne 2
.mk
.na
.B DDI_SERVICE_RESTORED
.ad
.RS 26n
.rt
The service provided by the device has been restored. The operational state
of the device will transition to its pre-error condition state and
\fBDEVI_DEVICE_DOWN\fR or \fBDEVI_DEVICE_DEGRADED\fR is removed.
.RE

.sp
.ne 2
.mk
.na
.B DDI_SERVICE_UNAFFECTED
.ad
.RS 26n
.rt
The service provided by the device was unaffected by the error.
.RE

.SH CONTEXT
.sp
.LP
The \fBddi_fm_service_impact()\fR function can be called from user, kernel,
or high-level interrupt context.
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
.BR fmd (1M),
.BR attributes (5),
.BR ddi_fm_ereport_post (9F),
.BR pci_ereport_post (9F)
