usr/src/man/man9f/ddi_getiminor.9f
'\" te
.\" Copyright (c) 2004, Sun Microsystems, Inc.
.\"  All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ddi_getiminor 9F "18 Nov 2004" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
ddi_getiminor \- get kernel internal minor number from an external dev_t
.SH SYNOPSIS
.LP
.nf
#include <sys/types.h>
#include <sys/mkdev.h>
#include <sys/ddi.h>



\fBminor_t\fR \fBddi_getiminor\fR(\fBdev_t\fR \fIdev\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
This interface is obsolete.
.BR getminor (9F)
should be used instead.
.SH PARAMETERS
.sp
.LP
The following parameters are supported:
.sp
.ne 2
.mk
.na
.I dev
.ad
.RS 7n
.rt
Device number.
.RE

.SH DESCRIPTION
.sp
.LP
.B ddi_getiminor()
extracts the minor number from a device number. This
call should be used only for device numbers that have been passed to the
kernel from the user space through opaque interfaces such as the contents of
.BR ioctl (9E)
and
.BR putmsg (2).
The device numbers passed in using
standard device entry points must continue to be interpreted using the
.BR getminor (9F)
interface. This new interface is used to translate
between user visible device numbers and in kernel device numbers. The two
numbers may differ in a clustered system.
.sp
.LP
For certain bus types, you can call this
.B DDI
function from a
high-interrupt context.  These types include
.B ISA
and SBus buses.  See
.BR sysbus (4),
.BR isa (4),
and
.BR sbus (4)
for details.
.SH CONTEXT
.sp
.LP
.B ddi_getiminor()
can be called from user context only.
.SH RETURN VALUES
.sp
.LP
The minor number or
.B EMINOR_UNKNOWN
if the minor number of the device
is invalid.
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for a description of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
\fBATTRIBUTE TYPE\fR\fBATTRIBUTE VALUE\fR
_
Stability LevelObsolete
.TE

.SH SEE ALSO
.sp
.LP
.BR attributes (5),
.BR getmajor (9F),
.BR getminor (9F),
.BR makedevice (9F)
.sp
.LP
.I Writing Device Drivers
.SH WARNINGS
.sp
.LP
Drivers are required to replace calls to
.B ddi_getminor.9f
by
.BR getminor (9F))
in order to compile under Solaris 10 and later
versions.
