usr/src/man/man9f/ddi_report_dev.9f
'\" te
.\" Copyright (c) 1993, Sun Microsystems, Inc.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ddi_report_dev 9F "7 Jun 1993" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
ddi_report_dev \- announce a device
.SH SYNOPSIS
.LP
.nf
#include <sys/conf.h>
#include <sys/ddi.h>
#include <sys/sunddi.h>



\fBvoid\fR \fBddi_report_dev\fR(\fBdev_info_t *\fIdip\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI).
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I dip
.ad
.RS 8n
.rt
a pointer the device's
.B dev_info
structure.
.RE

.SH DESCRIPTION
.sp
.LP
.B ddi_report_dev()
prints a banner at boot time,  announcing the device
pointed to by
.IR dip .
The banner is always placed in the system logfile
(displayed by \fBdmesg\fR(1M)), but is only displayed on the console if the
system was booted with the verbose (\fB-v\fR) argument.
.SH CONTEXT
.sp
.LP
.B ddi_report_dev()
can be called from user context.
.SH SEE ALSO
.sp
.LP
.BR dmesg (1M),
.BR kernel (1M)
.sp
.LP
.I Writing Device Drivers
