usr/src/man/man9f/ddi_iomin.9f
'\" te
.\" Copyright (c) 2006, Sun Microsystems, Inc.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ddi_iomin 9F "04 Apr 2006" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
ddi_iomin \- find minimum alignment and transfer size for DMA
.SH SYNOPSIS
.LP
.nf
#include <sys/conf.h>
#include <sys/ddi.h>
#include <sys/sunddi.h>



\fBint\fR \fBddi_iomin\fR(\fBdev_info_t *\fIdip\fR, \fBint\fR \fIinitial\fR, \fBint\fR \fIstreaming\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI). This interface is obsolete.
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I dip
.ad
.RS 13n
.rt
A pointer to the device's
.B dev_info
structure.
.RE

.sp
.ne 2
.mk
.na
.I initial
.ad
.RS 13n
.rt
The initial minimum
.BR DMA transfer
size in bytes. This may be zero or an
.RB "appropriate " dlim_minxfer " value for device's " ddi_dma_lim 
structure (see
.BR ddi_dma_lim_sparc (9S)
or
.BR ddi_dma_lim_x86 (9S)).
This value must be a power of two.
.RE

.sp
.ne 2
.mk
.na
.I streaming
.ad
.RS 13n
.rt
This argument, if non-zero, indicates that the returned value should be
modified to account for
.I streaming
mode accesses (see
.BR ddi_dma_req (9S)
for a discussion of streaming versus non-streaming
access mode).
.RE

.SH DESCRIPTION
.sp
.LP
The
.B ddi_iomin()
function, finds out the minimum
.BR DMA transfer
size for the device pointed to by
.IR dip .
This provides a mechanism by
which a driver can determine the effects of underlying caches as well as
intervening bus adapters on the granularity of a DMA transfer.
.SH RETURN VALUES
.sp
.LP
The
.B ddi_iomin()
function returns the minimum
.BR DMA transfer
size
for the calling device, or it returns zero, which means that you cannot get
there from here.
.SH CONTEXT
.sp
.LP
This function can be called from user, interrupt, or kernel context.
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityObsolete
.TE

.SH SEE ALSO
.sp
.LP
.BR ddi_dma_devalign (9F),
.BR ddi_dma_setup (9F),
.BR ddi_dma_sync (9F),
.BR ddi_dma_lim_sparc (9S),
.BR ddi_dma_lim_x86 (9S),
.BR ddi_dma_req (9S)
.sp
.LP
.I Writing Device Drivers
