usr/src/man/man9f/ddi_dma_nextwin.9f
'\" te
.\" Copyright (c) 2006, Sun Microsystems, Inc.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ddi_dma_nextwin 9F "16 Jan 2006" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
ddi_dma_nextwin \- get next DMA window
.SH SYNOPSIS
.LP
.nf
#include <sys/ddi.h>
#include <sys/sunddi.h>



\fBint\fR \fBddi_dma_nextwin\fR(\fBddi_dma_handle_t\fR \fIhandle\fR, \fBddi_dma_win_t\fR \fIwin\fR,
     \fBddi_dma_win_t *\fInwin\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
This interface is obsolete.
.BR ddi_dma_getwin (9F)
should be used
instead.
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I handle
.ad
.RS 10n
.rt
A
.B DMA
handle.
.RE

.sp
.ne 2
.mk
.na
.I win
.ad
.RS 10n
.rt
The current
.B DMA
window or
.IR NULL .
.RE

.sp
.ne 2
.mk
.na
.I nwin
.ad
.RS 10n
.rt
A pointer to the next
.B DMA
window to be filled in. If
.I win
is
.IR NULL ,
a pointer to the first window within the object is returned.
.RE

.SH DESCRIPTION
.sp
.LP
The
.B ddi_dma_nextwin()
function shifts the current
.B DMA
window
.I win
within the object referred to by
.I handle
to the next
.B DMA
window
.IR nwin .
If the current window is
.IR NULL ,
the first
window within the object is returned. A
.B DMA
window is a portion of a
.B DMA
object or might be the entire object. A
.B DMA
window has
system resources allocated to it and is prepared to accept data transfers.
Examples of system resources are
.B DVMA
mapping resources and
intermediate transfer buffer resources.
.sp
.LP
All
.B DMA
objects require a window. If the
.B DMA
window represents
the whole
.B DMA
object it has system resources allocated for the entire
data transfer. However, if the system is unable to setup the entire
.B DMA
object due to system resource limitations, the driver writer may
allow the system to allocate system resources for less than the entire
.B DMA
object. This can be accomplished by specifying the
.B DDI_DMA_PARTIAL
flag as a parameter to
.BR ddi_dma_buf_setup (9F)
or
.BR ddi_dma_addr_setup (9F)
or as part of a
.BR ddi_dma_req "(9S) structure"
in a call to
.BR ddi_dma_setup (9F).
.sp
.LP
Only the window that has resources allocated is valid per object at any one
time. The currently valid window is the one that was most recently returned
from
.BR ddi_dma_nextwin() .
Furthermore, because a call to
.B ddi_dma_nextwin()
will reallocate system resources to the new window,
the previous window will become invalid. It is a
.B severe
error to call
.B ddi_dma_nextwin()
before any transfers into the current window are
complete.
.sp
.LP
The
.B ddi_dma_nextwin()
function takes care of underlying memory
synchronizations required to shift the window. However, if you want to
access the data before or after moving the window, further synchronizations
using
.BR ddi_dma_sync "(9F) are required."
.SH RETURN VALUES
.sp
.LP
The
.B ddi_dma_nextwin()
function returns:
.sp
.ne 2
.mk
.na
.B DDI_SUCCESS
.ad
.RS 17n
.rt
Successfully filled in the next window pointer.
.RE

.sp
.ne 2
.mk
.na
.B DDI_DMA_DONE
.ad
.RS 17n
.rt
There is no next window. The current window is the final window within the
specified object.
.RE

.sp
.ne 2
.mk
.na
.B DDI_DMA_STALE
.ad
.RS 17n
.rt
.I win
does not refer to the currently active window.
.RE

.SH CONTEXT
.sp
.LP
The
.B ddi_dma_nextwin()
function can be called from user, interrupt, or
kernel context.
.SH EXAMPLES
.sp
.LP
For an example see
.BR ddi_dma_segtocookie (9F).
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for a description of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
\fBATTRIBUTE TYPE\fR\fBATTRIBUTE VALUE\fR
_
Stability LevelObsolete
.TE

.SH SEE ALSO
.sp
.LP
.BR attributes (5),
.BR ddi_dma_addr_setup (9F),
.BR ddi_dma_buf_setup (9F),
.BR ddi_dma_getwin (9F),
.BR ddi_dma_nextseg (9F),
.BR ddi_dma_segtocookie (9F),
.BR ddi_dma_sync (9F),
.BR ddi_dma_req (9S)
.sp
.LP
.I Writing Device Drivers
