usr/src/man/man9f/ddi_get_time.9f
'\" te
.\" Copyright (c) 2000, Sun Microsystems, Inc.
.\"  All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ddi_get_time 9F "18 Feb 1998" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
ddi_get_time \- returns the current time in seconds
.SH SYNOPSIS
.LP
.nf
#include <sys/types.h>
#include <sys/ddi.h>
#include <sys/sunddi.h>



\fBtime_t\fR \fBddi_get_time\fR(\fBvoid\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI).
.SH DESCRIPTION
.sp
.LP
.B ddi_get_time()
returns the current time in seconds since 00:00:00
UTC, January 1, 1970. This value can be used to set of wait or expiration
intervals.
.SH RETURN VALUES
.sp
.LP
.B ddi_get_time()
returns the time in seconds.
.SH CONTEXT
.sp
.LP
 This routine can be called from any context.
.SH SEE ALSO
.sp
.LP
.BR ddi_get_lbolt (9F),
.BR drv_getparm (9F),
.BR drv_usectohz (9F)
.sp
.LP
.I Writing Device Drivers
.sp
.LP
 \fISTREAMS Programming Guide\fR
