usr/src/man/man9f/ddi_in_panic.9f
'\" te
.\" Copyright (c) 2000, Sun Microsystems, Inc.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ddi_in_panic 9F "23 Jun 1997" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
ddi_in_panic \- determine if system is in panic state
.SH SYNOPSIS
.LP
.nf
#include <sys/ddi.h>
#include <sys/sunddi.h>



\fBint\fR \fBddi_in_panic\fR(\fBvoid\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI).
.SH DESCRIPTION
.sp
.LP
Drivers controlling devices on which the system may write a kernel crash dump
in the event of a panic can call
.B ddi_in_panic()
to determine if the
system is panicking.
.sp
.LP
When the system is panicking, the calls of functions scheduled by
.BR timeout (9F)
and \fBddi_trigger_softintr\fR(9F) will never occur. Neither
can
.BR delay "(9F) be relied upon, since it is implemented via"
.BR timeout (9F).
.sp
.LP
Drivers that need to enforce a time delay such as
.B SCSI
bus reset delay
time must busy-wait when the system is panicking.
.SH RETURN VALUES
.sp
.LP
.B ddi_in_panic()
returns
.B 1
if the system is in panic,  or
.B 0
otherwise.
.SH CONTEXT
.sp
.LP
.B ddi_in_panic()
may be called from any context.
.SH SEE ALSO
.sp
.LP
.BR dump (9E),
.BR delay (9F),
.BR ddi_trigger_softintr (9F),
.BR timeout (9F)
.sp
.LP
.I Writing Device Drivers
