usr/src/man/man9f/dlbindack.9f
'\" te
.\" Copyright (c) 2006, Sun Microsystems, Inc.  All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH dlbindack 9F "16 Jan 2006" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
dlbindack, dlphysaddrack, dlokack, dlerrorack, dluderrorind \- DLPI device
driver helper functions
.SH SYNOPSIS
.LP
.nf
#include <sys/dlpi.h>



\fBvoid\fR \fBdlokack\fR(\fBqueue_t *\fIwq\fR, \fBmblk_t *\fImp\fR, \fBt_uscalar_t\fR \fIcorrect_primitive\fR);
.fi

.LP
.nf
\fBvoid\fR \fBdlerrorack\fR(\fBqueue_t *\fIwq\fR, \fBmblk_t *\fImp\fR, \fBt_uscalar_t\fR \fIerror_primitive\fR,
     \fBt_uscalar_t\fR \fIerror\fR, \fBt_uscalar_t\fR \fIunix_errno\fR);
.fi

.LP
.nf
\fBvoid\fR \fBdlbindack\fR(\fBqueue_t *\fIwq\fR, \fBmblk_t *\fImp\fR, \fBt_scalar_t\fR \fIsap\fR, \fBconst void *\fIaddrp\fR,
     \fBt_uscalar_t\fR \fIaddrlen\fR, \fBt_uscalar_t\fR \fImaxconind\fR, \fB t_uscalar_t\fR \fIxidtest\fR);
.fi

.LP
.nf
\fBvoid\fR \fBdlphysaddrack\fR(\fBqueue_t *\fIwq\fR, \fBmblk_t *\fImp\fR, \fBconst void *\fIaddrp\fR,
     \fBt_uscalar_t\fR \fIaddrlen\fR);
.fi

.LP
.nf
\fBvoid\fR \fBdluderrorind\fR(\fBqueue_t *\fIwq\fR, \fBmblk_t *\fImp\fR, \fBconst void *\fIaddrp\fR,
     \fBt_uscalar_t\fR \fIaddrlen\fR, \fBt_uscalar_t\fR \fIerror\fR, \fBt_uscalar_t\fR \fIunix_errno\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI).
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I wq
.ad
.RS 21n
.rt
Streams write queue.
.RE

.sp
.ne 2
.mk
.na
.I mp
.ad
.RS 21n
.rt
Pointer to the bind request message.
.RE

.sp
.ne 2
.mk
.na
.I sap
.ad
.RS 21n
.rt
Service access point being requested.
.RE

.sp
.ne 2
.mk
.na
.I addrp
.ad
.RS 21n
.rt
Pointer to the dlpi layer source address.
.RE

.sp
.ne 2
.mk
.na
.I addrlen
.ad
.RS 21n
.rt
Size of the
.B dlpi
layer address pointed to by
.IR addr .
.RE

.sp
.ne 2
.mk
.na
.I maxconind
.ad
.RS 21n
.rt
Maximum number of
.B DL_CONNECT_IND
messages allowed to be outstanding
per stream.
.RE

.sp
.ne 2
.mk
.na
.I xidtest
.ad
.RS 21n
.rt
The
.B XID
and
.B TEST
responses supported.
.RE

.sp
.ne 2
.mk
.na
.I correct_primitive
.ad
.RS 21n
.rt
Identifies the
.B DL
primitive completing successfully.
.RE

.sp
.ne 2
.mk
.na
.I error_primitive
.ad
.RS 21n
.rt
Identifies the
.B DL
primitive in error.
.RE

.sp
.ne 2
.mk
.na
.I error
.ad
.RS 21n
.rt
\fBDLPI\fR error associated with the failure in the \fBDLPI\fR request.
.RE

.sp
.ne 2
.mk
.na
.I unix_errno
.ad
.RS 21n
.rt
Corresponding
.B UNIX
system error that can be associated with the
failure in the
.B DLPI
request.
.RE

.SH DESCRIPTION
.sp
.LP
All functions described in this manpage take a pointer to the message
passed to the
.B DLPI
provider (\fBmblk_t\fR) and attempt to reuse it in
formulating the
.B M_PROTO
reply. If the message block is too small to be
reused, it is freed and a new one is allocated.
.sp
.LP
All functions reply upstream using
.BR qreply "(9F). The write-side queue"
pointer must be provided.
.sp
.LP
The
.B dlokack()
function provides the successfull acknowledgement
\fBDL_OK_ACK\fR message reply to the \fBDLPI\fR provider and is used to
complete many of the
.B DLPI
requests in the
.B DLPI
consumer.
.sp
.LP
The
.B dlerrorack()
function provides the unsuccessfull acknowledgement
\fBDL_ERROR_ACK\fR message reply to the
.BR DLPI ()
provider and is used
for error completions were required for
.B DLPI
requests in the
\fBDLPI\fR consumer.
.sp
.LP
The
.B dlbindack()
function provides the
.B DL_BIND_ACK
message reply
to the
.B DLPI
provider and is used to complete the
.BR DL_BIND_REQ
processing in the
.B DLPI
consumer.
.sp
.LP
The
.B dlphysaddrack()
function provides the
\fR()\fBDL_PHYS_ADDR_ACK\fR message reply used to complete the
\fBDL_PHYS_ADDR_ACK\fR processing.
.sp
.LP
The
.B dluderrorind()
function provides the
.B DL_UDERROR_IND
message
reply used to complete an unsuccessful
.BR DL_UNITDATA_REQ .
.SH RETURN VALUES
.sp
.LP
None.
.SH NOTES
.sp
.LP
These functions are not required if you are are writing a
.B DLPI
device
driver using
.BR gld (7D).
.SH CONTEXT
.sp
.LP
All
.B DLPI
helper functions can be called from user, interrupt, or
kernel context.
.SH SEE ALSO
.sp
.LP
.BR gld (7D),
.BR dlpi (7P),
.BR qreply (9F)
.sp
.LP
.I Writing Device Drivers
.sp
.LP
.I STREAMS Programming Guide
