usr/src/man/man9f/drv_usectohz.9f
'\" te
.\" Copyright (c) 2008, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" Copyright 1989 AT&T
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH drv_usectohz 9F "24 Apr 2008" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
drv_usectohz \- convert microseconds to clock ticks
.SH SYNOPSIS
.LP
.nf
#include <sys/types.h>
#include <sys/ddi.h>



\fBclock_t\fR \fBdrv_usectohz\fR(\fBclock_t\fR \fImicrosecs\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Architecture independent level 1 (DDI/DKI).
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I microsecs
.ad
.RS 13n
.rt
The number of microseconds to convert.
.RE

.SH DESCRIPTION
.sp
.LP
The
.B drv_usectohz()
function converts a length of time expressed in
microseconds to a number of system clock ticks. The time arguments to
.BR timeout (9F)
and
.BR delay "(9F) are expressed in clock ticks."
.sp
.LP
The
.B drv_usectohz()
function is a portable interface for drivers to
make calls to
.BR timeout "(9F) and"
.BR delay (9F)
and remain binary
compatible should the driver object file be used on a system with a
different clock speed (a different number of ticks in a second).
.SH RETURN VALUES
.sp
.LP
The value returned is the number of system clock ticks equivalent to the
.I microsecs
argument. No error value is returned. If the clock tick
equivalent to
.I microsecs
is too large to be represented as a
.BR clock_t ,
then the maximum
.B clock_t
value will be returned.
.SH CONTEXT
.sp
.LP
The
.B drv_usectohz()
function can be called from user, interrupt, or
kernel context.
.SH SEE ALSO
.sp
.LP
.BR delay (9F),
.BR drv_hztousec (9F),
.BR timeout (9F)
.sp
.LP
.I Writing Device Drivers
.SH NOTES
.sp
.LP
If the
.I microsecs
argument to
.B drv_usectohz()
is less than
.BR drv_hztousec (9F),
.B drv_usectohz()
returns one tick. This, coupled
with multiplication, can result in significantly longer durations than
expected. For example, on a machine where
.B hz
is 100, calling
.B drv_usectohz()
with a
.I microsecs
value less than 10000 returns a
result equivalent to 10000 (1 tick). This type of mistake causes code such
as"5000 * drv_usectohz(1000)" to compute a duration of 50 seconds instead of
the intended 5 seconds.
