usr/src/man/man9f/dupmsg.9f
'\" te
.\" Copyright 1989 AT&T
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH dupmsg 9F "11 Apr 1991" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
dupmsg \- duplicate a message
.SH SYNOPSIS
.LP
.nf
#include <sys/stream.h>



\fBmblk_t *\fBdupmsg\fR(\fBmblk_t *\fImp\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Architecture independent level 1 (DDI/DKI).
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I mp
.ad
.RS 7n
.rt
Pointer to the message.
.RE

.SH DESCRIPTION
.sp
.LP
.B dupmsg()
forms a new message by copying the message block descriptors
pointed to by
.I mp
and linking them. \fBdupb\fR(9F) is called for each
message block. The data blocks themselves are not duplicated.
.SH RETURN VALUES
.sp
.LP
If successful,
.B dupmsg()
returns a pointer to the new message block.
Otherwise, it returns a
.I NULL
pointer. A return value of  \fINULL\fR
indicates either memory depletion or the data block reference count,
.B db_ref
(see \fBdatab\fR(9S)), has reached a limit
.RB ( 255 ).
See
.BR dupb (9F).
.SH CONTEXT
.sp
.LP
.B dupmsg()
can be called from user, kernel, or interrupt context.
.SH EXAMPLES
.LP
.B Example 1
Using
.BR dupmsg()
.sp
.LP
See \fBcopyb\fR(9F) for an example using
.BR dupmsg() .

.SH SEE ALSO
.sp
.LP
.BR copyb (9F),
.BR copymsg (9F),
.BR dupb (9F),
.BR datab (9S)
.sp
.LP
.I Writing Device Drivers
.sp
.LP
.I STREAMS Programming Guide
