usr/src/man/man9f/esballoc.9f
'\" te
.\" Copyright 1989 AT&T
.\" Copyright (C) 2006, Sun Microsystems, Inc. All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH esballoc 9F "16 Jan 2006" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
esballoc, desballoc \- allocate a message block using a caller-supplied
buffer
.SH SYNOPSIS
.LP
.nf
#include <sys/stream.h>



\fBmblk_t *\fBesballoc\fR(\fBuchar_t *\fIbase\fR, \fBsize_t\fR \fIsize\fR, \fBuint_t\fR \fIpri\fR,
     \fBfrtn_t *\fIfr_rtnp\fR);
.fi

.LP
.nf
\fBmblk_t *\fBdesballoc\fR(\fBuchar_t *\fIbase\fR, \fBsize_t\fR \fIsize\fR, \fBuint_t\fR \fIpri\fR,
     \fBfrtn_t *\fIfr_rtnp\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
.BR esballoc() :
Architecture independent level 1 (DDI/DKI)
.sp
.LP
.BR desballoc() :
Solaris DDI specific (Solaris DDI)
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I base
.ad
.RS 11n
.rt
Address of caller-supplied data buffer.
.RE

.sp
.ne 2
.mk
.na
.I size
.ad
.RS 11n
.rt
Number of bytes in data buffer.
.RE

.sp
.ne 2
.mk
.na
.I pri
.ad
.RS 11n
.rt
Priority of the request (no longer used).
.RE

.sp
.ne 2
.mk
.na
.I fr_rtnp
.ad
.RS 11n
.rt
Free routine data structure.
.RE

.SH DESCRIPTION
.sp
.LP
The
.B esballoc()
and
.B desballoc()
functions operate identically to
.BR allocb (9F),
except that the data buffer to associate with the message
is specified by the caller. The allocated message will have both the
.B b_wptr
and
.B b_rptr
set to the supplied data buffer starting at
.IR base .
Only the buffer itself can be specified by the caller. The
message block and data block header are allocated as if by
.BR allocb (9F).
.sp
.LP
When \fBfreeb\fR(9F) is called to free the message, the driver's
message-freeing routine, referenced through the \fBfree_rtn\fR(9S)
structure, is called with appropriate arguments to free the data buffer.
.sp
.LP
The \fBfree_rtn\fR(9S) structure includes the following members:
.sp
.in +2
.nf
void (*free_func)();     /* caller's freeing routine */
caddr_t free_arg;        /* argument to free_func() */
.fi
.in -2

.sp
.LP
Instead of requiring a specific number of arguments, the \fBfree_arg\fR
field is defined of type
.BR caddr_t .
This way, the driver can pass a
pointer to a structure if more than one argument is needed.
.sp
.LP
If
.B esballoc()
was used, then
.B free_func
will be called
asynchronously at some point after the message is no longer referenced. If
.B desballoc()
was used, then
.B free_func
will be called
synchronously by the thread releasing the final reference. See
.BR freeb (9F).
.sp
.LP
The
.B free_func
routine must not sleep, and must not access any
dynamically allocated data structures that could be freed before or during
its execution. In addition, because messages allocated with
.B desballoc()
are freed in the context of the caller, \fBfree_func\fR
must not call another module's
.B put
procedure, or attempt to acquire a
private module lock which might be held by another thread across a call to a
STREAMS utility routine that could free a message block. Finally,
.B free_func
routines specified using
.B desballoc
may run in
interrupt context and thus must only use synchronization primitives that
include an interrupt priority returned from
.BR ddi_intr_get_pri "(9F) or"
.BR ddi_intr_get_softint_pri (9F).
If any of these restrictions are not
followed, the possibility of lock recursion or deadlock exists.
.SH RETURN VALUES
.sp
.LP
On success, a pointer to the newly allocated message block is returned. On
failure,
.B NULL
is returned.
.SH CONTEXT
.sp
.LP
The
.B esballoc()
and
.B desballoc()
functions can be called from
user, interrupt, or kernel context.
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
.BR allocb (9F),
.BR ddi_intr_get_pri (9F),
.BR ddi_intr_get_softint_pri (9F),
.BR freeb (9F),
.BR datab (9S),
.BR free_rtn (9S)
.sp
.LP
.I Writing Device Drivers
.sp
.LP
.I STREAMS Programming Guide
