usr/src/man/man9f/flushband.9f
'\" te
.\" Copyright (c) 2006, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" Copyright 1989 AT&T
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH flushband 9F "16 Jan 2006" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
flushband \- flush messages for a specified priority band
.SH SYNOPSIS
.LP
.nf
#include <sys/stream.h>



\fBvoid\fR \fBflushband\fR(\fBqueue_t\fR \fI*q\fR, \fBunsigned char\fR \fIpri\fR, \fBint\fR \fIflag\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Architecture independent level 1 (DDI/DKI).
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I q
.ad
.RS 8n
.rt
Pointer to the queue.
.RE

.sp
.ne 2
.mk
.na
.I pri
.ad
.RS 8n
.rt
Priority of messages to be flushed.
.RE

.sp
.ne 2
.mk
.na
.I flag
.ad
.RS 8n
.rt
Valid
.I flag
values are:
.RE

.sp
.ne 2
.mk
.na
.B FLUSHDATA
.ad
.RS 13n
.rt
Flush only data messages (types
.B "M_DATA, M_DELAY,"
.B M_PROTO,
and
.B M_PCPROTO
).
.RE

.sp
.ne 2
.mk
.na
.B FLUSHALL
.ad
.RS 13n
.rt
Flush all messages.
.RE

.SH DESCRIPTION
.sp
.LP
The
.B flushband()
function flushes messages associated with the
priority band specified by
.IR pri .
If
.I pri
is
.BR 0 ,
only normal
and high priority messages are flushed. Otherwise, messages are flushed from
the band
.I pri
according to the value of
.IR flag .
.SH CONTEXT
.sp
.LP
The
.B flushband()
function can be called from user, interrupt, or
kernel context.
.SH SEE ALSO
.sp
.LP
.BR flushq (9F)
.sp
.LP
.I "Writing Device Drivers" STREAMS Programming Guide
