usr/src/man/man9f/freeb.9f
'\" te
.\" Copyright (c) 2006 Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" Copyright 1989 AT&T
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH freeb 9F "16 Jan 2006" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
freeb \- free a message block
.SH SYNOPSIS
.LP
.nf
#include <sys/stream.h>



\fBvoid\fR \fBfreeb\fR(\fBmblk_t *\fIbp\fR);
.fi

.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I bp
.ad
.RS 6n
.rt
Pointer to the message block to be deallocated.
.B mblk_t
is an instance
of the
.BR msgb "(9S) structure."
.RE

.SH INTERFACE LEVEL
.sp
.LP
Architecture independent level 1 (DDI/DKI).
.SH DESCRIPTION
.sp
.LP
The
.B freeb()
function deallocates a message block. If the reference
count of the
.B db_ref
member of the
.BR datab (9S)
structure is greater
than
.BR 1 ,
.B freeb()
decrements the count. If
.B db_ref
equals
.BR 1 ,
it deallocates the message block and the corresponding data block
and buffer.
.sp
.LP
If the data buffer to be freed was allocated with the
.BR esballoc (9F),
the buffer may be a non-STREAMS resource. In that case, the driver must be
notified that the attached data buffer needs to be freed, and run its own
freeing routine. To make this process independent of the driver used in the
.RB "stream, " freeb() " finds the " free_rtn (9S)
structure associated with
the buffer. The
.B free_rtn
structure contains a pointer to the
driver-dependent routine, which releases the buffer. Once this is
accomplished,
.B freeb()
releases the
.B STREAMS
resources associated
with the buffer.
.SH CONTEXT
.sp
.LP
The
.B freeb()
function can be called from user, interrupt, or kernel
context.
.SH EXAMPLES
.LP
.B Example 1
Using
.B freeb()
.sp
.LP
See
.BR copyb (9F)
for an example of using \fBfreeb()\fR.

.SH SEE ALSO
.sp
.LP
.BR allocb (9F),
.BR copyb (9F),
.BR dupb (9F),
.BR esballoc (9F),
.BR free_rtn (9S)
.sp
.LP
.I Writing Device Drivers
.sp
.LP
.I STREAMS Programming Guide
