usr/src/man/man9f/getrbuf.9f
'\" te
.\" Copyright 1989 AT&T
.\" Copyright (c) 2006 Sun Microsystems, Inc.  All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH getrbuf 9F "16 Jan 2006" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
getrbuf \- get a raw buffer header
.SH SYNOPSIS
.LP
.nf
#include <sys/buf.h>
#include <sys/kmem.h>
#include <sys/ddi.h>



\fBstruct buf *\fBgetrbuf\fR(\fBint\fR \fIsleepflag\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Architecture independent level 1 (DDI/DKI).
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I sleepflag
.ad
.RS 13n
.rt
Indicates whether driver should sleep for free space.
.RE

.SH DESCRIPTION
.sp
.LP
The
.B getrbuf()
function allocates the space for a buffer header to the
caller. It is used in cases where a block driver is performing raw
(character interface) I/O and needs to set up a buffer header that is not
associated with the buffer cache.
.sp
.LP
.RB "The " getrbuf() " function calls " kmem_alloc (9F)
to perform the
memory allocation.
.BR kmem_alloc() requires
the information included in
.RI "the " sleepflag " argument. If " sleepflag " is set to"
.BR KM_SLEEP ,
the driver may sleep until the space is freed up. If
.I sleepflag
is set
to
.BR KM_NOSLEEP ,
the driver will not sleep.  In either case, a pointer
to the allocated space is returned or
.B NULL
to indicate that no space
was available.
.SH RETURN VALUES
.sp
.LP
The
.B getrbuf()
function returns a pointer to the allocated buffer
header, or
.B NULL
if no space is available.
.SH CONTEXT
.sp
.LP
The
.B getrbuf()
function can be called from user, interrupt, or kernel
context. (Drivers must not allow
.B getrbuf()
to sleep if called from an
interrupt routine.)
.SH SEE ALSO
.sp
.LP
.BR bioinit (9F),
.BR freerbuf (9F),
.BR kmem_alloc (9F),
.BR kmem_free (9F)
.sp
.LP
.I Writing Device Drivers
