usr/src/man/man9f/hat_getkpfnum.9f
'\" te
.\" Copyright (c) 2004, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" Copyright 1989 AT&T
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH hat_getkpfnum 9F "13 June 2004" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
hat_getkpfnum \- get page frame number for kernel address
.SH SYNOPSIS
.LP
.nf
#include <sys/types.h>
#include <sys/ddi.h>
#include <sys/sunddi.h>

\fBpfn_t\fR \fBhat_getkpfnum\fR(\fBcaddr_t\fR \fIaddr\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
This interface is obsolete. A driver
.BR devmap (9E)
entry point should be
provided instead.
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I addr
.ad
.RS 9n
.rt
The kernel virtual address for which the page frame number is to be
returned.
.RE

.SH DESCRIPTION
.sp
.LP
.B hat_getkpfnum()
returns the page frame number corresponding to the
kernel virtual address,
.IR addr .
.sp
.LP
.I addr
must be a kernel virtual address which maps to device memory.
.BR ddi_map_regs (9F)
can be used to obtain this address. For example,
.BR ddi_map_regs (9F)
can be called in the driver's
.BR attach (9E)
routine. The resulting kernel virtual address can be saved by the driver
(see \fBddi_soft_state\fR(9F)) and used in \fBmmap\fR(9E). The corresponding
.BR ddi_unmap_regs (9F)
call can be made in the driver's
.BR detach (9E)
routine. Refer to \fBmmap\fR(9E) for more information.
.SH RETURN VALUES
.sp
.LP
The page frame number corresponding to the valid, device-mapped virtual
address
.IR addr .
Otherwise the return value is undefined.
.SH CONTEXT
.sp
.LP
.B hat_getkpfnum()
can be called only from user or kernel context.
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface stabilityObsolete
.TE

.SH SEE ALSO
.sp
.LP
.BR attach (9E),
.BR detach (9E),
.BR devmap (9E),
.BR mmap (9E),
.BR ddi_map_regs (9F),
.BR ddi_soft_state (9F),
.BR ddi_unmap_regs (9F)

.sp
.LP
.I Writing Device Drivers
.SH NOTES
.sp
.LP
For some devices, mapping device memory in the driver's
.BR attach (9E)
routine and unmapping device memory in the driver's
.BR detach (9E)
routine
is a sizeable drain on system resources. This is especially true for devices
with a large amount of physical address space. Refer to \fBmmap\fR(9E) for
alternative methods.
