usr/src/man/man9f/insq.9f
'\" te
.\" Copyright (c) 2009, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" Copyright 1989 AT&T
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH insq 9F "23 Mar 2009" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
insq \- insert a message into a queue
.SH SYNOPSIS
.LP
.nf
#include <sys/stream.h>



\fBint\fR \fBinsq\fR(\fBqueue_t *\fIq\fR, \fBmblk_t *\fIemp\fR, \fBmblk_t *\fInmp\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Architecture independent level 1 (DDI/DKI).
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I q
.ad
.RS 7n
.rt
Pointer to the queue containing message
.IR emp .
.RE

.sp
.ne 2
.mk
.na
.I emp
.ad
.RS 7n
.rt
Enqueued message before which the new message is to be inserted.
.B mblk_t
is an instance of the
.BR msgb "(9S) structure."
.RE

.sp
.ne 2
.mk
.na
.I nmp
.ad
.RS 7n
.rt
Message to be inserted.
.RE

.SH DESCRIPTION
.sp
.LP
The
.B insq()
function inserts a message into a queue. The message to be
inserted,
.IR nmp ,
is placed in
.I q
immediately before the message
.IR emp .
If
.I emp
is
.IR NULL ,
the new message is placed at the end of
the queue. The queue class of the new message is ignored. All flow control
parameters are updated. The service procedure is enabled unless
.B QNOENB
is
set.
.SH RETURN VALUES
.sp
.LP
The
.B insq()
function returns
.B 1
on success, and
.B 0
on failure.
.SH CONTEXT
.sp
.LP
The
.B insq()
function can be called from user, interrupt, or kernel
context.
.SH EXAMPLES
.sp
.LP
This routine illustrates the steps a transport provider may take to place
expedited data ahead of normal data on a queue (assume all
.B M_DATA
messages
are converted into
.B "M_PROTO T_DATA_REQ"
.RB "messages). Normal" " T_DATA_REQ"
messages are just placed on the end of the queue (line 16). However, expedited
.B T_EXDATA_REQ
messages are inserted before any normal messages already on
the queue (line 25). If there are no normal messages on the queue,
.B bp
will
be
.I NULL
and we fall out of the
.B for
loop (line 21).
.B insq
acts
like
.BR putq "(9F) in this case."
.sp
.in +2
.nf
 1  #include <sys/stream.h>
 2  #include <sys/tihdr.h>
 3
 4  static int
 5  xxxwput(queue_t *q, mblk_t *mp)
 6  {
 7   union T_primitives *tp;
 8   mblk_t *bp;
 9   union T_primitives *ntp;
10
11   switch (mp->b_datap->db_type) {
12   case M_PROTO:
13        tp = (union T_primitives *)mp->b_rptr;
14        switch (tp->type) {
15        case T_DATA_REQ:
16                putq(q, mp);
17                break;
18
19        case T_EXDATA_REQ:
20              /* Insert code here to protect queue and message block */
21               for (bp = q->q_first; bp; bp = bp->b_next) {
22                  if (bp->b_datap->db_type == M_PROTO) {
23                    ntp = (union T_primitives *)bp->b_rptr;
24                    if (ntp->type != T_EXDATA_REQ)
25                        break;
26                 }
27               }
28               (void)insq(q, bp, mp);
29               /* End of region that must be protected */
30               break;
          . . .
31              }
32    }
33   }
.fi
.in -2

.sp
.LP
When using
.BR insq() ,
you must ensure that the queue and the message block
is not modified by another thread at the same time. You can achieve this either
by using STREAMS functions or by implementing your own locking.
.SH SEE ALSO
.sp
.LP
.BR putq (9F),
.BR rmvq (9F),
.BR msgb (9S)
.sp
.LP
.I Writing Device Drivers
.sp
.LP
.I STREAMS Programming Guide
.SH WARNINGS
.sp
.LP
If
.I emp
is non-\fINULL\fR, it must point to a message on
.I q
or a
system panic could result.
