usr/src/man/man9f/kstat_install.9f
'\" te
.\" Copyright (c) 1994, Sun Microsystems, Inc., All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH kstat_install 9F "26 May 1994" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
kstat_install \- add a fully initialized kstat to the system
.SH SYNOPSIS
.LP
.nf
#include <sys/types.h>
#include <sys/kstat.h>



\fBvoid\fR \fBkstat_install\fR(\fBkstat_t *\fIksp\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI)
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I ksp
.ad
.RS 7n
.rt
Pointer to a fully initialized
.BR kstat "(9S) structure."
.RE

.SH DESCRIPTION
.sp
.LP
.B kstat_install()
is used in conjunction with
.BR kstat_create "(9F) to"
allocate and initialize a
.BR kstat "(9S) structure."
.sp
.LP
After a successful call to
.B kstat_create()
the driver must perform any
necessary initialization of the data section (such as setting the name
fields in a kstat of type
.BR KSTAT_TYPE_NAMED ).
Virtual kstats must have
the
.B ks_data
field set at this time. The provider may also set the
.BR ks_update ,
.BR ks_private ,
and
.B ks_lock
fields if necessary.
.sp
.LP
Once the kstat is completely initialized,
.B kstat_install
is used to
make the kstat accessible to the outside world.
.SH RETURN VALUES
.sp
.LP
None.
.SH CONTEXT
.sp
.LP
.B kstat_install()
can be called from user or kernel context.
.SH EXAMPLES
.LP
.B Example 1
Allocating and Initializing a
.B kstat
Structure
.sp
.LP
The method for allocating and initializing a
.B kstat
structure is
generally as follows:

.sp
.in +2
.nf
kstat_t *ksp;
ksp = kstat_create(module, instance, name, class, type, ndata, flags);
if (ksp) { 	
         /* .\|.\|. provider initialization, if necessary */
       	kstat_install(ksp);
}
.fi
.in -2

.SH SEE ALSO
.sp
.LP
.BR kstat_create (9F),
.BR kstat_delete (9F),
.BR kstat_named_init (9F),
.BR kstat (9S)
.sp
.LP
.I Writing Device Drivers
