usr/src/man/man9f/kstat_named_init.9f
'\" te
.\" Copyright (c) 2006, Sun Microsystems, Inc., All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH kstat_named_init 9F "29 Feb 2008" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
kstat_named_init, kstat_named_setstr \- initialize a named kstat
.SH SYNOPSIS
.LP
.nf
#include <sys/types.h>
#include <sys/kstat.h>



\fBvoid\fR \fBkstat_named_init\fR(\fBkstat_named_t *\fIknp\fR, \fBconst char *\fIname\fR,
     \fBuchar_t\fR \fIdata_type\fR);
.fi

.LP
.nf
\fBvoid\fR \fBkstat_named_setstr\fR(\fBkstat_named_t *\fIknp\fR, \fBconst char *\fIstr\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI)
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I knp
.ad
.RS 13n
.rt
Pointer to a
.BR kstat_named "(9S) structure."
.RE

.sp
.ne 2
.mk
.na
.I name
.ad
.RS 13n
.rt
The name of the statistic.
.RE

.sp
.ne 2
.mk
.na
.I data_type
.ad
.RS 13n
.rt
The type of value. This indicates which field of the
.BR kstat_named (9S)
structure should be used. Valid values are:
.sp
.ne 2
.mk
.na
.B KSTAT_DATA_CHAR
.ad
.RS 24n
.rt
The "\fBchar\fR" field.
.RE

.sp
.ne 2
.mk
.na
.B KSTAT_DATA_LONG
.ad
.RS 24n
.rt
The "\fBlong\fR" field.
.RE

.sp
.ne 2
.mk
.na
.B KSTAT_DATA_ULONG
.ad
.RS 24n
.rt
The "\fBunsigned long\fR" field.
.RE

.sp
.ne 2
.mk
.na
.B KSTAT_DATA_LONGLONG
.ad
.RS 24n
.rt
Obsolete. Use
.BR KSTAT_DATA_INT64 .
.RE

.sp
.ne 2
.mk
.na
.B KSTAT_DATA_ULONGLONG
.ad
.RS 24n
.rt
Obsolete. Use
.BR KSTAT_DATA_UINT64 .
.RE

.sp
.ne 2
.mk
.na
.B KSTAT_DATA_STRING
.ad
.RS 24n
.rt
Arbitrary length "\fBlong string\fR" field.
.RE

.RE

.sp
.ne 2
.mk
.na
.I str
.ad
.RS 13n
.rt
Pointer to a
.BR NULL "-terminated string."
.RE

.SH DESCRIPTION
.sp
.LP
.B kstat_named_init()
associates a name and a type with a
.BR kstat_named (9S)
structure.
.sp
.LP
.B kstat_named_setstr()
associates
.I str
with the named kstat
.BR knp .
It is an error for
.B knp
to be of type other than
.BR KSTAT_DATA_STRING .
The string argument must remain valid even after
the function that is calling
.B kstat_named_setstr()
is returned. This is
the only supported method of changing the value of long strings.
.SH RETURN VALUES
.sp
.LP
None.
.SH CONTEXT
.sp
.LP
.B kstat_named_init()
and
.B kstat_named_setstr()
can be called from
user or kernel context.
.SH SEE ALSO
.sp
.LP
.BR kstat_create (9F),
.BR kstat_install (9F),
.BR kstat (9S),
.BR kstat_named (9S)
.sp
.LP
.I Writing Device Drivers
