usr/src/man/man9f/kstat_delete.9f
'\" te
.\" Copyright (c) 1994, Sun Microsystems, Inc., All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH kstat_delete 9F "4 Apr 1994" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
kstat_delete \- remove a kstat from the system
.SH SYNOPSIS
.LP
.nf
#include <sys/types.h>
#include <sys/kstat.h>



\fBvoid\fR \fBkstat_delete\fR(\fBkstat_t *\fIksp\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI)
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I ksp
.ad
.RS 8n
.rt
Pointer to a currently installed
.BR kstat "(9S) structure."
.RE

.SH DESCRIPTION
.sp
.LP
.B kstat_delete()
removes
.I ksp
from the
.B kstat
chain and frees
all associated system resources.
.SH RETURN VALUES
.sp
.LP
None.
.SH CONTEXT
.sp
.LP
.B kstat_delete()
can be called from any context.
.SH SEE ALSO
.sp
.LP
.BR kstat_create (9F),
.BR kstat_install (9F),
.BR kstat_named_init (9F),
.BR kstat (9S)
.sp
.LP
.I Writing Device Drivers
.SH NOTES
.sp
.LP
When calling
.BR kstat_delete() ,
the driver must not be holding that
.BR kstat 's
.BR ks_lock .
.RB "Otherwise, it may deadlock with a" " kstat"
reader.
