usr/src/man/man9f/kstat_create.9f
'\" te
.\" Copyright (c) 2006, Sun Microsystems, Inc., All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH kstat_create 9F "13 Nov 2006" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
kstat_create \- create and initialize a new kstat
.SH SYNOPSIS
.LP
.nf
#include <sys/types.h>
#include <sys/kstat.h>



\fBkstat_t *\fBkstat_create\fR(\fBconst char *\fIks_module\fR, \fBint\fR \fIks_instance\fR,
     \fBconst char *\fIks_name\fR, \fBconst char *\fIks_class\fR, \fBuchar_t\fR \fIks_type\fR,
     \fBulong_t\fR \fIks_ndata\fR, \fBuchar_t\fR \fIks_flag\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI)
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I ks_module
.ad
.RS 15n
.rt
The name of the provider's module (such as "\fBsd\fR", "\fBesp\fR", .\|.\|.). The
"\fBcore\fR" kernel uses the name "unix".
.RE

.sp
.ne 2
.mk
.na
.I ks_instance
.ad
.RS 15n
.rt
The provider's instance number, as from
.BR ddi_get_instance (9F).
Modules
which do not have a meaningful instance number should use
.BR 0 .
.RE

.sp
.ne 2
.mk
.na
.I ks_name
.ad
.RS 15n
.rt
A pointer to a string that uniquely identifies this structure. Only
\fBKSTAT_STRLEN \(mi 1\fR characters are significant.
.RE

.sp
.ne 2
.mk
.na
.I ks_class
.ad
.RS 15n
.rt
The general class that this kstat belongs to. The following classes are
currently in use:
.BR disk ,
.BR tape ,
.BR net ,
.BR controller ,
.BR vm ,
.BR kvm ,
.BR hat ,
.BR streams ,
.BR kstat ,
and
.BR misc .
.RE

.sp
.ne 2
.mk
.na
.I ks_type
.ad
.RS 15n
.rt
The type of
.B kstat
to allocate. Valid types are:
.sp
.ne 2
.mk
.na
.B KSTAT_TYPE_NAMED
.ad
.RS 20n
.rt
Allows more than one data record per
.BR kstat .
.RE

.sp
.ne 2
.mk
.na
.B KSTAT_TYPE_INTR
.ad
.RS 20n
.rt
Interrupt; only one data record per
.BR kstat .
.RE

.sp
.ne 2
.mk
.na
.B KSTAT_TYPE_IO
.ad
.RS 20n
.rt
.BR I/O ;
only one data record per
.BR kstat
.RE

.RE

.sp
.ne 2
.mk
.na
.I ks_ndata
.ad
.RS 15n
.rt
The number of type-specific data records to allocate.
.RE

.sp
.ne 2
.mk
.na
\fIks_flag\fR
.ad
.RS 15n
.rt
A bit-field of various flags for this
.BR kstat .
\fIks_flag\fR is some
combination of:
.sp
.ne 2
.mk
.na
.B KSTAT_FLAG_VIRTUAL
.ad
.RS 25n
.rt
Tells
.B kstat_create()
not to allocate memory for the
.B kstat
data
section; instead, the driver will set the
.B ks_data
field to point to the
data it wishes to export. This provides a convenient way to export existing
data structures.
.RE

.sp
.ne 2
.mk
.na
.B KSTAT_FLAG_WRITABLE
.ad
.RS 25n
.rt
Makes the
.B kstat
data section writable by root.
.RE

.sp
.ne 2
.mk
.na
.B KSTAT_FLAG_PERSISTENT
.ad
.RS 25n
.rt
Indicates that this
.B kstat
is to be persistent over time. For persistent
\fBkstat\fRs, \fBkstat_delete\fR(9F) simply marks the \fBkstat\fR as dormant;
a subsequent
.B kstat_create()
reactivates the kstat. This feature is
provided so that statistics are not lost across driver close/open (such as raw
disk
.B I/O
on a disk with no mounted partitions.) Note: Persistent
\fBkstat\fRs cannot be virtual, since \fBks_data\fR points to garbage as soon
as the driver goes away.
.RE

.RE

.SH DESCRIPTION
.sp
.LP
\fBkstat_create()\fR is used in conjunction with \fBkstat_install\fR(9F) to
allocate and initialize a
.BR kstat "(9S) structure. The method is generally"
as follows:
.sp
.LP
\fBkstat_create()\fR allocates and performs necessary system initialization
of a \fBkstat\fR(9S) structure. \fBkstat_create()\fR allocates memory for the
entire
.B kstat
(header plus data), initializes all header fields,
.RB "initializes the data section to all zeroes, assigns a unique kstat" " ID"
(\fBKID\fR), and puts the kstat onto the system's \fBkstat\fR chain. The
returned kstat is marked invalid because the provider (caller) has not yet had
a chance to initialize the data section.
.sp
.LP
After a successful call to
.B kstat_create()
the driver must perform any
necessary initialization of the data section (such as setting the name fields
in a
.B kstat
of type
.BR KSTAT_TYPE_NAMED ).
Virtual
.BR kstat "s must"
have the
.B ks_data
field set at this time. The provider may also set the
.BR ks_update ,
.BR ks_private ,
and
.B ks_lock
fields if necessary.
.sp
.LP
Once the
.B kstat
is completely initialized,
.BR kstat_install (9F)
is
used to make the
.B kstat
accessible to the outside world.
.SH RETURN VALUES
.sp
.LP
If successful,
.B kstat_create()
returns a pointer to the allocated
.BR kstat .
\fINULL\fR is returned upon failure.
.SH CONTEXT
.sp
.LP
\fBkstat_create()\fR can be called from user or kernel context.
.SH EXAMPLES
.LP
\fBExample 1\fR Allocating and Initializing a \fBkstat\fR Structure
.sp
.in +2
.nf
pkstat_t   *ksp;
   ksp = kstat_create(module, instance, name, class, type, ndata, flags);
   if (ksp) {
      /* .\|.\|. provider initialization, if necessary */
      kstat_install(ksp);
   }
.fi
.in -2

.SH SEE ALSO
.sp
.LP
.BR kstat (3KSTAT),
.BR ddi_get_instance (9F),
.BR kstat_delete (9F),
.BR kstat_install (9F),
.BR kstat_named_init (9F),
.BR kstat (9S),
.BR kstat_named (9S)
.sp
.LP
.I Writing Device Drivers
