usr/src/man/man9f/ldi_get_dev.9f
'\" te
.\" Copyright (c) 2003, Sun Microsystems, Inc.,  All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ldi_get_dev 9F "3 June 2003" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
ldi_get_dev, ldi_get_otyp, ldi_get_devid, ldi_get_minor_name \- Extract
information from a layered handle
.SH SYNOPSIS
.LP
.nf
#include <sys/sunldi.h>

\fBint\fR \fBldi_get_dev\fR(\fBldi_handle_t lh\fR, \fBdev_t *\fIdevp\fR);
.fi

.LP
.nf
\fBint\fR \fBldi_get_otyp\fR(\fBldi_handle_t lh\fR, \fBint *\fIotyp\fR);
.fi

.LP
.nf
\fBint\fR \fBldi_get_devid\fR(\fBldi_handle_t lh\fR, \fBddi_devid_t *\fIdevid\fR);
.fi

.LP
.nf
\fBint\fR \fBldi_get_minor_name\fR(\fBldi_handle_t lh\fR, \fBchar **\fIminor_name\fR);
.fi

.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I lh
.ad
.RS 15n
.rt
Layered handle
.RE

.sp
.ne 2
.mk
.na
.I otyp
.ad
.RS 15n
.rt
Indicates on which interface the driver was opened. Valid settings are:
.sp
.ne 2
.mk
.na
.B OTYP_BLK
.ad
.RS 12n
.rt
Open device block interface.
.RE

.sp
.ne 2
.mk
.na
.B OTYP_CHR
.ad
.RS 12n
.rt
Open device character interface.
.RE

.RE

.sp
.ne 2
.mk
.na
.I devp
.ad
.RS 15n
.rt
Pointer to a device number.
.RE

.sp
.ne 2
.mk
.na
.I devid
.ad
.RS 15n
.rt
Device ID.
.RE

.sp
.ne 2
.mk
.na
.I minor_name
.ad
.RS 15n
.rt
Minor device node name.
.RE

.SH DESCRIPTION
.sp
.LP
The
.B ldi_get_dev()
function retrieves the
.B dev_t
associated with
a layered handle.
.sp
.LP
The
.B ldi_get_otyp()
retrieves the open flag that was used to open the
device associated with the layered handle.
.sp
.LP
The
.B ldi_get_devid()
function retrieves a
.I devid
for the device
associated with the layered handle. The caller  should use
.B ddi_devid_free()
to free the devid when done with it.
.sp
.LP
The
.B ldi_get_minor_name()
function retrieves the name of the minor
node opened for the device associated with the layered handle.
.B ldi_get_minor_name()
allocates a buffer containing the minor node name
and returns it via the
.I minor_name
parameter. The caller should use
.B kmem_free()
to release the buffer when done with it.
.SH RETURN VALUES
.sp
.LP
The
.BR ldi_get_dev() ,
.BR ldi_get_otyp() ,
.BR ldi_get_devid() ,
and
.B ldi_get_devid()
functions return
.B 0
upon success.
.sp
.LP
In case of an error, the following values may be returned:
.sp
.ne 2
.mk
.na
.B EINVAL
.ad
.RS 11n
.rt
Invalid input parameters.
.RE

.sp
.ne 2
.mk
.na
.B ENOTSUP
.ad
.RS 11n
.rt
The operation is not supported for this device.
.RE

.SH CONTEXT
.sp
.LP
These functions may be called from user or kernel context.
