usr/src/man/man9f/ldi_get_size.9f
'\" te
.\" Copyright (c) 2004, Sun Microsystems, Inc.,  All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ldi_get_size 9F "18 Mar 2004" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
ldi_get_size \- Retrieve device size
.SH SYNOPSIS
.LP
.nf
#include <sys/sunldi.h>

\fBint\fR \fBldi_get_size\fR(\fBldi_handle_t\fR \fIlh\fR, \fBuint64_t *\fIsizep\fR);
.fi

.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I lh
.ad
.RS 10n
.rt
Layered handle.
.RE

.sp
.ne 2
.mk
.na
.I sizep
.ad
.RS 10n
.rt
Pointer to the caller's unsigned 64-bit integer buffer.
.RE

.SH DESCRIPTION
.sp
.LP
The
.B ldi_get_size()
function uses the layered driver handle to
calculate and return a device's size. The device size is returned within the
caller supplied buffer (*\fIsizep\fR). A valid layered driver handle must be
obtained via the
.BR ldi_open_by_name (9F)
interface prior to calling
.BR ldi_get_size() .
.SH RETURN VALUES
.sp
.LP
The
.B ldi_get_size()
function returns the following values:
.sp
.ne 2
.mk
.na
.B DDI_SUCCESS
.ad
.RS 15n
.rt
The device size has been returned within the caller supplied buffer.
.RE

.sp
.ne 2
.mk
.na
.B DDI_FAILURE
.ad
.RS 15n
.rt
The device size could not be found or determined.
.RE

.SH CONTEXT
.sp
.LP
This function may be called from user or kernel context.
.SH SEE ALSO
.sp
.LP
.BR ldi_open_by_name (9F)
.sp
.LP
.I Writing Device Drivers
