usr/src/man/man9f/ldi_remove_event_handler.9f
'\" te
.\" Copyright (c) 2007, Sun Microsystems, Inc.,  All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ldi_remove_event_handler 9F "21 Aug 2007" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
ldi_remove_event_handler \- remove an NDI event service callback
.SH SYNOPSIS
.LP
.nf
#include <sys/ddi_obsolete.h>

\fBint\fR \fBldi_remove_event_handler\fR(\fBldi_handle_t\fR \fIlh\fR,
     \fIldi_callback_id_t id\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Obsolete
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I ldi_handle_t lh
.ad
.RS 24n
.rt
Layered handle representing the device for which the event notification is
requested.
.RE

.sp
.ne 2
.mk
.na
.I ldi_callback_id_t id
.ad
.RS 24n
.rt
Unique system-wide registration ID returned by
.BR ldi_add_event_handler (9F)
upon successful registration.
.RE

.SH DESCRIPTION
.sp
.LP
This function is obsolete and is only maintained for compatibility. Use of
this function is strongly discouraged. For equivalent functionality provided
by new interfaces, see
.BR ldi_ev_register_callbacks (9F)
and
.BR ldi_ev_remove_callbacks (9F).
.sp
.LP
The
.B ldi_remove_event_handler()
function removes the callback handler
specified by the registration ID
.RI ( ldi_callback_id_t ).
Upon successful
removal, the callback handler is removed from the system and is not invoked
at the event occurance.
.SH RETURN VALUES
.sp
.ne 2
.mk
.na
.B DDI_SUCCESS
.ad
.RS 15n
.rt
Callback handler removed successfully.
.RE

.sp
.ne 2
.mk
.na
.B DDI_FAILURE
.ad
.RS 15n
.rt
Failed to remove callback handler.
.RE

.SH CONTEXT
.sp
.LP
This function can be called from user and kernel contexts only.
.SH SEE ALSO
.sp
.LP
.BR ldi_ev_register_callbacks (9F),
.BR ldi_ev_remove_callbacks (9F),
.BR ldi_add_event_handler (9F),
.BR ldi_get_eventcookie (9F)
.sp
.LP
.I Writing Device Drivers
