usr/src/man/man9f/ldi_get_eventcookie.9f
'\" te
.\" Copyright (c) 2007, Sun Microsystems, Inc.,  All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ldi_get_eventcookie 9F "21 Aug 2007" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
ldi_get_eventcookie \- retrieve NDI event service cookie
.SH SYNOPSIS
.LP
.nf
#include <sys/ddi_obsolete.h>

\fBint\fR \fBldi_get_eventcookie\fR(\fBldi_handle_t\fR \fIlh\fR, \fIchar *name\fR
     \fIddi_eventcookie_t *ecp\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Obsolete
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I ldi_handle_t lh
.ad
.RS 26n
.rt
Layered handle.
.RE

.sp
.ne 2
.mk
.na
.I char *name
.ad
.RS 26n
.rt
null-terminated string containing the event name.
.RE

.sp
.ne 2
.mk
.na
.I ddi_eventcookie_t *ecp
.ad
.RS 26n
.rt
Pointer to the kernel event cookie.
.RE

.SH DESCRIPTION
.sp
.LP
This function is obsolete and is only maintained for compatibility. Use of
this function is strongly discouraged. For equivalent functionality provided
by new interfaces, see
.BR ldi_ev_get_cookie (9F)
and
.BR ldi_ev_register_callbacks (9F).
.sp
.LP
The
.B ldi_get_eventcookie()
function queries the device tree for a cookie
matching the given event name and returns a reference to that cookie. The
search is performed by calling up the device tree hierarchy of the  device
represented by the layered driver handle until the request is satisfied by a
bus nexus driver,  or the top of the dev_info tree is reached.
.sp
.LP
The cookie returned by this function can be used to register a callback
handler with
.BR ldi_add_event_handler (9F).
.SH RETURN VALUES
.sp
.ne 2
.mk
.na
.B DDI_SUCCESS
.ad
.RS 15n
.rt
Cookie handle is returned.
.RE

.sp
.ne 2
.mk
.na
.B DDI_FAILURE
.ad
.RS 15n
.rt
Request was not serviceable by any nexus driver in the target device's
ancestral device tree hierarchy.
.RE

.SH CONTEXT
.sp
.LP
This function may be called from user or kernel contexts.
.SH SEE ALSO
.sp
.LP
.BR ldi_ev_get_cookie (9F),
.BR ldi_ev_register_callbacks (9F),
.BR ldi_add_event_handler (9F),
.BR ldi_remove_event_handler (9F)
.sp
.LP
.I Writing Device Drivers
