usr/src/man/man9f/ldi_ident_from_dev.9f
'\" te
.\" Copyright (c) 2009, Sun Microsystems, Inc.,  All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ldi_ident_from_dev 9F "26 Mar 2009" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
ldi_ident_from_dev, ldi_ident_from_stream, ldi_ident_from_dip,
ldi_ident_release \- ldi cookie management
.SH SYNOPSIS
.LP
.nf
#include <sys/sunldi.h>

\fBint\fR \fBldi_ident_from_dip\fR(\fBdev_info_t *\fIdip\fR, \fBldi_ident_t *\fIlip\fR);
.fi

.LP
.nf
\fBint\fR \fBldi_ident_from_dev\fR(\fBdev_t\fR \fIdev\fR, \fBldi_ident_t *\fIlip\fR);
.fi

.LP
.nf
\fBint\fR \fBldi_ident_from_stream\fR(\fBstruct queue *\fIsq\fR, \fBldi_ident_t *\fIlip\fR);
.fi

.LP
.nf
\fBvoid\fR \fBldi_ident_release\fR(\fBldi_ident_t\fR \fIli\fR);
.fi

.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I li
.ad
.RS 7n
.rt
ldi identifier
.RE

.sp
.ne 2
.mk
.na
.I lip
.ad
.RS 7n
.rt
ldi identifier pointer
.RE

.sp
.ne 2
.mk
.na
.I dip
.ad
.RS 7n
.rt
pointer to device info node
.RE

.sp
.ne 2
.mk
.na
.I dev
.ad
.RS 7n
.rt
device number
.RE

.sp
.ne 2
.mk
.na
.I sq
.ad
.RS 7n
.rt
pointer to a stream queue
.RE

.SH DESCRIPTION
.sp
.LP
The
.B ldi_ident_from_dev()
function allocates and  returns an ldi
identifier that  is  associated with the device number specified by
.IR dev .
The new ldi identifier is returned in the ldi identifier pointer
parameter
.IR lip .
.sp
.LP
The
.B ldi_ident_from_dip()
function allocates and  returns an ldi
identifier that is associated with the device info node pointed to by dip.
The new ldi identifier is  returned in the ldi identifier pointer parameter
.IR lip .
.sp
.LP
The
.B ldi_ident_from_stream()
function allocates and returns an ldi
identifier that is associated with the stream pointed to by
.IR queue .
The
new ldi identifier is returned in the ldi identifier pointer parameter
.IR lip .
.sp
.LP
The
.B ldi_ident_release()
function releases an identifier that was
allocated by one of the
.B ldi_ident_from_*()
functions.
.SH RETURN VALUES
.sp
.LP
The
.BR ldi_ident_from_dev() ,
.BR ldi_ident_from_dip() ,
and
.B ldi_ident_from_stream()
functions return
.B 0
upon success.
.sp
.LP
All of these functions return
.B EINVAL
for invalid input parameters.
.SH CONTEXT
.sp
.LP
These functions can be called from user or kernel context.
