usr/src/man/man9f/ldi_strategy.9f
'\" te
.\" Copyright (c) 2003, Sun Microsystems, Inc.,  All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ldi_strategy 9F "3 June 2003" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
ldi_strategy \- Device strategy request
.SH SYNOPSIS
.LP
.nf
#include <sys/sunldi.h>

\fBint\fR \fBldi_strategy\fR(\fBldi_handle_t\fR \fIlh\fR, \fB struct buf *\fIbp\fR);
.fi

.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I lh
.ad
.RS 7n
.rt
Layered handle.
.RE

.sp
.ne 2
.mk
.na
.I bp
.ad
.RS 7n
.rt
Pointer to the
.B buf(9S)
structure.
.RE

.SH DESCRIPTION
.sp
.LP
The
.B ldi_strategy()
function passes a strategy request to the device
entry point for the device specified by the layered handle. This operation
is supported for block devices.
.SH RETURN VALUES
.sp
.LP
The
.B ldi_strategy()
function returns
.B 0
if the strategy request
has been passed on to the target device. Other possible return values are:
.sp
.ne 2
.mk
.na
.B EINVAL
.ad
.RS 11n
.rt
Invalid input parameters.
.RE

.sp
.ne 2
.mk
.na
.B ENOTSUP
.ad
.RS 11n
.rt
Operation is not supported for this device.
.RE

.sp
.LP
Once the request has been passed on to the target devices strategy entry
point, any further errors will be reported by
.BR bioerror (9F)
and
.BR biodone (9F).
See the
.BR strategy (9E)
entry point for more
information.
.SH CONTEXT
.sp
.LP
This function may be called from user or kernel context.
