usr/src/man/man9f/ldi_read.9f
'\" te
.\" Copyright (c) 2003, Sun Microsystems, Inc.,  All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ldi_read 9F "3 June 2003" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
ldi_read, ldi_write \- Read and write from a device
.SH SYNOPSIS
.LP
.nf
#include <sys/sunldi.h>

\fBint\fR ldi_read(\fBldi_handle_t\fR \fIlh\fR, \fBstruct uio *\fIuiop\fR, \fBcred_t *\fIcr\fR);
.fi

.LP
.nf
\fBint\fR \fB ldi_write\fR(\fBldi_handle_t\fR \fIlh\fR, \fBstruct uio *\fIuiop\fR, \fBcred_t *\fIcr\fR);
.fi

.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I lh
.ad
.RS 9n
.rt
Layered handle.
.RE

.sp
.ne 2
.mk
.na
.I cr
.ad
.RS 9n
.rt
Pointer to a credential structure used to open a device.
.RE

.sp
.ne 2
.mk
.na
.I uiop
.ad
.RS 9n
.rt
Pointer to the
.B uio(9S)
structure.
.B uio(9S)
specifies the
location of the read or write data.  (Either userland or kernel.)
.RE

.SH DESCRIPTION
.sp
.LP
The
.B ldi_read()
function passes a read request to the device entry
point for the device specified by the layered handle. This operation is
supported for  block,  character, and streams devices.
.sp
.LP
The
.B ldi_write()
function passes a write request to the device entry
point for a device specified by the layered handle. This operation is
supported for block,  character, and streams devices.
.SH RETURN VALUES
.sp
.LP
The
.B ldi_read()
and
.B ldi_write()
functions return
.B 0
upon
success. If  a  failure occurs before the request is passed to the device,
the possible return values are shown below. Otherwise any other error number
may be returned by the device.
.sp
.ne 2
.mk
.na
.B EINVAL
.ad
.RS 11n
.rt
Invalid input parameters.
.RE

.sp
.ne 2
.mk
.na
.B ENOTSUP
.ad
.RS 11n
.rt
Operation is not supported for this device.
.RE

.SH CONTEXT
.sp
.LP
These functions may be called from user or kernel context.
