usr/src/man/man9f/ldi_devmap.9f
'\" te
.\" Copyright (c) 2003, Sun Microsystems, Inc.,  All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ldi_devmap 9F "3 June 2003" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
ldi_devmap \- Issue a devmap request to a device
.SH SYNOPSIS
.LP
.nf
#include <sys/sunldi.h>

\fBint\fR \fBldi_devmap\fR(\fBldi_handle_t\fR \fIlh\fR, \fBdevmap_cookie_t\fR \fIdhp\fR, \fBoffset_t\fR \fIoff\fR,
     \fBsize_t\fR \fIlen\fR, \fBsize_t *\fImaplen\fR, \fBuint_t\fR \fImodel\fR);
.fi

.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I lh
.ad
.RS 10n
.rt
Layered handle.
.RE

.sp
.ne 2
.mk
.na
.I dhp
.ad
.RS 10n
.rt
Opaque mapping handle used by the system to describe mapping.
.RE

.sp
.ne 2
.mk
.na
.I off
.ad
.RS 10n
.rt
User offset within the logical device memory at which mapping begins.
.RE

.sp
.ne 2
.mk
.na
.I len
.ad
.RS 10n
.rt
Mapping length (in bytes).
.RE

.sp
.ne 2
.mk
.na
.I maplen
.ad
.RS 10n
.rt
Pointer to length (in bytes) of validated mapping.  (Less than or equal to
.IR len ).
.RE

.sp
.ne 2
.mk
.na
.I model
.ad
.RS 10n
.rt
Data model type of current thread.
.RE

.SH DESCRIPTION
.sp
.LP
The
.B ldi_devmap()
function passes an devmap request to the device
entry point for the device specified by the layered handle. This operation
is supported for character devices.
.SH RETURN VALUES
.sp
.LP
The
.B ldi_devmap()
function returns
.B 0
upon success. If a failure
occurs before the request is passed to the device, possible return values
are shown below. Otherwise any other error number may be returned by the
device.
.sp
.ne 2
.mk
.na
.B EINVAL
.ad
.RS 11n
.rt
Invalid input parameters.
.RE

.sp
.ne 2
.mk
.na
.B ENOTSUP
.ad
.RS 11n
.rt
Operation is not supported for this device.
.RE

.SH CONTEXT
.sp
.LP
This function may be called from user or kernel context.
