usr/src/man/man9f/linkb.9f
'\" te
.\" Copyright 1989 AT&T
.\" Copyright (C) 2006, Sun Microsystems, Inc.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH linkb 9F "16 Jan 2006" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
linkb \- concatenate two message blocks
.SH SYNOPSIS
.LP
.nf
#include <sys/stream.h>



\fBvoid\fR \fBlinkb\fR(\fBmblk_t *\fImp1\fR, \fBmblk_t *\fImp2\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Architecture independent level 1 (DDI/DKI).
.SH DESCRIPTION
.sp
.LP
The
.B linkb()
function creates a new message by adding
.I mp2
to the
tail of
.IR mp1 .
The continuation pointer,
.BR b_cont ,
of
.I mp1
is
set to point to
.IR mp2 .
.sp
.LP
The following figure describes how the
.B "linkb(m1, m2);"
function
concatenates two message blocks,
.B mp1
and
.BR mp2 :
.sp
Printed copy or docs.sun.com shows a figure that describes how the
linkb(m1, m2); function creates a new message by adding mp1 to the tail of
mp2
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I mp1
.ad
.RS 7n
.rt
The message to which
.I mp2
is to be added.
.B mblk_t
is an instance
of the
.BR msgb "(9S) structure."
.RE

.sp
.ne 2
.mk
.na
.I mp2
.ad
.RS 7n
.rt
The message to be added.
.RE

.SH CONTEXT
.sp
.LP
The
.B linkb()
function can be called from user, interrupt, or kernel
context.
.SH EXAMPLES
.sp
.LP
See \fBdupb\fR(9F) for an example that uses
.BR linkb() .
.SH SEE ALSO
.sp
.LP
.BR dupb (9F),
.BR unlinkb (9F),
.BR msgb (9S)
.sp
.LP
.I Writing Device Drivers
.sp
.LP
.I STREAMS Programming Guide
