usr/src/man/man9f/makecom.9f
'\" te
.\" Copyright (c) 2006, Sun Microsystems, Inc. , All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH makecom 9F "16 Jan 2006" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
makecom, makecom_g0, makecom_g0_s, makecom_g1, makecom_g5 \- make a packet
for SCSI commands
.SH SYNOPSIS
.LP
.nf
#include <sys/scsi/scsi.h>

\fBvoid\fR \fBmakecom_g0\fR(\fBstruct scsi_pkt *\fIpkt\fR, \fBstruct scsi_device *\fIdevp\fR,
     \fBint\fR \fIflag\fR, \fBint\fR \fIcmd\fR, \fBint\fR \fIaddr\fR, \fBint\fR \fIcnt\fR);
.fi

.LP
.nf
\fBvoid\fR \fBmakecom_g0_s\fR(\fBstruct scsi_pkt *\fIpkt\fR, \fBstruct scsi_device *\fIdevp\fR,
     \fBint\fR \fIflag\fR, \fBint\fR \fIcmd\fR, \fBint\fR \fIcnt\fR, \fBint\fR \fIfixbit\fR);
.fi

.LP
.nf
\fBvoid\fR \fBmakecom_g1\fR(\fBstruct scsi_pkt *\fIpkt\fR, \fBstruct scsi_device *\fIdevp\fR,
     \fBint\fR \fIflag\fR, \fBint\fR \fIcmd\fR, \fBint\fR \fIaddr\fR, \fBint\fR \fIcnt\fR);
.fi

.LP
.nf
\fBvoid\fR \fBmakecom_g5\fR(\fBstruct scsi_pkt *\fIpkt\fR, \fBstruct scsi_device *\fIdevp\fR,
     \fBint\fR \fIflag\fR, \fBint\fR \fIcmd\fR, \fBint\fR \fIaddr\fR, \fBint\fR \fIcnt\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
These interfaces are obsolete.
.BR scsi_setup_cdb (9F)
should be used
instead.
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I pkt
.ad
.RS 10n
.rt
Pointer to an allocated
.BR scsi_pkt "(9S) structure."
.RE

.sp
.ne 2
.mk
.na
.I devp
.ad
.RS 10n
.rt
Pointer to the target's
.BR scsi_device (9S)
structure.
.RE

.sp
.ne 2
.mk
.na
.I flag
.ad
.RS 10n
.rt
Flags for the
.B pkt_flags
member.
.RE

.sp
.ne 2
.mk
.na
.I cmd
.ad
.RS 10n
.rt
First byte of a group 0 or 1 or 5
.BR "SCSI CDB" .
.RE

.sp
.ne 2
.mk
.na
.I addr
.ad
.RS 10n
.rt
Pointer to the location of the data.
.RE

.sp
.ne 2
.mk
.na
.I cnt
.ad
.RS 10n
.rt
Data transfer length in units defined by the SCSI device type. For
sequential devices
.I cnt
is the number of bytes. For block devices,
.I cnt
is the number of blocks.
.RE

.sp
.ne 2
.mk
.na
.I fixbit
.ad
.RS 10n
.rt
Fixed bit in sequential access device commands.
.RE

.SH DESCRIPTION
.sp
.LP
The
.B makecom
functions initialize a packet with the specified command
descriptor block,
.I devp
and transport flags. The
.BR pkt_address ,
.BR pkt_flags ,
and the command descriptor block pointed to by
.B pkt_cdbp
are initialized using the remaining arguments. Target drivers
may use
.B makecom_g0()
for Group 0 commands (except for sequential
access devices), or
.B makecom_g0_s()
for Group 0 commands for sequential
access devices, or
.B makecom_g1()
for Group 1 commands,  or
.B makecom_g5()
for Group 5 commands.
.I fixbit
is used by sequential
access devices for accessing fixed block sizes and sets the tag portion of
the
.BR "SCSI CDB" .
.SH CONTEXT
.sp
.LP
These functions can be called from user, interrupt, or kernel context.
.SH EXAMPLES
.LP
.B Example 1
Using
.B makecom
Functions
.sp
.in +2
.nf
if (blkno >= (1<<20)) {
      makecom_g1(pkt, SD_SCSI_DEVP, pflag, SCMD_WRITE_G1,
         (int) blkno, nblk);
} else {
      makecom_g0(pkt, SD_SCSI_DEVP, pflag, SCMD_WRITE,
         (int) blkno, nblk);
}
.fi
.in -2

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for a description of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
\fBATTRIBUTE TYPE\fR\fBATTRIBUTE VALUE\fR
_
Stability LevelObsolete
.TE

.SH SEE ALSO
.sp
.LP
.BR attributes (5),
.BR scsi_setup_cdb (9F),
.BR scsi_device (9S),
.BR scsi_pkt (9S)
.sp
.LP
.I "ANSI Small Computer System Interface-2 (SCSI-2)
.sp
.LP
.I Writing Device Drivers
.SH NOTES
.sp
.LP
The
.BR makecom_g0() ,
.BR makecom_g0_s() ,
.BR makecom_g1() ,
and
.B makecom_g5()
functions are obsolete and will be discontinued in a
future release. These functions have been replaced by the
.B scsi_setup_cdb()
function. See
.BR scsi_setup_cdb (9F).
