usr/src/man/man9f/mcopyout.9f
'\" te
.\" Copyright (c) 2004, Sun Microsystems, Inc.  All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH mcopyout 9F "9 June 2004" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
mcopyout \- Convert an M_IOCTL or M_IOCDATA message to an M_COPYOUT
.SH SYNOPSIS
.LP
.nf
#include <sys/stream.h>
#include <sys/strsun.h>



\fBvoid\fR \fBmcopyout\fR(\fBmblk_t *\fImp\fR, \fBvoid *\fIprivate\fR, \fBsize_t\fR \fIsize\fR, \fBvoid *\fIuseraddr\fR,
      \fBmblk_t *\fIdp\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI).
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I mp
.ad
.RS 12n
.rt
M_IOCTL or M_IOCDATA message.
.RE

.sp
.ne 2
.mk
.na
.I private
.ad
.RS 12n
.rt
Value to set the cq_private field of the
.BR copyreq "(9S) to."
.RE

.sp
.ne 2
.mk
.na
.I size
.ad
.RS 12n
.rt
Value to set the cq_size field of the
.BR copyreq "(9S) to."
.RE

.sp
.ne 2
.mk
.na
.I useraddr
.ad
.RS 12n
.rt
Optionally, the value to set the cq_addr field of the
.BR copyreq (9S)
to.
.RE

.sp
.ne 2
.mk
.na
.I dp
.ad
.RS 12n
.rt
Optionally, the payload to copy out.
.RE

.SH DESCRIPTION
.sp
.LP
The
.B mcopyout()
function converts an M_IOCTL or M_IOCDATA message into
an M_COPYOUT message using the supplied arguments.
.sp
.LP
To convert the message,
.B mcopyout()
changes the message type to
M_COPYOUT, and its payload from a
.BR iocblk (9S)
to a
.BR copyreq (9S).
Since the
.BR iocblk "(9S) and"
.BR copyreq (9S)
are designed to overlay one
another, the only fields which must be updated are
.BR cq_private ,
.BR cq_size ,
and
.BR cq_addr ,
which are set to the supplied values. If
.I useraddr
is passed as NULL, the M_IOCTL must be transparent and
.B cq_addr
is assigned the pointer-sized quantity found at
.BR mp->b_cont->b_rptr .
.sp
.LP
If
.I dp
is not NULL, any trailing message blocks associated with
.I mp
are freed,
.B mp->b_cont
is reset to
.I dp
and
.B dp->b_wptr
is set to
.BR "dp->b_rptr + size" .
Otherwise, any trailing
message blocks are unaffected.
.SH RETURN VALUES
.sp
.LP
None.
.SH CONTEXT
.sp
.LP
This function can be called from user, kernel or interrupt context.
.SH SEE ALSO
.sp
.LP
.BR mcopyin (9F),
.BR copyreq (9S),
.BR iocblk (9S)
.sp
.LP
.I STREAMS Programming Guide
