usr/src/man/man9f/mcopymsg.9f
'\" te
.\" Copyright (c) 2007, Sun Microsystems, Inc.  All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH mcopymsg 9F "16 Oct 2007" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
mcopymsg \- Copy message contents into a buffer and free message
.SH SYNOPSIS
.LP
.nf
#include <sys/stream.h>
#include <sys/strsun.h>



\fBvoid\fR \fBmcopymsg\fR(\fBmblk_t *\fImp\fR, \fBvoid *\fIbuf\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI).
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I mp
.ad
.RS 7n
.rt
Message to be copied.
.RE

.sp
.ne 2
.mk
.na
.I buf
.ad
.RS 7n
.rt
Buffer in which to copy.
.RE

.SH DESCRIPTION
.sp
.LP
The
.B mcopymsg()
function copies the contents of the specified message
into the specified buffer. If the message consists of more than a single
message block, the contents of each message block are placed consecutively
into the buffer. After copying the message contents to
.IR buf ,
.B mcopymsg()
frees the message
.IR mp .
.sp
.LP
The provided buffer must be large enough to accommodate the message. If the
buffer is not large enough, the results are unspecified. The
.BR msgsize (9F)
function can be used to calculate the total size of the
message beforehand.
.SH RETURN VALUES
.sp
.LP
None.
.SH CONTEXT
.sp
.LP
This function can be called from user, kernel or interrupt context.
.SH SEE ALSO
.sp
.LP
.BR freemsg (9F),
.BR msgsize (9F)
.sp
.LP
.I STREAMS Programming Guide
