usr/src/man/man9f/merror.9f
'\" te
.\" Copyright (c) 2004, Sun Microsystems, Inc.  All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH merror 9F "9 June 2004" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
merror \- Send an M_ERROR message upstream
.SH SYNOPSIS
.LP
.nf
#include <sys/stream.h>
#include <sys/strsun.h>



\fBvoid\fR \fBmerror\fR(\fBqueue_t *\fIwq\fR, \fBmblk_t *\fImp\fR, \fBint\fR \fIerror\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI).
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I wq
.ad
.RS 9n
.rt
Write queue associated with the read queue to send the M_ERROR on.
.RE

.sp
.ne 2
.mk
.na
.I mp
.ad
.RS 9n
.rt
Optionally, a STREAMS message to convert to an M_ERROR.
.RE

.sp
.ne 2
.mk
.na
.I error
.ad
.RS 9n
.rt
Error code to include in the M_ERROR message.
.RE

.SH DESCRIPTION
.sp
.LP
The
.B merror()
function constructs an M_ERROR message, and sends the
resulting message upstream.
.sp
.LP
If
.I mp
is NULL,
.B merror()
allocates a one-byte M_ERROR message.
If
.I mp
is non-NULL,
.B merror()
attempts to convert the passed-in
message to an M_ERROR. However, if the passed-in message has more than one
reference (see
.BR dupmsg (9F)),
or if it is of zero length, it is freed
and a new message is allocated.
.sp
.LP
If the allocation or conversion fails,
.B merror()
silently fails.
Otherwise, the resulting one-byte data block is assigned the specified error
code and sent upstream.
.SH RETURN VALUES
.sp
.LP
None.
.SH CONTEXT
.sp
.LP
This function can be called from user, kernel or interrupt context.
.SH NOTES
.sp
.LP
Callers must not hold any locks across an
.B merror()
that can be
acquired as part of
.BR put "(9E) processing."
.SH SEE ALSO
.sp
.LP
.BR put (9E),
.BR dupmsg (9F)
.sp
.LP
.I STREAMS Programming Guide
