usr/src/man/man9f/miocpullup.9f
'\" te
.\" Copyright (c) 2004, Sun Microsystems, Inc.  All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH miocpullup 9F "9 June 2004" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
miocpullup \- Prepare the payload of an M_IOCTL message for access
.SH SYNOPSIS
.LP
.nf
#include <sys/stream.h>
#include <sys/strsun.h>



\fBint\fR \fBmiocpullup\fR(\fBmblk_t *\fImp\fR, \fBsize_t\fR \fIsize\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI).
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I mp
.ad
.RS 8n
.rt
M_IOCTL message.
.RE

.sp
.ne 2
.mk
.na
.I size
.ad
.RS 8n
.rt
Number of bytes to prepare.
.RE

.SH DESCRIPTION
.sp
.LP
The
.B miocpullup()
function prepares the payload of the specified
M_IOCTL message for access by ensuring that it consists of at least
.I size
bytes of data.
.sp
.LP
If the M_IOCTL message is transparent, or its total payload is less than
.I size
bytes, an error is returned.  Otherwise, the payload is
concatenated as necessary to provide contiguous access to at least
.I size
bytes of data. As a special case, if
.I size
is zero,
.B miocpullup()
returns successfully, even if no payload exists.
.SH RETURN VALUES
.sp
.LP
Zero is returned on success. Otherwise an errno value is returned
indicating the problem.
.SH CONTEXT
.sp
.LP
This function can be called from user, kernel or interrupt context.
.SH SEE ALSO
.sp
.LP
.I STREAMS Programming Guide
