usr/src/man/man9f/miocnak.9f
'\" te
.\" Copyright (c) 2004, Sun Microsystems, Inc.  All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH miocnak 9F "9 June 2004" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
miocnak \- Negatively acknowledge an M_IOCTL message
.SH SYNOPSIS
.LP
.nf
#include <sys/stream.h>
#include <sys/strsun.h>



\fBvoid\fR \fBmiocnak\fR(\fBqueue_t *\fIwq\fR, \fBmblk_t *\fImp\fR, \fBint\fR \fIcount\fR, \fBint\fR \fIerror\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI).
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I wq
.ad
.RS 9n
.rt
Write queue associated with the read queue to send the M_IOCNAK on.
.RE

.sp
.ne 2
.mk
.na
.I mp
.ad
.RS 9n
.rt
M_IOCTL message.
.RE

.sp
.ne 2
.mk
.na
.I count
.ad
.RS 9n
.rt
Value to set the ioc_count of the
.BR iocblk "(9S) to."
.RE

.sp
.ne 2
.mk
.na
.I error
.ad
.RS 9n
.rt
Value to set the ioc_error of the
.BR iocblk "(9S) to."
.RE

.SH DESCRIPTION
.sp
.LP
The
.B miocnak()
function converts an M_IOCTL message into an M_IOCNAK
message and sends the resulting message upstream.
.sp
.LP
To convert the message,
.B miocnak()
changes the message type to
M_IOCNAK, sets the\fB ioc_count\fR and \fBioc_error\fR members of the
.BR iocblk (9S)
associated with
.I mp
to the passed-in values, and
clears the
.B ioc_rval
field.  Since payloads cannot currently be
associated with M_IOCNAK messages,
.I count
must always be zero. If
.I error
is passed as zero,
.B EINVAL
is assumed.
.SH RETURN VALUES
.sp
.LP
None.
.SH CONTEXT
.sp
.LP
This function can be called from user, kernel or interrupt context.
.SH NOTES
.sp
.LP
Callers must not hold any locks across a
.B miocnak()
that can be
acquired as part of
.BR put "(9E) processing."
.SH SEE ALSO
.sp
.LP
.BR mioc2ack (9F),
.BR miocack (9F),
.BR put (9E),
.BR iocblk (9S)
.sp
.LP
.I STREAMS Programming Guide
