usr/src/man/man9f/msgdsize.9f
'\" te
.\" Copyright 1989 AT&T
.\" Copyright (c) 2006, Sun Microsystems, Inc., All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH msgdsize 9F "16 Jan 2006" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
msgdsize \- return the number of bytes in a message
.SH SYNOPSIS
.LP
.nf
#include <sys/stream.h>



\fBsize_t\fR \fBmsgdsize\fR(\fBmblk_t *\fImp\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Architecture independent level 1 (DDI/DKI).
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I mp
.ad
.RS 6n
.rt
Message to be evaluated.
.RE

.SH DESCRIPTION
.sp
.LP
The
.B msgdsize()
function counts the number of bytes in a data message.
Only bytes included in the data blocks of type
.B M_DATA
are included in
the count.
.SH RETURN VALUES
.sp
.LP
The number of data bytes in a message, expressed as an integer.
.SH CONTEXT
.sp
.LP
The
.B msgdsize()
function can be called from user, interrupt, or kernel
context.
.SH EXAMPLES
.sp
.LP
See
.BR bufcall (9F)
for an example that uses
.BR msgdsize() .
.SH SEE ALSO
.sp
.LP
.BR bufcall (9F)
.sp
.LP
.I Writing Device Drivers
.sp
.LP
.I STREAMS Programming Guide
