usr/src/man/man9f/msgpullup.9f
'\" te
.\" Copyright (c) 2006, Sun Microsystems, Inc., All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH msgpullup 9F "16 Jan 2006" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
msgpullup \- concatenate bytes in a message
.SH SYNOPSIS
.LP
.nf
#include <sys/stream.h>



\fBmblk_t *\fBmsgpullup\fR(\fBmblk_t *\fImp\fR, \fBssize_t\fR \fIlen\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Architecture independent level 1 (DDI/DKI).
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I mp
.ad
.RS 7n
.rt
Pointer to the message whose blocks are to be concatenated.
.RE

.sp
.ne 2
.mk
.na
.I len
.ad
.RS 7n
.rt
Number of bytes to concatenate.
.RE

.SH DESCRIPTION
.sp
.LP
The
.B msgpullup()
function concatenates and aligns the first
.IR len
data bytes of the message pointed to by
.IR mp ,
copying the data into a
new message. Any remaining bytes in the remaining message blocks will be
copied and linked onto the new message. The original message is unaltered.
If
.I len
equals \fB\(mi1\fR, all data are concatenated. If \fIlen\fR
bytes of the same message type cannot be found,
.B msgpullup()
fails and
returns
.IR NULL .
.SH RETURN VALUES
.sp
.LP
The
.B msgpullup
function returns the following values:
.sp
.ne 2
.mk
.na
.B Non-null
.ad
.RS 12n
.rt
Successful completion. A pointer to the new message is returned.
.RE

.sp
.ne 2
.mk
.na
.I NULL
.ad
.RS 12n
.rt
An error occurred.
.RE

.SH CONTEXT
.sp
.LP
The
.B msgpullup()
function can be called from user, interrupt, or
kernel context.
.SH SEE ALSO
.sp
.LP
.BR srv (9E),
.BR allocb (9F),
.BR pullupmsg (9F),
.BR msgb (9S)
.sp
.LP
.I Writing Device Drivers
.sp
.LP
.I STREAMS Programming Guide
.SH NOTES
.sp
.LP
The
.B msgpullup()
function is a \fBDKI\fR-compliant replacement for the
older
.BR pullupmsg "(9F) routine. Users are strongly encouraged to use"
.B msgpullup()
instead of
.BR pullupmsg (9F).
