usr/src/man/man9f/net_isvalidchecksum.9f
'\" te
.\" Copyright (C) 2008, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH net_isvalidchecksum 9F "1 May 2008" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
net_isvalidchecksum \- verify layer 3 and layer 4  checksums
.SH SYNOPSIS
.LP
.nf
#include <sys/neti.h>

\fBint\fR \fBnet_isvalidchecksum\fR(\fBconst\fR \fBnet_data_t\fR \fInet\fR, \fBmblk_t\fR *\fImb\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI).
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I net
.ad
.RS 7n
.rt
value returned from a successful call to
.BR net_protocol_lookup (9F).
.RE

.sp
.ne 2
.mk
.na
.I mb
.ad
.RS 6n
.rt
the
.B mblk
structure holding a packet that is the subject of this
query.
.RE

.SH DESCRIPTION
.sp
.LP
The
.B net_isvalidchecksum()
function verifies the layer 3 checksum
(and, in some case, the layer 4 checksum) in the packet. If possible, fields
that are used by hardware checksum'ing are examined rather than manually
verifying that the checksums are present for packets received from a network
interface.
.sp
.LP
For both
.B IPv4
and
.BR IPv6 ,
.BR TCP ,
.B UDP
and
.BR ICMP
(including
.B ICMPV6
for
.BR IPv6 )
layer 4 checksums are currently
validated.
.SH RETURN VALUES
.sp
.LP
The
.B net_isvalidchecksum()
function returns:
.sp
.ne 2
.mk
.na
.B -1
.ad
.RS 6n
.rt
The network protocol does not support this function.
.RE

.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 6n
.rt
The packet does not contain partial checksums.
.RE

.sp
.ne 2
.mk
.na
.B 1
.ad
.RS 6n
.rt
The packet does contain partial checksums.
.RE

.SH CONTEXT
.sp
.LP
The
.B net_isvalidchecksum()
function may be called from user,  kernel,
or interrupt context.
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
.BR net_ispartialchecksum (9F),
.BR net_protocol_lookup (9F),
.BR attributes (5)
