usr/src/man/man9f/net_hook_register.9f
'\" te
.\" Copyright (C) 2008, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH net_hook_register 9F "1 May 2008" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
net_hook_register \- add a hook to be called in event processing
.SH SYNOPSIS
.LP
.nf
#include <sys/neti.h>

\fBnet_hook_t\fR \fBnet_hook_register\fR(\fBconst\fR \fBnet_data_t\fR \fInet\fR, \fBhook_t\fR *\fIhook\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI).
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I net
.ad
.RS 8n
.rt
value returned from a successful call to
.BR net_protocol_register() .
.RE

.sp
.ne 2
.mk
.na
.I hook
.ad
.RS 8n
.rt
pointer to a
.B hook_t
structure.
.RE

.SH DESCRIPTION
.sp
.LP
The
.B net_hook_register()
function uses hooks that allow callbacks to
be registered with events that belong to a network protocol. A successful
call to
.B net_hook_register()
requires that a valid handle for a network
protocol be provided (the
.I net
parameter), along with a hook
description that includes a reference to an available event.
.sp
.LP
While it is possible to use the same
.B hook_t
structure with multiple
calls to
.BR net_hook_register() ,
it is not encouraged.
.sp
.LP
The
.B hook_t
structure passed in with this function is described by
.BR hook_t (9S).
The following describes how this structure is used.
.sp
.ne 2
.mk
.na
.B h_func
.ad
.RS 23n
.rt
Must be non-NULL and represent a function that fits the specified
interface.
.RE

.sp
.ne 2
.mk
.na
.B h_name
.ad
.RS 23n
.rt
Gives the hook a name that represents its owner. No duplication of
.B h_name
among the hooks present for an event is allowed.
.RE

.sp
.ne 2
.mk
.na
.B h_flags
.ad
.RS 23n
.rt
Currently unused and must be set to 0.
.RE

.sp
.ne 2
.mk
.na
.B h_hint, h_hintvalue
.ad
.RS 23n
.rt
Specify a hint to
.B net_hook_register()
on how to insert this hook. If
the hint cannot be specified, then an error is returned.
.RE

.sp
.ne 2
.mk
.na
.B h_arg;
.ad
.RS 23n
.rt
May take any value that the consumer wishes to have passed back when the
hook is activated.
.RE

.SH RETURN VALUES
.sp
.LP
If the
.B net_hook_register()
function succeeds, 0 is returned.
Otherwise, one of the following errors is returned:
.sp
.ne 2
.mk
.na
.B ENOMEM
.ad
.RS 10n
.rt
The system cannot allocate any more memory to support registering this
hook.
.RE

.sp
.ne 2
.mk
.na
.B ENXIO
.ad
.RS 10n
.rt
A hook cannot be found among the given family of events.
.RE

.sp
.ne 2
.mk
.na
.B EEXIST
.ad
.RS 10n
.rt
A hook with the given
.B h_name
already exists on that event.
.RE

.sp
.ne 2
.mk
.na
.B ESRCH
.ad
.RS 10n
.rt
A before or after dependency cannot be satisfied due to the hook with
.RE

.sp
.ne 2
.mk
.na
.B EBUSY
.ad
.RS 10n
.rt
The
.B h_hint
field specifies a hint that cannot currently be satisfied
because it conflicts with another hook. An example of this might be
specifying
.B HH_FIRST
or
.B HH_LAST
when another hook has already
been registered with this value.
.RE

.SH CONTEXT
.sp
.LP
The
.B net_hook_register()
function may be called from user  or kernel
context.
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
.BR net_hook_unregister (9F),
.BR hook_t (9S)
