usr/src/man/man9f/net_routeto.9f
'\" te
.\" Copyright (C) 2008, Sun Microsystems, Inc. All Rights Reserved.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH net_routeto 9F "1 May 2008" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
net_routeto \- indicate which network interface packets are sent
.SH SYNOPSIS
.LP
.nf
#include <sys/neti.h>

\fBphy_if_t\fR \fBnet_routeto\fR(\fBconst\fR \fBnet_data_t\fR *\fInet\fR, \fBstruct\fR \fBsockaddr\fR *\fIaddress\fR,
     \fBstruct\fR \fBsockaddr\fR *\fInexthop\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI).
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I net
.ad
.RS 11n
.rt
value returned from a successful call to
.BR net_protocol_lookup (9F).
.RE

.sp
.ne 2
.mk
.na
.I address
.ad
.RS 11n
.rt
network address to find a path out of the machine for.
.RE

.sp
.ne 2
.mk
.na
.I nexthop
.ad
.RS 11n
.rt
pointer to the
.B sockaddr
structure in which to store the address of
the next hop. If this information is not required, the value
.B NULL
may
be passed instead.
.RE

.SH DESCRIPTION
.sp
.LP
The
.B net_routeto()
function indicates which network interface packets
destined for a particular address would be sent out of, according to the
systems network routing tables. If
.B next
is supplied as a
non-\fBNULL\fR pointer, the \fBIP\fR address of the
.B nexthop
router to
be used is returned in it.
.SH RETURN VALUES
.sp
.LP
The
.B net_routeto()
function returns:
.sp
.ne 2
.mk
.na
.B -1
.ad
.RS 6n
.rt
The network protocol does not support this function.
.RE

.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 6n
.rt
This function cannot find a route for the address given.
.RE

.sp
.ne 2
.mk
.na
.B >0
.ad
.RS 6n
.rt
Indicates which network interface can be used to reach the given address.
.RE

.SH CONTEXT
.sp
.LP
The
.B net_routeto()
function may be called from user,  kernel, or
interrupt context.
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
.BR net_phygetnext (9F),
.BR net_phylookup (9F),
.BR net_protocol_lookup (9F),
.BR attributes (5)
