usr/src/man/man9f/net_getifname.9f
'\" te
.\" Copyright (C) 2008, Sun Microsystems, Inc. All Rights Reserved.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH net_getifname 9F "1 May 2008" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
net_getifname \- determine the name given to a network interface
.SH SYNOPSIS
.LP
.nf
#include <sys/neti.h>

\fBint\fR \fBnet_getifname\fR(\fBconst\fR \fBnet_data_t\fR \fInet\fR, \fBconst\fR \fBphy_if_t\fR \fIifp\fR,
     \fBchar *\fIbuffer\fR, \fBsize_t\fR \fIbuflen\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI).
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I net
.ad
.RS 10n
.rt
value returned from a successful call to
.BR net_protocol_lookup (9F).
.RE

.sp
.ne 2
.mk
.na
\fIifp\fR
.ad
.RS 10n
.rt
value returned from a successful call to
.BR net_phylookup "(9F) or"
.BR net_phygetnext (9F).
.RE

.sp
.ne 2
.mk
.na
\fIbuffer\fR
.ad
.RS 10n
.rt
pointer to the buffer in which to write the interface name.
.RE

.sp
.ne 2
.mk
.na
\fIbuflen\fR
.ad
.RS 10n
.rt
size of the buffer in which to store the interface name.
.RE

.SH DESCRIPTION
.sp
.LP
The \fBnet_getifname()\fR function copies the name of the network interface
into the buffer provided. The name will always be null-terminated. If the
buffer is too small to fit both the interface name and the null-terminated
name, the name in the buffer is truncated to fit. See
.BR net_phygetnext (9F)
for an example on how to use this function.
.SH RETURN VALUES
.sp
.LP
The \fBnet_getifname()\fR function returns:
.sp
.ne 2
.mk
.na
.B -1
.ad
.RS 6n
.rt
The network protocol does not support this function.
.RE

.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 6n
.rt
Successful completion.
.RE

.sp
.ne 2
.mk
.na
.B 1
.ad
.RS 6n
.rt
Unsuccessful.
.RE

.SH CONTEXT
.sp
.LP
The \fBnet_getifname()\fR function may be called from user,  kernel, or
interrupt context.
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
.BR net_phygetnext (9F),
.BR net_phylookup (9F),
.BR net_protocol_lookup (9F)
