usr/src/man/man9f/net_event_notify_register.9f
'\" te
.\" Copyright (C) 2008, Sun Microsystems, Inc. All Rights Reserved.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH net_event_notify_register 9F "30 Oct 2008" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
net_event_notify_register, net_event_notify_unregister \- add/delete a
function to be called for changes to a event
.SH SYNOPSIS
.LP
.nf
#include <sys/hook.h>
#include <sys/neti.h>

\fBint\fR \fBnet_event_notify_register\fR(\fBnet_handle_t\fR \fIfamily\fR, \fBchar\fR
     *\fIevent\fR, \fBhook_notify_fn_t\fR *\fIcallback\fR, \fBvoid\fR *\fIarg\fR);

\fBint\fR \fBnet_event_notify_unregister\fR(\fBnet_handle_t\fR \fIfamily\fR, \fBchar\fR
     *\fIevent\fR, \fBhook_notify_fn_t\fR *\fIcallback\fR);

\fBtypedef int\fR (* \fBhook_notify_fn_t\fR)(\fBhook_notify_cmd_t command,\fR
     \fBvoid\fR *\fIarg\fR, \fBconst char\fR *\fIname1\fR, \fBconst char\fR *\fIname2\fR, \fBconst char\fR
     *\fIname3\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI).
.SH PARAMETERS
.sp
.ne 2
.mk
.na
\fIfamily\fR
.ad
.RS 12n
.rt
value returned from a successful call to
.BR net_protocol_lookup() .
.RE

.sp
.ne 2
.mk
.na
.I callback
.ad
.RS 12n
.rt
function to call when a change occurs.
.RE

.sp
.ne 2
.mk
.na
.I event
.ad
.RS 12n
.rt
name of the event for which notification of change is desired.
.RE

.sp
.ne 2
.mk
.na
.I arg
.ad
.RS 12n
.rt
pointer to pass into the
.B callback()
function when a change occurs.
.RE

.SH DESCRIPTION
.sp
.LP
The \fBnet_event_notify_register()\fR function registers a function
represented by the pointer
.I callback
to be called when there is a
change to the event represented by
.IR family .
The types of changes for
which notifications are available for is currently limited to the addition
and removal of hooks.
.sp
.LP
The \fBnet_event_notify_unregister()\fR function indicates that there is no
longer any desire to receive notification of changes to the event through
function calls to the specified
.IR callback .
.sp
.LP
The name of a hook should be considered a private interface unless
otherwise specified. The hook names used by
.B IPFilter
in Solaris are a
public, but uncommitted, interface.
.sp
.LP
Multiple
.I callback
functions may be registered through this interface.
The same set of parameters is passed to each
.I callback
function. The
memory referenced through the pointers passed to the
.I callback
should
be treated as pointing to read-only memory. Changing this data is strictly
prohibited.
.sp
.LP
The function that is called when the
.I event
occurs must not block any
other events.
.sp
.LP
The arguments passed through to the
.B callback
are as follows (the
command is either
.B HN_REGISTER
or
.BR HN_UNREGISTER ):
.sp
.ne 2
.mk
.na
.I name1
.ad
.RS 9n
.rt
is the name of the protocol.
.RE

.sp
.ne 2
.mk
.na
.I name2
.ad
.RS 9n
.rt
is the name of the event
.RE

.sp
.ne 2
.mk
.na
.I name3
.ad
.RS 9n
.rt
is the name of the hook being added/removed
.RE

.SH RETURN VALUES
.sp
.LP
If these functions succeed, 0 is returned. Otherwise, the following error
is returned:
.sp
.ne 2
.mk
.na
.B EEXIST
.ad
.RS 10n
.rt
the given callback function is already registered.
.RE

.SH CONTEXT
.sp
.LP
These functions may be called from user or kernel context.
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
.BR attributes (5),
.BR net_hook_register (9F),
.BR net_hook_unregister (9F),
.BR net_protocol_lookup (9F)
