usr/src/man/man9f/net_protocol_lookup.9f
'\" te
.\" Copyright (C) 2008, Sun Microsystems, Inc. All Rights Reserved.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH net_protocol_lookup 9F "1 May 2008" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
net_protocol_lookup \- locate an implementation of a network layer
protocol
.SH SYNOPSIS
.LP
.nf
#include <sys/neti.h>

\fBnet_data_t\fR \fBnet_protocol_lookup\fR(\fBnetid_t\fR \fIid\fR, \fBconst\fR \fBchar\fR *\fIprotocol\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI).
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I id
.ad
.RS 10n
.rt
network instance identifier.
.RE

.sp
.ne 2
.mk
.na
\fIfamily\fR
.ad
.RS 10n
.rt
name of the network protocol to find.
.RE

.SH DESCRIPTION
.sp
.LP
The
.B net_protocol_lookup()
function attempts to locate a data
structure that defines what capabilities it is exporting through this
interface. The value returned by this call is guaranteed to be valid until
it is passed into a call to \fBnet_protocol_release\fR(9F), after which it
should no longer be treated as valid.
.sp
.LP
The protocol must be a registered name of a network protocol that has been
registered. The symbols
.B NHF_INET
and
.B NHF_INET6
should be passed
to
.B net_protocol_lookup()
as the protocol name to gain access to either
\fBIPv4\fR or \fBIPv6\fR respectively.
.SH RETURN VALUES
.sp
.LP
The
.B net_protocol_lookup()
function returns
.B NULL
if it does not
find any knowledge about the network protocol referenced. Otherwise, it
returns a value that can be used with other calls in this framework.
.SH CONTEXT
.sp
.LP
The
.B net_protocol_lookup()
function may be called from user,  kernel,
or interrupt context.
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
.BR net_protocol_release (9F),
.BR attributes (5)
