usr/src/man/man9f/net_kstat_delete.9f
'\" te
.\" Copyright (C) 2008, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH net_kstat_delete 9F "1 May 2008" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
net_kstat_delete \- remove a kstat for a specific instance of IP from the
system
.SH SYNOPSIS
.LP
.nf
#include <sys/types.h>
#include <sys/kstat.h>
#include <sys/neti.h>

\fBvoid\fR \fBnet_kstat_delete\fR(\fBnetid_t\fR \fInetid\fR, \fBkstat_t\fR *\fIksp\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI).
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I netid
.ad
.RS 9n
.rt
.B IP
instance identifier.
.RE

.sp
.ne 2
.mk
.na
.I ksp
.ad
.RS 9n
.rt
Pointer to a currently installed
.BR kstat "(9S) structure."
.RE

.SH DESCRIPTION
.sp
.LP
The
.B net_kstat_delete()
function removes
.I ksp
from the
.B kstat
chain and frees all associated system resources. See
.BR kstat_delete (9F)
for a complete discussion of this function.
.SH RETURN VALUES
.sp
.LP
If successful,
.B net_kstat_delete()
returns a pointer to the allocated
.BR kstat .
.I NULL
is returned upon failure.
.SH CONTEXT
.sp
.LP
The
.B net_kstat_delete()
function may be called from user,  kernel, or
interrupt context.
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
.BR kstat_create (9F),
.BR kstat_delete (9F),
.BR net_kstat_create (9F),
.BR hook_t (9S),
.BR kstat_named (9S)
