usr/src/man/man9f/net_protocol_walk.9f
'\" te
.\" Copyright (C) 2008, Sun Microsystems, Inc. All Rights Reserved.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH net_protocol_walk 9F "1 May 2008" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
net_protocol_walk \- step through the list of registered network
protocols
.SH SYNOPSIS
.LP
.nf
#include <sys/neti.h>

\fBnet_data_t\fR *\fBnet_protocol_walk\fR(\fBnet_data_t\fR \fInet\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI).
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I net
.ad
.RS 7n
.rt
value returned from a successful call to
.BR net_protocol_lookup (9F).
.RE

.SH DESCRIPTION
.sp
.LP
The
.B net_protocol_walk()
function walks through all of the network
protocols that have been registered with this interface. The initial call to
.B net_protocol_walk()
should be made by passing in
.B NULL
as the
value for
.IR net .
When this function returns
.BR NULL ,
the end of the
list has been reached.
.sp
.LP
A caller of
.B net_protocol_walk()
is required to walk through the
entire list of network protocols, until
.B NULL
is returned or, when
finished with using the value returned, pass it into a call to
.BR net_protocol_release (9F).
.SH RETURN VALUES
.sp
.LP
The
.B net_protocol_walk()
function returns
.B NULL
when the end of
the list is returned. Otherwise, it returns a non-\fBNULL\fR value as a
token for being passed into other function calls within this interface.
.SH CONTEXT
.sp
.LP
The
.B net_protocol_walk()
function may be called from user,  kernel, or
interrupt context.
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
.BR net_protocol_lookup (9F),
.BR net_protocol_release (9F),
.BR attributes (5)
