usr/src/man/man9f/net_zoneidtonetid.9f
'\" te
.\" Copyright (C) 2008, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH net_zoneidtonetid 9F "1 May 2008" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
net_zoneidtonetid \- map a zoneid_t struture identifier to a netid_t
structure
.SH SYNOPSIS
.LP
.nf
#include <sys/neti.h>

\fBnetid_t\fR \fBnet_zoneidtonetid\fR(\fBconst\fR \fBzoneid_t\fR \fIzone\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI).
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I zone
.ad
.RS 8n
.rt
valid
.B zoneid_t
structure that refers to a running zone.
.RE

.SH DESCRIPTION
.sp
.LP
The
.B net_zoneidtonetid()
function maps the given
.BR zoneid_t
structure (used to represent a zone that is currently running) into a
.B netid_t
structure that is associated with the
.B IP
instance
supporting network functions for that zone.
.SH RETURN VALUES
.sp
.LP
The
.B net_zoneidtonetid()
function returns -1 if no mapping took place.
Otherwise, it returns the
.B netid_t
structure currently used by the
.B zoneid_t
structure. For zones that are using a shared
.B IP
instance, the
.B netid_t
structure for the instance owned by the global
zone is returned.
.SH CONTEXT
.sp
.LP
The
.B net_zoneidtonetid()
function may be called from user,  kernel, or
interrupt context.
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
.BR net_netidtozonid (9F),
.BR attributes (5)
