usr/src/man/man9f/net_zoneidtonetid.9f
'\" te
.\" Copyright (C) 2008, Sun Microsystems, Inc. All Rights Reserved.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH net_zoneidtonetid 9F "1 May 2008" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
net_zoneidtonetid \- map a zoneid_t struture identifier to a netid_t
structure
.SH SYNOPSIS
.LP
.nf
#include <sys/neti.h>

\fBnetid_t\fR \fBnet_zoneidtonetid\fR(\fBconst\fR \fBzoneid_t\fR \fIzone\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI).
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I zone
.ad
.RS 8n
.rt
valid
.B zoneid_t
structure that refers to a running zone.
.RE

.SH DESCRIPTION
.sp
.LP
The
.B net_zoneidtonetid()
function maps the given
.BR zoneid_t
structure (used to represent a zone that is currently running) into a
.B netid_t
structure that is associated with the
.B IP
instance
supporting network functions for that zone.
.SH RETURN VALUES
.sp
.LP
The
.B net_zoneidtonetid()
function returns -1 if no mapping took place.
Otherwise, it returns the
.B netid_t
structure currently used by the
.B zoneid_t
structure. For zones that are using a shared
.B IP
instance, the
.B netid_t
structure for the instance owned by the global
zone is returned.
.SH CONTEXT
.sp
.LP
The
.B net_zoneidtonetid()
function may be called from user,  kernel, or
interrupt context.
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
.BR net_netidtozonid (9F),
.BR attributes (5)
