usr/src/man/man9f/nochpoll.9f
'\" te
.\" Copyright (c) 2006, Sun Microsystems, Inc.,  All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH nochpoll 9F "16 Jan 2006" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
nochpoll \- error return function for non-pollable devices
.SH SYNOPSIS
.LP
.nf
#include <sys/ddi.h>
#include <sys/sunddi.h>



\fBint\fR \fBnochpoll\fR(\fBdev_t\fR \fIdev\fR, \fBshort\fR \fIevents\fR, \fBint\fR \fIanyyet\fR, \fBshort\fR \fI*reventsp\fR,
      \fBstruct pollhead\fR \fI**pollhdrp\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI).
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I dev
.ad
.RS 12n
.rt
Device number.
.RE

.sp
.ne 2
.mk
.na
.I events
.ad
.RS 12n
.rt
Event flags.
.RE

.sp
.ne 2
.mk
.na
.I anyyet
.ad
.RS 12n
.rt
Check current events only.
.RE

.sp
.ne 2
.mk
.na
.I reventsp
.ad
.RS 12n
.rt
Event flag pointer.
.RE

.sp
.ne 2
.mk
.na
.I pollhdrp
.ad
.RS 12n
.rt
Poll head pointer.
.RE

.SH DESCRIPTION
.sp
.LP
The
.B nochpoll()
function is a routine that simply returns the value
.BR ENXIO .
It is intended to be used in the \fBcb_ops\fR(9S) structure of
a device driver for devices that do not support the
.BR poll (2)
system
call.
.SH RETURN VALUES
.sp
.LP
The
.B nochpoll()
function returns
.BR ENXIO .
.SH CONTEXT
.sp
.LP
The
.B nochpoll()
function can be called from user, interrupt, or kernel
context.
.SH SEE ALSO
.sp
.LP
.BR poll (2),
.BR chpoll (9E),
.BR cb_ops (9S)
.sp
.LP
.I Writing Device Drivers
