usr/src/man/man9f/nulldev.9f
'\" te
.\" Copyright (c) 1991, Sun Microsystems, Inc.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH nulldev 9F "11 Apr 1991" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
nulldev \- zero return function
.SH SYNOPSIS
.LP
.nf
#include <sys/conf.h>
#include <sys/ddi.h>



\fBint\fR \fBnulldev\fR(\fB);\fR
.fi

.SH INTERFACE LEVEL
.sp
.LP
Architecture independent level 1
.RB ( DDI/DKI ).
.SH DESCRIPTION
.sp
.LP
.B nulldev()
returns
.BR 0 .
It is intended to be used in the
.BR cb_ops (9S)
data structure of a device driver for device entry points
that do nothing.
.SH RETURN VALUES
.sp
.LP
.B nulldev()
returns a
.BR 0 .
.SH CONTEXT
.sp
.LP
.B nulldev()
can be called from any context.
.SH SEE ALSO
.sp
.LP
.BR nodev (9F),
.BR cb_ops (9S)
.sp
.LP
.I Writing Device Drivers
