usr/src/man/man9f/nvlist_remove.9f
'\" te
.\" Copyright (c) 2006, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH nvlist_remove 9F "16 Jan 2006" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
nvlist_remove, nvlist_remove_all \- remove name-value pairs
.SH SYNOPSIS
.LP
.nf
#include <sys/nvpair.h>

\fBint\fR \fBnvlist_remove\fR(\fBnvlist_t *\fInvl\fR, \fBconst char *\fIname\fR, \fBdata_type_t\fR \fItype\fR);
.fi

.LP
.nf
\fBint\fR  \fBnvlist_remove_all\fR(\fBnvlist_t *\fInvl\fR, \fBconst char *\fIname\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI)
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I nvl
.ad
.RS 8n
.rt
The list of name-value pairs
.RB ( nvlist_t )
to be processed.
.RE

.sp
.ne 2
.mk
.na
.I name
.ad
.RS 8n
.rt
Name of the name-value pair
.RB ( nvpair )
to be removed.
.RE

.sp
.ne 2
.mk
.na
.I type
.ad
.RS 8n
.rt
Data type of the
.B nvpair
to be removed.
.RE

.SH DESCRIPTION
.sp
.LP
The
.B nvlist_remove()
function removes the first occurrence of
.I nvpair
that matches the name and the type.
.sp
.LP
The
.B nvlist_remove_all()
function removes all occurrences of
.I nvpair
that match the name, regardless of type.
.sp
.LP
Multiple threads can simultaneously read the same
.B nvlist_t
but only
one thread may actively change a given
.B nvlist_t
at a time. The caller
is responsible for the synchronization.
.SH RETURN VALUES
.sp
.LP
These functions return
.B 0
on success and an error value on failure.
.SH CONTEXT
.sp
.LP
The
.B nvlist_remove()
and
.B nvlist_remove_all()
functions can be
called from user, interrupt, or kernel context.
.SH ERRORS
.sp
.ne 2
.mk
.na
.B EINVAL
.ad
.RS 10n
.rt
There is an invalid argument.
.RE

.sp
.ne 2
.mk
.na
.B ENOENT
.ad
.RS 10n
.rt
No name-value pairs were found to match the criteria specified by name and
type.
.RE

