usr/src/man/man9f/nvlist_lookup_nvpair.9f
'\" te
.\" Copyright (c) 2007, Sun Microsystems Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH nvlist_lookup_nvpair 9F "24 Oct 2007" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
nvlist_lookup_nvpair, nvlist_exists \- lookup named pairs
.SH SYNOPSIS
.LP
.nf
#include <libnvpair.h>

\fBint\fR \fBnvlist_lookup_nvpair\fR(\fBnvlist_t *\fInvl\fR, \fBconst char *\fIname\fR,
     nvpair_t **\fInvp\fR);
.fi

.LP
.nf
\fBboolean_t\fR \fBnvlist_exists\fR(\fBnvlist_t *\fInvl\fR, \fBconst char *\fIname\fR);
.fi

.SH DESCRIPTION
.sp
.LP
The
.B nvlist_lookup_nvpair()
function returns the nvpair with the
matching name, regardless of type. It is valid only for lists allocated with
.BR NV_UNIQUE_NAME .
See
.BR nvlist_alloc (9F).
.sp
.LP
The
.B nvlist_exists()
function returns success if any nvpair exists
with the given name. It is valid for all types of lists.
.SH RETURN VALUES
.sp
.LP
The
.B nvlist_lookup_nvpair()
function returns 0 on success and an error
value on failure.
.sp
.LP
The
.B nvlist_exists()
function returns
.B B_TRUE
if an nvpair with
the given name exists and
.B B_FALSE
otherwise.
.SH ERRORS
.sp
.LP
The
.B nvlist_lookup_nvpair()
function will fail if:
.sp
.ne 2
.mk
.na
.B EINVAL
.ad
.RS 11n
.rt
There is an invalid argument.
.RE

.sp
.ne 2
.mk
.na
.B ENOENT
.ad
.RS 11n
.rt
No matching name-value pair is found.
.RE

.sp
.ne 2
.mk
.na
.B ENOTSUP
.ad
.RS 11n
.rt
The list was not allocated with
.BR NV_UNIQUE_NAME .
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
.BR nvlist_lookup_nvpair (3NVPAIR),
.BR nvlist_alloc (9F),
.BR attributes (5)
