usr/src/man/man9f/nvlist_next_nvpair.9f
'\" te
.\" Copyright (c) 2006, Sun Microsystems, Inc. All Rights Reserved.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH nvlist_next_nvpair 9F "16 Jan 2006" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
nvlist_next_nvpair, nvpair_name, nvpair_type \- return data regarding
name-value pairs
.SH SYNOPSIS
.LP
.nf
#include <sys/nvpair.h>

\fBnvpair_t *\fBnvlist_next_nvpair\fR(\fBnvlist_t *\fInvl\fR, \fBnvpair_t *\fInvpair\fR);
.fi

.LP
.nf
\fBchar *\fBnvpair_name\fR(\fBnvpair_t *\fInvpair\fR);
.fi

.LP
.nf
\fBdata_type_t\fR \fBnvpair_type\fR(\fBnvpair_t *\fInvpair\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI)
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I nvl
.ad
.RS 10n
.rt
The list of name-value pairs (\fBnvlist_t\fR) to be processed.
.RE

.sp
.ne 2
.mk
.na
.I nvpair
.ad
.RS 10n
.rt
Handle to a name-value pair.
.RE

.SH DESCRIPTION
.sp
.LP
The
.B nvlist_next_nvpair()
function returns a handle to the next
name-value pair (\fBnvpair\fR) in the list following
.IR nvpair .
If
.I nvpair
is NULL, the first pair is returned. If
.I nvpair
is the last
pair in the
.BR nvlist_t ,
NULL is returned.
.sp
.LP
The
.B nvpair_name()
function returns a string containing the name of
.IR nvpair .
.sp
.LP
The
.B nvpair_type()
function retrieves the value of the
.I nvpair
in
the form of enumerated type
.BR data_type_t .
This is used to determine the
appropriate
.B nvpair_*()
function to call for retrieving the value.
.SH RETURN VALUES
.sp
.LP
For
.BR nvpair_name() :
a string containing the name.
.sp
.LP
For
.BR nvpair_type() :
an enumerated data type
.BR data_type_t .
Possible
values for
.B data_type_t
are:
.sp
.in +2
.nf
DATA_TYPE_BOOLEAN
DATA_TYPE_BOOLEAN_VALUE
DATA_TYPE_BYTE
DATA_TYPE_INT8
DATA_TYPE_UINT8
DATA_TYPE_INT16
DATA_TYPE_UINT16
DATA_TYPE_INT32
DATA_TYPE_UINT32
DATA_TYPE_INT64
DATA_TYPE_UINT64
DATA_TYPE_STRING
DATA_TYPE_NVLIST
DATA_TYPE_BOOLEAN_ARRAY
DATA_TYPE_BYTE_ARRAY
DATA_TYPE_INT8_ARRAY
DATA_TYPE_UINT8_ARRAY
DATA_TYPE_INT16_ARRAY
DATA_TYPE_UINT16_ARRAY
DATA_TYPE_INT32_ARRAY
DATA_TYPE_UINT32_ARRAY
DATA_TYPE_INT64_ARRAY
DATA_TYPE_UINT64_ARRAY
DATA_TYPE_STRING_ARRAY
DATA_TYPE_NVLIST_ARRAY
.fi
.in -2
.sp

.sp
.LP
After nvpairs is removed from or replaced in an nvlist, it cannot be
manipulated. This includes
.BR nvlist_next_nvpair() ,
.B nvpair_name()
and
.BR nvpair_type() .
Replacement can happen during pair addition on
nvlists created with NV_UNIQUE_NAME_TYPE and NV_UNIQUE_NAME. See
.BR nvlist_alloc (9F)
for more details.
.SH CONTEXT
.sp
.LP
These functions can be called from user, interrupt, or kernel context.
