usr/src/man/man9f/outb.9f
'\" te
.\" Copyright (c) 2006, Sun Microsystems, Inc., All RIghts Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH outb 9F "16 Jan 2006" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
outb, outw, outl, repoutsb, repoutsw, repoutsd \- write to an I/O port
.SH SYNOPSIS
.LP
.nf
#include <sys/ddi.h>
#include <sys/sunddi.h>

\fBvoid\fR \fBoutb\fR(\fBint\fR \fIport\fR, \fBunsigned char\fR \fIvalue\fR);
.fi

.LP
.nf
\fBvoid\fR \fBoutw\fR(\fBint\fR \fIport\fR, \fBunsigned short\fR \fIvalue\fR);
.fi

.LP
.nf
\fBvoid\fR \fBoutl\fR(\fBint\fR \fIport\fR, \fBunsigned long\fR \fIvalue\fR);
.fi

.LP
.nf
\fBvoid\fR \fBrepoutsb\fR(\fBint\fR \fIport\fR, \fBunsigned char *\fIaddr\fR, \fBint\fR \fIcount\fR);
.fi

.LP
.nf
\fBvoid\fR \fBrepoutsw\fR(\fBint\fR \fIport\fR, \fBunsigned short *\fIaddr\fR, \fBint\fR \fIcount\fR);
.fi

.LP
.nf
\fBvoid\fR \fBrepoutsd\fR(\fBint\fR \fIport\fR, \fBunsigned long *\fIaddr\fR, \fBint\fR \fIcount\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
The functions described here are obsolete. For the
.BR outb() ,
.BR outw() ,
and
.B outl()
functions use, respectively,
.BR ddi_put8 (9F),
.BR ddi_put8 (9F),
and
.BR ddi_put8 "(9F) instead. For"
.BR repoutsb() ,
.BR repoutsw() ,
and\fBrepoutsl()\fR, use, respectively,
.BR ddi_rep_put8 (9F),
.BR ddi_rep_put8 (9F),
and
.BR ddi_rep_put8 (9F)
instead.
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I port
.ad
.RS 9n
.rt
A valid
.B I/O
port address.
.RE

.sp
.ne 2
.mk
.na
.I value
.ad
.RS 9n
.rt
The data to be written to the
.B I/O
port.
.RE

.sp
.ne 2
.mk
.na
.I addr
.ad
.RS 9n
.rt
The address of a buffer from which the values will be fetched.
.RE

.sp
.ne 2
.mk
.na
.I count
.ad
.RS 9n
.rt
The number of values to be written to the
.B I/O
port.
.RE

.SH DESCRIPTION
.sp
.LP
These routines write data of various sizes to the
.B I/O
port with the
address specified by
.IR port .
.sp
.LP
The
.BR outb() ,
.BR outw() ,
and
.B outl()
functions write 8 bits, 16
bits, and 32 bits of data respectively, writing the data specified by
.IR value .
.sp
.LP
The
.BR repoutsb() ,
.BR repoutsw() ,
and
.B repoutsd()
functions
.RI "write multiple 8-bit, 16-bit, and 32-bit values, respectively." " count"
specifies the number of values to be written.
.I addr
is a pointer to a
buffer from which the output values are fetched.
.SH CONTEXT
.sp
.LP
These functions may be called from user, interrupt, or kernel context.
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Architecturex86
_
Interface Stability Obsolete
.TE

.SH SEE ALSO
.sp
.LP
.BR isa (4),
.BR attributes (5),
.BR ddi_put8 (9F),
.BR ddi_put8 (9F),
.BR ddi_put8 (9F),
.BR ddi_rep_put8 (9F),
.BR ddi_rep_put8 (9F),
.BR ddi_rep_put8 (9F),
.BR inb (9F)
.sp
.LP
.I Writing Device Drivers
