usr/src/man/man9f/pci_config_setup.9f
'\" te
.\" Copyright (c) 1995, Sun Microsystems, Inc. , All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH pci_config_setup 9F "1 Jan 1997" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
pci_config_setup, pci_config_teardown \- setup or tear down the resources
for enabling accesses to the PCI Local Bus Configuration space
.SH SYNOPSIS
.LP
.nf
#include <sys/ddi.h>
 #include <sys/sunddi.h>



\fBint\fR \fBpci_config_setup\fR(\fBdev_info_t\fR \fI*dip\fR, \fBddi_acc_handle_t\fR \fI*handle\fR);
.fi

.LP
.nf
\fBvoid\fR \fBpci_config_teardown\fR(\fBddi_acc_handle_t\fR \fI*handle\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI).
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I dip
.ad
.RS 11n
.rt
Pointer to the device's
.B dev_info
structure.
.RE

.sp
.ne 2
.mk
.na
.I handle
.ad
.RS 11n
.rt
Pointer to a data access handle.
.RE

.SH DESCRIPTION
.sp
.LP
.B pci_config_setup()
sets up the necessary resources for enabling
subsequent data accesses to the
.B PCI
Local Bus Configuration space.
.B pci_config_teardown()
reclaims and removes those resources
represented by the data access handle returned from
.BR pci_config_setup() .
.SH RETURN VALUES
.sp
.LP
.B pci_config_setup()
returns:
.sp
.ne 2
.mk
.na
.B DDI_SUCCESS
.ad
.RS 16n
.rt
Successfully setup the resources.
.RE

.sp
.ne 2
.mk
.na
.B DDI_FAILURE
.ad
.RS 16n
.rt
Unable to allocate resources for setup.
.RE

.SH CONTEXT
.sp
.LP
.B pci_config_setup()
must be called from user or kernel context.
.B pci_config_teardown()
can be called from any context.
.SH NOTES
.sp
.LP
These functions are specific to
.B PCI
bus device drivers. For drivers
using these functions,  a single source to support devices with multiple bus
versions may not be easy to maintain.
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
ArchitecturePCI Local Bus
.TE

.SH SEE ALSO
.sp
.LP
.BR attributes (5)
.sp
.LP
.I IEEE 1275 PCI Bus Binding
