usr/src/man/man9f/pci_save_config_regs.9f
'\" te
.\" Copyright (c) 2002, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH pci_save_config_regs 9F "02 June 2000" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
pci_save_config_regs, pci_restore_config_regs \- save and restore the PCI
configuration registers
.SH SYNOPSIS
.LP
.nf
\fB#include <sys/ddi.h>\fR
\fB#include <sys/sunddi.h>\fR



\fBint\fR \fBpci_save_config_regs\fR(\fBdev_info_t *\fIdip\fR);
.fi

.LP
.nf
\fBint\fR \fBpci_restore_config_regs\fR(\fBdev_info_t *\fIdip\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI-specific (Solaris DDI).
.SH ARGUMENTS
.sp
.ne 2
.mk
.na
.I dip
.ad
.RS 7n
.rt
Pointer to the device's
.B dev_info
structure.
.RE

.SH DESCRIPTION
.sp
.LP
.B pci_save_config_regs()
saves the current configuration registers on
persistent system memory.
.B pci_restore_config_regs()
restores
configuration registers previously saved by
.BR pci_save_config_regs() .
.sp
.LP
.B pci_save_config_regs()
should be called by the driver's
.B power()
entry point before powering a device off (to PCI state D3). Likewise,
.B pci_restore_config_regs()
should be called after powering a device on
(from PCI state D3), but before accessing the device. See
.BR power (9E).
.SH RETURN VALUES
.sp
.LP
.B pci_save_config_regs()
and
.B pci_restore_config_regs()
return:
.sp
.ne 2
.mk
.na
.B DDI_SUCCESS
.ad
.RS 15n
.rt
Operation completed successfully.
.RE

.sp
.ne 2
.mk
.na
.B DDI_FAILURE
.ad
.RS 15n
.rt
Operation failed to complete successfully.
.RE

.SH CONTEXT
.sp
.LP
Both these functions can be called from user or kernel context.
.SH EXAMPLES
.LP
.B Example 1
Invoking the save and restore functions
.sp
.in +2
.nf
static int
xx_power(dev_info_t *dip, int component, int level) {
   struct xx *xx;
   int rval = DDI_SUCCESS;

   xx = ddi_get_soft_state(xx_softstate, ddi_get_instance(dip));
   if (xx == NULL) {
       return (DDI_FAILURE);
   }

   mutex_enter(&xx\(mi>x_mutex);

   switch (level) {
   case PM_LEVEL_D0:
       XX_POWER_ON(xx);
       if (pci_restore_config_regs(dip) == DDI_FAILURE) {
           /*
            * appropriate error path handling here
            */
           ...
           rval = DDI_FAILURE;
           }
       break;

   case PM_LEVEL_D3:
       if (pci_save_config_regs(dip) == DDI_FAILURE) {
            /*
             * appropriate error path handling here
             */
            ...
            rval = DDI_FAILURE;
            }
        else {
            XX_POWER_OFF(xx);
        }
        break;

    default:
          rval = DDI_FAILURE;
          break;
    }

    mutex_exit(&xx\(mi>x_mutex);
    return (rval);
}
.fi
.in -2

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
.BR attributes (5),
.BR power (9E)
.sp
.LP
.I Writing Device Drivers
.sp
.LP
.I "PCI Bus Power Management Interface Specification Version 1.1
.sp
.LP
.I PCI Bus Specification Revision 2.1
