usr/src/man/man9f/pm_busy_component.9f
'\" te
.\" Copyright (c) 2004, Sun Microsystems, Inc.,  All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH pm_busy_component 9F "21 July 2004" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
pm_busy_component, pm_idle_component \- control device component
availability for Power Management
.SH SYNOPSIS
.LP
.nf
#include <sys/ddi.h>
#include <sys/sunddi.h>



\fBint\fR \fBpm_busy_component\fR(\fBdev_info_t\fR \fI*dip\fR, \fBint\fR \fIcomponent\fR);
.fi

.LP
.nf
\fBint\fR \fBpm_idle_component\fR(\fBdev_info_t\fR \fI*dip\fR, \fBint\fR \fIcomponent\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI)
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I dip
.ad
.RS 13n
.rt
Pointer to the device's
.B dev_info
structure.
.RE

.sp
.ne 2
.mk
.na
.I component
.ad
.RS 13n
.rt
The number of the component to be power-managed.
.RE

.SH DESCRIPTION
.sp
.LP
The
.B pm_busy_component()
function sets
.I component
of
.I dip
to
be busy. Calls to
.B pm_busy_component()
are stacked, requiring a
corresponding number of calls to
.B pm_idle_component()
to make the
component idle again. When a device is busy it will not be power-managed by
the system.
.sp
.LP
The
.B pm_idle_component()
function marks
.I component
idle,
recording the time that
.I component
went idle. This function must be
called once for each call to
.BR pm_busy_component() .
A component which is
idle is available to be power-managed by the system. The
.B pm_idle_component()
function has no effect if the component is already
idle, except to update the system's notion of when the device went idle.
.sp
.LP
If these functions are called as a result of entry into the driver's
.BR attach (9E),
.BR detach (9E)
or
.BR power "(9E) entry point, these"
functions must be called from the same thread which entered
.BR attach (9E),
.BR detach (9E)
or
.BR power (9E).
.SH RETURN VALUES
.sp
.LP
The
.B pm_busy_component()
and
.B pm_idle_component()
functions
return:
.sp
.ne 2
.mk
.na
.B DDI_SUCCESS
.ad
.RS 15n
.rt
Successfully set the indicated component busy or idle.
.RE

.sp
.ne 2
.mk
.na
.B DDI_FAILURE
.ad
.RS 15n
.rt
Invalid component number
.I component
or the device has no components.
.RE

.SH CONTEXT
.sp
.LP
These functions can be called from user or kernel context. These functions
may also be called from interrupt context, providing they are not the first
Power Management function called by the driver.
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface stabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
.BR power.conf (4),
.BR pm (7D),
.BR attach (9E),
.BR detach (9E),
.BR power (9E),
.BR pm_raise_power (9F),
.BR pm (9P),
.BR pm-components (9P)
.sp
.LP
.I Writing Device Drivers
