usr/src/man/man9f/pm_trans_check.9f
'\" te
.\" Copyright (c) 2009, Sun Microsystems, Inc.  All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH pm_trans_check 9F "16 Jul 2009" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
pm_trans_check \- Device power cycle advisory check
.SH SYNOPSIS
.LP
.nf
#include <sys/sunddi.h>

\fBint\fR \fBpm_trans_check\fR(\fBstruct pm_trans_data *\fIdatap,\fR time_t *\fIintervalp\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI)
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I datap
.ad
.RS 9n
.rt
Pointer to a
.B pm_trans_data
structure
.RE

.sp
.ne 2
.mk
.na
.I intervalp
.ad
.RS 13n
.rt
Pointer to time difference when next power cycle will be advised
.RE

.SH DESCRIPTION
.sp
.LP
The
.B pm_trans_check()
function checks if a power-cycle is currently
advised based on data in the
.B pm_trans_data
structure. This function
is provided to prevent damage to devices from excess power cycles; drivers
for devices that are sensitive to the number of power cycles should call
.B pm_trans_check()
from their \fBpower\fR(9E) function before
powering-off a device. If
.B pm_trans_check()
indicates that the device
should not be power cycled, the driver should not attempt to power cycle the
device and should fail the call to
.BR power "(9E) entry point."
.sp
.LP
If
.B pm_trans_check()
returns that it is not advised to power cycle the
device, it attempts to calculate when the  next power cycle is advised,
based on the supplied parameters. In such case,
.I intervalp
returns the
time difference (in seconds) from the current time to when the next power
cycle is advised. If the time for the next power cycle cannot be determined,
.I intervalp
indicates
.BR 0 .
.sp
.LP
To avoid excessive calls to the
.BR power "(9E) entry point during a period"
when power cycling is not advised, the driver should mark the corresponding
device component busy for the
.I intervalp
time period (if interval is
not 0). Conveniently, the driver can utilize the fact that calls to
.BR pm_busy_component (9F)
are stacked. If power cycling is not advised,
the driver can call
.BR pm_busy_component "(9F)  and issue a"
.BR timeout (9F)
for the
.I intervalp
time. The
.B timeout()
handler
can issue the corresponding
.BR pm_idle_component "(9F) call."
.sp
.LP
The format field of
.B pm_trans_data
accepts either
.BR DC_SCSI_FORMAT
or
.BR DC_SMART_FORMAT .
If the caller provides information from a SCSI Log
Page, it should set the format field to
.BR DC_SCSI_FORMAT ,
and provide
valid data in
.IR svc_date [],
.IR lifemax ,
.I ncycles
and \fIflag\fR
in the
.B pm_scsi_cycles
structure. If the caller provides information
from a SMART feature attribute, it should set the format field to
.B DC_SMART_FORMAT
and provide valid data in
.IR allowed ,
.I usedup
and \fIflag\fR in the \fBpm_smart_count\fR structure, where \fIallowed\fR
indicates the normalized cycle count before reaching the borderline
threshold cycle count, and
.I usedup
indicates the normalized consumed
cycle count.
.sp
.LP
The \fIflag\fR field in both \fBpm_scsi_cycles\fR and \fBpm_smart_count\fR
structures is reserved for future use and must be set to 0.
.sp
.in +2
.nf
struct pm_trans_data {
       int format;            /* data format */
       union {
             struct pm_scsi_cycles scsi_cycles;
             struct pm_smart_count smart_count;
       } un;
};
.fi
.in -2

.SH RETURN VALUES
.sp
.ne 2
.mk
.na
.B 1
.ad
.RS 6n
.rt
Power cycle is advised.
.RE

.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 6n
.rt
Power cycle is not advised.
.RE

.sp
.ne 2
.mk
.na
.B -1
.ad
.RS 6n
.rt
Error due to invalid argument.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
.BR power.conf (4),
.BR attributes (5),
.BR power (9E)
.sp
.LP
.I Writing Device Drivers
.sp
.LP
.I Using Power Management
