usr/src/man/man9f/priv_policy.9f
'\" te
.\" Copyright (c) 2009, Sun Microsystems, Inc.  All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH priv_policy 9F "3 Apr 2009" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
priv_policy, priv_policy_only, priv_policy_choice \- check, report, and
audit privileges
.SH SYNOPSIS
.LP
.nf
#include <sys/policy.h>

\fBint\fR \fBpriv_policy\fR(\fBconst cred_t  *\fIcr\fR, \fBint\fR \fIpriv\fR, \fBint\fR \fIerr\fR,
     \fBboolean_t\fR \fIflag\fR, \fBconst char  *\fImsg\fR);
.fi

.LP
.nf
\fBboolean_t\fR \fBpriv_policy_only\fR(\fBconst cred_t  *\fIcr\fR, \fBint\fR \fIpriv\fR,
     \fBboolean_t\fR \fIflag\fR);
.fi

.LP
.nf
\fBboolean_t\fR \fBpriv_policy_choice\fR(\fBconst cred_t  *\fIcr\fR, \fBint\fR \fIpriv\fR,
     \fBboolean_t\fR \fIflag\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI).
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I cr
.ad
.RS 8n
.rt
The credential to be checked.
.RE

.sp
.ne 2
.mk
.na
.I priv
.ad
.RS 8n
.rt
The integer value of the privilege to test.
.RE

.sp
.ne 2
.mk
.na
.I flag
.ad
.RS 8n
.rt
All zone privileges flag. Set to
.B B_FALSE
for most tests or
.B B_TRUE
if the operation requires the caller to have all available
privileges in the zone.
.RE

.sp
.ne 2
.mk
.na
.I err
.ad
.RS 8n
.rt
The error code to return.
.RE

.sp
.ne 2
.mk
.na
.I msg
.ad
.RS 8n
.rt
String that is added to the privilege debugging message if one is
generated. NULL if no additional information is needed. Because the function
name is included in the output, NULL is usually the best value to pass as a
parameter.
.RE

.SH DESCRIPTION
.sp
.LP
These functions aid in privilege checking and privilege debugging.
.sp
.LP
The
.BR priv_policy() ,
.BR priv_policy_only() ,
and
.B priv_policy_choice()
functions all check whether
.I priv
is
asserted in the effective set of the credential. The special value
.B PRIV_ALL
tests for all privileges.
.sp
.LP
The
.B priv_policy()
function updates the ASU accounting flag and
records the privilege used on success in the audit trail if the required
privilege was not a basic privilege.
.sp
.LP
The
.B priv_policy_only()
function checks whether a privilege is
asserted and has no side effects.
.sp
.LP
The
.B priv_policy_choice()
function behaves like
.B priv_policy_only()
but records the successfully used non-basic
privileges in the audit trail.
.SH RETURN VALUES
.sp
.LP
On success,
.B priv_policy()
return 0. On failure it returns its
parameter
.IR err .
.sp
.LP
On success,
.B priv_policy_choice()
and
.B priv_policy_only()
return
1, on failure both return 0.
.SH ERRORS
.sp
.ne 2
.mk
.na
.B EINVAL
.ad
.RS 16n
.rt
This might be caused by any of the following:
.RS +4
.TP
.ie t \(bu
.el o
The
.I flags
parameter is invalid.
.RE
.RS +4
.TP
.ie t \(bu
.el o
The specified privilege does not exist.
.RE
.RS +4
.TP
.ie t \(bu
.el o
The
.I priv
parameter contains invalid characters.
.RE
.RE

.sp
.ne 2
.mk
.na
.B ENOMEM
.ad
.RS 16n
.rt
There is no room to allocate another privilege.
.RE

.sp
.ne 2
.mk
.na
.B ENAMETOOLONG
.ad
.RS 16n
.rt
An attempt was made to allocate a privilege that was longer than
.B {PRIVNAME_MAX}
characters.
.RE

.SH CONTEXT
.sp
.LP
This functions can be called from user, interrupt, or kernel context.
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for a description of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
\fBATTRIBUTE TYPE\fR\fBATTRIBUTE VALUE\fR
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
.BR acct (3HEAD),
.BR attributes (5),
.BR privileges (5)
.sp
.LP
.I Writing Device Drivers
