usr/src/man/man9f/ptob.9f
'\" te
.\" Copyright 1989 AT&T
.\" Copyright (c) 2006, Sun Microsystems, Inc.,  All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ptob 9F "16 Jan 2006" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
ptob \- convert size in pages to size in bytes
.SH SYNOPSIS
.LP
.nf
#include <sys/ddi.h>



\fBunsigned long\fR \fBptob\fR(\fBunsigned long\fR \fInumpages\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Architecture independent level 1 (DDI/DKI).
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I numpages
.ad
.RS 12n
.rt
Size in number of pages to convert to size in bytes.
.RE

.SH DESCRIPTION
.sp
.LP
This function returns the number of bytes that are contained in the
specified number of pages. For example, if the page size is 2048, then
.B ptob(2)
returns
.BR 4096 .
.B ptob(0)
returns
.BR 0 .
.SH RETURN VALUES
.sp
.LP
The return value is always the number of bytes in the specified number of
pages. There are no invalid input values, and no checking will be performed
for overflow in the case of a page count whose corresponding byte count
cannot be represented by an
.BR "unsigned long" .
Rather, the higher order
bits will be ignored.
.SH CONTEXT
.sp
.LP
The
.B ptob()
function can be called from user, interrupt, or kernel
context.
.SH SEE ALSO
.sp
.LP
.BR btop (9F),
.BR btopr (9F),
.BR ddi_ptob (9F)
.sp
.LP
.I Writing Device Drivers
