usr/src/man/man9f/putctl1.9f
'\" te
.\" Copyright 1989 AT&T
.\" Copyright (c) 2006, Sun Microsystems, Inc.,
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\"  All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH putctl1 9F "16 Jan 2006" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
putctl1 \- send a control message with a one-byte parameter to a queue
.SH SYNOPSIS
.LP
.nf
#include <sys/stream.h>



\fBint\fR \fBputctl1\fR(\fBqueue_t *\fIq\fR, \fBint\fR \fItype\fR, \fBint\fR \fIp\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Architecture independent level 1 (DDI/DKI).
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I q
.ad
.RS 8n
.rt
Queue to which the message is to be sent.
.RE

.sp
.ne 2
.mk
.na
.I type
.ad
.RS 8n
.rt
Type of message.
.RE

.sp
.ne 2
.mk
.na
.I p
.ad
.RS 8n
.rt
One-byte parameter.
.RE

.SH DESCRIPTION
.sp
.LP
The
.B putctl1()
function, like
.BR putctl (9F),
tests the \fItype\fR
argument to make sure a data type has not been specified, and attempts to
allocate a message block. The
.I p
parameter can be used, for example, to
specify how long the delay will be when an
.B M_DELAY
message is being
sent.
.B putctl1()
fails if
.I type
is
.BR M_DATA ,
.BR M_PROTO ,
or
.BR M_PCPROTO ,
or if a message block cannot be allocated. If successful,
.B putctl1()
calls the
.BR put (9E)
routine of the queue pointed to by
.I q
with the newly allocated and initialized message.
.SH RETURN VALUES
.sp
.LP
On success,
.B 1
is returned.
.B 0
is returned if
.I type
is a
data type, or if a message block cannot be allocated.
.SH CONTEXT
.sp
.LP
The
.B putctl1()
function can be called from user, interrupt, or kernel
context.
.SH EXAMPLES
.sp
.LP
See the
.BR putctl (9F)
function page for an example of
.BR putctl1() .
.SH SEE ALSO
.sp
.LP
.BR put (9E),
.BR allocb (9F),
.BR datamsg (9F),
.BR putctl (9F),
.BR putnextctl1 (9F)
.sp
.LP
.I Writing Device Drivers
.sp
.LP
.I STREAMS Programming Guide
