usr/src/man/man9f/putnext.9f
'\" te
.\" Copyright (c) 2006, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright 1989 AT&T
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH putnext 9F "16 Jan 2006" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
putnext \- send a message to the next queue
.SH SYNOPSIS
.LP
.nf
#include <sys/stream.h>
#include <sys/ddi.h>



\fBvoid\fR \fBputnext\fR(\fBqueue_t *\fIq\fR, \fBmblk_t *\fImp\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Architecture independent level 1 (DDI/DKI).
.SH PARAMETERS
.sp
.ne 2
.mk
.na
\fIq\fR
.ad
.RS 6n
.rt
Pointer to the queue from which the message \fImp\fR will be sent.
.RE

.sp
.ne 2
.mk
.na
\fImp\fR
.ad
.RS 6n
.rt
Message to be passed.
.RE

.SH DESCRIPTION
.sp
.LP
The \fBputnext()\fR function is used to pass a message to the \fBput\fR(9E)
routine of the next queue in the stream.
.SH RETURN VALUES
.sp
.LP
None.
.SH CONTEXT
.sp
.LP
The \fBputnext()\fR function can be called from user, interrupt, or kernel
context.
.SH EXAMPLES
.sp
.LP
See \fBallocb\fR(9F) for an example of using \fBputnext()\fR.
.SH SEE ALSO
.sp
.LP
\fBput\fR(9E), \fBallocb\fR(9F), \fBput\fR(9F), \fBqprocson\fR(9F)
.sp
.LP
\fIWriting Device Drivers\fR
.sp
.LP
\fISTREAMS Programming Guide\fR
.SH NOTES
.sp
.LP
The \fBput()\fR and \fBputnext()\fR functions should be called only after
\fBqprocson()\fR is finished.
