usr/src/man/man9f/putnext.9f
'\" te
.\" Copyright (c) 2006, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" Copyright 1989 AT&T
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH putnext 9F "16 Jan 2006" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
putnext \- send a message to the next queue
.SH SYNOPSIS
.LP
.nf
#include <sys/stream.h>
#include <sys/ddi.h>



\fBvoid\fR \fBputnext\fR(\fBqueue_t *\fIq\fR, \fBmblk_t *\fImp\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Architecture independent level 1 (DDI/DKI).
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I q
.ad
.RS 6n
.rt
Pointer to the queue from which the message
.I mp
will be sent.
.RE

.sp
.ne 2
.mk
.na
.I mp
.ad
.RS 6n
.rt
Message to be passed.
.RE

.SH DESCRIPTION
.sp
.LP
The
.B putnext()
function is used to pass a message to the
.BR put (9E)
routine of the next queue in the stream.
.SH RETURN VALUES
.sp
.LP
None.
.SH CONTEXT
.sp
.LP
The
.B putnext()
function can be called from user, interrupt, or kernel
context.
.SH EXAMPLES
.sp
.LP
See \fBallocb\fR(9F) for an example of using
.BR putnext() .
.SH SEE ALSO
.sp
.LP
.BR put (9E),
.BR allocb (9F),
.BR put (9F),
.BR qprocson (9F)
.sp
.LP
.I Writing Device Drivers
.sp
.LP
.I STREAMS Programming Guide
.SH NOTES
.sp
.LP
The
.B put()
and
.B putnext()
functions should be called only after
.B qprocson()
is finished.
