usr/src/man/man9f/putq.9f
'\" te
.\" Copyright 1989 AT&T
.\" Copyright (c) 2006, Sun Microsystems, Inc.,  All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH putq 9F "16 Jan 2006" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
putq \- put a message on a queue
.SH SYNOPSIS
.LP
.nf
#include <sys/stream.h>



\fBint\fR \fBputq\fR(\fBqueue_t *\fIq\fR, \fBmblk_t *\fIbp\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Architecture independent level 1 (DDI/DKI).
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I q
.ad
.RS 6n
.rt
Pointer to the queue to which the message is to be added.
.RE

.sp
.ne 2
.mk
.na
.I bp
.ad
.RS 6n
.rt
Message to be put on the queue.
.RE

.SH DESCRIPTION
.sp
.LP
The
.B putq()
function is used to put messages on a driver's queue after
the module's put routine has finished processing the message. The message is
placed after any other messages of the same priority, and flow control
parameters are updated. If
.B QNOENB
is not set, the service routine is
enabled. If no other processing is done,
.B putq()
can be used as the
module's put routine.
.SH RETURN VALUES
.sp
.LP
The
.B putq()
function returns
.B 1
on success and
.B 0
on
failure.
.sp
.LP
Upon failure, the caller should call
.BR freemsg (9F)
to free the pointer
to the message block.
.SH CONTEXT
.sp
.LP
The
.B putq()
function can be called from user, interrupt, or kernel
context.
.SH EXAMPLES
.sp
.LP
See the
.BR datamsg (9F)
function page for an example of
.BR putq() .
.SH SEE ALSO
.sp
.LP
.BR datamsg (9F),
.BR putbq (9F),
.BR qenable (9F),
.BR rmvq (9F)
.sp
.LP
.I Writing Device Drivers
.sp
.LP
.I STREAMS Programming Guide
