usr/src/man/man9f/qassociate.9f
'\" te
.\" Copyright (c) 2007, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH qassociate 9F "01 Feb 2007" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
qassociate \- associate STREAMS queue with driver instance
.SH SYNOPSIS
.LP
.nf
#include <sys/types.h>
#include <sys/stream.h>
#include <sys/stropts.h>
#include <sys/ddi.h>
#include <sys/sunddi.h>

\fBint\fR \fBqassociate\fR(\fBqueue_t *\fIq\fR, \fBint\fR \fIinstance\fR
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI).
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.BI "queue_t *" q
.ad
.RS 16n
.rt
Pointer to a
.BR queue "(9S) structure. Either the read or write queue can"
be used.
.RE

.sp
.ne 2
.mk
.na
.BI "int " instance
.ad
.RS 16n
.rt
Driver instance number or -1.
.RE

.SH DESCRIPTION
.sp
.LP
The
.B qassociate()
function must be used by
.B DLPI
style 2 device
drivers to manage the association between STREAMS queues and device
instances. The \fBgld\fR(7D) does this automatically on behalf of drivers
based on it. It is recommended that the \fBgld\fR(7D) be used for network
device drivers whenever possible.
.sp
.LP
The
.B qassociate()
function associates the specified STREAMS queue with
the specified instance of the bottom driver in the queue. Upon successful
return, the stream is associated with the instance with any prior
association dissolved.
.sp
.LP
A DLPI style 2 driver calls
.B qassociate()
while processing the
.B DL_ATTACH_REQ
message. The driver is also expected to call this
interface while performing stream associations through other means, such as
.BR ndd (1M)
ioctl commands.
.sp
.LP
If
.I instance
is -1, the stream is left unassociated with any hardware
instance.
.sp
.LP
If the interface returns failure, the stream is not associated with the
specified instance. Any prior association is left untouched.
.sp
.LP
The interface typically fails because of failure to locate and attach the
device instance. The interface never fails if the specified instance is
-1.
.SH CONTEXT
.sp
.LP
The
.B qassociate()
function can be called from the stream's
.BR put (9E)
entry point.
.SH RETURN VALUES
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 6n
.rt
Success.
.RE

.sp
.ne 2
.mk
.na
.B -1
.ad
.RS 6n
.rt
Failure.
.RE

.SH EXAMPLES
.sp
.LP
DLPI style 2 network driver
.B DL_ATTACH_REQ
code specifies:
.sp
.in +2
.nf
if (qassociate(q, instance) != 0)
                goto fail;
.fi
.in -2

.sp
.LP
The association prevents Dynamic Reconfiguration (DR) from detaching the
instance.
.sp
.LP
DLPI style 2 network driver
.B DL_DETACH
code specifies:
.sp
.in +2
.nf
(void) qassociate(q, -1);
.fi
.in -2

.sp
.LP
This dissolves the queue's association with any device instance.
.sp
.LP
DLPI style 2 network driver
.BR open "(9E) code must call:"
.sp
.in +2
.nf
qassociate(q, -1);
.fi
.in -2

.sp
.LP
This informs the framework that this driver has been modified to be
DDI-compliant.
.SH SEE ALSO
.sp
.LP
.BR dlpi (7P),
.BR gld (7D),
.BR open (9E),
.BR put (9E),
.BR ddi_no_info (9F),
.BR queue (9S)
