usr/src/man/man9f/qprocson.9f
'\" te
.\" Copyright (c) 2006, Sun Microsystems, Inc.,  All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH qprocson 9F "16 Jan 2006" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
qprocson, qprocsoff \- enable, disable put and service routines
.SH SYNOPSIS
.LP
.nf
#include <sys/stream.h>
#include <sys/ddi.h>

\fBvoid\fR \fBqprocson\fR(\fBqueue_t *\fIq\fR);
.fi

.LP
.nf
\fBvoid\fR \fBqprocsoff\fR(\fBqueue_t *\fIq\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Architecture independent level 1 (DDI/DKI).
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I q
.ad
.RS 5n
.rt
Pointer to the
.B RD
side of a streams queue pair.
.RE

.SH DESCRIPTION
.sp
.LP
The
.B qprocson()
enables the put and service routines of the driver or
module whose read queue is pointed to by
.IR q .
Threads cannot enter the
module instance through the put and service routines while they are
disabled.
.sp
.LP
The
.B qprocson()
function must be called by the open routine of a
driver or module before returning, and after any initialization necessary
for the proper functioning of the put and service routines.
.sp
.LP
The
.B qprocson()
function must be called before calling
.BR put (9F),
.BR putnext (9F),
.BR qbufcall (9F),
.BR qtimeout (9F),
.BR qwait (9F),
or
.BR qwait_sig (9F).
.sp
.LP
The
.B qprocsoff()
function must be called by the close routine of a
driver or module before returning, and before deallocating any resources
necessary for the proper functioning of the put and service routines. It
also removes the queue's service routines from the service queue, and blocks
until any pending service processing completes.
.sp
.LP
The module or driver instance is guaranteed to be single-threaded before
.B qprocson()
is called and after
.B qprocsoff()
is called, except for
threads executing asynchronous events such as interrupt handlers and
callbacks, which must be handled separately.
.SH CONTEXT
.sp
.LP
These routines can be called from user, interrupt, or kernel context.
.SH SEE ALSO
.sp
.LP
.BR close (9E),
.BR open (9E),
.BR put (9E),
.BR srv (9E),
.BR put (9F),
.BR putnext (9F),
.BR qbufcall (9F),
.BR qtimeout (9F),
.BR qwait (9F),
.BR qwait_sig (9F)
.sp
.LP
.I Writing Device Drivers
.sp
.LP
.I STREAMS Programming Guide
.SH NOTES
.sp
.LP
The caller may not have the stream frozen during either of these calls.
