usr/src/man/man9f/qreply.9f
'\" te
.\" Copyright 1989 AT&T
.\" Copyright (c) 2006, Sun Microsystems, Inc.,  All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH qreply 9F "16 Jan 2006" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
qreply \- send a message on a stream in the reverse direction
.SH SYNOPSIS
.LP
.nf
#include <sys/stream.h>



\fBvoid\fR \fBqreply\fR(\fBqueue_t *\fIq\fR, \fBmblk_t *\fImp\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Architecture independent level 1 (DDI/DKI).
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I q
.ad
.RS 6n
.rt
Pointer to the queue.
.RE

.sp
.ne 2
.mk
.na
.I mp
.ad
.RS 6n
.rt
Pointer to the message to be sent in the opposite direction.
.RE

.SH DESCRIPTION
.sp
.LP
The
.B qreply()
function sends messages in the reverse direction of
normal flow. That is, \fBqreply(\fIq\fB,\fR \fImp\fB)\fR is
equivalent to \fBputnext(OTHERQ(\fIq\fB),\fR \fImp\fB)\fR.
.SH CONTEXT
.sp
.LP
The
.B qreply()
function can be called from user, interrupt, or kernel
context.
.SH EXAMPLES
.LP
.B Example 1
Canonical Flushing Code for STREAMS Drivers.
.sp
.LP
This example depicts the canonical flushing code for STREAMS drivers.
Assume that the driver has service procedures so that there may be messages
on its queues. See
.BR srv (9E).
Its write-side put procedure handles
.B M_FLUSH
messages by first checking the
.B FLUSHW
bit  in the first
byte of the message, then the write queue is flushed (line 8) and the
.B FLUSHW
bit is turned off (line 9). See \fBput\fR(9E). If the
.B FLUSHR
bit is on, then the read queue is flushed (line 12) and the
message is sent back up the read side of the stream with the
.BR qreply()
function (line 13). If the
.B FLUSHR
bit is off, then the message is
freed (line 15). See the example for \fBflushq\fR(9F) for the canonical
flushing code for modules.

.sp
.in +2
.nf
1  xxxwput(q, mp)
 2    queue_t *q;
 3    mblk_t *mp;
 4  {
 5	    switch(mp->b_datap->db_type) {
 6	    case M_FLUSH:
 7           if (*mp->b_rptr & FLUSHW) {
 8                  flushq(q, FLUSHALL);
 9                  *mp->b_rptr &= ~FLUSHW;
10	          }
11           if (*mp->b_rptr & FLUSHR) {
12                  flushq(RD(q), FLUSHALL);
13	                 qreply(q, mp);
14           } else {
15	                 freemsg(mp);
16	          }
17           break;
	      . . .
18     }
19  }
.fi
.in -2

.SH SEE ALSO
.sp
.LP
.BR put (9E),
.BR srv (9E),
.BR flushq (9F),
.BR OTHERQ (9F),
.BR putnext (9F)
.sp
.LP
.I Writing Device Drivers
.sp
.LP
.I STREAMS Programming Guide
