usr/src/man/man9f/rmalloc_wait.9f
'\" te
.\" Copyright (c) 2006, Sun Microsystems, Inc.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\"  All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH rmalloc_wait 9F "16 Jan 2006" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
rmalloc_wait \- allocate space from a resource map, wait if necessary
.SH SYNOPSIS
.LP
.nf
#include <sys/map.h>
#include <sys/ddi.h>



\fBunsigned long\fR \fBrmalloc_wait\fR(\fBstruct map *\fImp\fR, \fBsize_t\fR \fIsize\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Architecture independent level 1
.RB ( DDI/DKI ).
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I mp
.ad
.RS 8n
.rt
Pointer to the resource map from which space is to be allocated.
.RE

.sp
.ne 2
.mk
.na
.I size
.ad
.RS 8n
.rt
Number of units of space to allocate.
.RE

.SH DESCRIPTION
.sp
.LP
The
.B rmalloc_wait()
function requests an allocation of space from a
resource map.
.B rmalloc_wait()
is similar to the
.BR rmalloc (9F)
function with the exception that it will wait for space to become available if
necessary.
.SH RETURN VALUES
.sp
.LP
The
.B rmalloc_wait()
function returns the base of the allocated space.
.SH CONTEXT
.sp
.LP
This function can be called from user, interrupt, or kernel context. However,
in most cases
.B rmalloc_wait()
should not be called from interrupt
context.
.SH SEE ALSO
.sp
.LP
.BR rmalloc (9F),
.BR rmallocmap (9F),
.BR rmfree (9F),
.BR rmfreemap (9F)
.sp
.LP
.I Writing Device Drivers
