usr/src/man/man9f/scsi_hba_lookup_capstr.9f
'\" te
.\" Copyright (c) 2006, Sun Microsystems, Inc., All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH scsi_hba_lookup_capstr 9F "13 May 2006" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
scsi_hba_lookup_capstr \- return index matching capability string
.SH SYNOPSIS
.LP
.nf
#include <sys/scsi/scsi.h>



\fBint\fR \fBscsi_hba_lookup_capstr\fR(\fBchar *\fIcapstr\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris architecture specific (Solaris DDI).
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I capstr
.ad
.RS 10n
.rt
Pointer to a string
.RE

.SH DESCRIPTION
.sp
.LP
The
.B scsi_hba_lookup_capstr()
function attempts to match
.IR capstr
against a known set of capability strings. If found, the defined index for
the matched capability is returned.
.sp
.LP
The following indices are defined for the capability strings listed
below.
.sp
.ne 2
.mk
.na
.B SCSI_CAP_DMA_MAX
.ad
.sp .6
.RS 4n
"\fBdma-max\fR" or "\fBdma_max\fR"
.RE

.sp
.ne 2
.mk
.na
.B SCSI_CAP_MSG_OUT
.ad
.sp .6
.RS 4n
"\fBmsg-out\fR" or "\fBmsg_out\fR"
.RE

.sp
.ne 2
.mk
.na
.B SCSI_CAP_DISCONNECT
.ad
.sp .6
.RS 4n
"\fBdisconnect\fR"
.RE

.sp
.ne 2
.mk
.na
.B SCSI_CAP_SYNCHRONOUS
.ad
.sp .6
.RS 4n
"\fBsynchronous\fR"
.RE

.sp
.ne 2
.mk
.na
.B SCSI_CAP_WIDE_XFER
.ad
.sp .6
.RS 4n
"\fBwide-xfer\fR" or "\fBwide_xfer\fR"
.RE

.sp
.ne 2
.mk
.na
.B SCSI_CAP_PARITY
.ad
.sp .6
.RS 4n
"\fBparity\fR"
.RE

.sp
.ne 2
.mk
.na
.B SCSI_CAP_INITIATOR_ID
.ad
.sp .6
.RS 4n
"\fBinitiator-id\fR"
.RE

.sp
.ne 2
.mk
.na
.B SCSI_CAP_UNTAGGED_QING
.ad
.sp .6
.RS 4n
"\fBuntagged-qing\fR"
.RE

.sp
.ne 2
.mk
.na
.B SCSI_CAP_TAGGED_QING
.ad
.sp .6
.RS 4n
"\fBtagged-qing\fR"
.RE

.sp
.ne 2
.mk
.na
.B SCSI_CAP_ARQ
.ad
.sp .6
.RS 4n
"\fBauto-rqsense\fR"
.RE

.sp
.ne 2
.mk
.na
.B SCSI_CAP_LINKED_CMDS
.ad
.sp .6
.RS 4n
"\fBlinked-cmds\fR"
.RE

.sp
.ne 2
.mk
.na
.B SCSI_CAP_SECTOR_SIZE
.ad
.sp .6
.RS 4n
"\fBsector-size\fR"
.RE

.sp
.ne 2
.mk
.na
.B SCSI_CAP_TOTAL_SECTORS
.ad
.sp .6
.RS 4n
"\fBtotal-sectors\fR"
.RE

.sp
.ne 2
.mk
.na
.B SCSI_CAP_GEOMETRY
.ad
.sp .6
.RS 4n
"\fBgeometry\fR"
.RE

.sp
.ne 2
.mk
.na
.B SCSI_CAP_RESET_NOTIFICATION
.ad
.sp .6
.RS 4n
"\fBreset-notification\fR"
.RE

.sp
.ne 2
.mk
.na
.B SCSI_CAP_QFULL_RETRIES
.ad
.sp .6
.RS 4n
"\fBqfull-retries\fR"
.RE

.sp
.ne 2
.mk
.na
.B SCSI_CAP_QFULL_RETRY_INTERVAL
.ad
.sp .6
.RS 4n
"\fBqfull-retry-interval\fR"
.RE

.sp
.ne 2
.mk
.na
.B SCSI_CAP_LUN_RESET
.ad
.sp .6
.RS 4n
"\fBlun-reset\fR"
.RE

.sp
.ne 2
.mk
.na
.B SCSI_CAP_CDB_LEN
.ad
.sp .6
.RS 4n
"\fBmax-cdb-length\fR"
.RE

.SH RETURN VALUES
.sp
.LP
The
.B scsi_hba_lookup_capstr()
function returns a non-negative index
value that corresponds to the capability string. If the string does not
match a known capability,
.B -1
is returned.
.SH CONTEXT
.sp
.LP
The
.B scsi_hba_lookup_capstr()
function can be called from user,
interrupt, or kernel context.
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
.BR tran_getcap (9E),
.BR tran_setcap (9E),
.BR scsi_ifgetcap (9F),
.BR scsi_ifsetcap (9F),
.BR scsi_reset_notify (9F)
.sp
.LP
.I Writing Device Drivers
