usr/src/man/man9f/scsi_slave.9f
'\" te
.\" Copyright (c) 2002, Sun Microsystems, Inc., All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH scsi_slave 9F "27 Sep 2002" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
scsi_slave \- utility for SCSI target drivers to establish the presence of
a target
.SH SYNOPSIS
.LP
.nf
#include <sys/scsi/scsi.h>



\fBint\fR \fBscsi_slave\fR(\fBstruct scsi_device *\fIdevp\fR, \fBint\fR \fB(*\fRcallback\fB)(void)\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
The
.B scsi_slave()
function is obsolete. This function has been
replaced by
.BR scsi_probe (9F).
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I devp
.ad
.RS 13n
.rt
Pointer to a
.BR scsi_device "(9S) structure."
.RE

.sp
.ne 2
.mk
.na
.I callback
.ad
.RS 13n
.rt
Pointer to a callback function,
.B NULL_FUNC
or
.BR SLEEP_FUNC .
.RE

.SH DESCRIPTION
.sp
.LP
.B scsi_slave()
checks for the presence of a
.B SCSI
device. Target
drivers may use this function in their
.BR probe "(9E) routines."
.B scsi_slave()
determines if the device is present by using a Test Unit
Ready command followed by an Inquiry command. If
.B scsi_slave()
is
successful, it will fill in the
.B scsi_inquiry
structure, which is the
.B sd_inq
member of the
.BR scsi_device "(9S) structure, and return"
.BR SCSI_PROBE_EXISTS .
This information can be used to determine if the
.RI "target driver has probed the correct SCSI device type." " callback"
indicates what the allocator routines should do when
.B DMA
resources are
not available:
.sp
.ne 2
.mk
.na
.B NULL_FUNC
.ad
.RS 16n
.rt
Do not wait for resources. Return a
.I NULL
pointer.
.RE

.sp
.ne 2
.mk
.na
.B SLEEP_FUNC
.ad
.RS 16n
.rt
Wait indefinitely for resources.
.RE

.sp
.ne 2
.mk
.na
.B Other Values
.ad
.RS 16n
.rt
.I callback
points to a function which is called when resources may have
become available.
.I callback
.B must
return either
.BR 0
(indicating that it attempted to allocate resources but again failed to do
so), in which case it is put back on a list to be called again later, or
.B 1
indicating either success in allocating resources or indicating that
it no longer cares for a retry.
.RE

.SH RETURN VALUES
.sp
.LP
.B scsi_slave()
returns:
.sp
.ne 2
.mk
.na
.B SCSIPROBE_NOMEM
.ad
.RS 22n
.rt
No space available for structures.
.RE

.sp
.ne 2
.mk
.na
.B SCSIPROBE_EXISTS
.ad
.RS 22n
.rt
Device exists and inquiry data is valid.
.RE

.sp
.ne 2
.mk
.na
.B SCSIPROBE_NONCCS
.ad
.RS 22n
.rt
Device exists but inquiry data is not valid.
.RE

.sp
.ne 2
.mk
.na
.B SCSIPROBE_FAILURE
.ad
.RS 22n
.rt
Polled command failure.
.RE

.sp
.ne 2
.mk
.na
.B SCSIPROBE_NORESP
.ad
.RS 22n
.rt
No response to
.BR "TEST UNIT READY" .
.RE

.SH CONTEXT
.sp
.LP
.B scsi_slave()
is normally called from the target driver's
.BR probe (9E)
or
.BR attach "(9E) routine. In any case, this routine"
should not be called from interrupt context, because it can sleep waiting
for memory to be allocated.
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for a description of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
\fBATTRIBUTE TYPE\fR\fBATTRIBUTE VALUE\fR
_
Stability LevelObsolete
.TE

.SH SEE ALSO
.sp
.LP
.BR attributes (5),
.BR attach (9E),
.BR probe (9E),
.BR ddi_iopb_alloc (9F),
.BR makecom (9F),
.BR scsi_dmaget (9F),
.BR scsi_ifgetcap (9F),
.BR scsi_pktalloc (9F),
.BR scsi_poll (9F),
.BR scsi_probe (9F),
.BR scsi_device (9S)
.sp
.LP
 \fIANSI Small Computer System Interface-2 (SCSI-2)\fR
.sp
.LP
.I Writing Device Drivers
.SH NOTES
.sp
.LP
The
.B scsi_slave()
function is obsolete and will be discontinued in a
future release. This function has been replaced by
.BR scsi_probe (9F).
