usr/src/man/man9f/scsi_dmaget.9f
'\" te
.\" Copyright (c) 2006, Sun Microsystems, Inc.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH scsi_dmaget 9F "16 Jan 2006" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
scsi_dmaget, scsi_dmafree \- SCSI dma utility routines
.SH SYNOPSIS
.LP
.nf
#include <sys/scsi/scsi.h>



\fBstruct scsi_pkt *\fBscsi_dmaget\fR(\fBstruct scsi_pkt *\fIpkt\fR,
     \fBopaque_t\fR \fIdmatoken\fR, \fBint\fB(*\fRcallback\fB)(void)\fR);
.fi

.LP
.nf
\fBvoid\fR \fBscsi_dmafree\fR(\fBstruct scsi_pkt *\fIpkt\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
These interfaces are obsolete. Use \fBscsi_init_pkt\fR(9F) instead of
.BR scsi_dmaget() .
Use
.BR scsi_destroy_pkt (9F)
instead of
.BR scsi_dmafree() .
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I pkt
.ad
.RS 12n
.rt
A pointer to a
.BR scsi_pkt "(9S) structure."
.RE

.sp
.ne 2
.mk
.na
.I dmatoken
.ad
.RS 12n
.rt
Pointer to an implementation dependent object.
.RE

.sp
.ne 2
.mk
.na
.I callback
.ad
.RS 12n
.rt
Pointer to a callback function, or
.B NULL_FUNC
or
.BR SLEEP_FUNC.
.RE

.SH DESCRIPTION
.sp
.LP
The
.B scsi_dmaget()
function allocates
.B DMA
resources for an
already allocated
.B SCSI
packet.
.I pkt
is a pointer to the
previously allocated
.B SCSI
packet (see \fBscsi_pktalloc\fR(9F)).
.sp
.LP
The
.I dmatoken
parameter is a pointer to an implementation dependent
object which defines the length, direction, and address of the data transfer
associated with this
.B SCSI
packet (command). The
.I dmatoken
must be
a pointer to a \fBbuf\fR(9S) structure. If
.I dmatoken
is
.IR NULL ,
no
resources are allocated.
.sp
.LP
The
.I callback
parameter indicates what
.B scsi_dmaget()
should do
when resources are not available:
.sp
.ne 2
.mk
.na
.B NULL_FUNC
.ad
.RS 16n
.rt
Do not wait for resources. Return a
.I NULL
pointer.
.RE

.sp
.ne 2
.mk
.na
.B SLEEP_FUNC
.ad
.RS 16n
.rt
Wait indefinitely for resources.
.RE

.sp
.ne 2
.mk
.na
.B Other Values
.ad
.RS 16n
.rt
\fIcallback\fR points to a function which is called when resources may have
become available.
.I callback
must return either
.B 0
(indicating that
it attempted to allocate resources but failed to do so again), in which case
it is put back on a list to be called again later, or
.B 1
indicating
either success in allocating resources or indicating that it no longer cares
for a retry.
.RE

.sp
.LP
The \fBscsi_dmafree()\fR function frees the
.B DMA
resources associated
with the
.B SCSI
packet. The packet itself remains allocated.
.SH RETURN VALUES
.sp
.LP
The
.B scsi_dmaget()
function returns a pointer to a
.B scsi_pkt
on
success. It returns
.B NULL
if resources are not available.
.SH CONTEXT
.sp
.LP
If
.I callback
is
.BR SLEEP_FUNC ,
then this routine may only be called
from user or kernel context. Otherwise, it may be called from user, kernel,
or interrupt context. The
.I callback
function may not block or call
routines that block.
.sp
.LP
The \fBscsi_dmafree()\fR function can be called from user, interrupt, or
kernel context.
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for a description of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
\fBATTRIBUTE TYPE\fR\fBATTRIBUTE VALUE\fR
_
Stability LevelObsolete
.TE

.SH SEE ALSO
.sp
.LP
.BR attributes (5),
.BR scsi_pktalloc (9F),
.BR scsi_pktfree (9F),
.BR scsi_resalloc (9F),
\fBscsi_resfree\fR(9F), \fBbuf\fR(9S),
.BR scsi_pkt (9S)
.sp
.LP
.I Writing Device Drivers
.SH NOTES
.sp
.LP
The
.B scsi_dmaget()
and \fBscsi_dmafree()\fR functions are obsolete and
will be discontinued in a future release. These functions have been replaced
by, respectively, \fBscsi_init_pkt\fR(9F) and \fBscsi_destroy_pkt\fR(9F).
