usr/src/man/man9f/scsi_poll.9f
'\" te
.\" Copyright (c) 2006, Sun Microsystems, Inc.  All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH scsi_poll 9F "16 Jan 2006" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
scsi_poll \- run a polled SCSI command on behalf of a target driver
.SH SYNOPSIS
.LP
.nf
#include <sys/scsi/scsi.h>



\fBint\fR \fBscsi_poll\fR(\fBstruct scsi_pkt *\fIpkt\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI).
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I pkt
.ad
.RS 7n
.rt
Pointer to the
.BR scsi_pkt "(9S) structure."
.RE

.SH DESCRIPTION
.sp
.LP
The
.B scsi_poll()
function requests the host adapter driver to run a
polled command. Unlike
.BR scsi_transport (9F)
which runs commands
asynchronously,
.B scsi_poll()
runs commands to completion before
returning. If the
.B pkt_time
member of
.I pkt
is
.BR 0 ,
the value
of
.B pkt_time
is defaulted to
.B SCSI_POLL_TIMEOUT
to prevent an
indefinite hang of the system.
.SH RETURN VALUES
.sp
.LP
The
.B scsi_poll()
function returns:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 6n
.rt
command completed successfully.
.RE

.sp
.ne 2
.mk
.na
.B -1
.ad
.RS 6n
.rt
command failed.
.RE

.SH CONTEXT
.sp
.LP
The
.B scsi_poll()
function can be called from user, interrupt, or
kernel context. This function should not be called when the caller is
executing \fBtimeout\fR(9F) in the context of a thread.
.SH SEE ALSO
.sp
.LP
.BR makecom (9F),
.BR scsi_transport (9F),
.BR scsi_pkt (9S)
.sp
.LP
.I Writing Device Drivers
.SH WARNINGS
.sp
.LP
Since
.B scsi_poll()
runs commands to completion before returning, it
may require more time than is desirable when called from interrupt context.
Therefore, calling
.B scsi_poll
from interrupt context is not
recommended.
