usr/src/man/man9f/scsi_validate_sense.9f
'\" te
.\" Copyright (c) 2006, Sun Microsystems, Inc., All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH scsi_validate_sense 9F "29 Jun 2006" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
scsi_validate_sense \- find descriptor in SCSI sense data
.SH SYNOPSIS
.LP
.nf
#include <sys/scsi/scsi.h>



\fBint\fR \fBscsi_validate_sense\fR(\fBuint8_t *\fIsense_buffer\fR, \fBint\fR \fIsense_buf_len\fR,
     \fBint *\fIflags\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI).
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I sense_buffer
.ad
.RS 17n
.rt
Pointer to a buffer containing
.B SCSI
sense data. The sense data is
expected in wire format starting at the response code.
.RE

.sp
.ne 2
.mk
.na
.I sense_buf_len
.ad
.RS 17n
.rt
Length of sense buffer in bytes.
.RE

.sp
.ne 2
.mk
.na
.I flags
.ad
.RS 17n
.rt
Returns additional properties of the sense data.
.RE

.SH DESCRIPTION
.sp
.LP
The
.B scsi_validate_sense()
function returns the format of the sense
data contained in the provided sense buffer. If the response code field in
the sense data is not recognized or if there is not enough sense data to
include sense key, asc, and ascq then
.B scsi_validate_sense()
returns
.BR SENSE_UNUSABLE .
If the buffer contains usable sense data in fixed
format, the function returns
.BR SENSE_FIXED_FORMAT .
If the buffer
contains usable sense data in descriptor format, the function returns
.BR SENSE_DESCR_FORMAT .
.sp
.LP
The following flags may be set as appropriate depending on the sense
data:
.sp
.ne 2
.mk
.na
.B SNS_BUF_OVERFLOW
.ad
.RS 20n
.rt
The sense data buffer provided for the request is too small to hold all the
sense data.
.RE

.sp
.ne 2
.mk
.na
.B SNS_BUF_DEFERRED
.ad
.RS 20n
.rt
The sense data contained in the buffer relates to an error that has
occurred during the processing of a successfully completed command, such as
a cached write that could not be commited to the media.
.RE

.SH RETURN VALUES
.sp
.ne 2
.mk
.na
.B SENSE_UNUSABLE
.ad
.RS 22n
.rt
The response code from the sense data is unrecognized or not enough sense
data present to provide the
.BR "sense key" ,
.BR asc ,
and
.BR ascq .
.RE

.sp
.ne 2
.mk
.na
.B SENSE_FIXED_FORMAT
.ad
.RS 22n
.rt
The sense data in the buffer is in "fixed format".
.RE

.sp
.ne 2
.mk
.na
.B SENSE_DESCR_FORMAT
.ad
.RS 22n
.rt
The sense data in the buffer is in "descriptor format".
.RE

.SH CONTEXT
.sp
.LP
The
.B scsi_validate_sense()
function can be called from user or
interrupt context.
.SH SEE ALSO
.sp
.LP
.BR scsi_ext_sense_fields (9F),
.BR scsi_find_sense_descr (9F),
.BR scsi_sense_asc (9F),
.BR scsi_sense_ascq (9F),
.BR scsi_sense_cmdspecific_uint64 (9F),
.BR scsi_sense_info_uint64 (9F),
.BR scsi_sense_key (9F)
