usr/src/man/man9f/scsi_sense_key.9f
'\" te
.\" Copyright (c) 2006, Sun Microsystems, Inc., All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH scsi_sense_key 9F "28 Jun 2006" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
scsi_sense_key, scsi_sense_asc, scsi_sense_ascq \- retrieve fields from
SCSI sense data
.SH SYNOPSIS
.LP
.nf
#include <sys/scsi/scsi.h>



\fBuint8_t\fR \fBscsi_sense_key\fR(\fBuint8_t *\fIsense_buffer\fR);
.fi

.LP
.nf
\fBuint8_t\fR \fBscsi_sense_asc\fR(\fBuint8_t *\fIsense_buffer\fR);
.fi

.LP
.nf
\fBuint8_t\fR \fBscsi_sense_ascq\fR(\fBuint8_t *\fIsense_buffer\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI).
.SH PARAMETERS
.sp
.ne 2
.mk
.na
\fIsense_buffer\fR
.ad
.RS 16n
.rt
Pointer to a buffer containing
.B SCSI
sense data. The sense data is
expected in wire format starting at the response code. It can be in either
fixed or descriptor format.
.RE

.SH DESCRIPTION
.sp
.LP
The
.B scsi_sense_key()
function returns the sense key value from the
sense data contained in the sense_buffer.
.sp
.LP
The
.B scsi_sense_asc()
function returns the additional sense code
(\fBASC\fR) value from the sense data contained in the sense_buffer.
.sp
.LP
The
.B scsi_sense_ascq()
function returns the additional sense code
qualifier (\fBASCQ\fR) value from the sense data contained in the
sense_buffer.
.sp
.LP
The
.BR scsi_sense_key() ,
.BR scsi_sense_asc() ,
and
\fBscsi_sense_ascq()\fR functions are used to retrieve values from
\fBSCSI\fR sense data, regardles of whether the sense data is in fixed
format or descriptor format.
.sp
.LP
Drivers should use
.BR scsi_validate_sense "(9F) to ensure that valid sense"
key,
.BR asc ,
and
.B ascq
values are present in the sense data.
.SH RETURN VALUES
.sp
.LP
The
.B scsi_sense_key()
function returns the sense key value from the
sense buffer. The
.B scsi_sense_asc()
function returns the additional
sense code (\fBASC\fR) from the sense buffer and the \fBscsi_sense_ascq()\fR
function returns the additional sense code qualifier (\fBASCQ\fR) from the
sense buffer.
.SH CONTEXT
.sp
.LP
The
.BR scsi_sense_key() ,
.BR scsi_sense_asc() ,
and
\fBscsi_sense_ascq()\fR functions can be called from user or interrupt
context.
.SH SEE ALSO
.sp
.LP
\fBscsi_ext_sense_fields\fR(9F), \fBscsi_find_sense_descr\fR(9F),
\fBscsi_sense_cmdspecific_uint64\fR(9F), \fBscsi_sense_info_uint64\fR(9F),
.BR scsi_validate_sense (9F)
