usr/src/man/man9f/scsi_hba_pkt_comp.9f
'\" te
.\" Copyright (c) 2009, Sun Microsystems Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH scsi_hba_pkt_comp 9F "29 Jan 2009" "SunOS 5.11" ""
.SH NAME
scsi_hba_pkt_comp \- scsi_pkt completion routine
.SH SYNOPSIS
.LP
.nf
#include <sys/scsi/scsi.h>

\fBvoid\fR \fBscsi_hba_pkt_comp\fR(\fBstruct scsi_pkt *\fIpkt\fR);
.fi

.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I pkt
.ad
.RS 7n
.rt
Pointer to a
.BR scsi_pkt "(9S) structure."
.RE

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI).
.SH DESCRIPTION
.sp
.LP
After filling in
.BR scsi_pkt (9S)
fields with packet completion
information, an HBA driver should call the
.B scsi_hba_pkt_comp()
function. This function is the recommended way for an HBA driver to signal
completion of a
.B scsi_pkt
structure.  Use is mandatory for HBA drivers
that use
.BR tran_setup_pkt (9E).
.sp
.LP
Calling the
.B scsi_hba_pkt_comp()
function allows SCSA to observe, and
possibly react to, the completion of a
.B scsi_pkt
request.
.sp
.LP
A call to the
.B scsi_hba_pkt_comp()
function will always result in a
call to the
.IR pkt_comp ()
callback function defined in
.BR scsi_pkt (9S).
This
.IR pkt_comp ()
callback may, however, occur after
return from
.BR scsi_hba_pkt_comp() ,
and may occur from a different thread
executing on a different CPU.
.SH CONTEXT
.sp
.LP
The
.B scsi_hba_pkt_comp()
function can be called from user, interrupt,
or kernel context.
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
.BR attributes (5),
.BR tran_setup_pkt (9E),
.BR scsi_pkt (9S)
.SH NOTES
.sp
.LP
HBA driver calls
.B scsi_hba_pkt_comp()
instead of calling
.BR scsi_pkt (9S)
.I pkt_comp
directly.
