usr/src/man/man9f/scsi_hba_probe.9f
'\" te
.\" Copyright (c) 1995, Sun Microsystems, Inc.,  All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH scsi_hba_probe 9F "30 Aug 1995" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
scsi_hba_probe \- default SCSI HBA probe function
.SH SYNOPSIS
.LP
.nf
#include <sys/scsi/scsi.h>



\fBint\fR \fBscsi_hba_probe\fR(\fBstruct scsi_device *\fIsd\fR, \fBint\fB(*\fRwaitfunc\fB)(void)\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris architecture specific (Solaris DDI).
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I sd
.ad
.RS 13n
.rt
Pointer to a
.BR scsi_device "(9S) structure describing the target."
.RE

.sp
.ne 2
.mk
.na
.I waitfunc
.ad
.RS 13n
.rt
.B NULL_FUNC
or
.BR SLEEP_FUNC .
.RE

.SH DESCRIPTION
.sp
.LP
.B scsi_hba_probe()
is a function providing the semantics of
.BR scsi_probe (9F).
An
.B HBA
driver may call
.BR scsi_hba_probe()
from its \fBtran_tgt_probe\fR(9E) entry point, to probe for the existence of
a target on the
.B SCSI
bus, or the
.B HBA
may set
.BR tran_tgt_probe (9E)
to point to
.B scsi_hba_probe
directly.
.SH RETURN VALUES
.sp
.LP
See \fBscsi_probe\fR(9F) for the return values from
.BR scsi_hba_probe() .

.SH CONTEXT
.sp
.LP
.B scsi_hba_probe()
should only be called from the
.BR HBA 's
.BR tran_tgt_probe (9E)
entry point.
.SH SEE ALSO
.sp
.LP
.BR tran_tgt_probe (9E),
.BR scsi_probe (9F),
.BR scsi_device (9S)
.sp
.LP
.I Writing Device Drivers
