usr/src/man/man9f/scsi_hba_attach_setup.9f
'\" te
.\" Copyright (c) 2006 Sun Microsystems, Inc., All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH scsi_hba_attach_setup 9F "30 May 2006" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
scsi_hba_attach_setup, scsi_hba_attach, scsi_hba_detach \- SCSI HBA attach
and detach routines
.SH SYNOPSIS
.LP
.nf
#include <sys/scsi/scsi.h>



\fBint\fR \fBscsi_hba_attach_setup\fR(\fBdev_info_t *\fIdip\fR, \fBddi_dma_attr_t *\fIhba_dma_attr\fR,
     \fBscsi_hba_tran_t *\fIhba_tran\fR, \fBint\fR \fIhba_flags\fR);
.fi

.LP
.nf
\fBint\fR \fBscsi_hba_attach\fR(\fBdev_info_t *\fIdip\fR, \fBddi_dma_lim_t *\fIhba_lim\fR,
     \fBscsi_hba_tran_t *\fIhba_tran\fR, \fBint\fR \fIhba_flags\fR, \fBvoid *\fIhba_options\fR);
.fi

.LP
.nf
\fBint\fR \fBscsi_hba_detach\fR(\fBdev_info_t *\fIdip\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris architecture specific (Solaris DDI).
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I dip
.ad
.RS 16n
.rt
Pointer to the
.B dev_info_t
structure that refers to the instance of
the HBA device.
.RE

.sp
.ne 2
.mk
.na
.I hba_lim
.ad
.RS 16n
.rt
Pointer to a
.BR ddi_dma_lim "(9S) structure."
.RE

.sp
.ne 2
.mk
.na
.I hba_tran
.ad
.RS 16n
.rt
Pointer to a
.BR scsi_hba_tran "(9S) structure."
.RE

.sp
.ne 2
.mk
.na
.I hba_flags
.ad
.RS 16n
.rt
Flag modifiers. The defined flag values are
.BR SCSI_HBA_TRAN_CLONE ,
.BR SCSI_HBA_TRAN_SCB ,
and
.BR SCSI_HBA_TRAN_CDB .
.RE

.sp
.ne 2
.mk
.na
.I hba_options
.ad
.RS 16n
.rt
Optional features provided by the HBA driver for future extensions; must be
.IR NULL .
.RE

.sp
.ne 2
.mk
.na
.I hba_dma_attr
.ad
.RS 16n
.rt
Pointer to a
.BR ddi_dma_attr "(9S) structure."
.RE

.SH DESCRIPTION
.sp
.LP
The
.B scsi_hba_attach_setup()
function is the recommended interface
over the
.B scsi_hba_attach()
function.
.SS "scsi_hba_attach_setup(\|) scsi_hba_attach(\|)"
.sp
.LP
The
.B scsi_hba_attach()
function registers the
.I hba_lim
DMA limits
and the
.I hba_tran
transport vectors of each instance of the HBA device
defined by
.IR dip .
The
.B scsi_hba_attach_setup()
function registers
the
.I hba_dma_attr
DMA attributes and the
.I hba_tran
transport
vectors of each instance of the HBA device defined by
.IR dip .
The HBA
driver can pass different DMA limits or DMA attributes and the transport
vectors for each instance of the device to support any constraints imposed
by the  HBA itself.
.sp
.LP
The
.B scsi_hba_attach()
and
.B scsi_hba_attach_setup()
functions use
the
.B dev_bus_ops
field in the
.BR dev_ops "(9S) structure. The HBA"
driver should initialize this field to
.I NULL
before calling
.B scsi_hba_attach()
or
.BR scsi_hba_attach_setup() .
.sp
.LP
If
.B SCSI_HBA_TRAN_CLONE
is requested in
.IR hba_flags ,
the
.B hba_tran
structure is cloned once for each target that is attached to
the HBA. The structure is cloned before the
.BR tran_tgt_init (9E)
entry
point is called to initialize a target. At all subsequent HBA entry points,
including
.BR tran_tgt_init "(9E), the"
.B scsi_hba_tran_t
structure
passed as an argument or found in a
.B scsi_address
structure is the
cloned
.B scsi_hba_tran_t
structure,which allows the HBA to use the
.B tran_tgt_private
field in the
.B scsi_hba_tran_t
structure to point
to per-target data. The HBA should free only the same \fBscsi_hba_tran_t\fR
.RB "structure allocated when the HBA detaches. All cloned" " scsi_hba_tran_t"
structures that are allocated by the system are freed by the system.
.sp
.LP
The flags
.B SCSI_HBA_TRAN_CDB
and
.B SCSI_HBA_TRAN_SCB
are only
valid when
.B tran_setup_pkt()
is used. See
.BR tran_setup_pkt (9E)
for
information on using these flags.
.sp
.LP
The
.B scsi_hba_attach()
and
.B scsi_hba_attach_setup()
functions
attach a number of integer-valued properties to
.IR dip ,
unless properties
of the same name are already attached to the node. An HBA driver should
retrieve these configuration parameters via
.BR ddi_prop_get_int "(9F), and"
respect any settings for features provided the HBA.
.sp
.ne 2
.mk
.na
.B scsi-options
.ad
.RS 26n
.rt
.B Optional SCSI
.B configuration bits
.RE

.sp
.ne 2
.mk
.na
.B SCSI_OPTIONS_DR
.ad
.RS 26n
.rt
If not set, the HBA should not grant Disconnect privileges to target
devices.
.RE

.sp
.ne 2
.mk
.na
.B SCSI_OPTIONS_TAG
.ad
.RS 26n
.rt
If not set, the HBA should not operate in Command Tagged Queueing mode.
.RE

.sp
.ne 2
.mk
.na
.B SCSI_OPTIONS_PARITY
.ad
.RS 26n
.rt
If not set, the HBA should not operate in parity mode.
.RE

.sp
.ne 2
.mk
.na
.B SCSI_OPTIONS_QAS
.ad
.RS 26n
.rt
If not set, the HBA should not make use of the Quick Arbitration Select
feature. Consult your Sun hardware documentation to determine whether your
machine supports QAS.
.RE

.sp
.ne 2
.mk
.na
.B SCSI_OPTIONS_FAST
.ad
.RS 26n
.rt
If not set, the HBA should not operate the bus in FAST SCSI mode.
.RE

.sp
.ne 2
.mk
.na
.B SCSI_OPTIONS_FAST20
.ad
.RS 26n
.rt
If not set, the HBA should not operate the bus in FAST20 SCSI mode.
.RE

.sp
.ne 2
.mk
.na
.B SCSI_OPTIONS_FAST40
.ad
.RS 26n
.rt
If not set, the HBA should not operate the bus in FAST40 SCSI mode.
.RE

.sp
.ne 2
.mk
.na
.B SCSI_OPTIONS_FAST80
.ad
.RS 26n
.rt
If not set, the HBA should not operate the bus in FAST80 SCSI mode.
.RE

.sp
.ne 2
.mk
.na
.B SCSI_OPTIONS_FAST160
.ad
.RS 26n
.rt
If not set, the HBA should not operate the bus in FAST160 SCSI mode.
.RE

.sp
.ne 2
.mk
.na
.B SCSI_OPTIONS_FAST320
.ad
.RS 26n
.rt
If not set, the HBA should not operate the bus in FAST320 SCSI mode.
.RE

.sp
.ne 2
.mk
.na
.B SCSI_OPTIONS_WIDE
.ad
.RS 26n
.rt
If not set, the HBA should not operate the bus in WIDE SCSI mode.
.RE

.sp
.ne 2
.mk
.na
.B SCSI_OPTIONS_SYNC
.ad
.RS 26n
.rt
If not set, the HBA should not operate the bus in synchronous transfer
mode.
.RE

.sp
.ne 2
.mk
.na
.B scsi-reset-delay
.ad
.RS 26n
.rt
SCSI bus or device reset recovery time, in milliseconds.
.RE

.sp
.ne 2
.mk
.na
.B scsi-selection-timeout
.ad
.RS 26n
.rt
Default SCSI selection phase timeout value, in milliseconds. Please refer
to individual HBA man pages for any HBA-specific information
.RE

.SS "scsi_hba_detach(\|)"
.sp
.LP
The
.B scsi_hba_detach()
function removes the reference to the DMA
limits or attributes structure and the transport vector for the given
instance of an HBA driver.
.SH RETURN VALUES
.sp
.LP
The
.BR scsi_hba_attach() ,
.BR scsi_hba_attach_setup() ,
and
.B scsi_hba_detach()
functions return
.B DDI_SUCCESS
if the function
call succeeds, and return
.B DDI_FAILURE
on failure.
.SH CONTEXT
.sp
.LP
The
.B scsi_hba_attach()
and
.B scsi_hba_attach_setup()
functions
should be called from \fBattach\fR(9E). The \fBscsi_hba_detach()\fR function
should be called from
.BR detach (9E).
.SH SEE ALSO
.sp
.LP
.BR attach (9E),
.BR detach (9E),
.BR tran_setup_pkt (9E),
.BR tran_tgt_init (9E),
.BR ddi_prop_get_int (9F),
.BR ddi_dma_attr (9S),
.BR ddi_dma_lim (9S),
.BR dev_ops (9S),
.BR scsi_address (9S),
.BR scsi_hba_tran (9S)
.sp
.LP
.I Writing Device Drivers
.SH NOTES
.sp
.LP
It is the HBA driver's responsibility to ensure that no more transport
requests will be taken on behalf of any SCSI target device driver after
.B scsi_hba_detach()
is called.
.sp
.LP
The
.B scsi_hba_attach()
function is obsolete and will be discontinued
in a future release. This function is replaced by
.BR scsi_hba_attach_setup() .
