usr/src/man/man9f/scsi_free_consistent_buf.9f
'\" te
.\" Copyright (c) 2006, Sun Microsystems, Inc.,
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH scsi_free_consistent_buf 9F "16 Jan 2006" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
scsi_free_consistent_buf \- free a previously allocated SCSI DMA I/O
buffer
.SH SYNOPSIS
.LP
.nf
#include <sys/scsi/scsi.h>



\fBvoid\fR \fBscsi_free_consistent_buf\fR(\fBstruct buf *\fIbp\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI).
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I bp
.ad
.RS 6n
.rt
Pointer to the \fBbuf\fR(9S) structure.
.RE

.SH DESCRIPTION
.sp
.LP
The
.B scsi_free_consistent_buf()
function frees a buffer header and
consistent data buffer that was previously allocated using
.BR scsi_alloc_consistent_buf (9F).
.SH CONTEXT
.sp
.LP
The
.B scsi_free_consistent_buf()
function can be called from user,
interrupt, or kernel context.
.SH SEE ALSO
.sp
.LP
.BR freerbuf (9F),
.BR scsi_alloc_consistent_buf (9F),
.BR buf (9S)
.sp
.LP
.I Writing Device Drivers
.SH WARNING
.sp
.LP
The \fBscsi_free_consistent_buf()\fR function will call \fBfreerbuf\fR(9F)
to free the \fBbuf\fR(9S) that was allocated before or during the call to
.BR scsi_alloc_consistent_buf (9F).
.sp
.LP
If consistent memory is bound to a
.BR scsi_pkt "(9S), the pkt should be"
destroyed before freeing the consistent memory.
