usr/src/man/man9f/scsi_find_sense_descr.9f
'\" te
.\" Copyright (c) 2006, Sun Microsystems, Inc., All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH scsi_find_sense_descr 9F "30 Jun 2006" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
scsi_find_sense_descr \- find descriptor in SCSI sense data
.SH SYNOPSIS
.LP
.nf
#include <sys/scsi/scsi.h>



\fBuint8_t *\fBscsi_find_sense_descr\fR(\fBuint8_t *\fIsense_buffer\fR, \fBint\fR \fIsense_buf_len\fR,
     \fBint\fR \fIreq_descr_type\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI).
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I sense_buffer
.ad
.RS 18n
.rt
Pointer to a buffer containing
.B SCSI
descriptor sense data. The data
is expected in wire format starting at the response code.
.RE

.sp
.ne 2
.mk
.na
.I sense_buf_len
.ad
.RS 18n
.rt
Integer that contains the length of sense buffer in bytes.
.RE

.sp
.ne 2
.mk
.na
.I req_descr_type
.ad
.RS 18n
.rt
Integer that contains the descriptor type value for the desired sense
descriptor.
.RE

.SH DESCRIPTION
.sp
.LP
The
.B scsi_find_sense_descr()
function is used to obtain a pointer to a
specific descriptor type, specified by
.IR req_descr_type ,
within a
descriptor sense buffer. Before returning the pointer,
.B scsi_find_sense_descr()
verifies that the entire descriptor is present
based on the length provided in
.IR sense_buf_len .
.sp
.LP
Any value for
.I req_descr_type
can be requested. The following
descriptor types are already defined:
.sp
.in +2
.nf
#define DESCR_INFORMATION         0x00
#define DESCR_COMMAND_SPECIFIC    0x01
#define DESCR_SENSE_KEY_SPECIFIC  0x02
#define DESCR_FRU                 0x03
#define DESCR_STREAM_COMMANDS     0x04
#define DESCR_BLOCK_COMMANDS      0x05
#define DESCR_OSD_OID             0x06
#define DESCR_OSD_RESP_INTEGRITY  0x07
#define DESCR_OSD_ATTR_ID         0x08
.fi
.in -2

.sp
.LP
Drivers should use
.BR scsi_validate_sense "(9F) to ensure that the sense"
buffer contains valid descriptor sense data.
.SH RETURN VALUES
.sp
.LP
The
.B scsi_find_sense_descr()
function returns a pointer to a sense
descriptor of the requested type if a descriptor of that type exists. If no
such descriptor exists,
.B scsi_find_sense_descr()
returns
.IR NULL .
.SH CONTEXT
.sp
.LP
The
.B scsi_find_sense_descr()
function can be called from user or
interrupt context.
.SH SEE ALSO
.sp
.LP
.BR scsi_ext_sense_fields (9F),
.BR scsi_sense_asc (9F),
.BR scsi_sense_ascq (9F),
.BR scsi_sense_cmdspecific_uint64 (9F),
.BR scsi_sense_info_uint64 (9F),
.BR scsi_sense_key (9F),
.BR scsi_validate_sense (9F)
