usr/src/man/man9f/scsi_reset_notify.9f
'\" te
.\" Copyright (c) 2006, Sun Microsystems, Inc.,
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH scsi_reset_notify 9F "16 Jan 2006" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
scsi_reset_notify \- notify target driver of bus resets
.SH SYNOPSIS
.LP
.nf
#include <sys/scsi/scsi.h>



\fBvoid\fR \fBscsi_reset_notify\fR(\fBstruct scsi_address *\fIap\fR, \fBint\fR \fIflag\fR,
     \fBvoid\fR (*\fIcallback)(caddr_t)\fR, \fBcaddr_t\fR \fIarg\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI).
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I ap
.ad
.RS 12n
.rt
Pointer to the
.B scsi_address
structure.
.RE

.sp
.ne 2
.mk
.na
.I flag
.ad
.RS 12n
.rt
A flag indicating registration or cancellation of the notification
request.
.RE

.sp
.ne 2
.mk
.na
.I callback
.ad
.RS 12n
.rt
A pointer to the target driver's reset notification function.
.RE

.sp
.ne 2
.mk
.na
.I arg
.ad
.RS 12n
.rt
The callback function argument.
.RE

.SH DESCRIPTION
.sp
.LP
The
.B scsi_reset_notify()
function is used by a target driver when it
needs to be notified of a bus reset. The bus reset could be issued by the
transport layer (e.g. the host bus adapter (\fBHBA)\fR driver or controller)
or by another initiator.
.sp
.LP
The  argument
.I flag
is used to register or cancel the notification.
The supported values for
.I flag
are as follows:
.sp
.ne 2
.mk
.na
.B SCSI_RESET_NOTIFY
.ad
.RS 21n
.rt
Register
.I callback
as the reset notification function for the target
driver.
.RE

.sp
.ne 2
.mk
.na
.B SCSI_RESET_CANCEL
.ad
.RS 21n
.rt
Cancel the reset notification request.
.RE

.sp
.LP
Target drivers can find out whether the
.B HBA
driver and controller
support reset notification by checking the  \fBreset-notification\fR
capability using the \fBscsi_ifgetcap\fR(9F) function.
.SH RETURN VALUES
.sp
.LP
If
.IR flag " is"
.BR SCSI_RESET_NOTIFY ,
.B scsi_reset_notify()
returns:
.sp
.ne 2
.mk
.na
.B DDI_SUCCESS
.ad
.RS 15n
.rt
The notification request has been accepted.
.RE

.sp
.ne 2
.mk
.na
.B DDI_FAILURE
.ad
.RS 15n
.rt
The transport layer does not support reset notification or could not accept
this request.
.RE

.sp
.LP
If
.IR flag " is"
.BR SCSI_RESET_CANCEL ,
.B scsi_reset_notify()
returns:
.sp
.ne 2
.mk
.na
.B DDI_SUCCESS
.ad
.RS 15n
.rt
The notification request has been canceled.
.RE

.sp
.ne 2
.mk
.na
.B DDI_FAILURE
.ad
.RS 15n
.rt
No notification request was registered.
.RE

.SH CONTEXT
.sp
.LP
The
.B scsi_reset_notify()
function can be called from user, interrupt,
or kernel context.
.SH SEE ALSO
.sp
.LP
.BR scsi_address (9S),
.BR scsi_ifgetcap (9F)
.sp
.LP
.I Writing Device Drivers
