usr/src/man/man9f/strqset.9f
'\" te
.\" Copyright (c) 2006, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright 1989 AT&T
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH strqset 9F "16 Jan 2006" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
strqset \- change information about a queue or band of the queue
.SH SYNOPSIS
.LP
.nf
#include <sys/stream.h>



\fBint\fR \fBstrqset\fR(\fBqueue_t *\fIq\fR, \fBqfields_t\fR \fIwhat\fR, \fBunsigned char\fR \fIpri\fR, \fBintptr_t\fR \fIval\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Architecture independent level 1 (DDI/DKI).
.SH PARAMETERS
.sp
.ne 2
.mk
.na
\fIq\fR
.ad
.RS 8n
.rt
Pointer to the queue.
.RE

.sp
.ne 2
.mk
.na
\fIwhat\fR
.ad
.RS 8n
.rt
Field of the \fBqueue\fR structure (or the specified priority band) to
return information about. Valid values are one of:
.sp
.ne 2
.mk
.na
\fBQHIWAT\fR
.ad
.RS 11n
.rt
High water mark.
.RE

.sp
.ne 2
.mk
.na
\fBQLOWAT\fR
.ad
.RS 11n
.rt
Low water mark.
.RE

.sp
.ne 2
.mk
.na
\fBQMAXPSZ\fR
.ad
.RS 11n
.rt
Largest packet accepted.
.RE

.sp
.ne 2
.mk
.na
\fBQMINPSZ\fR
.ad
.RS 11n
.rt
Smallest packet accepted.
.RE

.RE

.sp
.ne 2
.mk
.na
\fIpri\fR
.ad
.RS 8n
.rt
Priority band of interest.
.RE

.sp
.ne 2
.mk
.na
\fIval\fR
.ad
.RS 8n
.rt
The value for the field to be changed.
.RE

.SH DESCRIPTION
.sp
.LP
The \fBstrqset()\fR function gives drivers and modules a way to change
information about a queue or a particular band of a queue without directly
accessing STREAMS data structures.
.SH RETURN VALUES
.sp
.LP
On success, \fB0\fR is returned. \fBEINVAL\fR is returned if an undefined
attribute is specified.
.SH CONTEXT
.sp
.LP
The \fBstrqset()\fR function can be called from user, interrupt, or kernel
context.
.SH SEE ALSO
.sp
.LP
\fBstrqget\fR(9F), \fBqueue\fR(9S)
.sp
.LP
\fIWriting Device Drivers\fR
.sp
.LP
\fISTREAMS Programming Guide\fR
.SH NOTES
.sp
.LP
When lowering existing values, set \fBQMINPSZ\fR before setting
\fBQMAXPSZ\fR; when raising existing values, set \fBQMAXPSZ\fR before
setting \fBQMINPSZ\fR.
