usr/src/man/man9f/swab.9f
'\" te
.\" Copyright (c) 2006, Sun Microsystems, Inc.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH swab 9F "16 Jan 2006" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
swab \- swap bytes in 16-bit halfwords
.SH SYNOPSIS
.LP
.nf
#include <sys/sunddi.h>



\fBvoid\fR \fBswab\fR(\fBvoid *\fIsrc\fR, \fBvoid *\fIdst\fR, \fBsize_t\fR \fInbytes\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Architecture independent level 1 (DDI/DKI).
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I src
.ad
.RS 10n
.rt
A pointer to the buffer containing the bytes to be swapped.
.RE

.sp
.ne 2
.mk
.na
.I dst
.ad
.RS 10n
.rt
A pointer to the destination buffer where the swapped bytes will be
written. If
.I dst
is the same as
.I src
the buffer will be swapped in
place.
.RE

.sp
.ne 2
.mk
.na
.I nbytes
.ad
.RS 10n
.rt
Number of bytes to be swapped, rounded down to the nearest half-word.
.RE

.SH DESCRIPTION
.sp
.LP
The
.B swab()
function copies the bytes in the buffer pointed to by
.I src
to the buffer pointer to by
.IR dst ,
swapping the order of
adjacent bytes in half-word pairs as the copy proceeds. A total of
.I nbytes
bytes are copied, rounded down to the nearest half-word.
.SH CONTEXT
.sp
.LP
The
.B swab()
function can be called from user, interrupt, or kernel
context.
.SH SEE ALSO
.sp
.LP
.I Writing Device Drivers
.SH NOTES
.sp
.LP
Since
.B swab()
operates byte-by-byte, it can be used on non-aligned
buffers.
