usr/src/man/man9f/unbufcall.9f
'\" te
.\" Copyright 2006 Sun Microsystems, Inc All rights reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" Copyright 1989 AT&T
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH unbufcall 9F "16 Jan 2006" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
unbufcall \- cancel a pending bufcall request
.SH SYNOPSIS
.LP
.nf
#include <sys/stream.h>



\fBvoid\fR \fBunbufcall\fR(\fBbufcall_id_t\fR \fIid\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Architecture independent level 1 (DDI/DKI).
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I id
.ad
.RS 6n
.rt
Identifier returned from
.BR bufcall (9F)
or
.BR esbbcall (9F).
.RE

.SH DESCRIPTION
.sp
.LP
The
.BR unbufcall " function cancels a pending "
.B bufcall()
or
.B esbbcall()
request. The argument
.B id
is a non-zero identifier for
the request to be cancelled.
.B id
is returned from the
.B bufcall()
or
.B esbbcall()
function used to issue the request.
.B unbufcall()
will not return until the pending callback is cancelled or has run. Because
of this, locks acquired by the callback routine should not be held across
the call to
.B unbufcall()
or deadlock may result.
.SH RETURN VALUES
.sp
.LP
None.
.SH CONTEXT
.sp
.LP
The
.B unbufcall
function can be called from user, interrupt, or kernel
context.
.SH SEE ALSO
.sp
.LP
.BR bufcall (9F),
.BR esbbcall (9F)
.sp
.LP
.I Writing Device Drivers
.sp
.LP
.I STREAMS Programming Guide
