usr/src/man/man9f/ureadc.9f
'\" te
.\" Copyright 1989 AT&T
.\" Copyright (c) 2006, Sun Microsystems, Inc., All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ureadc 9F "16 Jan 2006" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
ureadc \- add character to a uio structure
.SH SYNOPSIS
.LP
.nf
#include <sys/uio.h>
#include <sys/types.h>



\fBint\fR \fBureadc\fR(\fBint\fR \fIc\fR, \fBuio_t *\fIuio_p\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Architecture independent level 1 (DDI/DKI).
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I c
.ad
.RS 9n
.rt
The character added to the
.BR uio "(9S) structure."
.RE

.sp
.ne 2
.mk
.na
.I uio_p
.ad
.RS 9n
.rt
Pointer to the
.BR uio "(9S) structure."
.RE

.SH DESCRIPTION
.sp
.LP
The
.B ureadc()
function transfers the character
.I c
into the
address space of the
.BR uio "(9S) structure pointed to by"
.IR uio_p ,
and
updates the
.B uio
structure as for
.BR uiomove (9F).
.SH RETURN VALUES
.sp
.LP
.B 0
is returned on success and
.B EFAULT
on failure.
.SH CONTEXT
.sp
.LP
The
.B ureadc()
function can be called from user, interrupt, or kernel
context.
.SH SEE ALSO
.sp
.LP
.BR uiomove (9F),
.BR uwritec (9F),
.BR iovec (9S),
.BR uio (9S)
.sp
.LP
.I Writing Device Drivers
