usr/src/man/man9f/usb_create_pm_components.9f
'\" te
.\" Copyright (c) 2004, Sun Microsystems, Inc., All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH usb_create_pm_components 9F "5 Jan 2004" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
usb_create_pm_components \- Create power management components for USB
devices
.SH SYNOPSIS
.LP
.nf
#include <sys/usb/usba.h>



\fBint\fR \fBusb_create_pm_components\fR(\fBdev_info_t *\fIdip\fR, \fBuint_t *\fIpwrstates\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI)
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I dip
.ad
.RS 13n
.rt
Pointer to the device's
.B dev_info
structure.
.RE

.sp
.ne 2
.mk
.na
.I pwrstates
.ad
.RS 13n
.rt
Address into which a mask which lists power states capable by device is
returned. This is a bitmask containing zero or more of the following
values:
.RE

.sp
.ne 2
.mk
.na
.B USB_DEV_PWRMASK_D0
.ad
.RS 22n
.rt
Corresponds to USB_DEV_OS_PWR_3 or full power.
.RE

.sp
.ne 2
.mk
.na
.B USB_DEV_PWRMASK_D1
.ad
.RS 22n
.rt
Corresponds to USB_DEV_OS_PWR_2.
.RE

.sp
.ne 2
.mk
.na
.B USB_DEV_PWRMASK_D2
.ad
.RS 22n
.rt
Corresponds to USB_DEV_OS_PWR_1.
.RE

.sp
.ne 2
.mk
.na
.B USB_DEV_PWRMASK_D3
.ad
.RS 22n
.rt
Corresponds to USB_DEV_OS_PWR_0 or no power.
.RE

.SH DESCRIPTION
.sp
.LP
The
.B usb_create_pm_components()
function creates pm component
properties that assume the standard USB D0-D3 powerlevels (USB_DEV_PWR_D0 -
USB_DEV_PWR_D3). See the device's relevant USB descriptor to determine the
device's power management capabilities and account for bus-powered devices.
The
.B usb_create_pm_components()
function also updates the pm-components
property in the device's dev_info structure.
.sp
.LP
Note that these USB power levels are inverse of OS power levels. For
example, USB_DEV_OS_PWR_0 and USB_DEV_PWR_D3 are equivalent levels
corresponding to powered-down.
.SH RETURN VALUES
.sp
.ne 2
.mk
.na
.B USB_SUCCESS
.ad
.RS 15n
.rt
Power management facilities in device are recognized by system.
.RE

.sp
.ne 2
.mk
.na
.B USB_FAILURE
.ad
.RS 15n
.rt
An error occurred.
.RE

.SH CONTEXT
.sp
.LP
May be called from user or kernel context.
.SH EXAMPLES
.sp
.in +2
.nf
   uint_t *pwrstates;

    /* Hook into device's power management.  Enable remote wakeup. */
    if (usb_create_pm_components(dip, pwrstates) == USB_SUCCESS) {
            usb_handle_remote_wakeup(dip,USB_REMOTE_WAKEUP_ENABLE);
    }

.fi
.in -2

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
ArchitecturePCI-based systems
_
Interface stabilityCommitted
_
AvailabilitySUNWusb
.TE

.SH SEE ALSO
.sp
.LP
.BR attributes (5),
.BR usb_clr_feature (9F),
.BR usb_register_hotplug_cbs (9F),
.BR usb_get_cfg (9F),
.BR usb_get_dev_data (9F),
.BR usb_handle_remote_wakeup (9F),
.BR pm_idle_component (9F),
.BR pm_busy_component (9F),
.BR pm_raise_power (9F),
.BR pm_lower_power (9F),
.BR usb_cfg_descr (9S)
