usr/src/man/man9f/usb_get_string_descr.9f
'\" te
.\" Copyright (c) 2004, Sun Microsystems, Inc.,
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH usb_get_string_descr 9F "5 Jan 2004" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
usb_get_string_descr \- Get string descriptor from device
.SH SYNOPSIS
.LP
.nf
#include <sys/usb/usba.h>



\fBint\fR \fBusb_get_string_descr\fR(\fBdev_info_t *\fIdip\fR,
     \fBuint16_t\fR \fIlangid\fR, \fBuint8_t\fR \fIindex\fR,
     \fBchar *\fIbuf\fR, \fBsize_t\fR \fIbuflen\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI)
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I dip
.ad
.RS 10n
.rt
Pointer to the device's
.B dev_info
structure.
.RE

.sp
.ne 2
.mk
.na
.I langid
.ad
.RS 10n
.rt
Language ID. Currently only USB_LANG_ID (English ascii) is valid.
.RE

.sp
.ne 2
.mk
.na
.I index
.ad
.RS 10n
.rt
String index indicating descriptor to retrieve.
.RE

.sp
.ne 2
.mk
.na
.I buf
.ad
.RS 10n
.rt
Address into which the string descriptor is placed.
.RE

.sp
.ne 2
.mk
.na
.I buflen
.ad
.RS 10n
.rt
Size of buf in bytes.
.RE

.SH DESCRIPTION
.sp
.LP
The
.B usb_get_string_descr()
function retrieves a parsed string
descriptor from a device.
.I dip
specifies the device, while
.I index
indicates which descriptor to return.
.sp
.LP
String descriptors provide information about other descriptors, or
information that is encoded in other descriptors, in readable form. Many
descriptor types have one or more index fields which identify string
descriptors. (See Sections
.I 9.5
and
.I 9.6
of the
.IR "USB 2.0"
specification.) For example, a configuration descriptor's seventh byte
contains the string descriptor index describing a specific configuration.
.sp
.LP
Retrieved descriptors that do not fit into
.I buflen
bytes are
truncated. All returned descriptors are null-terminated.
.SH RETURN VALUES
.sp
.ne 2
.mk
.na
.B USB_SUCCESS
.ad
.RS 20n
.rt
String descriptor is returned in
.IR buf .
.RE

.sp
.ne 2
.mk
.na
.B USB_INVALID_ARGS
.ad
.RS 20n
.rt
.I dip
or
.I buf
are
.BR NULL ,
or
.I index
or
.I buflen
is
.BR 0 .
.RE

.sp
.ne 2
.mk
.na
.B USB_FAILURE
.ad
.RS 20n
.rt
Descriptor cannot be retrieved.
.RE

.SH CONTEXT
.sp
.LP
May be called from user or kernel context.
.SH EXAMPLES
.sp
.in +2
.nf
   /* Get the first string descriptor. */

    char buf[SIZE];

    if (usb_get_string_descr(
        dip, USB_LANG_ID, 0, buf, SIZE) == USB_SUCCESS) {
            cmn_err (CE_NOTE, "%s%d: %s",
                ddi_driver_name(dip), ddi_get_instance(dip), buf);
    }
.fi
.in -2

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
ArchitecturePCI-based systems
_
Interface stabilityCommitted
_
AvailabilitySUNWusb
.TE

.SH SEE ALSO
.sp
.LP
.BR attributes (5),
.BR usb_get_dev_data (9F),
.BR usb_string_descr (9S)
