usr/src/man/man9f/usb_handle_remote_wakeup.9f
'\" te
.\" Copyright (c) 2004, Sun Microsystems, Inc., All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH usb_handle_remote_wakeup 9F "5 Feb 2004" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
usb_handle_remote_wakeup \- Enable or disable remote wakeup on USB
devices
.SH SYNOPSIS
.LP
.nf
#include <sys/usb/usba.h>



\fBint\fR \fBusb_handle_remote_wakeup\fR(\fBdev_info_t *\fIdip\fR, \fBint\fR \fIcmd\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI)
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I dip
.ad
.RS 7n
.rt
Pointer to the device's
.B dev_info
structure.
.RE

.sp
.ne 2
.mk
.na
.I cmd
.ad
.RS 7n
.rt
Command. Either USB_REMOTE_WAKEUP_ENABLE or USB_REMOTE_WAKEUP_DISABLE.
.RE

.SH DESCRIPTION
.sp
.LP
The
.B usb_handle_remote_wakeup()
function enables or disables remote
wakeup on a USB device. This call can block.
.SH RETURN VALUES
.sp
.ne 2
.mk
.na
.B USB_SUCCESS
.ad
.RS 15n
.rt
Remote wakeup is successfully enabled or disabled.
.RE

.sp
.ne 2
.mk
.na
.B USB_FAILURE
.ad
.RS 15n
.rt
Remote wakeup is not supported by the device. An internal error occurred.
.RE

.SH CONTEXT
.sp
.LP
May be called from user or kernel context.
.SH EXAMPLES
.sp
.in +2
.nf
    uint_t *pwrstates;

    /* Hook into device's power management.  Enable remote wakeup. */
    if (usb_create_pm_components(dip, pwrstates) == USB_SUCCESS) {
            usb_handle_remote_wakeup(dip, USB_REMOTE_WAKEUP_ENABLE);
    }

.fi
.in -2

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
ArchitecturePCI-based systems
_
Interface stabilityCommitted
_
AvailabilitySUNWusb
.TE

.SH SEE ALSO
.sp
.LP
.BR attributes (5),
.BR pm_busy_component (9F),
.BR pm_idle_component (9F),
.BR pm_lower_power (9F),
.BR pm_raise_power (9F),
.BR usb_clr_feature (9F),
.BR usb_create_pm_components (9F),
.BR usb_get_cfg (9F),
.BR usb_get_dev_data (9F),
.BR usb_register_hotplug_cbs (9F),
.BR usb_cfg_descr (9S)
