usr/src/man/man9f/usb_get_cfg.9f
'\" te
.\" Copyright (c) 2004, Sun Microsystems, Inc., All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH usb_get_cfg 9F "5 Jan 2004" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
usb_get_cfg, usb_set_cfg \- Get and set current USB device configuration
.SH SYNOPSIS
.LP
.nf
#include <sys/usb/usba.h>



\fBint\fR \fBusb_get_cfg\fR(\fBdev_info_t *\fIdip\fR, \fBuint_t\fR \fIcfgval\fR, \fBusb_flags_t\fR \fIflags\fR);
.fi

.LP
.nf
\fBint\fR \fBusb_set_cfg\fR(\fBdev_info_t *\fIdip\fR, \fBuint_t\fR \fIcfg_index\fR, \fBusb_flags_t\fR \fIflags\fR,
     \fBvoid (*\fIcallback\fR)(usb_pipe_handle_t \fIpipe_handle\fR, \fBusb_opaque_t\fR
     \fIcallback_arg\fR, \fBint\fR  \fIrval\fR, \fBusb_cb_flags_t\fR \fIflags)\fR, \fBusb_opaque_t\fR
     \fIcallback_arg\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI)
.SH PARAMETERS
.sp
.LP
For
.BR usb_get_cfg() :
.sp
.ne 2
.mk
.na
.I dip
.ad
.RS 10n
.rt
Pointer to device's dev_info structure.
.RE

.sp
.ne 2
.mk
.na
.I cfgval
.ad
.RS 10n
.rt
Pointer to returned configuration value.
.RE

.sp
.ne 2
.mk
.na
.I flags
.ad
.RS 10n
.rt
Not used.  Always waits for completion.
.RE

.sp
.LP
For
.BR usb_set_cfg() :
.sp
.ne 2
.mk
.na
.I dip
.ad
.RS 16n
.rt
Pointer to device's dev_info structure.
.RE

.sp
.ne 2
.mk
.na
.I cfg_index
.ad
.RS 16n
.rt
Desired device configuration index. Set to USB_DEV_DEFAULT_CONFIG_INDEX to
restore default configuration.
.RE

.sp
.ne 2
.mk
.na
.I flags
.ad
.RS 16n
.rt
Only USB_FLAGS_SLEEP is recognized. Wait for completion and do not call
callback.
.RE

.sp
.ne 2
.mk
.na
.I callback
.ad
.RS 16n
.rt
Callback handler to notify of asynchronous completion.
.RE

.sp
.ne 2
.mk
.na
.I callback_arg
.ad
.RS 16n
.rt
Second argument passed to callback handler.
.RE

.SH DESCRIPTION
.sp
.LP
The
.B usb_get_cfg()
function retrieves the current configuration. It
ignores the flags argument and always blocks while contacting the device.
.sp
.LP
The
.B usb_set_cfg()
function sets a new configuration. Because this
call changes the device's mode of operation, the device must be quiescent
and have all pipes, with the exception of the default control pipe, closed.
The driver must have control over the entire device and cannot own just a
single interface on a composite device. Additionally, its device node must
not be a parent to other device nodes that can be operated by other drivers.
The driver must own the device exclusively, otherwise drivers managing other
parts of the device would be affected without their knowledge or control.
.sp
.LP
This call updates all internal USBA framework data structures, whereas
issuing a raw USB_REQ_SET_CFG device request does not.  The
.B usb_set_cfg()
function is the only supported programmatic way to
change device configuration.
.sp
.LP
This call blocks if USB_FLAGS_SLEEP is set in flags.  It returns
immediately and calls the callback on completion if USB_FLAGS_SLEEP is not
set.
.SH RETURN VALUES
.sp
.LP
For
.BR usb_get_cfg() :
.sp
.ne 2
.mk
.na
.B USB_SUCCESS
.ad
.RS 20n
.rt
New configuration is retrieved.
.RE

.sp
.ne 2
.mk
.na
.B USB_INVALID_ARGS
.ad
.RS 20n
.rt
.I cfgval
or
.I dip
is NULL.
.RE

.sp
.ne 2
.mk
.na
.B USB_FAILURE
.ad
.RS 20n
.rt
Configuration cannot be retrieved.
.RE

.sp
.LP
For
.BR usb_set_cfg() :
.sp
.ne 2
.mk
.na
.B USB_SUCCESS
.ad
.RS 23n
.rt
New configuration is set.
.RE

.sp
.ne 2
.mk
.na
.B USB_INVALID_ARGS
.ad
.RS 23n
.rt
dip is NULL.
.sp
USB_FLAGS_SLEEP is clear and callback is NULL.
.RE

.sp
.ne 2
.mk
.na
.B USB_INVALID_CONTEXT
.ad
.RS 23n
.rt
Called from interrupt context with USB_FLAGS_SLEEP specified.
.RE

.sp
.ne 2
.mk
.na
.B USB_INVALID_PERM
.ad
.RS 23n
.rt
Caller does not own entire device or device is a parent to child devices.
.RE

.sp
.ne 2
.mk
.na
.B USB_BUSY
.ad
.RS 23n
.rt
One or more pipes other than the default control pipe are open on the
device.
.RE

.sp
.ne 2
.mk
.na
.B USB_INVALID_PIPE
.ad
.RS 23n
.rt
Pipe handle is NULL or invalid, or pipe is closing or closed.
.RE

.sp
.ne 2
.mk
.na
.B USB_FAILURE
.ad
.RS 23n
.rt
An illegal configuration is specified.
.sp
One or more pipes other than the default control pipe are open on the
device.
.RE

.SH CONTEXT
.sp
.LP
The
.B usb_get_cfg()
function may be called from user or kernel
context.
.sp
.LP
The
.B usb_set_cfg()
function may be called from user or kernel context
always. It may be called from interrupt context only if USB_FLAGS_SLEEP is
not set in flags.
.sp
.LP
If the USB_CB_ASYNC_REQ_FAILED bit is clear in usb_cb_flags_t, the
callback, if supplied, can block because it is executing in kernel context.
Otherwise the callback cannot block. Please see \fBusb_callback_flags\fR(9S)
for more information on callbacks.
.SH EXAMPLES
.sp
.in +2
.nf
 Setting the configuration to the one at index 1 (in the
  array of usb_cfg_data_t configuration nodes as returned
  by usb_get_dev_data()), and verifying what the configuration
  is at that index. (See usb_get_dev_data(9F)).

  uint_t cfg_index = 1;

  /*
   * Assume all pipes other than the default control pipe
   * are closed and make sure all requests to the default
   * control pipe have completed. /
   */


  if (usb_set_cfg(dip, cfg_index, USB_FLAGS_SLEEP, NULL, 0)
          != USB_SUCCESS) {
          cmn_err (CE_WARN,
              "%s%d: Error setting USB device to configuration #%d",
              ddi_driver_name(dip), ddi_get_instance(dip), cfg_index);
  }

  if (usb_get_cfg(dip, &bConfigurationValue, 0) == USB_SUCCESS) {
          cmn_err (CE_WARN, "%s%d: USB device active configuration is %d",
              ddi_driver_name(dip), ddi_get_instance(dip),
              bConfigurationValue);
  } else {
          ...
          ...
  }

.fi
.in -2

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
ArchitecturePCI-based systems
_
Interface stabilityCommitted
_
AvailabilitySUNWusb
.TE

.SH SEE ALSO
.sp
.LP
.BR attributes (5),
.BR usb_get_alt_if (9F),
.BR usb_get_dev_data (9F),
.BR usb_get_string_descr (9F),
.BR usb_pipe_open (9F),
.BR usb_callback_flags (9S),
.BR usb_cfg_descr (9S),
.BR usb_ep_descr (9S),
.BR usb_if_descr (9S)
