usr/src/man/man9f/usb_pipe_set_private.9f
'\" te
.\" Copyright (c) 2004, Sun Microsystems, Inc., All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH usb_pipe_set_private 9F "5 Jan 2004" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
usb_pipe_set_private, usb_pipe_get_private \- USB user-defined pipe
data-field facility
.SH SYNOPSIS
.LP
.nf
#include <sys/usb/usba.h>

\fBint \fBusb_pipe_set_private\fR(\fBusb_pipe_handle_t\fR \fIpipe_handle\fR, \fBusb_opaque_t\fR \fIdata\fR);
.fi

.LP
.nf
\fBusb_opaque_t usb_pipe_get_private \fR(\fBusb_pipe_handle_t\fR \fIpipe_handle\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI)
.SH PARAMETERS
.sp
.LP
For
.BR usb_pipe_set_private() :
.sp
.ne 2
.mk
.na
.I pipe_handle
.ad
.RS 15n
.rt
Pipe handle into which user-defined data is placed.
.RE

.sp
.ne 2
.mk
.na
.I data
.ad
.RS 15n
.rt
Data to store in the pipe handle.
.RE

.sp
.LP
For
.BR usb_pipe_get_private() :
.sp
.ne 2
.mk
.na
.I pipe_handle
.ad
.RS 15n
.rt
Pipe handle from which user-defined data is retrieved.
.RE

.SH DESCRIPTION
.sp
.LP
The
.B usb_set_driver_private()
function initializes the user-private
data field of the pipe referred to by
.IR pipe_handle ,
using
.IR data .
The user-private data field is  used to store any data the client desires
and is not used in any way by the USBA or OS framework. Client drivers often
store their soft-state here for convenient retrieval by their callback
handlers.
.sp
.LP
The
.B usb_get_driver_private()
function retrieves the user-private data
stored via
.BR usb_set_driver_private() ,
from the pipe referred to by
.IR pipe_handle .
.SH RETURN VALUES
.sp
.LP
For
.BR usb_pipe_set_private() :
.sp
.ne 2
.mk
.na
.B USB_SUCCESS
.ad
.RS 20n
.rt
Private data has been successfully stored in pipe handle.
.RE

.sp
.ne 2
.mk
.na
.B USB_INVALID_PIPE
.ad
.RS 20n
.rt
.I pipe_handle
argument is
.B NULL
or invalid.
.sp
Pipe is closing or closed.
.RE

.sp
.ne 2
.mk
.na
.B USB_INVALID_PERM
.ad
.RS 20n
.rt
The
.I pipe_handle
argument refers to the default control pipe.
.RE

.sp
.LP
For
.BR usb_pipe_get_private() :
.sp
.LP
On success: usb_opaque_t pointer to data being retrieved.
.sp
.LP
On failure:
.BR NULL .
Fails if pipe handle is
.B NULL
or invalid.
Fails if pipe handle is to a pipe which is closing or closed.
.SH CONTEXT
.sp
.LP
May be called from user, kernel or interrupt context.
.SH EXAMPLES
.sp
.in +2
.nf
    usb_pipe_handle_t pipe;

    /* Some driver defined datatype. */
    xxx_data_t *data = kmem_zalloc(.\|.\|.);

    usb_pipe_set_private(pipe, data);

    ----

    xxx_data_t *xxx_data_ptr = (xxx_data_t *)usb_pipe_get_private(pipe);

.fi
.in -2

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
ArchitecturePCI-based systems
_
Interface stabilityCommitted
_
AvailabilitySUNWusb
.TE

.SH SEE ALSO
.sp
.LP
.BR attributes (5),
.BR usb_pipe_open (9F),
.BR usb_alloc_request (9F)
