usr/src/man/man9f/usb_get_current_frame_number.9f
'\" te
.\" Copyright (c) 2004, Sun Microsystems, Inc., All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH usb_get_current_frame_number 9F "25 July 2004" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
usb_get_current_frame_number \- Return current logical usb frame number
.SH SYNOPSIS
.LP
.nf
#include <sys/usb/usba.h>



\fBusb_frame_number_t\fR \fBusb_get_current_frame_number\fR(\fBdev_info_t *\fIdip\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI)
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I dip
.ad
.RS 7n
.rt
Pointer to the device's
.B dev_info
structure.
.RE

.SH DESCRIPTION
.sp
.LP
The
.B usb_get_current_frame_number()
function retrieves the current
logical USB frame number.
.sp
.LP
Isochronous requests can be started on a particular numbered frame. An
offset number of frames (typically between 4 and 10) can be added to the
current logical frame number to specify the number of an upcoming frame to
start an isochronous request.
.sp
.LP
The USB specification requires that the frame frequency (the period between
start-of-frame packets) is one millisecond.  The Solaris operating
environment USB implementation uses a running counter of the number of
milliseconds since boot as the current logical frame number.
.SH RETURN VALUES
.sp
.LP
On success, the
.B usb_get_current_frame_number()
function returns the
current USB frame number. On failure it returns
.BR 0 .
The function fails
if
.I dip
is NULL.
.SH CONTEXT
.sp
.LP
May be called from user, kernel or interrupt context.
.SH EXAMPLES
.sp
.in +2
.nf
    usb_pipe_handle_t handle;
    usb_frame_number_t offset = 10;
    usb_isoc_req_t *isoc_req;

    isoc_req = usb_alloc_isoc_req(.\|.\|.);
      .\|.\|.
      .\|.\|.
    isoc_req->isoc_frame_no = usb_get_current_frame_number(dip) + offset;
    isoc_req->isoc_attributes = USB_ATTRS_ISOC_START_FRAME;
      .\|.\|.
      .\|.\|.
    if (usb_pipe_isoc_xfer(handle, isoc_req, 0) != USB_SUCCESS) {
      .\|.\|.
    }
.fi
.in -2

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
ArchitecturePCI-based systems
_
Interface stabilityCommitted
_
AvailabilitySUNWusb
.TE

.SH SEE ALSO
.sp
.LP
.BR attributes (5),
.BR usb_alloc_isoc_req (9F),
.BR usb_get_max_pkts_per_isoc_request (9F),
.BR usb_pipe_isoc_xfer (9F),
.BR usb_pipe_get_max_bulk_transfer_size (9F),
.BR usb_isoc_request (9S)
