usr/src/man/man9f/usb_register_hotplug_cbs.9f
'\" te
.\" Copyright (c) 2004, Sun Microsystems, Inc.,
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH usb_register_hotplug_cbs 9F "17 Aug 2004" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
usb_register_hotplug_cbs, usb_unregister_hotplug_cbs \- Register/unregister
for notification of device hotplug events
.SH SYNOPSIS
.LP
.nf
#include <sys/usb/usba.h>



\fBint\fR \fBusb_register_hotplug_cbs\fR(\fBdev_info_t *\fIdip\fR,
     \fBint\fR \fI(*disconnection_event_handler)\fR(dev_info_t *\fIdip\fR,
     \fBint\fR \fI(*reconnection_event_handler)\fR(dev_info_t *\fIdip\fR);
.fi

.LP
.nf
 \fBvoid\fR \fBusb_unregister_hotplug_cbs\fR(\fBdev_info_t *\fIdip\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI)
.SH PARAMETERS
.sp
.LP
For
.BR usb_register_hotplug_cbs()
.sp
.ne 2
.mk
.na
.I dip
.ad
.sp .6
.RS 4n
Pointer to the device's
.B dev_info
structure.
.RE

.sp
.ne 2
.mk
.na
.I disconnection_event_handler
.ad
.sp .6
.RS 4n
Called when device is disconnected. This handler takes a dev_info_t as an
argument (representing the device being disconnected) and always returns
USB_SUCCESS.
.RE

.sp
.ne 2
.mk
.na
.I reconnection_event_handler
.ad
.sp .6
.RS 4n
Called when device is reconnected. This handler takes a dev_info_t as an
argument (representing the device being reconnected) and always returns
USB_SUCCESS.
.RE

.sp
.LP
For
.BR usb_unregister_hotplug_cbs() :
.sp
.ne 2
.mk
.na
.I dip
.ad
.RS 7n
.rt
Pointer to the device's
.B dev_info
structure.
.RE

.SH DESCRIPTION
.sp
.LP
The
.B usb_register_hotplug_cbs()
function registers callbacks to be
executed when the USB device represented by
.I dip
is hotplugged or
removed.
.sp
.LP
The
.B usb_unregister_hotplug_cbs()
function unregisters or disengages
callbacks from executing when the USB device represented by
.I dip
is
hotplugged or removed.
.SH RETURN VALUES
.sp
.LP
For
.BR usb_register_hotplug_cbs() :
.sp
.ne 2
.mk
.na
.B USB_SUCCESS
.ad
.RS 15n
.rt
Callbacks were successfully registered.
.RE

.sp
.ne 2
.mk
.na
.B USB_FAILURE
.ad
.RS 15n
.rt
One or more arguments were NULL.
.sp
Callbacks could not be successfully registered.
.RE

.sp
.LP
For
.BR usb_unregister_hotplug_cbs() :
None
.SH CONTEXT
.sp
.LP
The
.B usb_register_hotplug_cbs()
function may be called only from
.BR attach (9E).
.sp
.LP
The
.B usb_unregister_hotplug_cbs()
function may be called only from
.BR detach (9E).
.sp
.LP
Registered callback handlers requiring the use of any DDI (section 9F)
function (except ddi_taskq_* functions), should launch a separate thread
using ddi_taskq_* routines for processing their event, to avoid deadlocks.
The new thread can then safely call any DDI function it needs to handle the
event.
.sp
.LP
The registered callback handlers execute in kernel context.
.SH EXAMPLES
.sp
.in +2
.nf

    int remove_device(dev_info_t *)
    {
            ...
            ...
            return (USB_SUCCESS);
    }

    int accommodate_device(dev_info_t *)
    {
            ...
            ...
            return (USB_SUCCESS);
    }

    if (usb_register_hotplug_cbs(
        dip, remove_device, accommodate_device) == USB_FAILURE) {
            cmn_err (CE_WARN,
                "%s%d: Could not register hotplug handlers.",
                ddi_driver_name(dip), ddi_get_instance(dip));
    }

.fi
.in -2

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
ArchitecturePCI-based systems
_
Interface stabilityCommitted
_
AvailabilitySUNWusb
.TE

.SH SEE ALSO
.sp
.LP
.BR attributes (5),
.BR attach (9E),
.BR detach (9E),
.BR usb_get_status (9F)
