usr/src/man/man9f/uwritec.9f
'\" te
.\" Copyright (c) 2006, Sun Microsystems, Inc., All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" Copyright 1989 AT&T
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH uwritec 9F "16 Jan 2006" "SunOS 5.11" "Kernel Functions for Drivers"
.SH NAME
uwritec \- remove a character from a uio structure
.SH SYNOPSIS
.LP
.nf
#include <sys/uio.h>



\fBint\fR \fBuwritec\fR(\fBuio_t *\fIuio_p\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Architecture independent level 1 (DDI/DKI)
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I uio_p
.ad
.RS 9n
.rt
Pointer to the
.BR uio "(9S) structure"
.RE

.SH DESCRIPTION
.sp
.LP
The
.B uwritec()
function returns a character from the
.BR uio
structure pointed to by
.I uio_p
and updates the
.B uio
structure. See
.BR uiomove (9F).
.SH RETURN VALUES
.sp
.LP
The next character for processing is returned on success, and
.B -1
is
returned if
.B uio
is empty or if there is an error.
.SH CONTEXT
.sp
.LP
The
.B uwritec()
function can be called from user, interrupt, or kernel
context.
.SH SEE ALSO
.sp
.LP
.BR uiomove (9F),
.BR ureadc (9F),
.BR iovec (9S),
.BR uio (9S)
.sp
.LP
.I Writing Device Drivers
