usr/src/man/man7p/rarp.7p
'\" te
.\" Copyright (c) 2001, Sun Microsystems, Inc.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH rarp 7P "28 May 2005" "SunOS 5.11" "Protocols"
.SH NAME
rarp, RARP \- Reverse address resolution protocol
.SH DESCRIPTION
.sp
.LP
You use the RARP protocol to map dynamically between the Internet Protocol
(IP) and network interface MAC addresses. RARP is often used to boot a
Solaris client. RARP clients include the SPARC boot PROM, x86 boot floppy,
SunOS kernel, and
.BR ifconfig (1M).
.BR in.rarpd (1M)
provides the
server-side implementation.
.sp
.LP
RARP request timeout behavior in application-layer clients is governed by
the
.B /etc/inet/rarp
default file. To tune the number of retries an
application attempts before giving up, set the
.B RARP_RETRIES
variable
in
.BR /etc/inet/rarp .
If the file is not present or
.B RARP_RETRIES
is
not initialized within it, applications retry a maximum of five times with a
eight second wait between retries.
.SH FILES
.sp
.LP
.B /etc/inet/rarp
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface Stability (protocol)Standard
_
Interface Stability (defaults file)Unstable
_
Interface Stability (RARP_RETRIES)Unstable
.TE

.SH SEE ALSO
.sp
.LP
.BR ifconfig (1M),
.BR in.rarpd (1M),
.BR arp (7P)
.sp
.LP
.I "Reverse Address Resolution Protocol RFC 903.  June, 1984
R.
Finlayson, T. Mann, J.C. Mogul, M. Theimer
