usr/src/man/man7p/slp.7p
'\" te
.\" Copyright (C) 1999, Sun Microsystems, Inc.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" All Rights Reserved.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH slp 7P "17 Nov 1999" "SunOS 5.11" "Protocols"
.SH NAME
slp \- Service Location Protocol
.SH DESCRIPTION
.sp
.LP
The Service Location Protocol (\fBSLP\fR) is a dynamic service discovery
protocol that runs on top of the Internet Protocol
.RB ( IP ).
The protocol is
specified by the
.B IETF
standard-track documents
.IR "RFC 2165" ,
\fIRFC
2608\fR,
.IR "RFC 2609" ;
the
.B API
is documented in
.IR "RFC 2614" .
\&.
.sp
.LP
There are two components to the
.B SLP
technology. The first is a daemon,
.BR slpd (1M),
which coordinates
.B SLP
operations. The second is a software
library,
.BR slp_api (3SLP),
through which processes access a public
.BR API .
Both components are configured by means of the
.B SLP
configuration file,
.BR slp.conf (4).
.sp
.LP
The
.B "SLP API"
is useful for two types of processes:
.sp
.ne 2
.mk
.na
.B Client Applications
.ad
.RS 23n
.rt
Services and service information can be requested from the
.BR API .
Clients
do not need to know the location of a required service, only the type of service,
and optionally, the service characteristics.
.B SLP
will supply the location
and other information to the client through the
.BR API .
.RE

.sp
.ne 2
.mk
.na
.B Server Processes
.ad
.RS 23n
.rt
Programs that offer network services use the
.B "SLP API"
to advertise
their location as well as other service information. The advertisement can
optionally include attributes describing the service. Advertisements are
accompanied by a lifetime; when the lifetime expires, the advertisement is
flushed, unless it is refreshed prior to expiration.
.RE

.sp
.LP
.B API
libraries are available for both the C and Java languages.
.sp
.LP
.B SLP
provides the following additional features:
.RS +4
.TP
.ie t \(bu
.el o
.BR slpd (1M)
can be configured to function as a transparent directory agent.
This feature makes
.B SLP
scalable to the enterprise. System administrators
can configure directory agents to achieve a number of different strategies for
scalability.
.RE
.RS +4
.TP
.ie t \(bu
.el o
.B SLP
service advertising and discovery is performed in scopes. Unless
otherwise configured, all discovery and all advertisements are in the scope
.IR default .
In the case of a larger network, scopes can be used to group
services and client systems so that users will only find those services which are
physically near them, belong to their department, or satisfy the specified
criteria. Administrators can configure these scopes to achieve different service
provider strategies.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Services may be registered by proxy through a serialized registration file. This
is an alternative to registering services through the
.BR API .
See
.BR slpd.reg (4)
for more information.
.RE
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWslpu
_
CSICSI-enabled
_
Interface StabilityStandard
_
MT-LevelMT-Safe
.TE

.SH SEE ALSO
.sp
.LP
.BR slpd (1M),
.BR slp_api (3SLP),
.BR slp.conf (4),
.BR slpd.reg (4),
.BR attributes (5)
.sp
.LP
Guttman, E.,  Perkins, C., Veizades, J., and Day, M., \fIRFC 2608, Service
Location Protocol, Version 2\fR, The Internet Society, June 1999.
.sp
.LP
Guttman, E.,  Perkins, C., and Kempf, J., \fIRFC 2609, Service Templates and
Service: Schemes\fR, The Internet Society, June 1999.
.sp
.LP
Kempf, J. and Guttman, E.,
.IR "RFC 2614, An API for Service Location" ,
The
Internet Society, June 1999.
.sp
.LP
Veizades, J., Guttman, E.,  Perkins, C., and Kaplan, S., \fIRFC 2165, Service
Location Protocol\fR, Network Working Group, 1997.
