usr/src/man/man7d/ahci.7d
'\" te
.\" Copyright (c) 2009, Sun Microsystems, Inc. All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ahci 7D "10 Sep 2009" "SunOS 5.11" "Devices"
.SH NAME
ahci \- Advanced Host Controller Interface SATA controller driver
.SH SYNOPSIS
.LP
.nf
\fBsata@unit-address\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B ahci
driver is a SATA framework-compliant HBA driver that
supports SATA HBA controllers that are compatible with the \fIAdvanced Host
Controller Interface 1.0\fR specification. AHCI is an Intel-developed
protocol that describes the register-level interface for host controllers
for serial ATA 1.0a and Serial ATA II. The
.I "AHCI 1.0"
specification
describes the interface between the system software and the host controller
hardware.
.sp
.LP
The
.B ahci
driver currently supports the Intel ICH6/7/8/9/10, VIA
vt8251 and JMicron AHCI controllers which are compliant with the Advanced
Host Controller Interface 1.0 specification. The Intel ICH6/7/8/9 and VIA
vt8251 controllers support standard SATA features. The
.B ahci
driver
currently supports hard disk, ATAPI DVD, ATAPI tape, ATAPI disk (i.e. Dell
RD1000), hotplug, NCQ (Native command queuing) and Port multipliers (Silicon
Image 3726/4726). Power management is not yet supported.
.SH CONFIGURATION
.sp
.LP
The
.B ahci
module contains no user configurable parameters.
.SH FILES
.sp
.ne 2
.mk
.na
.B /kernel/drv/ahci
.ad
.sp .6
.RS 4n
32-bit
.B ELF
kernel module (x86).
.RE

.sp
.ne 2
.mk
.na
.B /kernel/drv/amd64/ahci
.ad
.sp .6
.RS 4n
64-bit
.B ELF
kernel module (x86).
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attribute:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Architecturex86
_
AvailabilitySUNWahci
.TE

.SH SEE ALSO
.sp
.LP
\fBcfgadm\fR(1M), \fBcfgadm_sata\fR(1M), \fBprtconf\fR(1M),
.BR sata (7D)
.sp
.LP
\fIAdvanced Host Controller Interface 1.0\fR
.sp
.LP
.I Writing Device Drivers
.SH NOTES
.sp
.LP
To bind the
.B ahci
driver to your controller, choose the [AHCI] BIOS
option. 
.sp
.LP
Note that booting is not supported if toggle exists between the [IDE] and
[AHCI] BIOS options
