usr/src/man/man7d/arn.7d
'\" te
.\" Copyright (c) 2009, Sun Microsystems, Inc. All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH arn 7D "24 Aug 2009" "SunOS 5.11" "Devices"
.SH NAME
arn \- Atheros AR9280/9281/9285 IEEE802.11 a/b/g/n wireless network
device
.SH DESCRIPTION
.sp
.LP
The
.B arn
IEEE802.11 a/b/g/n wireless driver is a loadable, clonable,
GLDv3-based STREAMS driver supporting Atheros AR9280/9281/9285 IEEE802.11
a/b/g/n wireless network device.
.SS "Configuration"
.sp
.LP
The
.B arn
driver performs auto-negotiation to determine the data rate
and mode. The driver supports only BSS networks (also known as
.B ap
or
\fBinfrastructure\fR networks) and \fBopen\fR(or
.BR open-system )
or
\fBshared system\fR authentication. For wireless security, WEP encryption,
WPA-PSK, and WPA2-PSK are currently supported. Configuration and
administration tasks can be performed with the
.BR dladm "(1M) and"
.BR wificonfig (1M)
utilities.
.SH FILES
.sp
.ne 2
.mk
.na
.B /dev/arn
.ad
.RS 25n
.rt
Special character device
.RE

.sp
.ne 2
.mk
.na
.B /kernel/drv/arn
.ad
.RS 25n
.rt
32-bit ELF kernel module (x86)
.RE

.sp
.ne 2
.mk
.na
.B /kernel/drv/amd64/arn
.ad
.RS 25n
.rt
64-bit ELF kernel driver module (x86)
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for a description of the following attributes:
.sp

.sp
.TS
tab() box;
lw(2.75i) |lw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Architecturex86
_
AvailabilitySUNWarn
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
.BR dladm (1M),
.BR wificonfig (1M),
.BR attributes (5),
.BR dlpi (7P),
.BR gld (7D)
