usr/src/man/man7d/asy.7d
'\" te
.\" Copyright (c) 2004, Sun Microsystems, Inc.  All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH asy 7D "9 Oct 2004" "SunOS 5.11" "Devices"
.SH NAME
asy \- asynchronous serial port driver
.SH SYNOPSIS
.LP
.nf
#include <fcntl.h>
.fi

.LP
.nf
#include <sys/termios.h>
.fi

.LP
.nf
open("/dev/term/\fIn\fR", \fImode\fR);
.fi

.LP
.nf
open("/dev/tty/\fIn\fR", \fImode\fR);
.fi

.LP
.nf
open("/dev/cua/\fIn\fR", \fImode\fR);
.fi

.SH DESCRIPTION
.sp
.LP
The
.B asy
module is a loadable STREAMS driver that provides basic
support for Intel-8250, National Semiconductor-16450, 16550, and some 16650
and 16750 and equivalent UARTs connected via the ISA-bus, in addition to
basic asynchronous communication support. The
.B asy
module supports
those
.BR termio (7I)
device control functions specified by flags in the
.B c_cflag
word of the
.B termios
structure, and by the
.B IGNBRK,
.BR "IGNPAR, PARMRK" ,
.BR INPCK ,
.BR IXON ,
.BR IXANY ,
or
.B IXOFF
flags in the c_iflag word of the termios structure. All other
.BR termio (7I)
functions must be performed by
.B STREAMS
modules pushed
atop the driver. When a device is opened, the
.BR ldterm (7M)
and
.BR ttcompat (7M)
.B STREAMS
modules are automatically pushed on top of
the stream, providing the standard
.BR termio (7I)
interface.
.sp
.LP
The character-special devices
.BR /dev/term/a ,
.BR /dev/term/b ,
.B /dev/term/c
and
.B /dev/term/d
are used to access the four standard
serial ports (COM1, COM2, COM3 and COM4 at I/O addresses 3f8, 2f8, 3e8 and
2e8 respectively). Serial ports on non-standard ISA-bus I/O addresses are
accessed via the character-special devices
.BR /dev/term/0 ,
.BR /dev/term/1 ,
etc. Device names are typically used to provide a logical
access point for a dial-in line that is used with a modem.
.sp
.LP
To allow a single tty line to be connected to a modem and used for incoming
and outgoing calls, a special feature is available that is controlled by the
minor device number. By accessing character-special devices with names of
the form
.BI /dev/cua/ n,
it is possible to open a port without the
.B Carrier Detect
signal being asserted, either through hardware or an
equivalent software mechanism. These devices are commonly known as dial-out
lines.
.LP
Note -
.sp
.RS 2
This module is affected by the setting of certain eeprom variables,
ttya-ignore-cd and ttya-rts-dtr-off (and similarly for ttyb-, ttyc-, and
ttyd- parameters). For information on these parameters, see the
.BR eeprom (1M)
man page.
.RE
.LP
Note -
.sp
.RS 2
For serial ports on the standard COM1 to COM4 I/O addresses above, the
default setting for ttya-ignore-cd and ttya-rts-dtr-off is true. If any of
these ports are connected to a modem, these settings should be changed to
false. For serial ports on non-standard I/O addresses, the default setting
for ttya-ignore-cd and ttya-rts-dtr-off is false.
.RE
.SH APPLICATION PROGRAMMING INTERFACE
.sp
.LP
Once a
.BI /dev/cua/ n
line is opened, the corresponding tty line
cannot be opened until the
.BI /dev/cua/ n
line is closed. A blocking
open will wait until the
.BI /dev/cua/ n
line is closed (which will
drop
.BR "Data Terminal Ready" ,
after which
.B "Carrier Detect"
will
usually drop as well) and carrier is detected again. A non-blocking open
will return an error. If the
.BI /dev/ttyd n
line has been opened
successfully (usually only when carrier is recognized on the modem), the
corresponding
.BI /dev/cua/ n
line cannot be opened. This allows a
modem to be attached to \fB/dev/term/\fR[\fIn\fR] (renamed from
\fB/dev/tty\fR[\fIn\fR]) and used for dial-in (by enabling the line for
login in
.BR /etc/inittab )
or dial-out (by
.BR tip (1)
or
.BR uucp (1C))
as
.BI /dev/cua/ n
when no one is logged in on the line.
.SH IOCTLS
.sp
.LP
The standard set of
.B "termio ioctl()"
calls are supported by
.BR asy .
.sp
.LP
Breaks can be generated by the
.B "TCSBRK, TIOCSBRK,"
and
.B TIOCCBRK ioctl()
calls.
.sp
.LP
The input and output line speeds may be set to any speed that is supported
by
.BR termio .
The speeds cannot be set independently; for example, when
the output speed is set, the input speed is automatically set to the same
speed.
.sp
.LP
When the
.B asy
module is used to service the serial console port, it
supports a BREAK condition that allows the system to enter the debugger or
the monitor. The BREAK condition is generated by hardware and it is usually
enabled by default.
.sp
.LP
A BREAK condition originating from erroneous electrical signals cannot be
distinguished from one deliberately sent by remote DCE. The Alternate Break
sequence can be used as a remedy against this. Due to a risk of incorrect
sequence interpretation, SLIP and certain other binary protocols should not
be run over the serial console port when Alternate Break sequence is in
effect. Although PPP is a binary protocol, it is able to avoid these
sequences using the ACCM feature in
.IR "RFC 1662" .
For Solaris PPP 4.0, you
do this by adding the following line to the
.B /etc/ppp/options
file (or
other configuration files used for the connection; see
.BR pppd (1M)
for
details):
.sp
.in +2
.nf
asyncmap 0x00002000
.fi
.in -2

.sp
.LP
By default, the Alternate Break sequence is a three character sequence:
carriage return, tilde and control-B (CR ~ CTRL-B), but may be changed by
the driver. For more information on breaking (entering the debugger or
monitor), see
.BR kbd (1)
and
.BR kb (7M).
.SH ERRORS
.sp
.LP
An
.B open()
will fail under the following conditions:
.sp
.ne 2
.mk
.na
.B ENXIO
.ad
.RS 9n
.rt
The unit being opened does not exist.
.RE

.sp
.ne 2
.mk
.na
.B EBUSY
.ad
.RS 9n
.rt
The dial-out device is being opened while the dial-in device is already
open, or the dial-in device is being opened with a no-delay open and the
dial-out device is already open.
.RE

.sp
.ne 2
.mk
.na
.B EBUSY
.ad
.RS 9n
.rt
The unit has been marked as exclusive-use by another process with a
.B TIOCEXCL ioctl()
call.
.RE

.sp
.ne 2
.mk
.na
.B EINTR
.ad
.RS 9n
.rt
The open was interrupted by the delivery of a signal.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
\fB/dev/term/\fR[\fIa-d\fR]\fR
.ad
.br
.na
\fB/dev/term/\fR[\fI012.\|.\|.\fR]\fR
.ad
.RS 25n
.rt
dial-in tty lines
.RE

.sp
.ne 2
.mk
.na
\fB/dev/cua/\fR[\fIa-d\fR]\fR
.ad
.br
.na
\fB/dev/cua/\fR[\fI012.\|.\|.\fR]\fR
.ad
.RS 25n
.rt
 dial-out tty lines
.RE

.sp
.ne 2
.mk
.na
.B /kernel/drv/amd64/asy
.ad
.RS 25n
.rt
64-bit kernel module for 64-bit x86 platform
.RE

.sp
.ne 2
.mk
.na
.B /kernel/drv/asy.conf
.ad
.RS 25n
.rt
.B asy
configuration file
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Architecturex86
.TE

.SH SEE ALSO
.sp
.LP
.BR tip (1),
.BR kbd (1),
.BR uucp (1C),
.BR eeprom (1M),
.BR pppd (1M),
.BR ioctl (2),
.BR open (2),
.BR termios (3C),
.BR attributes (5),
.BR ldterm (7M),
.BR ttcompat (7M),
.BR kb (7M),
.BR termio (7I)
.SH DIAGNOSTICS
.sp
.ne 2
.mk
.na
\fBasy\fIn\fB\|: silo overflow.\fR
.ad
.sp .6
.RS 4n
The hardware overrun occurred before the input character could be
serviced.
.RE

.sp
.ne 2
.mk
.na
\fBasy\fIn\fB\|: ring buffer overflow.\fR
.ad
.sp .6
.RS 4n
The driver's character input ring buffer overflowed before it could be
serviced.
.RE

