usr/src/man/man7d/ath.7d
'\" te
.\" Copyright (c) 2006, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ath 7D "14 Nov 2006" "SunOS 5.11" "Devices"
.SH NAME
ath \- Atheros AR52xx 802.11b/g wireless NIC driver
.SH DESCRIPTION
.sp
.LP
The
.B ath
.I 802.11b/g
wireless  NIC driver is a  multi-threaded,
loadable, clonable, GLDv3-based STREAMS driver for the Atheros AR52xx
(AR5210/5211/5212) chipset-based  wireless NIC.
.sp
.LP
The
.B ath
driver functions include controller initialization, wireless
.I 802.11b/g
infrastructure network connection, WEP, frame transmit and
receive, and promiscuous and multi-cast support.
.SH DRIVER CONFIGURATION
.sp
.LP
The
.B ath
driver performs auto-negotiation to determine the data rates
and mode. Supported
.I 802.11b
data rates (Mbits/sec.) are 1, 2, 5.5 and
11. Supported
.I 802.11g
data rates (Mbits/sec.) are 1, 2, 5.5, 11, 6, 9,
12, 18, 24, 36, 48 and 54.
.sp
.LP
 The
.B
ath
driver supports only BSS networks (also known  as "ap" or "infrastructure" networks) and the "open" (or "opensystem") authentication type. Only  WEP encryption is currently supported. Configuration and administration can be performed  through  the
.BR dladm (1M)
or 
.BR wificonfig (1M)
utilities.
.SH FILES
.sp
.ne 2
.mk
.na
.B /dev/ath*
.ad
.RS 26n
.rt
Special character device.
.RE

.sp
.ne 2
.mk
.na
.B /kernel/drv/ath
.ad
.RS 26n
.rt
32-bit ELF kernel module (x86).
.RE

.sp
.ne 2
.mk
.na
.B /kernel/drv/amd64/ath
.ad
.RS 26n
.rt
64-bit ELF kernel module (x86).
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Architecturex86
.TE

.SH SEE ALSO
.sp
.LP
.BR dladm (1M),
.BR wificonfig (1M),
.BR gld (7D)
.sp
.LP
\fIANSI/IEEE Std 802.11\fR- Standard for Wireless LAN Technology, 1999.
.sp
.LP
\fIIEEE Std 802.11a\fR- Standard for Wireless LAN Technology-Rev. A, 2003
.sp
.LP
.I IEEE Std 802.11b
- Standard for Wireless LAN Technology-Rev.B, 2003
.sp
.LP
\fIIEEE Std 802.11g\fR\(em Standard for Wireless LAN Technology - Rev. G,
2003
