usr/src/man/man7d/atu.7d
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\" Copyright (c) 2009, Sun Microsystems, Inc. All Rights Reserved
.TH atu 7D "26 Mar 2009" "SunOS 5.11" "Devices"
.SH NAME
atu \- Atmel AT76C50x USB IEEE 802.11b Wireless Device Driver
.SH DESCRIPTION
.sp
.LP
The \fBatu 802.11b\fR wireless driver is a multi-threaded, loadable,
clonable, GLDv3-based STREAMS driver supporting the Atmel AT76C50x
chipset-based wireless devices.
.SS "Configuration"
.sp
.LP
The \fBatu\fR driver performs auto-negotiation to determine the data rate
and mode. Supported 802.11b data rates are 1, 2, 5.5, and 11 Mbits/sec.
.sp
.LP
The \fBatu\fR driver supports only BSS networks (also known as \fBap\fR or
\fBinfrastructure\fR networks).
.sp
.LP
\fBopen\fR (or \fBopen-system\fR) and \fBshared key\fR authentication modes
are supported. Encryption types WEP40 and WEP104 are supported.
.SH FILES
.sp
.ne 2
.mk
.na
\fB/dev/atu*\fR
.ad
.RS 25n
.rt
Special character device
.RE

.sp
.ne 2
.mk
.na
\fB/kernel/drv/atu\fR
.ad
.RS 25n
.rt
32-bit ELF kernel module (x86)
.RE

.sp
.ne 2
.mk
.na
\fB/kernel/drv/amd64/atu\fR
.ad
.RS 25n
.rt
64-bit ELF kernel module (x86)
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for a description of the following attributes:
.sp

.sp
.TS
tab() box;
lw(2.75i) |lw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Architecturex86
_
AvailabilitySUNWatu
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBdladm\fR(1M), \fBwificonfig\fR(1M), \fBattributes\fR(5), \fBdlpi\fR(7P),
\fBgld\fR(7D)
.sp
.LP
\fI802.11 - Wireless LAN Media Access Control and Physical Layer
Specification - IEEE, 2001\fR
