usr/src/man/man7d/atu.7d
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\" Copyright (c) 2009, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.TH atu 7D "26 Mar 2009" "SunOS 5.11" "Devices"
.SH NAME
atu \- Atmel AT76C50x USB IEEE 802.11b Wireless Device Driver
.SH DESCRIPTION
.sp
.LP
The
.B "atu 802.11b"
wireless driver is a multi-threaded, loadable,
clonable, GLDv3-based STREAMS driver supporting the Atmel AT76C50x
chipset-based wireless devices.
.SS "Configuration"
.sp
.LP
The
.B atu
driver performs auto-negotiation to determine the data rate
and mode. Supported 802.11b data rates are 1, 2, 5.5, and 11 Mbits/sec.
.sp
.LP
The
.B atu
driver supports only BSS networks (also known as
.B ap
or
.B infrastructure
networks).
.sp
.LP
.B open
(or
.BR open-system )
and
.B "shared key"
authentication modes
are supported. Encryption types WEP40 and WEP104 are supported.
.SH FILES
.sp
.ne 2
.mk
.na
.B /dev/atu*
.ad
.RS 25n
.rt
Special character device
.RE

.sp
.ne 2
.mk
.na
.B /kernel/drv/atu
.ad
.RS 25n
.rt
32-bit ELF kernel module (x86)
.RE

.sp
.ne 2
.mk
.na
.B /kernel/drv/amd64/atu
.ad
.RS 25n
.rt
64-bit ELF kernel module (x86)
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for a description of the following attributes:
.sp

.sp
.TS
tab() box;
lw(2.75i) |lw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Architecturex86
_
AvailabilitySUNWatu
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
.BR dladm (1M),
.BR wificonfig (1M),
.BR attributes (5),
.BR dlpi (7P),
.BR gld (7D)
.sp
.LP
\fI802.11 - Wireless LAN Media Access Control and Physical Layer
Specification - IEEE, 2001\fR
