usr/src/man/man7d/audioens.7d
'\" te
.\" Copyright (c) 2009, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH audioens 7D "15 May 2009" "SunOS 5.11" "Devices"
.SH NAME
audioens \- Ensoniq ESS 1371 and ESS 1373 audio driver
.SH DESCRIPTION
.sp
.LP
The
.B audioens
driver provides support for the Ensoniq ESS1371,
ESS1373, and Creative 5880 AC'97 devices. These devices are commonly known
by several different names, including the Sound Blaster PCI128 and AudioPCI
\&'97.
.SH FILES
.sp
.ne 2
.mk
.na
.B /kernel/drv/audioens
.ad
.sp .6
.RS 4n
32-bit kernel module
.RE

.sp
.ne 2
.mk
.na
.B /kernel/drv/amd64/audioens
.ad
.sp .6
.RS 4n
64-bit x86 kernel module
.RE

.sp
.ne 2
.mk
.na
.B /kernel/drv/sparcv9/audioens
.ad
.sp .6
.RS 4n
64-bit SPARC kernel module
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(0i) |cw(5.5i)
lw(0i) |lw(5.5i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
ArchitectureSPARC, x86
_
AvailabilitySUNWaudd
_
Interface StabilityUncommitted
.TE

.SH SEE ALSO
.sp
.LP
.BR attributes (5),
.BR audio (7I),
.BR dsp (7I),
.BR mixer (7I)
