usr/src/man/man7d/audio810.7d
'\" te
.\" Copyright (c) 2009 Sun Microsystems, Inc. All rights reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH audio810 7D "13 May 2009" "SunOS 5.11" "Devices"
.SH NAME
audio810 \- Intel ICH series, nVidia nForce series and AMD 8111 audio core
support
.SH DESCRIPTION
.sp
.LP
The
.B audio810
driver provides support for AC 97 audio controllers
embedded in Intel ICH, nVidia nForce, and AMD 8111 chips.
.SH FILES
.sp
.ne 2
.mk
.na
.B /kernel/drv/audio810
.ad
.RS 30n
.rt
32-bit kernel driver module
.RE

.sp
.ne 2
.mk
.na
.B /kernel/drv/amd64/audio810
.ad
.RS 30n
.rt
64-bit x86 kernel driver module
.RE

.sp
.ne 2
.mk
.na
.B /kernel/drv/audio810.conf
.ad
.RS 30n
.rt
.B audio810
driver configuration file
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for a descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(1.83i) |cw(3.67i)
lw(1.83i) |lw(3.67i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
ArchitecturePC-based systems
_
AvailabilitySUNWad810
_
Interface StabilityUncommitted
.TE

.SH SEE ALSO
.sp
.LP
.BR ioctl (2),
.BR attributes (5),
.BR audio (7I),
.BR mixer (7I),
.BR streamio (7I)
.sp
.LP
.I "AMD-8111 HyperTransport I/O Hub Data Sheet
\(em Advanced Micro
Devices Inc.
.sp
.LP
.I ALC655 Specification
\(em Realtek Inc.
.SH NOTES
.sp
.LP
Some laptops (including Sony VAIO, among others), have their on-board
amplifier powered down by default, meaning that audio is suppressed even if
hardware and the
.B audio810
driver are working normally. To correct
this, set the
.B ac97-invert-amp=1
property in the
.B /kernel/drv/audio810.conf
to power-up the amplifier.
.SH DIAGNOSTICS
.sp
.LP
In addition to being logged, the following messages may appear on the
system console:
.sp
.ne 2
.mk
.na
.B play-interrupts too low
.ad
.br
.na
.B record-interrupts too low
.ad
.RS 30n
.rt
The interrupt rate in
.B audio810.conf
is set too low. It has been reset
to the rate specified in the message. Update
.B audio810.conf
to a higher
interrupt rate.
.RE

.sp
.ne 2
.mk
.na
.B play-interrupts too high
.ad
.br
.na
.B record-interrupts too high
.ad
.RS 30n
.rt
The interrupt rate set in\fBaudio810.conf\fR is set too 	 high.It has been
reset to the rate specified in the message. Update
.BR audio810.conf to
a
lower interrupt rate.
.RE

