usr/src/man/man7d/audiopci.7d
'\" te
.\" Copyright (c) 2009, Sun Microsystems, Inc. All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH audiopci 7D "6 May 2009" "SunOS 5.11" "Devices"
.SH NAME
audiopci \- Ensoniq 1370 driver support
.SH DESCRIPTION
.sp
.LP
The \fBaudiopci\fR driver provides support for the Ensoniq 1370 audio
controller. Ensoniq 1370 chips are found on add-in PCI cards commonly
identified as Audio PCI and SoundBlaster PCI.
.SH FILES
.sp
.ne 2
.mk
.na
\fB/kernel/drv/audiopci\fR
.ad
.RS 30n
.rt
32-bit kernel driver module
.RE

.sp
.ne 2
.mk
.na
\fB/kernel/drv/amd64/audiopci\fR
.ad
.RS 30n
.rt
64-bit x86 kernel driver module
.RE

.sp
.ne 2
.mk
.na
\fB/kernel/drv/amd64/audiopci\fR
.ad
.RS 30n
.rt
64-bit SPARC kernel driver module
.RE

.sp
.ne 2
.mk
.na
\fB/kernel/drv/audiopci.conf\fR
.ad
.RS 30n
.rt
Driver configuration file
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for a description of the following attributes:
.sp

.sp
.TS
tab() box;
lw(2.75i) |lw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
ArchitecturePCI-based systems
_
AvailabilitySUNWaudd
.TE

.SH SEE ALSO
.sp
.LP
\fBioctl\fR(2), \fBattributes\fR(5), \fBaudio\fR(7I), \fBmixer\fR(7I),
\fBstreamio\fR(7I)
.sp
.LP
\fICreative Technology Ltd ES1370 Specification\fR
.sp
.LP
http://www.sun.com
