usr/src/man/man7d/audiovia823x.7d
'\" te
.\" Copyright (c) 2009 Sun Microsystems, Inc. All rights reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH audiovia823x 7D "12 May 2009" "SunOS 5.11" "Devices"
.SH NAME
audiovia823x \- VIA VT8233, VT8235, and VT8237) support
.SH DESCRIPTION
.sp
.LP
The \fBaudiovia823\fIx\fR driver provides support for the VIA VT8233,
VT8235, and VT8237 AC'97 devices found on motherboards with certain VIA chip
sets.
.SH FILES
.sp
.ne 2
.mk
.na
.B /kernel/drv/audiovia823x
.ad
.sp .6
.RS 4n
32-bit x86 kernel module
.RE

.sp
.ne 2
.mk
.na
.B /kernel/drv/amd64/audiovia823x
.ad
.sp .6
.RS 4n
64-bit x86 kernel module
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.27i) |cw(3.23i)
lw(2.27i) |lw(3.23i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Architecturex86
_
AvailabilitySUNWvia823x
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
.BR attributes (5),
.BR audio (7I),
.BR dsp (7I),
.BR mixer (7I)
