usr/src/man/man7d/bcm_sata.7d
'\" te
.\" Copyright (c) 2009, Sun Microsystems, Inc. All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH bcm_sata 7D "31 Aug 2009" "SunOS 5.11" "Devices"
.SH NAME
bcm_sata \- Broadcom HT1000 SATA controller driver
.SH SYNOPSIS
.sp
.LP
\fBsata@\fIunit-address\fR
.SH DESCRIPTION
.sp
.LP
The
.B bcm_sata
driver is a SATA HBA driver that supports Broadcom
HT1000 SATA HBA controllers.
.sp
.LP
HT1000 SATA controllers are compliant with the Serial ATA 1.0 specification
and SATA II Phase 1.0 specification (the extension to the SATA 1.0
specification). These HT1000 controllers support standard SATA features
including SATA-II disks, NCQ, hotplug, ATAPI devices and port multiplier.
.sp
.LP
The driver does not currently support NCQ and port multiplier features.
.SS "Configuration"
.sp
.LP
The
.B bcm_sata
module contains no user configurable parameters.
.SH FILES
.sp
.ne 2
.mk
.na
.B /kernel/drv/bcm_sata
.ad
.RS 30n
.rt
32-bit ELF kernel module (x86)
.RE

.sp
.ne 2
.mk
.na
.B /kernel/drv/amd64/bcm_sata
.ad
.RS 30n
.rt
64-bit ELF kernel module (x86)
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for a description of the following attributes:
.sp

.sp
.TS
tab() box;
lw(2.75i) |lw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Architecturex86
_
AvailabilitySUNWbcmsata
.TE

.SH SEE ALSO
.sp
.LP
\fBcfgadm\fR(1M), \fBcfgadm_sata\fR(1M), \fBprtconf\fR(1M),
.BR attributes (5),
.BR sata (7D),
.BR sd (7D)
.sp
.LP
.I Writing Device Drivers
