usr/src/man/man7d/bfe.7d
'\" te
.\" Copyright (c) 2009, Sun Microsystems, Inc. All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH bfe 7D "23 Jun 2009" "SunOS 5.11" "Devices"
.SH NAME
bfe \- Device driver for Broadcom BCM4401 100Base-T NIC
.SH DESCRIPTION
.sp
.LP
The \fBbfe\fR Fast Ethernet driver is GLD-based and supports the Broadcom
BCM4401 100Base-T NIC adapters :\fBpci14e4,170c Broadcom BCM4401
100Base-T.\fR.
.sp
.LP
The \fBbfe\fR driver supports IEEE 802.3 auto-negotiation, flow control and
VLAN tagging.
.SS "Configuration"
.sp
.LP
The default configuration is auto-negotiation with bidirectional flow
control. The advertised capabilities for auto-negotiation are based on the
capabilities of the
.BR PHY .
.sp
.LP
You can set the capabilities advertised by the \fBbfe\fR controlled device
using
.BR dladm "(1M).  The driver supports only those parameters which"
begin with en (enabled) in the parameters listed by the command
.BR dladm (1M).
Each of these boolean parameters determines if the device
advertises that mode of operation when the hardware supports it.
.SH FILES
.sp
.ne 2
.mk
.na
\fB/dev/bfe\fR
.ad
.RS 25n
.rt
Special character device
.RE

.sp
.ne 2
.mk
.na
\fB/kernel/drv/bfe\fR
.ad
.RS 25n
.rt
32-bit device driver (x86)
.RE

.sp
.ne 2
.mk
.na
\fB/kernel/drv/amd64/bfe\fR
.ad
.RS 25n
.rt
64-bit device driver (x86)
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for a description of the following attributes:
.sp

.sp
.TS
tab() box;
lw(2.75i) |lw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
ArchitectureSPARC, x86
.TE

.SH SEE ALSO
.sp
.LP
.BR dladm (1M),
.BR netstat (1M),
\fBdriver.conf\fR(4),
.BR attributes (5),
.BR ieee802.3 (5),
.BR dlpi (7P),
.BR streamio (7I)
.sp
.LP
.I Writing Device Drivers
.sp
.LP
.I STREAMS Programmer's Guide
.sp
.LP
\fINetwork Interface Guide\fR
.sp
.LP
\fIIEEE 802.3ae Specification - 2002\fR
