usr/src/man/man7d/blk2scsa.7d
'\" te
.\" Copyright (c) 2008, Sun Microsystems, Inc.  All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH blk2scsa 7D "28 Feb 2008" "SunOS 5.11" "Devices"
.SH NAME
blk2scsa \- SCSA block device emulation
.SH DESCRIPTION
.sp
.LP
The
.B blk2scsa
module provides support services for generic block
devices so that they appear to the system as devices on a virtual SCSI bus,
thus allowing them to be serviced by the
.BR sd "(7D) SCSI disk driver. The"
.B blk2scsa
device supports the SCSI-2 command set for Direct Access
Devices. The
.B blk2scsa
device supports multiple LUNs per physical
device and creates a separate child device for each LUN. All child nodes
attach to
.BR sd (7D).
.SH DEVICE SPECIAL FILES
.sp
.LP
Disk block special file names are located in
.BR /dev/dsk .
Raw file names
are located in
.BR /dev/rdsk .
See
.BR sd (7D).
.SH IOCTLS
.sp
.LP
See
.BR dkio (7I)
.SH ERRORS
.sp
.LP
See
.BR sd (7D).
.SH FILES
.sp
.LP
Device special files for the storage device are created in the same way as
those for a SCSI disk. See
.BR sd (7D)
for more information.
.sp
.ne 2
.mk
.na
\fB/dev/dsk/c\fIn\fRt\fIn\fRd\fIn\fRs\fIn\fR
.ad
.sp .6
.RS 4n
Block files for disks.
.RE

.sp
.ne 2
.mk
.na
\fB/dev/rdsk/ct\fIn\fRd\fIn\fRs\fIn\fR
.ad
.sp .6
.RS 4n
Raw files for disks.
.RE

.sp
.ne 2
.mk
.na
.B /kernel/misc/blk2scsa
.ad
.sp .6
.RS 4n
32-bit ELF kernel module (x86).
.RE

.sp
.ne 2
.mk
.na
.B /kernel/misc/amd64/blk2scsa
.ad
.sp .6
.RS 4n
64-bit ELF kernel module (x86).
.RE

.sp
.ne 2
.mk
.na
.B /kernel/misc/sparcv9/blk2scsa
.ad
.sp .6
.RS 4n
64-bit ELF kernel module (SPARC).
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for a description of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
ArchitectureSPARC, x86
_
AvailabilitySUNWckr
.TE

.SH SEE ALSO
.sp
.LP
.BR eject (1),
.BR rmformat (1),
.BR rmmount (1),
.BR cfgadm_scsi (1M),
.BR fdisk (1M),
.BR mount (1M),
.BR umount (1M),
.BR scsi (4),
.BR vfstab (4),
.BR attributes (5),
.BR sd (7D),
.BR dkio (7I),
.BR pcfs (7FS)
.sp
.LP
.I "802.11b Standard for Wireless Local Area Networks (WLANs)
- IEEE
