usr/src/man/man7d/bpp.7d
'\" te
.\" Copyright (c) 1994, Sun Microsystems, Inc.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH bpp 7D "22 Aug 1994" "SunOS 5.11" "Devices"
.SH NAME
bpp \- bi-directional parallel port driver
.SH SYNOPSIS
.LP
.nf
\fBSUNW,bpp@\fIslot\fB,\fIoffset\fB:bpp\fIn\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B bpp
driver provides a general-purpose bi-directional interface to
parallel devices. It supports a variety of output (printer) and input
(scanner) devices, using programmable timing relationships between the
various handshake signals.
.SH APPLICATION PROGRAMMING INTERFACE
.sp
.LP
The
.B bpp
driver is an
.I exclusive-use
device. If the device has
already been opened, subsequent opens fail with 
.B EBUSY.
.SS "Default Operation"
.sp
.LP
Each time the
.B bpp
device is opened, the default configuration is
.B BPP_ACK_BUSY_HS
for read handshake,
.B BPP_ACK_HS
for write
handshake, 1 microsecond for all setup times and strobe widths, and 60
seconds for both timeouts. This configuration (in the write mode) drives
many common personal computer parallel printers with Centronics-type
interfaces. The application should use the
.B BPPIOC_SETPARMS
ioctl
request to configure the
.B bpp
for the particular device which is
attached, if necessary.
.SS "Write Operation"
.sp
.LP
If a failure or error condition occurs during a
.BR write (2),
the number
of bytes successfully written is returned (short write). Note that
.B errno
will not be set. The contents of certain status bits will be
captured at the time of the error, and can be retrieved by the application
program, using the
.B BPPIOC_GETERR
ioctl request. Subsequent
.BR write (2)
calls may fail with the system error
.B ENXIO
if the
error condition is not rectified. The captured status information will be
overwritten each time an attempted transfer or a
.B BPPIOC_TESTIO
ioctl
request occurs.
.SS "Read Operations"
.sp
.LP
If a failure or error condition occurs during a
.BR read (2),
the number
of bytes successfully read is returned (short read). Note that
.B errno
will not be set. The contents of certain status bits will be captured at the
time of the error, and can be retrieved by the application, using the
.B BPPIOC_GETERR
ioctl request. Subsequent
.BR read (2)
calls may fail
with
.B ENXIO
if the error condition is not rectified. The captured
register information will be overwritten each time an attempted transfer or
a
.B BPPIOC_TESTIO
ioctl request.
.sp
.LP
If the
.B read_handshake
element of the 
.B bpp_transfer_parms
structure (see below) is set to
.B BPP_CLEAR_MEM
or
.BR BPP_SET_MEM ,
zeroes or ones, respectively, are written into the user buffer.
.SS "Read/Write Operation"
.sp
.LP
When the driver is opened for reading and writing, it is assumed that
scanning will take place, as scanners are the only devices supported by this
mode. Most scanners require that the
.B SLCT_IN
or
.B AFX
pin be set
to tell the scanner the direction of the transfer. The
.B AFX
line is
set when the
.B read_handshake
element of the
.B bpp_transfer_parms
structure is set to
.BR BPP_HSCAN_HS ,
otherwise the
.B SLCT_IN
pin is
set. Normally, scanning starts by writing a command to the scanner, at which
time the pin is set.  When the scan data is read back, the pin is reset.
.SH IOCTLS
.sp
.LP
The following  ioctl requests are supported:
.sp
.ne 2
.mk
.na
.B BPPIOC_SETPARMS
.ad
.RS 21n
.rt
Set transfer parameters.
.sp
The argument is a pointer to a
.B bpp_transfer_parms
structure. See
below for a description of the elements of this structure. If a parameter is
out of range,
.B EINVAL
is returned.
.RE

.sp
.ne 2
.mk
.na
.B BPPIOC_GETPARMS
.ad
.RS 21n
.rt
Get current transfer parameters.
.sp
The argument is a pointer to a
.B bpp_transfer_parms
structure. See
below for a description of the elements of this structure. If no parameters
have been configured since the device was opened, the contents of the
structure will be the default conditions of the parameters (see \fBDefault Operation\fR above).
.RE

.sp
.ne 2
.mk
.na
.B BPPIOC_SETOUTPINS
.ad
.RS 21n
.rt
Set output pin values.
.sp
The argument is a pointer to a
.B bpp_pins
structure. See below for a
description of the elements of this structure. If a parameter is out of
range,
.B EINVAL
is returned.
.RE

.sp
.ne 2
.mk
.na
.B BPPIOC_GETOUTPINS
.ad
.RS 21n
.rt
.RB "Read output pin values. The argument is a pointer to a " " bpp_pins"
structure. See below for a description of the elements of this structure.
.RE

.sp
.ne 2
.mk
.na
.B BPPIOC_GETERR
.ad
.RS 21n
.rt
Get last error status.
.sp
The argument is a pointer to a
.B bpp_error_status
structure. See below
for a description of the elements of this structure. This structure
indicates the status of all the appropriate  status bits at the time of the
most recent error condition during a
.BR read (2)
or
.BR write (2)
call,
or the status of the bits at the most recent
.B BPPIOC_TESTIO
ioctl
request. Note:  The bits in the
.B pin_status
element indicate whether
the associated pin is active, not the actual polarity. The application can
check transfer readiness without attempting another transfer using the
.B BPPIOC_TESTIO
ioctl.  Note:  The
.B timeout_occurred
and
.B bus_error
fields will never be set by the
.B BPPIOC_TESTIO
ioctl,
only by an actual failed transfer.
.RE

.sp
.ne 2
.mk
.na
.B BPPIOC_TESTIO
.ad
.RS 21n
.rt
Test transfer readiness.
.sp
This command checks to see if a read or write transfer would succeed based
on pin status, opened mode, and handshake selected. If a handshake would
succeed,
.B 0
is returned. If a transfer would fail,
.B -1
is
returned, and
.B errno
is set to
.B EIO,
and the error status
information is captured. The captured status can be retrieved using the
.B BPPIOC_GETERR
ioctl call.  Note that the
.B timeout_occurred
and
.B bus_error
fields will never be set by this ioctl.
.RE

.SS "Transfer Parameters Structure"
.sp
.LP
This structure is defined in 
.RB < sys/bpp_io.h >.
.sp
.in +2
.nf
struct bpp_transfer_parms {
    enum  handshake_t
         read_handshake;      /* parallel port read handshake mode */
    int  read_setup_time;    /* DSS register - in nanoseconds */
    int  read_strobe_width;  /* DSW register - in nanoseconds */
    int  read_timeout;       /*
                              * wait this many seconds
                              * before aborting a transfer
                             */
    enum	handshake_t
         write_handshake;      /* parallel port write handshake mode */
    int  write_setup_time;    /* DSS register - in nanoseconds */
    int  write_strobe_width;  /* DSW register - in nanoseconds */
    int  write_timeout;       /*
                               * wait this many seconds
                               * before aborting a transfer
                              */
};
/* Values for read_handshake and write_handshake fields */
    enum	handshake_t {
        BPP_NO_HS,            /* no handshake pins */
        BPP_ACK_HS,           /* handshake controlled by ACK line */
        BPP_BUSY_HS,          /* handshake controlled by BSY line */
        BPP_ACK_BUSY_HS,      /*
                               * handshake controlled by ACK and BSY lines
                               * read_handshake only!
                              */
        BPP_XSCAN_HS,         /* xerox scanner mode,
                               * read_handshake only!
	                             */
        BPP_HSCAN_HS,         /*
                               * HP scanjet scanner mode
                               * read_handshake only!
                              */
        BPP_CLEAR_MEM,        /* write 0's to memory,
                               * read_handshake only!
                              */
        BPP_SET_MEM,          /* write 1's to memory,
                               * read_handshake only!
                              */
	/* The following handshakes are RESERVED. Do not use. */
        BPP_VPRINT_HS,        /* valid only in read/write mode */
        BPP_VPLOT_HS          /* valid only in read/write mode */
};
.fi
.in -2

.sp
.LP
The
.B read_setup_time
field controls the time between dstrb falling
edge to bsy rising edge if the
.B read_handshake
field is set to
.B BPP_NO_HS
or
.BR BPP_ACK_HS .
It controls the time between dstrb
falling edge to ack rising edge if the
.B read_handshake
field is set to
.B BPP_ACK_HS
or
.BR BPP_ACK_BUSY_HS .
It controls the time between ack
falling edge to dstrb rising edge if the
.B read_handshake
field is set
to
.BR BPP_XSCAN_HS .
.sp
.LP
The
.B read_strobe_width
field controls the time between ack rising
edge and ack falling edge if the
.B read_handshake
field is set to
.B BPP_NO_HS
or
.BR BPP_ACK_BUSY_HS .
It controls the time between dstrb
rising edge to dstrb falling edge if the
.B read_handshake
field is set
to
.BR BPP_XSCAN_HS .
.sp
.LP
The values allowed for the
.B write_handshake
field are duplicates of
the definitions for the
.B read_handshake
field. Note that some of these
handshake definitions are only valid in one mode or the other.
.sp
.LP
The
.B write_setup_time
field controls the time between data valid to
dstrb rising edge for all values of the
.B write_handshake
field.
.sp
.LP
The
.B write_strobe_width
field controls the time between dstrb rising
edge and dstrb falling edge if the
.B write_handshake
field is not set to
.B BPP_VPRINT_HS
or
.BR BPP_VPLOT_HS .
It controls the minimum time
between dstrb rising edge to dstrb falling edge if the
.BR write_handshake
field is set to
.B BPP_VPRINT_HS
or
.BR BPP_VPLOT_HS .
.SS "Transfer Pins Structure"
.sp
.LP
This structure is defined in
.RB < sys/bpp_io.h >.
.sp
.in +2
.nf
struct  bpp_pins {
    uchar_t  output_reg_pins;  /* pins in P_OR register */
    uchar_t  input_reg_pins;   /* pins in P_IR register */
};

/* Values for output_reg_pins field */
#define BPP_SLCTIN_PIN  0x01  /* Select in pin */
#define BPP_AFX_PIN     0x02  /* Auto feed pin */
#define BPP_INIT_PIN    0x04  /* Initialize pin */
#define BPP_V1_PIN      0x08  /* reserved pin 1 */
#define BPP_V2_PI       0x10  /* reserved pin 2 */
#define BPP_V3_PIN      0x20  /* reserved pin 3 */
#define BPP_ERR_PIN     0x01  /* Error pin */
#define BPP_SLCT_PIN    0x02  /* Select pin */
#define BPP_PE_PIN      0x04  /* Paper empty pin */
.fi
.in -2

.SS "Error Pins Structure"
.sp
.LP
This structure is defined in the include file
.RB < sys/bpp_io.h >.
.sp
.in +2
.nf
struct bpp_error_status {
	char	timeout_occurred;	/* 1 if a timeout occurred */
	char	bus_error;	/* 1 if an SBus bus error */
	uchar_t pin_status;	/*
			 * status of pins which could
			 * cause an error
			 */
};
/* Values for pin_status field */
#define BPP_ERR_ERR    0x01	/* Error pin active */
#define BPP_SLCT_ERR   0x02	/* Select pin active */
#define BPP_PE_ERR     0x04	/* Paper empty pin active */
#define BPP_SLCTIN_ERR 0x10	/* Select in pin active	*/
#define BPP_BUSY_ERR   0x40	/* Busy pin active */
.fi
.in -2

.SH ERRORS
.sp
.ne 2
.mk
.na
.B EBADF
.ad
.RS 10n
.rt
The device is opened for write-only access and a read is attempted, or the
device is opened for read-only access and a write is attempted.
.RE

.sp
.ne 2
.mk
.na
.B EBUSY
.ad
.RS 10n
.rt
The device has been opened and another open is attempted. An attempt has
been made to unload the driver while one of the units is open.
.RE

.sp
.ne 2
.mk
.na
.B EINVAL
.ad
.RS 10n
.rt
A
.B "BPPIOC_SETPARMS ioctl"
is attempted with an out of range value in
the
.B bpp_transfer_parms
structure. A
.B "BPPIOC_SETOUTPINS ioctl"
is
attempted with an invalid value in the pins structure. An
.B ioctl
is
attempted with an invalid value in the command argument. An invalid command
argument is received  during
.BR modload "(1M) or"
.BR modunload (1M).
.RE

.sp
.ne 2
.mk
.na
.B EIO
.ad
.RS 10n
.rt
The driver encountered an SBus bus error when attempting an access.
.sp
A read or write does not complete properly, due to a peripheral error or a
transfer timeout.
.sp
A
.B "BPPIOC_TESTIO ioctl"
call is attempted while a condition exists
which would prevent a transfer (such as a peripheral error).
.RE

.sp
.ne 2
.mk
.na
.B ENXIO
.ad
.RS 10n
.rt
The driver has received an open request for a  unit for which the attach
failed. The driver has received a read or write request for a unit number
greater than the number of units available. The driver has received a write
request for a unit which has an active peripheral error.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
.BI /dev/bpp n
.ad
.RS 13n
.rt
bi-directional parallel port devices
.RE

.SH SEE ALSO
.sp
.LP
.BR ioctl (2),
.BR read (2),
.BR write (2),
.BR sbus (4)
