usr/src/man/man7d/bscv.7d
'\" te
.\" Copyright (c) 2003, Sun Microsystems, Inc.  All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH bscv 7D "22 August 2003" "SunOS 5.11" "Devices"
.SH NAME
bscv, bscbus, i2bsc \- Blade support chip interface driver
.SH DESCRIPTION
.sp
.LP
The
.BR bscv ,
.B bscbus
and
.B i2bsc
drivers interface with the
Blade support chip used on Sun Microsystem's Blade server products. These
drivers provide a conduit for passing control, environmental, cpu signature
and event information between Solaris and the Blade support chip.
.sp
.LP
These drivers do not export public interfaces. Instead they make
information available via picl, prtdiag, prtfru and related tools. In
addition, these drivers log Blade support chip environmental event
information into system logs.
.SH FILES
.sp
.ne 2
.mk
.na
.B /platform/sun4u/kernel/drv/sparcv9/bscbus
.ad
.sp .6
.RS 4n
64-bit ELF kernel driver
.RE

.sp
.ne 2
.mk
.na
.B /platform/sun4u/kernel/drv/sparcv9/bscv
.ad
.sp .6
.RS 4n
64-bit ELF kernel driver
.RE

.sp
.ne 2
.mk
.na
.B /platform/sun4u/kernel/drv/sparcv9/i2bsc
.ad
.sp .6
.RS 4n
64-bit ELF kernel driver
.RE

.sp
.ne 2
.mk
.na
.B /platform/i86pc/kernel/drv/bscbus
.ad
.sp .6
.RS 4n
32-bit ELF kernel file (x86 only)
.RE

.sp
.ne 2
.mk
.na
.B /platform/i86pc/kernel/drv/bscv
.ad
.sp .6
.RS 4n
32-bit ELF kernel file (x86 only)
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
lw(2.75i) |lw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE  TYPEATTRIBUTE VALUE
_
ArchitectureT{
Limited to systems with Blade Support Chip
T}
_
AvailabilitySUNWcar.u,  SUNWcar.i
.TE

