usr/src/man/man7d/cgsix.7d
'\" te
.\" Copyright (c) 1992, Sun Microsystems, Inc.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH cgsix 7D "27 Mar 1992" "SunOS 5.11" "Devices"
.SH NAME
cgsix \- accelerated 8-bit color frame buffer
.SH SYNOPSIS
.LP
.nf
\fB/dev/fbs/cgsix\fIn\fR
.fi

.SH DESCRIPTION
.sp
.LP
.B cgsix
is a low-end graphics accelerator designed to enhance vector
and polygon drawing performance. It has an 8-bit color frame buffer and
provides the standard frame buffer interface as defined in
.BR fbio (7I).
.sp
.LP
In addition,
.B cgsix
supports the following
.BR cgsix -specific
.BR IOCTL ,
defined in
.RB < sys/fbio.h >.
.sp
.ne 2
.mk
.na
.B FBIOGXINFO
.ad
.RS 14n
.rt
Returns
.BR cgsix -specific
information about the hardware.  See the
.RB "definition of " cg6_info " in <" sys/fbio.h >
for more information.
.RE

.sp
.LP
.B cgsix
has registers and memory that may be mapped with
.BR mmap (2),
using the offsets defined in
.RB < sys/cg6reg.h >.
.SH FILES
.sp
.LP
.B /dev/fbs/cgsix0
.SH SEE ALSO
.sp
.LP
.BR mmap (2),
.BR fbio (7I)
