usr/src/man/man7d/chxge.7d
'\" te
.\" Copyright (c) 2005, Sun Microsystems, Inc.  All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH chxge 7D "17 Jan 2005" "SunOS 5.11" "Devices"
.SH NAME
chxge \- Chelsio Ethernet network interface controllers
.SH SYNOPSIS
.LP
.nf
/dev/chxge
.fi

.SH DESCRIPTION
.sp
.LP
The
.B chxge
Ethernet driver is a  multi-threaded, loadable, clonable,
STREAMS hardware driver supporting the connectionless Data Link Provider
Interface,
.BR dlpi (7P),
over Chelsio NIC controllers. Multiple (and
mixed) NIC controllers installed within the  system are supported  by the
driver. The
.B chxge
driver provides basic support for the NIC hardware.
Functions include chip initialization, frame transmit and receive, and error
recovery and reporting.
.SH APPLICATION PROGRAMMING INTERFACE
.sp
.LP
The cloning, character-special device
.B /dev/chxge
is used to access
NIC devices installed within the system.
.SH CHXGE AND DLPI
.sp
.LP
The
.B chxge
driver is dependent on
.BR /kernel/misc/gld ,
a loadable
kernel module  that  provides the
.B chxge
driver with the DLPI and
STREAMS functionality required of a LAN driver. See \fBgld\fR(7D) for more
details on the primitives supported by the driver.
.sp
.LP
The values returned by the driver in the DL_INFO_ACK primitive in response
to the DL_INFO_REQ are:
.RS +4
.TP
.ie t \(bu
.el o
Default Maximum SDU is 1500 (ETHERMTU).
.RE
.RS +4
.TP
.ie t \(bu
.el o
dlsap address length is 8.
.RE
.RS +4
.TP
.ie t \(bu
.el o
MAC type is DL_ETHER.
.RE
.RS +4
.TP
.ie t \(bu
.el o
The sap length value is  -2, meaning  the  physical address component is
followed immediately by a 2-byte sap component within the DLSAP address.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Broadcast address  value is Ethernet/IEEE  broadcast address
(FF:FF:FF:FF:FF:FF).
.RE
.SH FILES
.sp
.ne 2
.mk
.na
.B /dev/chxge
.ad
.RS 29n
.rt
Character special device.
.RE

.sp
.ne 2
.mk
.na
.B /kernel/drv/sparcv9/chxge
.ad
.RS 29n
.rt
SPARC chxge driver binary.
.RE

.sp
.ne 2
.mk
.na
.B /kernel/drv/chxge
.ad
.RS 29n
.rt
x86 platform kernel module. (32-bit).
.RE

.sp
.ne 2
.mk
.na
.B /kernel/drv/amd64/chxge
.ad
.RS 29n
.rt
x86 platform kernel module. (64-bit).
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
ArchitectureSPARC, x86
.TE

.SH SEE ALSO
.sp
.LP
.BR netstat (1M),
.BR attributes (5),
.BR gld (7D),
.BR dlpi (7P),
.BR gld (9F),
.BR gld_mac_info (9S)
