usr/src/man/man7d/cmdk.7d
'\" te
.\" Copyright (c) 2008, Sun Microsystems, Inc.  All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH cmdk 7D "4 Nov 2008" "SunOS 5.11" "Devices"
.SH NAME
cmdk \- common disk driver
.SH SYNOPSIS
.LP
.nf
cmdk@\fItarget\fR, \fIlun\fR : [ \fIpartition\fR \fB|\fR \fIslice\fR ]
.fi

.SH DESCRIPTION
.sp
.LP
The
.B cmdk
device driver is a common interface to various disk devices.
The driver supports magnetic fixed disks and magnetic removable disks.
.sp
.LP
The
.B cmdk
device driver supports three different disk labels: fdisk
partition table, Solaris x86 VTOC and EFI/GPT.
.sp
.LP
The block-files access the disk using the system's normal buffering
mechanism and are read and written without regard to physical disk records.
There is also a "raw" interface that provides for direct transmission
between the disk and the user's read or write buffer. A single read or write
call usually results in one I/O operation; raw I/O is therefore considerably
more efficient when many bytes are transmitted. The names of the block files
are found in
.BR /dev/dsk .
Raw file names are found in
.BR /dev/rdsk .
.sp
.LP
I/O requests to the magnetic disk must have an offset and transfer length
that is a multiple of 512 bytes or the driver returns an
.BR EINVAL
error.
.sp
.LP
Slice 0 is normally used for the root file system on a disk, slice 1 as a
paging area (for example, swap), and slice 2 for backing up the entire fdisk
partition for Solaris software. Other slices may be used for
.B usr
file
systems or system reserved area.
.sp
.LP
The fdisk partition 0 is to access the entire disk and is generally used by
the
.BR fdisk "(1M) program."
.SH FILES
.sp
.ne 2
.mk
.na
\fB/dev/dsk/c\fIn\fBd\fIn\fR[\fBs\fR|\fBp\fR]\fIn\fR
.ad
.RS 26n
.rt
block device (IDE)
.RE

.sp
.ne 2
.mk
.na
\fB/dev/rdsk/c\fIn\fBd\fIn\fR[\fBs\fR|\fBp\fR]\fIn\fR
.ad
.RS 26n
.rt
raw device (IDE)
.sp
where:
.sp
.ne 2
.mk
.na
.BI c n
.ad
.RS 6n
.rt
controller
.IR n .
.RE

.sp
.ne 2
.mk
.na
.BI d n
.ad
.RS 6n
.rt
lun
.IR "n (0-1)" .
.RE

.sp
.ne 2
.mk
.na
.BI s n
.ad
.RS 6n
.rt
UNIX system slice
.IR "n (0-15)."
.RE

.sp
.ne 2
.mk
.na
.BI p n
.ad
.RS 6n
.rt
fdisk partition (0-36).
.RE

.RE

.sp
.ne 2
.mk
.na
.B /kernel/drv/cmdk
.ad
.RS 26n
.rt
32-bit kernel module.
.RE

.sp
.ne 2
.mk
.na
.B /kernel/drv/amd64/cmdk
.ad
.RS 26n
.rt
64-bit kernel module.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Architecturex86
.TE

.SH SEE ALSO
.sp
.LP
.BR fdisk (1M),
.BR mount (1M),
.BR lseek (2),
.BR read (2),
.BR write (2),
.BR readdir (3C),
.BR scsi (4),
.BR vfstab (4),
.BR attributes (5),
.BR dkio (7I)
