usr/src/man/man7d/ctsmc.7d
'\" te
.\" Copyright (c) 2003, Sun Microsystems, Inc.  All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ctsmc 7D "7 Dec 2003" "SunOS 5.11" "Devices"
.SH NAME
ctsmc \- System Management  Controller driver
.SH DESCRIPTION
.sp
.LP
The
.B ctsmc
system management controller driver is a multithreaded,
loadable, clonable STREAMS hardware driver that supports communication with
the system management controller device on SUNW,NetraCT-410,
SUNW,NetraCT-810 and SUNW,Netra-CP2300 platforms.
.sp
.LP
The
.B smc
device provides a Keyboard Controller Style (KCS) interface
as described in the \fIIntelligent  Platform Management Interface (IPMI)
Version 1.5\fR specification. The
.B ctsmc
driver enables user-land and
kernel-land clients to access services provided by
.B smc
hardware.
.SH FILES
.sp
.ne 2
.mk
.na
.B /dev/ctsmc
.ad
.sp .6
.RS 4n
.B ctsmc
special character device
.RE

.sp
.ne 2
.mk
.na
.B /platform/sun4u/kernel/drv/sparcv9/ctsmc
.ad
.sp .6
.RS 4n
64 bit ELF kernel driver
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
ArchitectureSPARC
_
AvailabilitySUNWcar.u
.TE

.SH SEE ALSO
.sp
.LP
.BR attributes (5)
.sp
.LP
.I STREAMS Programmers Guide
.sp
.LP
.I Writing Device Drivers
.sp
.LP
.I "Intelligent Platform Management Interface (IPMI). Version 1.5
-
PICMIG, February, 2001
