usr/src/man/man7d/dnet.7d
'\" te
.\"  All Rights Reserved.  Copyright (c) 2000, Sun Microsystems, Inc.  All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH dnet 7D "20 OCT 2000" "SunOS 5.11" "Devices"
.SH NAME
dnet \- Ethernet driver for DEC 21040, 21041, 21140 Ethernet cards
.SH SYNOPSIS
.LP
.nf
\fB/kernel/drv/dnet\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B dnet
Ethernet driver is a multithreaded, loadable, clonable,
.B STREAMS GLD
driver. Multiple controllers installed within the system
are supported by the driver. The
.B dnet
driver functions include
controller initialization, frame transmit and receive, functional addresses,
promiscuous and multicast support, and error recovery and reporting.
.SH APPLICATION PROGRAMMING INTERFACE
.sp
.LP
The cloning character-special device,
.BR /dev/dnet ,
is used to access
all DEC 21040/21041/21140 devices installed in the system.
.sp
.LP
The
.B dnet
driver is dependent on
.BR /kernel/misc/gld ,
a loadable
kernel module that provides the
.B dnet
driver with the
.B DLPI
and
.B STREAMS
functionality required of a
.B LAN
driver.  See
.BR gld (7D)
for more details on the primitives supported by the driver.
.sp
.LP
The device is initialized on the first attach and de-initialized (stopped)
on the last detach.
.sp
.LP
The values returned by the driver in the
.B DL_INFO_ACK
primitive in
response to a
.B DL_INFO_REQ
from the user are as follows:
.RS +4
.TP
.ie t \(bu
.el o
The maximum
.B SDU
is
.B 1500
(\fBETHERMTU\fR - defined in
<\fBsys/ethernet.h\fR>).
.RE
.RS +4
.TP
.ie t \(bu
.el o
The minimum
.B SDU
is
.BR 0 .
.RE
.RS +4
.TP
.ie t \(bu
.el o
The
.B DLSAP
address length is
.BR 8 .
.RE
.RS +4
.TP
.ie t \(bu
.el o
The
.B MAC
type is
.BR DL_ETHER .
.RE
.RS +4
.TP
.ie t \(bu
.el o
The
.B sap
length value is \fB\(mi2\fR, meaning the physical address
component is followed immediately by a 2-byte
.B sap
component within the
.B DLSAP
address.
.RE
.RS +4
.TP
.ie t \(bu
.el o
The broadcast address value is the Ethernet/IEEE broadcast address
(\fBFF:FF:FF:FF:FF:FF\fR).
.RE
.sp
.LP
Once in the
.B DL_ATTACHED
.RB "state, the user must send a" " DL_BIND_REQ"
to associate a particular Service Access Point (SAP) with the stream.
.SH PRECONFIGURATION
.sp
.LP
The PCI configuration process varies from system to system. Follow the
instructions provided by the vendor.
.SS "Known Problems and Limitations"
.RS +4
.TP
.ie t \(bu
.el o
On multiport cards (exception: Osicom (Rockwell) RNS2340), the first port
is the top port. (On the Osicom RNS2340, the first port is the bottom
port.)
.RE
.RS +4
.TP
.ie t \(bu
.el o
If the
.B dnet
driver fails to determine the correct speed and duplex
mode resulting in a corresponding drop in performance, set the speed and
duplex mode using the
.B dnet.conf
file.
.RE
.RS +4
.TP
.ie t \(bu
.el o
The
.B dnet
driver incorrectly counts carrier lost or no carrier errors
while in full-duplex mode. There is no carrier signal present when in
full-duplex mode and it should not be counted as an error.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Version 4 SROM formats are not supported.
.RE
.SH CONFIGURATION
.sp
.LP
The
.B /kernel/drv/dnet.conf
file supports the following options:
.sp
.ne 2
.mk
.na
.B full-duplex
.ad
.RS 15n
.rt
For full duplex operation use
.BR full-duplex=1 ,
for half duplex use
.BR full-duplex=0 .
Half-duplex operation gives better results on older
10mbit networks.
.RE

.sp
.ne 2
.mk
.na
.B speed
.ad
.RS 15n
.rt
For 10mbit operation use
.BR speed=10 ,
for 100mbit operation use
.BR speed=100 .
Certain 21140 based cards will operate at either speed. Use
the speed property to override the 100mbit default in this case.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B /dev/dnet
.ad
.RS 25n
.rt
character special device
.RE

.sp
.ne 2
.mk
.na
.B /kernel/drv/dnet.conf
.ad
.RS 25n
.rt
.B dnet
configuration file
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Architecturex86
.TE

.SH SEE ALSO
.sp
.LP
.BR attributes (5),
.BR dlpi (7P),
.BR gld (7D)
.BR streamio (7I)
.sp
.LP
.I Writing Device Drivers
.sp
.LP
 \fISTREAMS Programming Guide\fR
