usr/src/man/man7d/dtrace.7d
'\" te
.\" Copyright (c) 2003, Sun Microsystems, Inc.  All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH dtrace 7D "4 Sep 2003" "SunOS 5.11" "Devices"
.SH NAME
dtrace \- DTrace dynamic tracing facility
.SH DESCRIPTION
.sp
.LP
The
.B dtrace
driver provides the dynamic instrumentation and tracing
facilities for the DTrace software, as well as the built-in \fBdtrace\fR
provider. The
.B dtrace
driver is not a public interface and you access
the instrumentation offered by this provider through DTrace tools such as
.BR dtrace (1M).
Refer to the
.I "Solaris Dynamic Tracing Guide"
for a
description of the public documented interfaces available for the DTrace
facility and dtrace provider probes.
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for a description of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWdtrp
_
Interface Stability Private
.TE

.SH SEE ALSO
.sp
.LP
.BR dtrace (1M),
.BR libdtrace (3LIB),
.BR attributes (5)
.sp
.LP
.I Solaris Dynamic Tracing Guide
