usr/src/man/man7d/ehci.7d
'\" te
.\" Copyright (c) 2006 Sun Microsystems, Inc.  All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ehci 7D "13 April 2006" "SunOS 5.11" "Devices"
.SH NAME
ehci \- Enhanced host controller driver
.SH SYNOPSIS
.LP
.nf
\fBusb@unit-address\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B ehci
driver is a USBA (Solaris USB Architecture) compliant nexus
driver that supports the Enhanced Host Controller Interface Specification
2.0, an industry standard developed by Intel.
.sp
.LP
A USB 2.0 host controller includes one high-speed host controller and zero
or more USB 1.1 host controllers. The high-speed host controller implements
an EHCI (Enhanced Host Controller Interface) that is used for all high-speed
communications to high-speed-mode devices.
.sp
.LP
All USB 2.0 devices  connected to the root ports of the USB 2.0  host
controller and all devices connected to a high- speed-mode hub should be
routed to the EHCI host controller.
.sp
.LP
All full- and low-speed devices connected to the root ports of the USB 2.0
host controller should be routed to the companion USB 1.1 host controllers.
(OHCI or UHCI host controller).
.sp
.LP
The
.B ehci
supports bulk, interrupt, control  and  iso chronous
transfers (on
.RI USB1. x
devices behind a USB2.0 hub).
.SH FILES
.sp
.ne 2
.mk
.na
.B /kernel/drv/ehci
.ad
.RS 28n
.rt
32-bit ELF 86 kernel module
.RE

.sp
.ne 2
.mk
.na
.B /kernel/drv/sparcv9/ehci
.ad
.RS 28n
.rt
64-bit SPARC ELF kernel module
.RE

.sp
.ne 2
.mk
.na
.B /kernel/drv/amd64/ehci
.ad
.RS 28n
.rt
64-bit x86 ELF kernel module
.RE

.sp
.ne 2
.mk
.na
.B /kernel/drv/ehci.conf
.ad
.RS 28n
.rt
Driver configuration file
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
ArchitectureSPARC, x86, PCI-based systems
_
AvailabilitySUNWusb
.TE

.SH SEE ALSO
.sp
.LP
.BR add_drv (1M),
.BR prtconf (1M),
.BR rem_drv (1M),
.BR update_drv (1M),
.BR attributes (5),
.BR hubd (7D),
.BR uhci (7D),
.BR ohci (7D),
.BR usba (7D)
.sp
.LP
.I Writing Device Drivers
.sp
.LP
.I Universal Serial Bus Specification 2.0
.sp
.LP
.I "Enhanced Host Controller Interface Specification 1.0
.sp
.LP
.I System Administration Guide: Basic Administration
.sp
.LP
.I http://www.usb.org
.sp
.LP
.I http://www.sun.com/io
.sp
.LP
.I http://www.sun.com/bigadmin/hcl
.sp
.LP
.I http://www.intel.com/technology/usb/ehcispec.htm
.SH DIAGNOSTICS
.sp
.LP
In addition to being logged, the following messages may appear on the
system console. All messages are formatted in the following manner:
.sp
.in +2
.nf
WARNING: <device path> (ehci<instance number>): Message...
.fi
.in -2
.sp

.sp
.ne 2
.mk
.na
.B Unrecoverable USB hardware error.
.ad
.sp .6
.RS 4n
There was an unrecoverable USB hardware error reported by the
.BR ehci
controller. Reboot the system. If this problem persists, contact your system
vendor.
.RE

.sp
.ne 2
.mk
.na
.B No SOF interrupts.
.ad
.br
.na
\fR
.ad
.sp .6
.RS 4n
No SOF interrupts have been received. This USB EHCI controller is
unusable.
.RE

.sp
.ne 2
.mk
.na
\fBError recovery failure: Please hotplug the 2.0 hub at <device
path>.\fR
.ad
.sp .6
.RS 4n
The driver failed to clear 2.0 hub's TT buffer. Remove and reinsert the
external USB2.0 hub.
.RE

.sp
.ne 2
.mk
.na
.B Revision<xx> is not supported.
.ad
.sp .6
.RS 4n
High speed USB devices prior to revision 0.95 are not supported.
.RE

.sp
.LP
The following messages may be entered into the system log. They are
formatted in the following manner:
.sp
.in +2
.nf
<device path> (ehci<instance number>): Message...
.fi
.in -2
.sp

.sp
.ne 2
.mk
.na
.B "Unable to take control from BIOS. Failure is ignored.
.ad
.sp .6
.RS 4n
The driver was unable to take control of the EHCI hardware from the
system's BIOS. This failure is ignored. To abort the attach on this
take-over failure, comment out a property in ehci.conf. (x86 only).
.RE

.sp
.ne 2
.mk
.na
.B "Unable to take control from BIOS.
.ad
.sp .6
.RS 4n
The driver is unable to take control of the EHCI hardware          from the
system's BIOS and aborts the attach. High speed (USB 2.0) support is
disabled. In this case, all USB devices run at full/low speed. Contact your
system vendor or your system administror for possible changes in BIOS
settings. You can disable a property in
.B ehci.conf
to ignore this
failure. (x86 only.)
.RE

.sp
.ne 2
.mk
.na
.B "Low speed device is not supported.
.ad
.br
.na
.B "Full speed device is not supported.
.ad
.sp .6
.RS 4n
The driver detected a low or full speed device on its root hub port. Per
USB 2.0 specification, the device should be routed to a companion host
controller (OHCI or UHCI). However, no attached companion host controller
appears to be available. Therefore, low and full speed devices are not
supported.
.RE

.sp
.ne 2
.mk
.na
\fBLow speed endpoint's poll interval of <n> ms is below threshold.
Rounding up to 8 ms.\fR
.ad
.sp .6
.RS 4n
Low speed endpoints are limited to polling intervals between 8 ms and 255
ms. If a device reports a polling interval that is less than 8 ms, the
driver uses 8 ms instead.
.RE

.sp
.ne 2
.mk
.na
.B "Low speed endpoint's poll interval is greater than 255 ms.
.ad
.sp .6
.RS 4n
The low speed device's polling interval is out of range. The host
controller does not allocate bandwidth for this device. This device is not
usable.
.RE

.sp
.ne 2
.mk
.na
.B "Full speed endpoint's poll interval must be between 1 and 255 ms.
.ad
.sp .6
.RS 4n
The full speed device's polling interval is out of range. The host
controller does not allocate bandwidth for this device. This device is not
usable.
.RE

.sp
.ne 2
.mk
.na
.B "High speed endpoint's poll interval must be between 1 and 16 units.
.ad
.sp .6
.RS 4n
The high speed device's polling interval is out of range. The host
controller will not allocate bandwidth for this device. This device will not
be usable. Refer to the USB specification, revision 2.0 for the unit
definition.
.RE

.sp
.ne 2
.mk
.na
.B ehci_modify_qh_status_bit: Failed to halt qh=<address>.
.ad
.sp .6
.RS 4n
Error recovery failed. Please disconnect and reinsert all devices or
reboot.
.RE

.LP
Note -
.sp
.RS 2
Due to recently discovered incompatibilities with this USB controller,
USB2.\fIx\fR transfer support has been disabled. However, this device
continues to function as a USB1.\fIx\fR controller. Information on enabling
USB2.x support is provided in this man page. Please refer to
.I www.sun.com/io
for Solaris Ready products and to
.I www.sun.com/bigadmin/hcl
for additional compatible USB products.
.LP
.RB "VIA chips may not be compatible with this driver. To bind" " ehci"
specifically to the chip and eliminate the warnings, and to enable USB2.x
suppport, a new, more specific driver alias  (refer to
.BR add_drv (1M)
and
.BR update_drv (1M))
must be specified for
.BR ehci .
By default, the
.B ehci
alias is 'pciclass,0c0320.' The compatible names in the
.BR prtconf (1M)
output provides additional aliases. For example:
.RE
.sp
.in +2
.nf
   # prtconf -vp | grep pciclass,0c0320
        compatible: 'pci1106,3104.1106.3104.2063' +
\&'pci1106,3104.1106.3104' + 'pci1106,3104' +
 pci1106,3104.2063' + 'pci1106,3104' + 'pciclass,0c0320' +
\&'pciclass,0c03'
         ....


       A more specific alias is 'pci1106,3104.' Perform the follow-
       ing step to add this alias, then reboot the system:


       # update_drv -a -i '"pci1106,3104"' ehci

       # reboot
.fi
.in -2

.sp
.LP
After you apply the above workaround, the following message is displayed in
your system log:
.sp
.LP
Applying VIA workarounds.
