usr/src/man/man7d/esp.7d
'\" te
.\" Copyright (c) 1995, Sun Microsystems, Inc.  All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH esp 7D "7 Feb 1997" "SunOS 5.11" "Devices"
.SH NAME
esp \- ESP SCSI Host Bus Adapter Driver
.SH SYNOPSIS
.LP
.nf
\fBesp@\fIsbus-slot\fR,80000\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B esp
Host Bus Adapter driver is a
.B SCSA
compliant nexus
driver that supports the Emulex family of esp
.B SCSI
chips (esp100,
esp100A, esp236, fas101, fas236).
.sp
.LP
The
.B esp
driver supports the standard functions provided by the
\fBSCSA\fR interface. The driver supports tagged and untagged queuing, fast
\fBSCSI\fR (on FAS esp's only), almost unlimited transfer size (using a
moving
.B DVMA
window approach),  and auto request sense; but it does not
support linked commands.
.SH CONFIGURATION
.sp
.LP
The
.B esp
driver can be configured by defining properties in
\fBesp.conf\fR which override the global \fBSCSI\fR settings. Supported
properties are: \fBscsi-options\fR, \fBtarget<\fIn\fR>-scsi-options\fR,
.BR scsi-reset-delay ,
.BR scsi-watchdog-tick ,
.BR scsi-tag-age-limit ,
.BR scsi-initiator-id .
.sp
.LP
\fBtarget<\fIn\fR>-scsi-options\fR overrides the  \fBscsi-options\fR
property value for \fBtarget<\fIn\fR>\fR. <\fIn\fR> can vary from \fB0\fR to
.BR 7 .
.sp
.LP
Refer to \fBscsi_hba_attach\fR(9F) for details.
.SH EXAMPLES
.LP
\fBExample 1\fR A sample of esp configuration file.
.sp
.LP
Create a file \fB/kernel/drv/esp.conf\fR and add this line:

.sp
.in +2
.nf
scsi-options=0x78;
.fi
.in -2

.sp
.LP
This will disable tagged queuing, fast
.B SCSI,
and Wide mode for all
\fBesp\fR instances. To disable an option for one specific  \fBesp\fR (refer
to
.BR driver.conf (4)):

.sp
.in +2
.nf
name="esp"
parent="/iommu@f,e0000000/sbus@f,e0001000/espdma@f,400000"
       reg=0xf,0x800000,0x40
       target1-scsi-options=0x58
       scsi-options=0x178 scsi-initiator-id=6;
.fi
.in -2

.sp
.LP
Note that the default initiator ID in OBP is 7 and that the change to ID 6
will occur at attach time. It may be preferable to change the initiator ID
in OBP.

.sp
.LP
The above would set
.B scsi-options
for target 1 to
.B 0x58
and for
all other targets on this
.B SCSI
bus to
.BR 0x178 .
The physical
pathname of the parent can be determined using the
.B /devices
tree or
following the link of the logical device name:

.sp
.in +2
.nf
example# \fBls -l /dev/rdsk/c0t3d0s0\fR
lrwxrwxrwx   1 root   root   88 Aug 22 13:29 /dev/rdsk/c0t3d0s0 ->
\&../../devices/iommu@f,e0000000/sbus@f,e0001000/espdma@f,400000/
              esp@f,800000/sd@3,0:a,raw
.fi
.in -2
.sp

.sp
.LP
The register property values can be determined from \fBprtconf\fR(1M)
output (\fB-v\fR option):

.sp
.in +2
.nf
	esp, instance #0
	....
       	    Register Specifications:
                Bus Type=0xf, Address=0x800000, Size=40
.fi
.in -2
.sp

.sp
.LP
To set scsi-options more specifically per target:

.sp
.in +2
.nf
target1-scsi-options=0x78;
device-type-scsi-options-list =
        "SEAGATE ST32550W", "seagate-scsi-options" ;
seagate-scsi-options = 0x58;
scsi-options=0x3f8;
.fi
.in -2

.sp
.LP
The above would set
.B scsi-options
for target 1 to
.B 0x78
and for
all other targets on this
.B SCSI
bus to
.B 0x378
except for one
specific disk type which will have
.B scsi-options
set to 0x58.

.sp
.LP
\fBscsi-options\fR specified per target ID has the highest precedence,
followed by
.B scsi-options
per device type. To get the inquiry string
run probe-scsi or probe-scsi-all command at the ok prompt before booting the
system.

.sp
.LP
Global, for example. for all esp instances,
.B scsi-options
per bus has
the lowest precedence.

.sp
.LP
The system needs to be rebooted before the specified
.BR scsi-options
take effect.

.SH FILES
.sp
.ne 2
.mk
.na
.B /kernel/drv/esp
.ad
.RS 24n
.rt
\fBELF\fR Kernel Module
.RE

.sp
.ne 2
.mk
.na
\fB/kernel/drv/esp.conf\fR
.ad
.RS 24n
.rt
Configuration file
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
ArchitectureSBus-based systems with esp-based
_
SCSI port and SSHA, SBE/S, FSBE/S,
_
T{
and DSBE/S SBus  SCSI Host Adapter options
T}
.TE

.SH SEE ALSO
.sp
.LP
.BR prtconf (1M),
.BR driver.conf (4),
.BR attributes (5),
\fBfas\fR(7D), \fBscsi_abort\fR(9F), \fBscsi_hba_attach\fR(9F),
\fBscsi_ifgetcap\fR(9F), \fBscsi_reset\fR(9F), \fBscsi_sync_pkt\fR(9F),
.BR scsi_transport (9F),
.BR scsi_device (9S),
.BR scsi_extended_sense (9S),
.BR scsi_inquiry (9S),
.BR scsi_pkt (9S)
.sp
.LP
.I Writing Device Drivers
.sp
.LP
\fIOpenBoot Command Reference\fR
.sp
.LP
\fIANSI Small Computer System Interface-2 (SCSI-2)\fR
.sp
.LP
.IR "ESP Technical Manuals" ,
QLogic Corp.
.SH DIAGNOSTICS
.sp
.LP
The messages described below are some that may appear on the system
console, as well as being logged.
.sp
.LP
The first four messages may be displayed while the
.B esp
driver is
trying to attach; these messages mean that the
.B esp
driver was unable
to attach. All of these messages are preceded by "esp%d", where "%d" is the
instance number of the
.B esp
controller.
.sp
.ne 2
.mk
.na
.B Device in slave-only slot
.ad
.sp .6
.RS 4n
The SBus device has been placed in a slave-only slot and will not be
accessible; move to non-slave-only SBus slot.
.RE

.sp
.ne 2
.mk
.na
.B "Device is using a hilevel intr
.ad
.sp .6
.RS 4n
The device was configured with an interrupt level that cannot be used with
this
.B esp
driver. Check the SBus device.
.RE

.sp
.ne 2
.mk
.na
.B Unable to map registers
.ad
.sp .6
.RS 4n
Driver was unable to map device registers; check for bad hardware. Driver
did not attach to device;
.B SCSI
devices will be inaccessible.
.RE

.sp
.ne 2
.mk
.na
\fBCannot find\fR \fBdma controller\fR
.ad
.sp .6
.RS 4n
Driver was unable to locate a dma controller. This is an auto-configuration
error.
.RE

.sp
.ne 2
.mk
.na
.B "Disabled TQ since disconnects are disabled
.ad
.sp .6
.RS 4n
Tagged queuing was disabled because disconnects were disabled in
.BR scsi-options .
.RE

.sp
.ne 2
.mk
.na
\fBBad clock frequency- setting 20mhz, asynchronous mode\fR
.ad
.sp .6
.RS 4n
Check for bad hardware.
.RE

.sp
.ne 2
.mk
.na
\fBSync pkt failed\fR
.ad
.sp .6
.RS 4n
Syncing a
.B SCSI
packet failed. Refer to \fBscsi_sync_pkt\fR(9F).
.RE

.sp
.ne 2
.mk
.na
.B "Slot %x: All tags in use!!!
.ad
.sp .6
.RS 4n
The driver could not allocate another tag number. The target devices do not
properly support tagged queuing.
.RE

.sp
.ne 2
.mk
.na
\fBTarget %d.%d cannot alloc tag queue\en\fR
.ad
.sp .6
.RS 4n
The driver could not allocate space for tag queue.
.RE

.sp
.ne 2
.mk
.na
.B "Gross error" in esp status (%x)
.ad
.sp .6
.RS 4n
The driver experienced severe
.B SCSI
bus problems. Check cables and
terminator.
.RE

.sp
.ne 2
.mk
.na
.B Spurious interrupt
.ad
.sp .6
.RS 4n
The driver received an interrupt while the hardware was not interrupting.
.RE

.sp
.ne 2
.mk
.na
.B Lost state in phasemanage
.ad
.sp .6
.RS 4n
The driver is confused about the state of the
.B SCSI
bus.
.RE

.sp
.ne 2
.mk
.na
.B "Unrecoverable DMA" error during selection
.ad
.sp .6
.RS 4n
The DMA controller experienced host SBus problems. Check for bad
hardware.
.RE

.sp
.ne 2
.mk
.na
.B "Bad sequence step (0x%x) in selection
.ad
.sp .6
.RS 4n
The esp hardware reported a bad sequence step. Check for bad hardware.
.RE

.sp
.ne 2
.mk
.na
\fBUndetermined selection failure\fR
.ad
.sp .6
.RS 4n
The selection of a target failed unexpectedly. Check for bad hardware.
.RE

.sp
.ne 2
.mk
.na
.B ">2 reselection IDs" on the bus
.ad
.sp .6
.RS 4n
Two targets selected simultaneously, which is illegal. Check for bad
hardware.
.RE

.sp
.ne 2
.mk
.na
\fBReconnect: unexpected bus free\fR
.ad
.sp .6
.RS 4n
A reconnect by a target failed. Check for bad hardware.
.RE

.sp
.ne 2
.mk
.na
.B "Timeout on" receiving tag msg
.ad
.sp .6
.RS 4n
Suspect target f/w failure in tagged queue handling.
.RE

.sp
.ne 2
.mk
.na
.B "Parity error" in tag msg
.ad
.sp .6
.RS 4n
A parity error was detected in a tag message. Suspect
.B SCSI
bus
problems.
.RE

.sp
.ne 2
.mk
.na
.B Botched tag
.ad
.sp .6
.RS 4n
The target supplied bad tag messages. Suspect target f/w failure in tagged
queue handling.
.RE

.sp
.ne 2
.mk
.na
.B "Parity error" in reconnect msg's
.ad
.sp .6
.RS 4n
The reconnect failed because of parity errors.
.RE

.sp
.ne 2
.mk
.na
\fBTarget <n> didn't disconnect after sending <message>\fR
.ad
.sp .6
.RS 4n
The target unexpectedly did not disconnect after sending <message>.
.RE

.sp
.ne 2
.mk
.na
\fBNo support\fR \fBfor multiple segs\fR
.ad
.sp .6
.RS 4n
The
.B esp
driver can only transfer contiguous data.
.RE

.sp
.ne 2
.mk
.na
.B No dma window?
.ad
.sp .6
.RS 4n
Moving the
.B DVMA
window failed unexpectedly.
.RE

.sp
.ne 2
.mk
.na
.B "No dma window" on <type> operation
.ad
.sp .6
.RS 4n
Moving the
.B DVMA
window failed unexpectedly.
.RE

.sp
.ne 2
.mk
.na
.B "Cannot set" new dma window
.ad
.sp .6
.RS 4n
Moving the
.B DVMA
window failed unexpectedly.
.RE

.sp
.ne 2
.mk
.na
\fBUnable to set new window at <address> for <type> operation\fR
.ad
.sp .6
.RS 4n
Moving the
.B DVMA
window failed unexpectedly.
.RE

.sp
.ne 2
.mk
.na
.B Illegal dma boundary? %x
.ad
.sp .6
.RS 4n
An attempt was made to cross a boundary that the driver could not handle.
.RE

.sp
.ne 2
.mk
.na
\fBUnwanted data out/in\fR \fBfor Target <n>\fR
.ad
.sp .6
.RS 4n
The target went into an unexpected phase.
.RE

.sp
.ne 2
.mk
.na
\fBSpurious <name> phase from target <n>\fR
.ad
.sp .6
.RS 4n
The target went into an unexpected phase.
.RE

.sp
.ne 2
.mk
.na
.B "SCSI bus DATA IN phase parity error
.ad
.sp .6
.RS 4n
The driver detected parity errors on the
.B SCSI
bus.
.RE

.sp
.ne 2
.mk
.na
.B "SCSI bus MESSAGE IN phase parity error
.ad
.sp .6
.RS 4n
The driver detected parity errors on the
.B SCSI
bus.
.RE

.sp
.ne 2
.mk
.na
.B "SCSI bus STATUS phase parity" error
.ad
.sp .6
.RS 4n
The driver detected parity errors on the
.B SCSI
bus.
.RE

.sp
.ne 2
.mk
.na
\fBPremature end of extended message\fR
.ad
.sp .6
.RS 4n
An extended
.B SCSI
bus message did not complete. Suspect a target f/w
problem.
.RE

.sp
.ne 2
.mk
.na
\fBPremature end of input message\fR
.ad
.sp .6
.RS 4n
A multibyte input message was truncated. Suspect a target f/w problem.
.RE

.sp
.ne 2
.mk
.na
.B Input message botch
.ad
.sp .6
.RS 4n
The driver is confused about messages coming from the target.
.RE

.sp
.ne 2
.mk
.na
.B "Extended message <n> is too long
.ad
.sp .6
.RS 4n
The extended message sent by the target is longer than expected.
.RE

.sp
.ne 2
.mk
.na
\fB<name> message <n> from Target <m> garbled\fR
.ad
.sp .6
.RS 4n
Target <m> sent message <name> of value <n> which the driver did not
understand.
.RE

.sp
.ne 2
.mk
.na
.B "Target <n> rejects our message <name>
.ad
.sp .6
.RS 4n
Target <n> rejected a message sent by the driver.
.RE

.sp
.ne 2
.mk
.na
\fBRejecting message <name> from Target <n>\fR
.ad
.sp .6
.RS 4n
The driver rejected a message received from target <n>
.RE

.sp
.ne 2
.mk
.na
.B "Cmd dma" error
.ad
.sp .6
.RS 4n
The driver was unable to send out command bytes.
.RE

.sp
.ne 2
.mk
.na
\fBTarget <n> refused message resend\fR
.ad
.sp .6
.RS 4n
The target did not accept a message resend.
.RE

.sp
.ne 2
.mk
.na
.B Two-byte message <name> <value> rejected
.ad
.sp .6
.RS 4n
The driver does not accept this two-byte message.
.RE

.sp
.ne 2
.mk
.na
.B Unexpected selection attempt
.ad
.sp .6
.RS 4n
An attempt was made to select this host adapter by another initiator.
.RE

.sp
.ne 2
.mk
.na
\fBPolled cmd failed (target busy)\fR
.ad
.sp .6
.RS 4n
A polled command failed because the target did not complete outstanding
commands within a reasonable time.
.RE

.sp
.ne 2
.mk
.na
\fBPolled cmd failed\fR
.ad
.sp .6
.RS 4n
A polled command failed because of timeouts or bus errors.
.RE

.sp
.ne 2
.mk
.na
\fBDisconnected\fR command \fBtimeout\fR for \fBTarget
<id>.<lun>\fR
.ad
.sp .6
.RS 4n
A timeout occurred while target/lun was disconnected. This is usually a
target f/w problem. For tagged queuing targets, <n> commands were
outstanding when the timeout was detected.
.RE

.sp
.ne 2
.mk
.na
\fBDisconnected tagged cmds (<n>) timeout for Target <id>.<lun>\fR
.ad
.sp .6
.RS 4n
A timeout occurred while target/lun was disconnected. This is usually a
target f/w problem. For tagged queuing targets, <n> commands were
outstanding when the timeout was detected.
.RE

.sp
.ne 2
.mk
.na
\fBConnected command timeout for Target <id>.<lun>\fR
.ad
.sp .6
.RS 4n
This is usually a
.B SCSI
bus problem. Check cables and termination.
.RE

.sp
.ne 2
.mk
.na
.B "Target <id>.<lun> reverting to async. mode
.ad
.sp .6
.RS 4n
A data transfer hang was detected. The driver attempts to eliminate this
problem by reducing the data transfer rate.
.RE

.sp
.ne 2
.mk
.na
\fBTarget <id>.<lun> reducing sync. transfer rate\fR
.ad
.sp .6
.RS 4n
A data transfer hang was detected. The driver attempts to eliminate this
problem by reducing the data transfer rate.
.RE

.sp
.ne 2
.mk
.na
.B "Reverting to slow SCSI cable mode
.ad
.sp .6
.RS 4n
A data transfer hang was detected. The driver attempts to eliminate this
problem by reducing the data transfer rate.
.RE

.sp
.ne 2
.mk
.na
\fBReset SCSI bus failed\fR
.ad
.sp .6
.RS 4n
An attempt to reset the
.B SCSI
bus failed.
.RE

.sp
.ne 2
.mk
.na
.B External SCSI bus reset
.ad
.sp .6
.RS 4n
Another initiator reset the
.B SCSI
bus.
.RE

.SH WARNINGS
.sp
.LP
The
.B esp
hardware does not support Wide
.B SCSI
mode. Only
FAS-type esp's support fast
.B SCSI
(10 MB/sec).
.SH NOTES
.sp
.LP
The
.B esp
driver exports properties indicating per target the
negotiated transfer speed (\fBtarget<n>-sync-speed\fR) and whether tagged
queuing has been enabled
.RB ( target<n>-TQ ).
The
.B sync-speed
property
value is the data transfer rate in KB/sec. The
.B target-TQ
property has
no value. The existence of the property indicates that tagged queuing has
been enabled. Refer to \fBprtconf\fR(1M) (verbose option) for viewing the
\fBesp\fR properties.
.sp
.in +2
.nf
         dma, instance #3
             Register Specifications:
                 Bus Type=0x2, Address=0x81000, Size=10
             esp, instance #3
                  Driver software properties:
                      name <target3-TQ> length <0> \(mi <no
value>.
                      name <target3-sync-speed> length <4>
                          value <0x00002710>.
                      name <scsi-options> length <4>
                          value <0x000003f8>.
                      name <scsi-watchdog-tick> length <4>
                          value <0x0000000a>.
                      name <scsi-tag-age-limit> length <4>
                          value <0x00000008>.
                      name <scsi-reset-delay> length <4>
                          value <0x00000bb8>.
.fi
.in -2

