usr/src/man/man7d/fbt.7d
'\" te
.\" Copyright (c) 2003, Sun Microsystems, Inc.  All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH fbt 7D "4 Sep 2003" "SunOS 5.11" "Devices"
.SH NAME
fbt \- DTrace function boundary tracing provider
.SH DESCRIPTION
.sp
.LP
The
.B fbt
driver is a DTrace dynamic tracing provider that performs
dynamic instrumentation at function boundaries in the Solaris kernel.
.sp
.LP
The function is the fundamental unit of program text. In a well-designed
system, the function performs a discrete and well-defined operation on a
specified object or series of like objects. Most functions are implemented
by themselves calling functions on encapsulated objects, but some functions
\(emso-called "leaf functions" \(em are implemented without making further
function calls. The Function Boundary Tracing
.B fbt
provider contains a
mechanism for instrumenting the vast majority of functions in the kernel and
offering the instrumentation as a set of DTrace probes.
.sp
.LP
The
.B fbt
driver is not a public interface and you access the
instrumentation offered by this provider through DTrace. Refer to the
.I Solaris Dynamic Tracing Guide
for a description of the public
documented interfaces available for the DTrace facility and the probes
offered by the
.B fbt
provider.
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for a description of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWdtrp
_
Interface StabilityPrivate
.TE

.SH SEE ALSO
.sp
.LP
.BR dtrace (1M),
.BR attributes (5),
.BR dtrace (7D)
.sp
.LP
.I Solaris Dynamic Tracing Guide
