usr/src/man/man7d/fcoet.7d
'\" te
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.\" Copyright (c) 2009, Sun Microsystems, Inc. All Rights Reserved
.TH fcoet 7D "18 Mar 2009" "SunOS 5.11" "Devices"
.SH NAME
fcoet \- fibre channel over Ethernet target mode driver
.SH DESCRIPTION
.sp
.LP
The \fBfcoet\fR driver is a pseudo device driver which encapsulates the raw
Fibre Channel frames into FCoE Ethernet frames, or decapsulates FC frames
from FCoE Ethernet frames. The supported FC frames contain extended/basic
link services, common transport frames and target mode FCP frames.
.sp
.LP
The \fBfcoet\fR driver interfaces with COMSTAR FC transport
driver,\fBfct\fR, and FCoE transport driver, \fBfcoe\fR(7D).
.SH FILES
.sp
.ne 2
.mk
.na
\fB/kernel/drv/fcoet\fR
.ad
.RS 29n
.rt
32-bit ELF kernel module (x86)
.RE

.sp
.ne 2
.mk
.na
\fB/kernel/drv/amd64/fcoet\fR
.ad
.RS 29n
.rt
64-bit ELF kernel module (x86)
.RE

.sp
.ne 2
.mk
.na
\fB/kernel/drv/sparcv9/fcoet\fR
.ad
.RS 29n
.rt
64-bit ELF kernel module (SPARC)
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for a description of the following attributes:
.sp

.sp
.TS
tab() box;
lw(2.75i) |lw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
ArchitectureSPARC, x86
_
AvailabilitySUNWfcoet
.TE

.SH SEE ALSO
.sp
.LP
\fBdriver.conf\fR(4), \fBattributes\fR(5), \fBfcoe\fR(7D)
.sp
.LP
\fIWriting Device Drivers\fR
.sp
.LP
\fIANSI X3.269-1996, Fibre Channel Protocol for SCSI (FCP)\fR
