usr/src/man/man7d/fcoei.7d
'\" te
.\" Copyright (c) 2009, Sun Microsystems, Inc. All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH fcoei 7D "11 Sep 2009" "SunOS 5.11" "Devices"
.SH NAME
fcoei \- Fibre Channel Over Ethernet Initiator Mode Driver
.SH SYNOPSIS
.sp
.in +2
.nf
fcoei@port,0
.fi
.in -2

.SH DESCRIPTION
.sp
.LP
The \fBfcoei\fR driver is a pseudo device driver which encapsulates the raw
Fibre Channel frames into FCoE ethernet frames, or decapsulates FC frames
from FCoE ethernet frames. The supported FC frames include extended/basic
link services, common transport frames and initiator mode FCP frames.
.sp
.LP
The \fBfcoei\fR driver interfaces with the Sun Fibre Channel port driver,
\fBfp\fR(7D), and the FCoE transport driver, \fBfcoe\fR(7D).
.SH FILES
.sp
.ne 2
.mk
.na
\fB/kernel/drv/fcoei\fR
.ad
.RS 27n
.rt
32-bit ELF kernel module (x86)
.RE

.sp
.ne 2
.mk
.na
\fB/kernel/drv/amd64/fcoei\fR
.ad
.RS 27n
.rt
64-bit ELF kernel module (x86)
.RE

.sp
.ne 2
.mk
.na
\fBkernel/drv/sparcv/fcoei\fR
.ad
.RS 27n
.rt
64-bit ELF kernel module (SPARC)
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for a description of the following attribute:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
ArchitectureSPARC, x86
_
AvailabilitySUNWfcoei
.TE

.SH SEE ALSO
.sp
.LP
.BR driver.conf (4),
.BR attributes (5),
\fBfcoe\fR(7D), \fBfcoet\fR(7D),
.BR fp (7D)
.sp
.LP
.I Writing Device Drivers
.sp
.LP
\fIANSI X3.269-1996, Fibre Channel Protocol for SCSI (FCP)\fR
