usr/src/man/man7d/fctl.7d
'\" te
.\" Copyright (c) 2004 Sun Microsystems, Inc.  All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH fctl 7D "20 Oct 2004" "SunOS 5.11" "Devices"
.SH NAME
fctl \- Sun Fibre Channel transport library
.SH DESCRIPTION
.sp
.LP
The
.B fctl
kernel module interfaces the Sun Fibre Channel upper layer
protocol (ULP) mapping modules with Sun Fibre Channel adapter (FCA) drivers.
There are no user-configurable options for this module.
.SH FILES
.sp
.ne 2
.mk
.na
.B /kernel/misc/fctl
.ad
.RS 29n
.rt
 32-bit ELF kernel module (x86)
.RE

.sp
.ne 2
.mk
.na
.B /kernel/misc/amd64/fctl
.ad
.RS 29n
.rt
64-bit ELF kernel module (x86)
.RE

.sp
.ne 2
.mk
.na
.B /kernel/misc/sparcv9/fctl
.ad
.RS 29n
.rt
64-bit ELF kernel module (SPARC)
.RE

.SH ATTRIBUTES
.sp
.LP
See attributes(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
ArchitectureSPARC
_
Interface stabilityUnknown
_
AvailabilitySUNWfctl
.TE

.SH SEE ALSO
.sp
.LP
.BR fp (7d)
