usr/src/man/man7d/gpio_87317.7d
'\" te
.\" Copyright (2000 Sun Microsystems, Inc.  All
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" Rights Reserved.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH gpio_87317 7D "12 April 2000" "SunOS 5.11" "Devices"
.SH NAME
gpio_87317 \- General purpose I/O driver for SuperIO
.SH DESCRIPTION
.sp
.LP
The
.B gpio_87317
driver is the general purpose I/O driver for the
National Semiconductor SuperIO (PC87317) chipset. It supports remote system
controller (RSC) administration via an interface to the SuperIO's general
purpose I/O bits.
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
ArchitectureLimited to SPARC systems with  SuperIO
_
Availability SUNWcar
_
Interface Stability Unstable
.TE

.SH SEE ALSO
.sp
.LP
.I PC87317VUL/PC97317VUL SuperI/O Data Sheet
\(em National Semiconductor

