usr/src/man/man7d/hci1394.7d
'\" te
.\" Copyright (c) 2005 Sun Microsystems, Inc.  All Rights Reserved.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH hci1394 7D "30 August 2005" "SunOS 5.11" "Devices"
.SH NAME
hci1394 \- 1394 OpenHCI host controller driver
.SH SYNOPSIS
.LP
.nf
\fBfirewire@unit-address\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B hci1394
host controller driver is an IEEE 1394 compliant nexus
driver that supports the \fI1394 Open Host Controller Interface
Specification 1.0\fR, an industry standard developed by Sun, Apple, Compaq,
Intel, Microsoft, National Semconductor, and Texas Instruments. The
\fBhci1394\fR driver supports asynchronous transfers, isochronous transfers,
and bus reset management. The
.B hci1394
driver also supports the nexus
device control interface.
.SH FILES
.sp
.ne 2
.mk
.na
.B /kernel/drv/sparcv9/hci1394
.ad
.sp .6
.RS 4n
64-bit SPARC ELF kernel module
.RE

.sp
.ne 2
.mk
.na
.B /kernel/drv/hci1394
.ad
.sp .6
.RS 4n
32-bit x86 ELF kernel module
.RE

.sp
.ne 2
.mk
.na
.B /kernel/drv/amd64/hci1394
.ad
.sp .6
.RS 4n
64-bit x86 ELF kernel module
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for a description of the following attributes:
.sp

.sp
.TS
tab() box;
lw(2.75i) |lw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
ArchitectureSPARC, x86, PCI-based systems
_
AvailabilitySUNW1394x
_
Interface StabilityUnstable
.TE

.SH SEE ALSO
.sp
.LP
.BR attributes (5),
.BR ieee1394 (7D)
.sp
.LP
\fIIEEE 1394 - IEEE Standard for a High Performance Serial Bus\fR
.sp
.LP
\fI1394 Open Host Controller Interface Specification 1.0\fR
