usr/src/man/man7d/hci1394.7d
'\" te
.\" Copyright (c) 2005 Sun Microsystems, Inc.  All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH hci1394 7D "30 August 2005" "SunOS 5.11" "Devices"
.SH NAME
hci1394 \- 1394 OpenHCI host controller driver
.SH SYNOPSIS
.LP
.nf
\fBfirewire@unit-address\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B hci1394
host controller driver is an IEEE 1394 compliant nexus
driver that supports the \fI1394 Open Host Controller Interface
Specification 1.0\fR, an industry standard developed by Sun, Apple, Compaq,
Intel, Microsoft, National Semconductor, and Texas Instruments. The
.B hci1394
driver supports asynchronous transfers, isochronous transfers,
and bus reset management. The
.B hci1394
driver also supports the nexus
device control interface.
.SH FILES
.sp
.ne 2
.mk
.na
.B /kernel/drv/sparcv9/hci1394
.ad
.sp .6
.RS 4n
64-bit SPARC ELF kernel module
.RE

.sp
.ne 2
.mk
.na
.B /kernel/drv/hci1394
.ad
.sp .6
.RS 4n
32-bit x86 ELF kernel module
.RE

.sp
.ne 2
.mk
.na
.B /kernel/drv/amd64/hci1394
.ad
.sp .6
.RS 4n
64-bit x86 ELF kernel module
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for a description of the following attributes:
.sp

.sp
.TS
tab() box;
lw(2.75i) |lw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
ArchitectureSPARC, x86, PCI-based systems
_
AvailabilitySUNW1394x
_
Interface StabilityUnstable
.TE

.SH SEE ALSO
.sp
.LP
.BR attributes (5),
.BR ieee1394 (7D)
.sp
.LP
.I "IEEE 1394 - IEEE Standard for a High Performance Serial Bus
.sp
.LP
.I "1394 Open Host Controller Interface Specification 1.0
