usr/src/man/man7d/heci.7d
'\" te
.\" Copyright (c) 2009, Sun Microsystems, Inc. All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH heci 7D "24 Feb 2009" "SunOS 5.11" "Devices"
.SH NAME
heci \- Intel(R) AMT Manageability Interface Driver
.SH DESCRIPTION
.sp
.LP
The Intel AMT Manageability Interface driver allows applications to access
the Intel Active Management Technology (Intel AMT) FW by way of the host
interface (as opposed to a network interface).
.sp
.LP
The Intel AMT Manageability Interface driver is meant to be used by the
Local Manageability Service. When the Intel AMT machine is in Legacy Mode,
the Intel AMT Manageability Interface driver functions. Messages from the
Intel AMT Manageability Interface driver are sent to the system's log, that
is, \fB/var/log/messages\fR.
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for a description of the following attributes:
.sp

.sp
.TS
tab() box;
lw(2.75i) |lw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Architecturex86
_
AvailabilitySUNWamt-lms
_
Interface StabilityVolatile
.TE

.SH SEE ALSO
.sp
.LP
\fBlms\fR(1M), \fBattributes\fR(5), \fBe1000g\fR(7D), \fBiwk\fR(7D)
