usr/src/man/man7d/heci.7d
'\" te
.\" Copyright (c) 2009, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH heci 7D "24 Feb 2009" "SunOS 5.11" "Devices"
.SH NAME
heci \- Intel(R) AMT Manageability Interface Driver
.SH DESCRIPTION
.sp
.LP
The Intel AMT Manageability Interface driver allows applications to access
the Intel Active Management Technology (Intel AMT) FW by way of the host
interface (as opposed to a network interface).
.sp
.LP
The Intel AMT Manageability Interface driver is meant to be used by the
Local Manageability Service. When the Intel AMT machine is in Legacy Mode,
the Intel AMT Manageability Interface driver functions. Messages from the
Intel AMT Manageability Interface driver are sent to the system's log, that
is,
.BR /var/log/messages .
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for a description of the following attributes:
.sp

.sp
.TS
tab() box;
lw(2.75i) |lw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Architecturex86
_
AvailabilitySUNWamt-lms
_
Interface StabilityVolatile
.TE

.SH SEE ALSO
.sp
.LP
.BR lms (1M),
.BR attributes (5),
.BR e1000g (7D),
.BR iwk (7D)
