usr/src/man/man7d/hermon.7d
'\" te
.\" Copyright (c) 2008, Sun Microsystems, Inc.  All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH hermon 7D "31 Jul 2008" "SunOS 5.11" "Devices"
.SH NAME
hermon \- ConnectX MT25408/MT25418/MT25428 InfiniBand (IB) Driver
.SH DESCRIPTION
.sp
.LP
The
.B hermon
driver is an IB Architecture-compliant implementation of an
HCA, which operates on the Mellanox MT25408,  MT25418 and MT25428 InfiniBand
ASSPs using host memory for context storage  rather than  locally  attached
memory on the card. Cards based  on these ASSP's utilize the PCI-Express I/O
bus. These  ASSP's  support  the  link and physical layers of the InfiniBand
specification while  the ASSP and the driver support the transport layer.
.sp
.LP
The
.B hermon
driver interfaces with  the InfiniBand  Transport Framework
(IBTF) and provides an implementation of the Channel Interfaces that are
defined by that framework.  It  also enables  management applications and
agents to access the IB fabric.
.SH FILES
.sp
.ne 2
.mk
.na
.B /kernel/drv/hermon
.ad
.sp .6
.RS 4n
32-bit
.B ELF
kernel module. (x86)
.RE

.sp
.ne 2
.mk
.na
.B /kernel/drv/amd64/hermon
.ad
.sp .6
.RS 4n
64-bit
.B ELF
kernel module. (x86)
.RE

.sp
.ne 2
.mk
.na
.B /kernel/drv/sparcv9/hermon
.ad
.sp .6
.RS 4n
64-bit ELF Kernel Module. (SPARC)
.RE

.sp
.ne 2
.mk
.na
\fB/kernel/drv/hermon.conf\fR
.ad
.sp .6
.RS 4n
Driver configuration file.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attribute:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
ArchitecturePCIe-based systems
_
AvailabilitySUNWhermon
.TE

.SH SEE ALSO
.sp
.LP
.BR driver.conf (4),
.BR printers.conf (4),
.BR attributes (5)
.sp
.LP
.I Writing Device Drivers
.SH DIAGNOSTICS
.sp
.LP
In addition to being  logged, the following  messages may appear on the system
console:
.sp
.ne 2
.mk
.na
\fBhermon\fBi\fR: driver attached for maintenance mode only.\fR
.ad
.sp .6
.RS 4n
There was a failure in the boot  process of  the  hermon ASSP  and  the only
function that can be performed is to re-flash  firmware on the ASSP. (Note that
\fBi\fR represents  the instance of the hermon device number.)
.RE

.sp
.ne 2
.mk
.na
\fBhermon\fBi:\fR driver failed to attach\fR
.ad
.sp .6
.RS 4n
The ASSP could not boot into either  operational  (HCA) mode or into
maintenance mode. The device is inoperable. (Note that
.B " i"
represents the
instance of the hermon device number.)
.RE

.sp
.ne 2
.mk
.na
.B "Unexpected port number in port state change event.
.ad
.sp .6
.RS 4n
A port state change event occurred, but the port  number in  the message does
not exist on this HCA. This message also indicates the port number that was in
the port state changed.
.RE

.sp
.ne 2
.mk
.na
\fBHermon driver successfully detached.\fR
.ad
.sp .6
.RS 4n
The driver has been removed from the system and the HCA is no longer available
for transfer operations.
.RE

.sp
.ne 2
.mk
.na
\fBhermon\fBi:\fR port \fBm\fR up.\fR
.ad
.sp .6
.RS 4n
A port up asynchronous event has occurred. (Note that
.B " i"
represents the
instance of the Hermon device number while "m" represents the port number on
the Hermon device.
.RE

.sp
.ne 2
.mk
.na
\fBhermon\fBi:\fR port \fBm\fR down.\fR
.ad
.sp .6
.RS 4n
A port up asynchronous event has occurred. Similar to port up event.
.RE

.sp
.ne 2
.mk
.na
\fBhermon: <command name> command failed.\fR
.ad
.sp .6
.RS 4n
A internal firmware command failed to execute.
.RE

