usr/src/man/man7d/hid.7d
'\" te
.\" Copyright (c) 2009, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH hid 7D "21 Aug 2009" "SunOS 5.11" "Devices"
.SH NAME
hid \- Human interface device (HID) class driver
.SH SYNOPSIS
.LP
.nf
\fBkeyboard@unit-address\fR
\fBmouse@unit-address\fR
\fBinput@unit-address:consumer_control\fR
\fB#include <sys/hid.h>\fR
\fBint ioctl(int fildes, int command, .\|.\|. /*arg*/);\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B hid
driver is a USBA (Solaris USB Architecture) compliant client
driver that supports the \fIHuman Interface Device Class (HID) 1.0\fR
specification. The Human Interface Device (HID) class encompasses devices
controlled by humans to operate computer systems. Typical examples of HID
devices include keyboards, mice, trackballs, and joysticks. HID also covers
front-panel controls such as knobs, switches, and buttons. A USB device with
multiple interfaces may have one interface for audio and a HID interface to
define the buttons that control the audio.
.sp
.LP
The
.B hid
driver is general and primarily handles the USB functionality
of the device and generic HID functionality. For example, HID interfaces are
required to have an interrupt pipe for the device to send data packets, and
the
.B hid
driver opens the pipe to the interrupt endpoint and starts
polling. The
.B hid
driver is also responsible for managing the device
through the default control pipe. In addition to being a USB client driver,
the
.B hid
driver is also a STREAMS driver so that modules may be pushed
on top of it.
.sp
.LP
The HID specification is flexible, and HID devices dynamically describe
their packets and other parameters through a HID report descriptor. The HID
parser is a misc module that parses the HID report descriptor and creates a
database of information about the device. The
.B hid
driver queries the
HID parser to find out the type and characteristics of the HID device. The
HID specification predefines packet formats for the boot protocol keyboard
and mouse.
.SH IOCTLS
.sp
.ne 2
.mk
.na
.B HIDIOCKMGDIRECT
.ad
.RS 19n
.rt
This ioctl should only be addressed to a USB keyboard or mouse device. The
.B hid
driver maintains two streams for each USB keyboard/mouse instance:
an internal one for the use of the kernel and an external one for the use of
user applications. This ioctl returns the information of which stream gets
the input for the moment.
.sp
.I arg
must point to a variable of
.B int
type. Upon return,
.B 0
means the internal stream gets the input,
.B 1
means the external stream
gets the input.
.RE

.sp
.ne 2
.mk
.na
.B HIDIOCKMSDIRECT
.ad
.RS 19n
.rt
This ioctl should only be addressed to a USB keyboard or mouse device. The
hid driver maintains two streams for each USB keyboard/mouse instance: an
internal one for the use of the kernel and an external one for the use of
user applications. This ioctl sets which stream should get the input for the
moment.
.sp
.I arg
must point to a variable of
.B int
type. The argument
.B 0
means the internal stream gets the input,
.B 1
means the external stream
gets the input.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B /kernel/drv/hid
.ad
.sp .6
.RS 4n
32-bit x86 ELF kernel hid module
.RE

.sp
.ne 2
.mk
.na
.B /kernel/drv/amd64/hid
.ad
.sp .6
.RS 4n
64-bit x86 ELF kernel hid module
.RE

.sp
.ne 2
.mk
.na
.B /kernel/drv/sparcv9/hid
.ad
.sp .6
.RS 4n
64-bit SPARC ELF kernel hid module
.RE

.sp
.ne 2
.mk
.na
.B /kernel/misc/hidparser
.ad
.sp .6
.RS 4n
32-bit x86 ELF kernel hidparser module
.RE

.sp
.ne 2
.mk
.na
.B /kernel/misc/amd64/hidparser
.ad
.sp .6
.RS 4n
64-bit x86 ELF kernel hidparser module
.RE

.sp
.ne 2
.mk
.na
.B /kernel/misc/sparcv9/hidparser
.ad
.sp .6
.RS 4n
64-bit SPARC ELF kernel hidparser module
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
ArchitectureSPARC, x86, PCI-based systems
_
Availability SUNWusb
.TE

.SH SEE ALSO
.sp
.LP
.BR cfgadm_usb (1M),
.BR attributes (5),
.BR usba (7D),
.BR virtualkm (7D)
.sp
.LP
.I Writing Device Drivers
.sp
.LP
.I STREAMS Programming Guide
.sp
.LP
.I "Universal Serial Bus Specification 1.0 and 1.1
.sp
.LP
.I "Device Class Definition for Human Interface Devices (HID) 1.1
.sp
.LP
.I System Administration Guide: Basic Administration
.sp
.LP
.I http://www.sun.com
.SH DIAGNOSTICS
.sp
.ne 2
.mk
.na
.B hid_attach: Unsupported HID device.
.ad
.sp .6
.RS 4n
The device requires a protocol not supported by the hid driver.
.RE

.sp
.ne 2
.mk
.na
.B Parsing of hid descriptor failed.
.ad
.sp .6
.RS 4n
The HID report descriptor cannot be parsed correctly. The device cannot be
supported by the hid driver.
.RE

.sp
.ne 2
.mk
.na
.B Invalid report descriptor.
.ad
.sp .6
.RS 4n
The HID report descriptor is invalid. The device cannot be supported by the
hid driver.
.RE

.sp
.LP
The following messages may be logged into the system log. They are
formatted in the following manner:
.sp
.in +2
.nf
<device path><hid<instance number>): message.\|.\|.
.fi
.in -2
.sp

.sp
.ne 2
.mk
.na
.B hid_attach: Unsupported HID device.
.ad
.sp .6
.RS 4n
The device cannot be supported by this version of the HID driver.
.RE

.sp
.ne 2
.mk
.na
.B Parsing of HID descriptor failed.
.ad
.sp .6
.RS 4n
The device cannot be supported by this version of the HID driver.
.RE

.sp
.ne 2
.mk
.na
.B Invalid report descriptor.
.ad
.sp .6
.RS 4n
The device cannot be supported by this version of the HID driver.
.RE

.SH NOTES
.sp
.LP
The hid driver currently supports only keyboard, mouse and audio HID
control devices.
.sp
.LP
Normally a mouse is not power managed and consquently, screen darkening can
be undone with a mouse movement. If power management of the mouse is
required, add the following line to
.B hid.conf
then reboot the system:
.sp
.in +2
.nf
hid-mouse-pm-enable;
.fi
.in -2

.sp
.LP
Modern mice that are power managed require a 'click' to wake up.
Occasionally, this may cause unexpected results.
