usr/src/man/man7d/hubd.7d
'\" te
.\" Copyright (c) 2006, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH hubd 7D "6 July 2006" "SunOS 5.11" "Devices"
.SH NAME
hubd \- USB hub driver
.SH SYNOPSIS
.LP
.nf
\fBhub@unit-address\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B hubd
is a USBA (Solaris USB Architecture) compliant client driver
that supports USB hubs conforming to the
.IR "Universal Serial Bus Specification 2.0" .
The
.B hubd
driver supports bus-powered and
self-powered hubs. The driver supports hubs with individual port power,
ganged power and no power switching.
.sp
.LP
When a device is attached to a hub port, the
.B hubd
driver enumerates
the device by determining its type and assigning an address to it. For
multi-configuration devices,
.B hubd
sets the preferred configuration
(refer to
.BR cfgadm_usb (1M)
to select a configuration). The
.B
hubd
driver attaches a driver to the device if one is available for the default
or selected configuration. When the device is disconnected from the hub
port, the
.B hubd
driver offlines any driver instance attached to the
device.
.SH FILES
.sp
.ne 2
.mk
.na
.B /kernel/drv/hubd
.ad
.RS 28n
.rt
32- bit x86 ELF kernel module
.RE

.sp
.ne 2
.mk
.na
.B /kernel/drv/amd64/hubd
.ad
.RS 28n
.rt
64- bit x86 ELF kernel module
.RE

.sp
.ne 2
.mk
.na
.B /kernel/drv/sparcv9/hubd
.ad
.RS 28n
.rt
64-bit SPARC ELF kernel module
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for a description of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
ArchitectureSPARC, x86, PCI-based systems
_
Availability SUNWusb
.TE

.SH SEE ALSO
.sp
.LP
.BR cfgadm_usb (1M),
.BR attributes (5),
.BR usba (7D)
.sp
.LP
.I Writing Device Drivers
.sp
.LP
.I Universal Serial Bus Specification 2.0
.sp
.LP
.I System Administration Guide: Basic Administration
.sp
.LP
http://\fIwww.sun.com/io\fR
.SH DIAGNOSTICS
.sp
.LP
In addition to being logged, the following messages may also appear on the
system console. Messages are formatted in the following manner:
.sp
.in +2
.nf
WARNING: <device path> <hubd<instance number>): Message...
.fi
.in -2
.sp

.sp
.LP
where
.B "<instance number>"
is the instance number of
.B hubd
and
.B <device path>
is the physical path to the device in
.BR /devices
directory. Messages from the root hub are displayed with a \fBusb<instance number>\fR prefix instead of
.B "hub<instance number>"
as the root hub is
an integrated part of the host controller.
.sp
.ne 2
.mk
.na
.BI "Connecting device on port " <number>
failed.\fR
.ad
.sp .6
.RS 4n
The driver failed to enumerate the device connected on port
.IR <number>
of hub. If enumeration fails, disconnect and re-connect.
.RE

.sp
.ne 2
.mk
.na
\fBUse of a USB 1.0 hub behind a high speed port may cause unexpected
failures.\fR
.ad
.sp .6
.RS 4n
Devices connected to a USB 1.0 hub which are in turn connected to an
external USB 2.0 hub, may misbehave unexpectedly or suddenly go offline.
This is due to a documented incompatibility between USB 1.0 hubs and USB 2.0
hub Transaction Translators. Please use only USB 2.0 or USB 1.1 hubs behind
high-speed ports.
.RE

.sp
.ne 2
.mk
.na
\fBConnecting a high speed device to a non-high speed hub (port x) will
result in a loss of performance. Please connect the device to a high speed
port to get the maximum performance.\fR
.ad
.sp .6
.RS 4n
USB 2.0 devices connected to USB 1.0 or 1.1 hubs cannot run at their
highest speed, even when the hub is in turn connected to a high-speed port.
For best performance, reconnect without going through a USB 1.0 or 1.1
hub.
.RE

.sp
.ne 2
.mk
.na
.B Cannot access <device>. Please reconnect.
.ad
.sp .6
.RS 4n
This hub has been disconnected because a device other than the original one
has been inserted. The driver informs you of this fact by displaying the
name of the original device.
.RE

.sp
.ne 2
.mk
.na
.B Port <n> overcurrent.
.ad
.sp .6
.RS 4n
An overcurrent condition was detected. Please remove the device on this
port.
.RE

.sp
.ne 2
.mk
.na
\fBDevices not identical to the previous one on this port. Please
disconnect and reconnect.\fR
.ad
.sp .6
.RS 4n
Same condition as described above; however in this case, the driver is
unable to identify the original device with a name string.
.RE

.sp
.ne 2
.mk
.na
.BI "Hub driver supports max of " <n>
ports on hub. Hence, using the
first \fI<number of physical ports>\fR of
.I <n>
ports available.\fR
.ad
.sp .6
.RS 4n
The current hub driver supports hubs that have
.I <n>
ports or less. A
hub with more than
.I <n>
ports has been plugged in. Only the first
.I <n>
out of the total
.I "<number of physical ports>"
ports are
usable.
.RE

.sp
.ne 2
.mk
.na
\fBHub global over current condition, please disconnect the devices
connected to the hub to clear the condition. You may need to re-connect the
hub if the ports do not work.\fR
.ad
.sp .6
.RS 4n
An overcurrent condition was detected on the hub. This 	means that the
aggregate current being drawn by the devices on the downstream ports exceeds
a preset value. Refer to section 7.2.1.2 and 11.13 of the \fIUniversal Serial Bus Specification 2.0\fR. If this message continues to display, you
may need to remove downstream devices to eliminate the problem. If any port
does not work after the overcurrent condition is cleared, re-connect the hub
to re-enable the ports.
.RE

.sp
.ne 2
.mk
.na
\fBRoot hub over current condition, please check your system to clear the
condition as soon as possible. You may need to reboot the system if the root
hub does not recover automatically.\fR
.ad
.sp .6
.RS 4n
An overcurrent condition was detected on the root hub, indicating that
malfunctioning devices on the downstream ports are drawing too much current.
Please disconnect the problematic downstream devices to eliminate the
problem. If the root hub doesn't work after the overcurrent condition is
cleared, you may need to reboot the system.
.RE

.sp
.LP
The following messages may be logged into the system log. They are
formatted in the following manner:
.sp
.in +2
.nf
<device path><hubd<instance number>): message...
.fi
.in -2
.sp

.sp
.ne 2
.mk
.na
.B "Local power has been lost, please disconnect hub.
.ad
.sp .6
.RS 4n
A USB self-powered hub has lost external power. All USB devices connected
down-stream from this hub will cease to function. Disconnect the hub, plug
in the external power-supply and then plug in the hub again.
.RE

.sp
.ne 2
.mk
.na
\fBLocal power has been lost, the hub could draw <x> mA power from the USB
bus.\fR
.ad
.sp .6
.RS 4n
A USB self/bus-powered hub has lost external power. Some USB devices
connected down-stream from this hub may cease          to function.
Disconnect the external power-supply and then plug in the hub again.
.RE

.sp
.ne 2
.mk
.na
.B "Two bus-powered hubs cannot be concatenated.
.ad
.sp .6
.RS 4n
A bus-powered hub was connected to a bus powered hub port. Please remove
this bus-powered hub and connect it to a self-powered hub or a root hub
port.
.RE

.sp
.ne 2
.mk
.na
\fBConfiguration <n> for device <device> at port <m> exceeds power
available for this port. Please re-insert your device into another hub port
which has enough power.\fR
.ad
.sp .6
.RS 4n
The device requires more power than is available on this port.
.RE

.sp
.ne 2
.mk
.na
\fBPort <\fIn\fR> in over current condition, please check the attached
device to clear the condition. The system will try to recover the port, but
if not successful, you need to re-connect the hub or reboot the system to
bring the port back to work.\fR
.ad
.sp .6
.RS 4n
An overcurrent condition was detected on port
.RI < n >.
This means the
device connected to the port is drawing more current than the hub can
supply. If this message continues to display, please disconnect the device
to eliminate the problem. If the port doesn't work after the overcurrent
condition is cleared, please re-connect the hub or reboot the system to
enable the port again.
.RE

