usr/src/man/man7d/hwahc.7d
'\" te
.\" Copyright (c) 2009, Sun Microsystems, Inc. All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH hwahc 7D "17 Apr 2009" "SunOS 5.11" "Devices"
.SH NAME
hwahc \- Host Wire Adapter Host Controller Driver
.SH DESCRIPTION
.sp
.LP
The
.B hwahc
driver is a USBA (Solaris USB Architecture) compliant nexus
driver that supports the Wireless USB 1.0 Host Wire Adapter Host Controller,
an industry standard developed by USB-IF.
.sp
.LP
A Host Wire Adapter (HWA) is a USB device whose upstream connection is a
USB 2.0 wired interface. The HWA operates as a host to a cluster of
downstream Wireless USB devices.
.sp
.LP
The
.B hwahc
driver supports bulk, interrupt and control transfers.
.SH FILES
.sp
.ne 2
.mk
.na
.B /kernel/drv/hwahc
.ad
.RS 29n
.rt
32-bit ELF 86 kernel module
.RE

.sp
.ne 2
.mk
.na
.B /kernel/drv/sparcv9/hwahc
.ad
.RS 29n
.rt
64-bit SPARC ELF kernel module
.RE

.sp
.ne 2
.mk
.na
.B /kernel/drv/amd64/hwahc
.ad
.RS 29n
.rt
64-bit x86 ELF kernel module
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for a description of the following attributes:
.sp

.sp
.TS
tab() box;
lw(2.75i) |lw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
ArchitectureSPARC, x86
_
AvailabilitySUNWusb
.TE

.SH SEE ALSO
.sp
.LP
.BR add_drv (1M),
.BR prtconf (1M),
.BR rem_drv (1M),
.BR update_drv (1M),
.BR attributes (5),
.BR ehci (7D),
.BR hubd (7D),
.BR usba (7D)
.sp
.LP
.I Writing Device Drivers
.sp
.LP
.I System Administration Guide: Basic Administration
.sp
.LP
\fIUniversal Serial Bus Specification 2.0\fR
.sp
.LP
\fIWireless Universal Serial Bus Specification 1.0\fR
.sp
.LP
http://www.usb.org
.sp
.LP
http://www.sun.com
.SH DIAGNOSTICS
.sp
.LP
All host controller errors are passed to the client drivers. In addition to
being logged, the following messages can appear on the system console. All
messages are formatted in the following way:
.sp
.in +2
.nf
WARNING: \fIdevice_path hwahc instance_number\fR: Message ...

Connection device on WUSB port \fIport_number\fR fails
.fi
.in -2
.sp

.sp
.LP
The connecting device fails to connect to the HWA. Make sure the device has
been associated with the host.
