usr/src/man/man7d/hxge.7d
'\" te
.\" Copyright (c) 2008, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH hxge 7D "10 Feb 2007" "SunOS 5.11" "Devices"
.SH NAME
hxge \- Sun Blade 10 Gigabit Ethernet network driver
.SH SYNOPSIS
.LP
.nf
/dev/hxge*
.fi

.SH DESCRIPTION
.sp
.LP
The
.B hxge
Gigabit Ethernet driver is a multi-threaded, loadable,
clonable, GLD-based STREAMS driver supporting the Data Link Provider
Interface,
.BR dlpi (7P),
on the Sun Blade Shared 10Gb Ethernet
Interface.
.sp
.LP
The Shared PCI-Express 10 Gb networking interface provides network I/O
consolidation for up to six Constellation blades, with each blade seeing its
own portion of the network interface.
.sp
.LP
The
.B hxge
driver functions include chip initialization, frame transmit
and receive, flow classification, multicast and promiscuous support and
error recovery and reporting in the blade domain.
.SH APPLICATION PROGRAMMING INTERFACE
.sp
.LP
The cloning character-special device,
.BR /dev/hxge ,
is used  to access
Sun Blade Shared 10Gb Ethernet Interface devices installed within the
system.
.sp
.LP
The
.B hxge
driver is managed by the
.BR dladm "(1M) command line"
utility, which allows VLANs to be defined on top of
.B hxge
instances
and for
.B hxge
instances to be aggregated. See
.BR dladm (1M)
for more
details.
.sp
.LP
You must send an explicit DL_ATTACH_REQ message to associate the opened
stream with a particular device (PPA). The PPA ID is interpreted as an
unsigned integer data type and indicates the corresponding device instance
(unit) number. The driver returns an error (DL_ERROR_ACK) if the PPA field
value does not correspond to a valid device instance number for the system.
The device is initialized  on  first  attach and de-initialized (stopped) at
last detach
.sp
.LP
The values returned by the driver in the DL_INFO_ACK primitive in response
to a DL_INFO_REQ are:
.RS +4
.TP
.ie t \(bu
.el o
Maximum SDU is 1500 (ETHERMTU - defined in
.RB < sys/ethernet.h >).
.RE
.RS +4
.TP
.ie t \(bu
.el o
Minimum SDU is 0.
.RE
.RS +4
.TP
.ie t \(bu
.el o
DLSAP address length is 8.
.RE
.RS +4
.TP
.ie t \(bu
.el o
MAC type is
.BR DL_ETHER .
.RE
.RS +4
.TP
.ie t \(bu
.el o
.B SAP
length value is
.IR -2 ,
meaning the physical address component
is followed immediately by a 2-byte
.B SAP
component within the
.B DLSAP
address.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Broadcast address value is the Ethernet/IEEE broadcast address
(FF:FF:FF:FF:FF:FF).
.sp
Due to the nature of the link address definition for IPoIB, the
DL_SET_PHYS_ADDR_REQ DLPI primitive is not supported.
.sp
In the transmit case for streams that have been put in raw mode via the
DLIOCRAW ioctl, the
.B dlpi
application must prepend the 20 byte IPoIB
destination address to the data it wants to transmit over-the-wire. In the
receive case, applications receive the IP/ARP datagram along with the IETF
defined 4 byte header.
.RE
.sp
.LP
Once in the DL_ATTACHED state, you must send a DL_BIND_REQ to associate a
particular Service Access Point (SAP) with the stream.
.SH CONFIGURATION
.sp
.LP
The link speed and mode are fixed at 10 Gbps full-duplex.
.sp
.LP
The default MTU is 1500. To enable jumbo frame support, you configure the
.B hxge
driver by defining the accept-jumbo property to 1 in the
.B hxge.conf
file. Note that the largest jumbo size is 9178 bytes.
.sp
.LP
The driver may be configured to discard certain classes of traffic. By
default, no class of traffic is allowed. You configure the
.B hxge
driver
by defining the class option property to 0x20000 in
.B hxge.conf
to
discard the specified class of traffic. For example, the following line in
.B hxge.conf
discards all IP Version 4 TCP traffic:
.sp
.in +2
.nf
class-opt-ipv4-tcp = 0x20000;
.fi
.in -2

.sp
.LP
You can also use the
.BR ndd (1M)
command to configure the
.B
hxge
driver at runtime to discard any classes of traffic.
.sp
.LP
The
.BR hxge driver
supports the self-healing functionality of Solaris OS.
By default it is configured to DDI_FM_EREPORT_CAPABLE |
DDI_FM_ERRCB_CAPABLE. You configure the
.B hxge
driver by defining the
fm-capable property in
.B hxge.conf
to other capabilities or to 0x0 to
disable it entirely.
.sp
.LP
The
.B hxge
driver may be configured using the standard
.BR ifconfig (1M)
command.
.sp
.LP
The
.B hxge
driver also reports various hardware and software statistics
data. You can view these statistics using the
.BR kstat (1M)
command.
.SH FILES
.sp
.ne 2
.mk
.na
.B /dev/hxge*
.ad
.RS 28n
.rt
Special character device.
.RE

.sp
.ne 2
.mk
.na
.B /kernel/drv/hxge
.ad
.RS 28n
.rt
32-bit device driver (x86).
.RE

.sp
.ne 2
.mk
.na
.B /kernel/drv/sparcv9/hxge
.ad
.RS 28n
.rt
64-bit device driver (SPARC).
.RE

.sp
.ne 2
.mk
.na
.B /kernel/drv/amd64/hxge
.ad
.RS 28n
.rt
64-bit device driver (x86).
.RE

.sp
.ne 2
.mk
.na
.B /kernel/drv/hxge.conf
.ad
.RS 28n
.rt
Configuration file.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
ArchitectureSPARC, x86
.TE

.SH SEE ALSO
.sp
.LP
.BR dladm (1M),
.BR ifconfig (1M),
.BR kstat (1M),
.BR ndd (1M),
.BR netstat (1M),
.BR driver.conf (4),
.BR attributes (5),
.BR streamio (7I),
.BR dlpi (7P)
.sp
.LP
.I Writing Device Drivers
.sp
.LP
.I STREAMS Programming Guide
.sp
.LP
.I Network Interfaces Programmer's Guide
