usr/src/man/man7d/ib.7d
'\" te
.\" Copyright (c) 2009, Sun Microsystems, Inc.  All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ib 7D "26 Jan 2009" "SunOS 5.11" "Devices"
.SH NAME
ib \- InfiniBand Bus Nexus Driver
.SH DESCRIPTION
.sp
.LP
The
.B ib
(IB nexus) driver is a pseudo nexus driver that supports
enumeration of port devices, VPPA (Virtual Physical Point Attachment), HCA_SVC
(HCA Service) devices, and I/O controllers (IOC) on the InfiniBand fabric that
are visible to the host and provides interfaces to
.BR cfgadm_ib (1M)
to manage
hot-plugging of IB devices. The
.B ib
nexus driver enumerates the port
device, VPPA devices and HCA_SVC devices based on entries specified in the
.B ib.conf
file. IOC devices are enumerated on demand. The IB  nexus driver
uses InfiniBand Device Manager services
.RB ( ibdm (7D))
to enumerate port
devices, VPPA devices, HCA_SVC devices, and IOCs on the IB fabric.
.SH CONFIGURATION
.sp
.LP
You configure the
.B ib
driver by defining properties in the
.B ib.conf
file. The IB nexus driver supports the following properties:
.sp

.sp
.TS
tab() box;
lw(0i) |lw(0i) |lw(5.5i)
lw(0i) |lw(0i) |lw(5.5i)
.
PROPERTY NAMEDEFAULTPOSSIBLE VALUES
_
port-svc-list\fB""\fRT{
List of service names,  for example:  srv
T}
_
vppa-svc-list\fB""\fRList of service names, for example: ipib
_
hca-svc-list\fB""\fRT{
List of service names, for example: hca_nfs
T}
.TE

.sp
.LP
The
.B port-svc-list
property defines the list of port communication service
names per port. The IB nexus driver creates a device instance for each entry in
.RB "this property per Host Channel Adapter (" HCA ") port. The " ib.conf " file"
contains a \fBport-svc-list=""\fR entry by default. You update
.B port-svc-list
with service names you want to add to the system.
.sp
.LP
The
.B vppa-svc-list
property defines the list of
.B VPPA
communication
service names per port per partition key. The IB nexus driver creates a device
instance for each entry in this property per Host Channel Adapter
.RB ( HCA )
port. The
.B
ib.conf
file contains a \fBvppa-svc-list=""\fR entry by default.
You update
.B vppa-svc-list
with service names you want to add to the
system.
.sp
.LP
The
.B hca-svc-list
property defines the list of HCA_SVC communication
service names per HCA. The IB nexus driver creates a device instance for each
entry in this property per Host Channel Adapter (HCA). The
.B ib.conf
file
contains a \fBhca-svc-list=""\fR  entry by  default. You update
.B hca-svc-list
with service names you want to add to the system.
.sp
.LP
The service name specified in
.BR port-svc-list ,
.B vppa-svc-list
and
.B hca-svc-list
must be  unique, be a maximum of four characters long, and is
limited to digits 0-9 and letters a-z and A-Z.
.sp
.LP
IOC drivers (which are parented by the IB nexus driver) may themselves have
\&.conf files. To distinguish those cases from pseudo drivers parented by IB
nexus, such drivers should include the \fB"ib-node-type"\fR property with value
.B merge
in the IOC
.B driver.conf
file. That property ensures that
properties from the .conf file are merged with other properties found through
hardware probing.
.SH EXAMPLES
.sp
.LP
Example 1: A sample
.B ib.conf
file with one  service name entry for PORT
communication services.
.sp
.in +2
.nf
    #
    # Copyright 2001-2003 Sun Microsystems, Inc.  All rights reserved.
    # Use is subject to license terms.
    #
    port-svc-list=""
    vppa-svc-list="";
    hca-svc-list="";
.fi
.in -2

.sp
.LP
In Example 1, the IB nexus driver does not create any port/vppa/hca_svc device
instances.
.sp
.LP
Example 2: A sample
.B
ib.conf
file with one entry for \fB"srv"\fR
service:
.sp
.in +2
.nf

   port-svc-list="srv"
   vppa-svc-list="";
   hca-svc-list="";
.fi
.in -2

.sp
.LP
The IB nexus driver creates one
.B srv
service instance for every
.BR HCA
port that exists on the host. For example, if there are two
.BR HCA s,
each
with two ports on the host, the IB nexus driver creates four instances of the
.B srv
service.
.sp
.LP
Example 3: A sample
.B ib.conf
file with one  service name entry for
each of Port and VPPA  communication services:
.sp
.in +2
.nf

   port-svc-list="srv"
   vppa-svc-list="ipib";
   hca-svc-list="";
.fi
.in -2

.sp
.LP
If there are two
.BR HCA "s in the system with two ports each and each port has"
two valid PKEY values, the IB  nexus driver creates four instances of srv
service (one for each port).  It also creates eight instances of
.B ipd
service (one per each port/PKEY combination).
.sp
.LP
Example 4: A sample
.B ib.conf
file with one service name entry for each
of Port, VPPA and HCA_SVC communication services:
.sp
.in +2
.nf

   port-svc-list="srv";
   vppa-svc-list="ipib";
   hca-svc-list="hca_nfs";
.fi
.in -2

.sp
.LP
The IB nexus driver creates one instance of hca_nfs service for each HCA in the
system.
.sp
.LP
Example 5: IOC
.B "driver .conf"
.sp
.in +2
.nf
 ib-node-type="merge";
 enable-special-mode="on";
.fi
.in -2

.SH FILES
.sp
.ne 2
.mk
.na
.B /kernel/drv/ib
.ad
.RS 26n
.rt
32-bit x86 ELF kernel module
.RE

.sp
.ne 2
.mk
.na
.B /kernel/drv/amd64/ib
.ad
.RS 26n
.rt
64-bit x86 ELF kernel module
.RE

.sp
.ne 2
.mk
.na
.B /kernel/drv/sparcv9/ib
.ad
.RS 26n
.rt
64-bit SPARC ELF kernel module
.RE

.sp
.ne 2
.mk
.na
.B /kernel/drv/ib.conf
.ad
.RS 26n
.rt
driver configuration file
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for a description of the following attribute:
.sp

.sp
.TS
tab() box;
lw(2.75i) |lw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE  TYPEATTRIBUTE VALUE
_
ArchitectureSPARC, x86
_
AvailabilitySUNWhea, SUNWib
_
Interface StabilityConsolidation Private
.TE

.SH SEE ALSO
.sp
.LP
.BR cfgadm_ib (1M),
.BR driver.conf (4),
.BR ib (4),
.BR attributes (5),
.BR ibcm (7D),
.BR ibdm (7D),
.BR ibtl (7D)
.sp
.LP
.I Writing Device Drivers
.sp
.LP
.I "InfiniBand Architecture Specification, Volume 1: Release 1.1
.sp
.LP
.I System Administration Guide: Basic Administration
.SH DIAGNOSTICS
.sp
.LP
In addition to being logged, the following messages may appear on the system
console. All messages are formatted in the following manner:
.sp
.in +2
.nf
ib: WARNING: Error message...
.fi
.in -2
.sp

.sp
.ne 2
.mk
.na
.B unit-address property in %s.conf
not well-formed.\fR
.ad
.sp .6
.RS 4n
The \fBdriver.conf\fR file does not have a valid \fB"unit-addr"\fR property
defined. This property is an array of strings.
.RE

.sp
.ne 2
.mk
.na
.BR "cannot find unit-address in %s.conf" .
.ad
.sp .6
.RS 4n
The \fBdriver.conf\fR file does not have a valid \fB"unit-addr"\fR property
defined. This property is an array of strings.
.RE

.sp
.ne 2
.mk
.na
.B Waiting for Port %d initialization.
.ad
.sp .6
.RS 4n
Waiting for port initialization from subnet manager.
.RE

