usr/src/man/man7d/ibdm.7d
'\" te
.\" Copyright (c) 2004, Sun Microsystems, Inc.  All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ibdm 7D "9 Oct 2004" "SunOS 5.11" "Devices"
.SH NAME
ibdm \- Solaris InfiniBand Device Manager
.SH DESCRIPTION
.sp
.LP
The Infiniband Device Manager (\fBIBDM\fR) is an IBTF-compliant kernel misc
module.
.B IBDM
adheres to the InfiniBand Device Management class as
described in \fIInfiniBand Architecture Specification, Volume 1: Release
1.1\fR and enumerates all the devices which are visible from a given host
and maintains a data base of all IB devices visible to the host. \fBIBDM\fR
provides interfaces to the IB nexus driver that enables the driver to
retrieve information about IB devices on the fabric.
.SH FILES
.sp
.ne 2
.mk
.na
.B /kernel/misc/ibdm
.ad
.RS 29n
.rt
32-bit x86 ELF kernel module
.RE

.sp
.ne 2
.mk
.na
.B /kernel/misc/amd64/ibdm
.ad
.RS 29n
.rt
64-bit x86 ELF kernel module
.RE

.sp
.ne 2
.mk
.na
.B /kernel/misc/sparcv9/ibdm
.ad
.RS 29n
.rt
64-bit SPARC ELF kernel module
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for a description of the following attribute:
.sp

.sp
.TS
tab() box;
lw(2.75i) |lw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface Stability Contract Consolidation Private
_
AvailabilitySUNWhea
.TE

.SH SEE ALSO
.sp
.LP
.BR attributes (5),
.BR ib (7D),
.BR ibtl (7D),
.BR ibcm (7D)
.sp
.LP
.I "InfiniBand Architecture Specification, Volume 1: Release 1.1
.SH DIAGNOSTICS
.sp
.LP
None.
