usr/src/man/man7d/ibtl.7d
'\" te
.\" Copyright (c) 2004, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ibtl 7D "9 Oct 2004" "SunOS 5.11" "Devices"
.SH NAME
ibtl \- Solaris InfiniBand Transport Layer
.SH DESCRIPTION
.sp
.LP
InfiniBand
.RB ( IB )
is an I/O technology based on switched fabrics. The
Solaris InfiniBand Transport Layer
.RB ( IBTL )
is a Solaris kernel misc
module and adheres to the
.I "IB Architecture Version 1.1"
specification
and provides a transport layer abstraction to
.B IB
client drivers.
.sp
.LP
.B IBTL
implements the programming interfaces for the Solaris InfiniBand
Transport Framework
.RB ( IBTF ),
consisting of the IB Channel Interface
(CI) and the IB Transport Interface (TI).
.sp
.LP
The CI consists of Host Channel Adapters (HCAs) and HCA drivers. A host is
attached to the IB fabric through the CI layer. The Solaris InfiniBand CI is
Sun's API rendering of the InfiniBand Architecture (IBTA) "verbs"
specification.
.sp
.LP
The Solaris InfiniBand TI is the kernel service driver interface into the
Solaris InfiniBand Transport Framework. It provides transport and
communications setup programming interfaces for Unreliable Datagram (UD) and
Reliable Connected (RC) transport types only.
.SH FILES
.sp
.ne 2
.mk
.na
.B /kernel/misc/ibtl
.ad
.RS 29n
.rt
32-bit x86 ELF kernel misc module
.RE

.sp
.ne 2
.mk
.na
.B /kernel/misc/amd64/ibtl
.ad
.RS 29n
.rt
64-bit x86 ELF kernel misc module
.RE

.sp
.ne 2
.mk
.na
.B /kernel/misc/sparcv9/ibtl
.ad
.RS 29n
.rt
64-bit SPARC ELF kernel module
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for a description of the following attribute:
.sp

.sp
.TS
tab() box;
lw(2.75i) |lw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityConsolidation Private
_
AvailabilitySUNWhea, SUNWib
.TE

.SH SEE ALSO
.sp
.LP
.BR attributes (5),
.BR ib (7D),
.BR ibcm (7D),
.BR ibdm (7D)
.sp
.LP
.I "InfiniBand Architecture Specification, Volume 1: Release 1.1
