usr/src/man/man7d/idn.7d
'\" te
.\" Copyright (c) 1999, Sun Microsystems, Inc.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\"  All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH idn 7d "3 Jun 1999" "SunOS 5.11" "Devices"
.SH NAME
idn \- inter-domain network device driver
.SH SYNOPSIS
.LP
.nf
\fB/dev/idn\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B idn
driver is a multi-thread, loadable, clonable, STREAMS-based
pseudo driver that supports the connectionless Data Link Provider Interface
.BR dlpi (7P)
over the Sun Enterprise 10000 Gigplane-XB Interconnect. This
connection is permitted only between domains within the same Sun Enterprise
10000 server.
.sp
.LP
The
.B idn
driver supports 1 to 32 logical network interfaces that can
be connected to domains linked to the local domain through the
.BR domain_link (1M)
command. (See
.BR domain_link (1M)
in the
.I
Sun Enterprise 10000 SSP 3.5 Reference Manual
for more information.) The
.B idn
driver works in conjunction with the System Service Processor
(SSP) to perform domain linking/unlinking and automated linking upon host
bootup.
.sp
.LP
The
.B /dev/idn
device is used to access all IDN services provided by
the system.
.SS "IDN and DLPI"
.sp
.LP
The
.B idn
driver is a style-2 Data Link Service provider. All
.B M_PROTO
and
.BR M_PCPROTO -type
messages are interpreted as
.BR "DLPI " primitives.
For the
.B
idn
driver to associate the opened stream with
.RB "a particular device (ppa), you must send an explicit" " DL_ATTACH_REQ"
message. The ppa ID is interpreted as an unsigned long and indicates the
corresponding device instance (unit) number. The
.B DL_ERROR_ACK
error is
returned by the driver if the ppa field value does not correspond to a valid
device-instance number for the system. The device is initialized on first
attach and de-initialized (stopped) on the last detach.
.RS +4
.TP
.ie t \(bu
.el o
The maximum SDU is configurable by using the
.B idn.conf
file and has a
range of 512 bytes to 512 Kbytes. The default value is 16384 bytes.
.RE
.RS +4
.TP
.ie t \(bu
.el o
The minimum SDU is 0.
.RE
.RS +4
.TP
.ie t \(bu
.el o
The Service Access Pointer (SAP) address length is 8.
.RE
.RS +4
.TP
.ie t \(bu
.el o
The MAC type is
.BR DL_ETHER .
.RE
.RS +4
.TP
.ie t \(bu
.el o
The
.B SAP
length value is
.IR -2 ,
meaning the physical address
component is followed immediately by a 2-byte
.B SAP
component within the
.B DLSAP
address.
.RE
.RS +4
.TP
.ie t \(bu
.el o
The service mode is
.BR DL_CLDLS .
.RE
.RS +4
.TP
.ie t \(bu
.el o
Optional quality of service
.RB ( QOS )
is not presently supported;
accordingly, the
.B QOS
fields are 0.
.RE
.RS +4
.TP
.ie t \(bu
.el o
The provider style is
.BR DL_STYLE2 .
.RE
.RS +4
.TP
.ie t \(bu
.el o
The version is
.BR DL_VERSION_2 .
.RE
.RS +4
.TP
.ie t \(bu
.el o
The broadcast address value is Ethernet/IEEE broadcast address (0xFFFFFF).
The
.B idn
driver supports broadcast by issuing messages to each target
individually. The
.B idn
driver is inherently a point-to-point network
between domains. When the
.B idn
driver is in the
.BR DL_ATTACHED
state, the user must send a
.B DL_BIND_REQ
request to associate a
particular
.B SAP
with the stream. The
.B idn
driver interprets the
.B SAP
field within the
.B DL_BIND_REQ
message as an Ethernet type and
valid values for the
.B SAP
field are in the range of
.I 0
to
.IR 0xFFFF .
Only one Ethernet type can be bound to the stream at any
time.
.RE
.sp
.LP
If a
.B SAP
with a value of 0 is selected, the receiver will be in 802.3
mode. All frames received from the media having a type field in the range of
0 to 1500 are assumed to be 802.3 frames and are routed up all open streams
which are bound to
.B SAP
value 0. If more than one stream is in 802.3
mode, then the frame will be duplicated and routed up as multiple stream
.B DL_UNITDATA_IND
messages.
.sp
.LP
In transmission, the driver checks the
.B SAP
field of the
.B DL_BIND_REQ
to determine if the SAP value is 0, and if the destination
type field is in the range of
.I " 0"
to
.IR 1500 .
If either is true, the
driver computes the length of the message, (excluding the initial message
block
.B "M_PROTO mblk)"
of all subsequent
.B DL_UNITDATA_REQ
messages
and transmits 802.3 frames that have this value in the MAC frame header
length field.
.sp
.LP
The driver also supports raw
.B M_DATA
mode. When the user sends a
.B DLIOCRAW
ioctl, the particular stream is put in raw mode. A complete
frame and a proper ether header is expected as part of the data.
.sp
.LP
The
.B DLSAP
address format consists of the 6-byte, physical address
component (Ethernet) followed immediately by the 2-byte
.B SAP
component
(type), producing an 8-byte
.B DLSAP
address. Applications should
.B not
hardcode to this particular implementation-specific
.B DLSAP
address format, but instead should use information returned in the
.B DL_INFO_ACK
primitive to compose and decompose
.B DLSAP
addresses.
The
.B SAP
length, full
.B DLSAP
length, and
.B SAP
physical
ordering are included within the
.B DL_INFO_ACK
primitive. The physical
address length can be computed by subtracting the
.B SAP
length from the
full
.B DLSAP
address length or by issuing the
.BR DL_PHYS_ADDR_REQ
message to obtain the current physical address associated with the stream.
.sp
.LP
When the
.B idn
driver is in the
.B DL_BOUND
state, you can transmit
frames on the IDN by sending
.B DL_UNITDATA_REQ
messages to the driver.
The driver then routes received IDN frames up the open and bound streams
having a
.B SAP
which matches the Ethernet type as
.BR DL_UNITDATA_IND
messages. If necessary, received IDN frames are duplicated and routed up
multiple open streams. The
.B DLSAP
address contained within the
.B DL_UNITDATA_REQ
and
.B DL_UNITDATA_IND
messages consists of both
the
.B SAP
(type) and physical (Ethernet) components.
.SS "IDN Primitives"
.sp
.LP
.RB "In addition to the mandatory connectionless DLPI message set, the" " idn"
driver supports the following primitives:
.sp
.LP
The
.B DL_ENABMULTI_REQ
and
.B DL_DISABMULTI_REQ
primitives which
enable or disable, respectively, the reception of individual multicast group
addresses. A set of multicast addresses may be iteratively created and
modified on a per-stream basis using these primitives. These primitives are
accepted by the driver in any state following the
.B DL_ATTACHED
state.
.sp
.LP
The
.B DL_PROMISCON_REQ
and
.B DL_PROMISCOFF_REQ
primitives, which
with the
.B DL_PROMISC_PHYS
flag set in the
.B dl_level
field, enable
or disable, respectively, the reception of all promiscuous frames on the
media, including frames generated by the local domain. When used with the
.B DL_PROMISC_SAP
flag set in the
.B dl_level
field, these primitives
enable or disable, respectively, the reception of all
.B SAP
(Ethernet
type) values. When used with the
.B DL_PROMISC_MULTI
flag set in the
.B dl_level
field, these primitives enable or disable, respectively, the
reception of all multicast group addresses. The effect of each is always on
a per-stream basis and independent of the other
.B SAP
and physical level
configurations on this stream or other streams.
.sp
.LP
The
.B DL_PHYS_ADDR_REQ
primitive which returns the 6-octet, Ethernet
address associated with (or attached to) the stream in the
.B DL_PHYS_ADDR_ACK
primitive. This primitive is valid only in states
following a successful
.B DL_ATTACH_REQ
request.
.sp
.LP
Because the driver maintains domain address information in the address to
.RB "direct packets to the correct destination, the" " DL_SET_PHYS_ADDR_REQ"
primitive is not allowed.
.SH FILES
.sp
.LP
The following files are supported:
.sp
.ne 2
.mk
.na
.B /dev/idn
.ad
.sp .6
.RS 4n
IDN special character device
.RE

.sp
.ne 2
.mk
.na
.B /platform/SUNW,Ultra-Enterprise-10000/kernel/drv/idn.conf
.ad
.sp .6
.RS 4n
System-wide and per-interface default device driver properties
.RE

.SH SEE ALSO
.sp
.LP
.BR netstat (1M),
.BR ndd (1M),
.BR dlpi (7P)
.sp
.LP
.BR domain_link (1M)
in the \fISun Enterprise 10000 SSP 3.5 Reference Manual\fR.
.sp
.LP
.I "Sun Enterprise 10000 InterDomain Networks User Guide
.SH NOTES
.sp
.LP
The
.B idn
driver supports a set of properties that can be set by using
the \fBdriver.conf\fR file for the IDN. See the \fISun Enterprise 10000 InterDomain Networks User Guide\fR for more information about the properties
in the
.BR driver.conf (4),
.RB ( idn.conf ,
for IDNs).
