usr/src/man/man7d/iwh.7d
'\" te
.\" Copyright (c) 2008, Sun Microsystems, Inc. All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH iwh 7D "26 Aug 2008" "SunOS 5.11" "Devices"
.SH NAME
iwh \- Intel(R) WiFi Link 5100/5300 Driver
.SH DESCRIPTION
.sp
.LP
The \fBiwh\fR \fI802.11a/g/n\fR wireless NIC driver is a multi-threaded,
loadable, clonable, GLDv3-based STREAMS driver supporting the Intel Shirley
Peak WiFi  chipset-based NIC's. Driver functions  include controller
initialization, wireless \fI802.11\fR infrastructure network connection, WEP
and frame transmit and receive.
.SH CONFIGURATION
.sp
.LP
The \fBiwh\fR driver performs auto-negotiation  to determine the data rate
and mode. Supported \fI802.11b\fR data rates are 1, 2, 5.5 and 11 Mbits/sec.
Supported \fI802.11g\fR data rates are 1, 2, 5.5, 11, 6, 9, 12, 18, 24, 36,
48 and 54 Mbits/sec.
.SH FILES
.sp
.ne 2
.mk
.na
\fB/dev/iwh\fR \fR
.ad
.RS 26n
.rt
Special character device.
.RE

.sp
.ne 2
.mk
.na
\fB/kernel/drv/iwh\fR \fR
.ad
.RS 26n
.rt
32-bit ELF kernel module (x86).
.RE

.sp
.ne 2
.mk
.na
\fB/kernel/drv/amd64/iwh\fR \fR
.ad
.RS 26n
.rt
64-bit ELF kernel module (x86).
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Architecturex86
_
AvailabilitySUNWiwh
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBdladm\fR(1M), \fBwificonfig\fR(1M), \fBattributes\fR(5), \fBgld\fR(7D),
\fBdlpi\fR(7P)
.sp
.LP
\fI802.11 - Wireless LAN Media  Access Control  and  Physical Layer
Specification\fR- IEEE, 2001.
