usr/src/man/man7d/iwp.7d
'\" te
.\" Copyright (c) 2009, Sun Microsystems, Inc. All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH iwp 7D "20 Oct 2009" "SunOS 5.11" "Devices"
.SH NAME
iwp \- Intel WiFi Link 6000 Series Device Driver
.SH DESCRIPTION
.sp
.LP
The \fBiwp\fR 802.11b/g wireless NIC driver is a multi-threaded, loadable,
clonable, GLDv3-based STREAMS driver which supports the Intel WiFi Link 6000
series chipset-based NICs.
.SS "Configuration"
.sp
.LP
The \fBiwp\fR driver performs auto-negotiation to determine the data rate
and mode. Supported 802.11b data rates are 1, 2, 5.5 and 11 Mbits/sec.
Supported 802.11g data rates are 1, 2, 5.5, 11, 6, 9, 12, 18, 24, 36, 48 and
54 Mbits/sec.
.sp
.LP
The \fBiwp\fR driver only supports BSS networks, (also known as \fBap\fR or
\fBinfrastructure\fR networks), \fBopen\fR(or \fBopen-system\fR) , or
\fBshared system\fR authentication.
.SH FILES
.sp
.ne 2
.mk
.na
\fB/kernel/drv/iwp\fR
.ad
.RS 25n
.rt
32-bit ELF kernel module (x86)
.RE

.sp
.ne 2
.mk
.na
\fB/kernel/drv/amd64/iwp\fR
.ad
.RS 25n
.rt
64-bit ELF kernel module (x86)
.RE

.sp
.ne 2
.mk
.na
\fB/dev/iwp*\fR
.ad
.RS 25n
.rt
Special character device
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for a description of the following attributes:
.sp

.sp
.TS
tab() box;
lw(2.75i) |lw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Architecturex86
_
AvailabilitySUNWiwp
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBdladm\fR(1M), \fBwificonfig\fR(1M), \fBattributes\fR(5)\fBgld\fR(7D),
\fBdlpi\fR(7P)
.sp
.LP
IEEE 802.11 - \fIWireless LAN Media Access Control and Physical Layer
Specification\fR, 2001
