usr/src/man/man7d/iwp.7d
'\" te
.\" Copyright (c) 2009, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH iwp 7D "20 Oct 2009" "SunOS 5.11" "Devices"
.SH NAME
iwp \- Intel WiFi Link 6000 Series Device Driver
.SH DESCRIPTION
.sp
.LP
The
.B iwp
802.11b/g wireless NIC driver is a multi-threaded, loadable,
clonable, GLDv3-based STREAMS driver which supports the Intel WiFi Link 6000
series chipset-based NICs.
.SS "Configuration"
.sp
.LP
The
.B iwp
driver performs auto-negotiation to determine the data rate
and mode. Supported 802.11b data rates are 1, 2, 5.5 and 11 Mbits/sec.
Supported 802.11g data rates are 1, 2, 5.5, 11, 6, 9, 12, 18, 24, 36, 48 and
54 Mbits/sec.
.sp
.LP
The
.B iwp
driver only supports BSS networks, (also known as
.B ap
or
.B infrastructure
networks),
.BR open (or
.BR open-system )
, or
.B shared system
authentication.
.SH FILES
.sp
.ne 2
.mk
.na
.B /kernel/drv/iwp
.ad
.RS 25n
.rt
32-bit ELF kernel module (x86)
.RE

.sp
.ne 2
.mk
.na
.B /kernel/drv/amd64/iwp
.ad
.RS 25n
.rt
64-bit ELF kernel module (x86)
.RE

.sp
.ne 2
.mk
.na
.B /dev/iwp*
.ad
.RS 25n
.rt
Special character device
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for a description of the following attributes:
.sp

.sp
.TS
tab() box;
lw(2.75i) |lw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Architecturex86
_
AvailabilitySUNWiwp
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
.BR dladm (1M),
\fBwificonfig\fR(1M), \fBattributes\fR(5)\fBgld\fR(7D),
.BR dlpi (7P)
.sp
.LP
IEEE 802.11 - \fIWireless LAN Media Access Control and Physical Layer Specification\fR, 2001
