usr/src/man/man7d/ixgbe.7d
'\" te
.\" Copyright (c) 2009, Sun Microsystems, Inc. All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ixgbe 7D "3 Jun 2009" "SunOS 5.11" "Devices"
.SH NAME
ixgbe \- Intel 10Gb PCI Express NIC Driver
.SH SYNOPSIS
.LP
.nf
\fB/dev/ixgbe*\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B ixgbe
10 Gigabit Ethernet driver is a multi-threaded, loadable,
clonable, GLD-based STREAMS driver supporting the Data Link Provider
Interface,
.BR dlpi (7P),
on Intel 10-Gigabit PCI Express Ethernet
controllers.
.sp
.LP
The
.B ixgbe
driver functions include controller initialization, frame
transmit and receive, promiscuous and multicast support, and error recovery
and reporting.
.sp
.LP
The
.B ixgbe
driver and hardware support auto-negotiation, a protocol
specified by the
.I "IEEE 802.3ae"
specification.
.SH APPLICATION PROGRAMMING INTERFACE
.sp
.LP
The cloning character-special device,
.BR /dev/ixgbe ,
is used to access
all Intel 10 -Gigabit PCI Express Ethernet devices installed within the
system.
.sp
.LP
The
.B ixgbe
driver is managed by the
.BR dladm "(1M) command line"
utility, which allows VLANs to be defined on top of
.B ixgbe
instances
and for
.B ixgbe
instances to be aggregated. See \fBdladm\fR(1M) for more
details.
.sp
.LP
You must send an explicit DL_ATTACH_REQ message to associate the opened
stream with a particular device (PPA). The PPA ID is interpreted as an
unsigned integer data type and indicates the corresponding device instance
(unit) number. The driver returns an error (DL_ERROR_ACK) if the PPA field
value does not correspond to a valid device instance number for the system.
The device is initialized on first attach and de-initialized (stopped) at
last detach.
.sp
.LP
The values returned by the driver in the DL_INFO_ACK primitive in response
to your DL_INFO_REQ are:
.RS +4
.TP
.ie t \(bu
.el o
Maximum SDU is 16366.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Minimum SDU is 0.
.RE
.RS +4
.TP
.ie t \(bu
.el o
DLSAP address length is 8.
.RE
.RS +4
.TP
.ie t \(bu
.el o
MAC type is DL_ETHER.
.RE
.RS +4
.TP
.ie t \(bu
.el o
SAP (Service Access Point) length value is -2, meaning the physical address
component is followed immediately by a 2-byte SAP component within the DLSAP
address.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Broadcast address value is the Ethernet/IEEE broadcast address
(FF:FF:FF:FF:FF:FF).
.sp
Once in the DL_ATTACHED state, you must send a DL_BIND_REQ to associate a
particular SAP with the stream.
.RE
.SH CONFIGURATION
.sp
.LP
By default, the
.B ixgbe
driver performs auto-negotiation to select the
link speed and mode. Link speed and mode can only be 10000 Mbps full-duplex.
See the
.I IEEE802.3
standard for more information.
.SH FILES
.sp
.ne 2
.mk
.na
.B /dev/ixgbe*
.ad
.RS 29n
.rt
Special character device.
.RE

.sp
.ne 2
.mk
.na
.B /kernel/drv/ixgbe
.ad
.RS 29n
.rt
32-bit device driver (x86).
.RE

.sp
.ne 2
.mk
.na
.B /kernel/drv/amd64/ixgbe
.ad
.RS 29n
.rt
64-bit device driver (x86).
.RE

.sp
.ne 2
.mk
.na
.B /kernel/drv/sparcv9/ixgbe
.ad
.RS 29n
.rt
64-bit device driver (SPARC).
.RE

.sp
.ne 2
.mk
.na
.B /kernel/drv/ixgbe.conf
.ad
.RS 29n
.rt
Configuration file.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
lw(2.75i) lw(2.75i)
lw(2.75i) lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
AvailabilitySUNWixgbe
ArchitectureSPARC, x86
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
.BR dladm (1M),
.BR netstat (1M),
.BR driver.conf (4),
.BR attributes (5),
.BR streamio (7I),
.BR dlpi (7P)
.sp
.LP
.I Writing Device Drivers
.sp
.LP
.I STREAMS Programming Guide
.sp
.LP
.I Network Interfaces Programmer's Guide
.sp
.LP
.IR "IEEE 802.3ae Specificiation" ,
IEEE - 2002
