usr/src/man/man7d/kfb.7d
'\" te
.\" Copyright (c) 2006, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH kfb 7D "14 Jul 2006" "SunOS 5.11" "Devices"
.SH NAME
kfb \- Sun XVR-2500 Graphics Accelerator device driver
.SH DESCRIPTION
.sp
.LP
The
.B kfb
driver is the Sun XVR-2500 graphics accelerator device
driver. The Sun XVR-2500 graphics accelerator is a high resolution, high
performance PCI graphics framebuffer providing hardware 2D and 3D
acceleration.
.sp
.LP
The
.B kfbdaemon
process provides memory management for the XVR-2500
product family.
.SH FILES
.sp
.ne 2
.mk
.na
\fBdev/fbs/kfb\fIn\fR
.ad
.RS 23n
.rt
Device special file for XVR-2500 high performance single screen.
.RE

.sp
.ne 2
.mk
.na
.B /usr/sbin/kfbdaemon
.ad
.RS 23n
.rt
Memory manager.
.RE

.SH SEE ALSO
.sp
.LP
.BR SUNWkfb_config (1M)
