usr/src/man/man7d/kstat.7d
'\" te
.\" Copyright (c) 1994, Sun Microsystems, Inc.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH kstat 7D "26 May 1994" "SunOS 5.11" "Devices"
.SH NAME
kstat \- kernel statistics driver
.SH DESCRIPTION
.sp
.LP
The
.B kstat
driver is the mechanism used by the
.BR kstat (3KSTAT)
library to extract kernel statistics. This is NOT a public interface.
.SH FILES
.sp
.ne 2
.mk
.na
.B /dev/kstat
.ad
.RS 14n
.rt
kernel statistics driver
.RE

.SH SEE ALSO
.sp
.LP
.BR kstat (3KSTAT),
.BR kstat (9S)
