usr/src/man/man7d/ksyms.7d
'\" te
.\" Copyright (c) 2000 Sun Microsystems, Inc.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\"  All Rights Reserved.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ksyms 7D "11 Dec 2000" "SunOS 5.11" "Devices"
.SH NAME
ksyms \- kernel symbols
.SH SYNOPSIS
.LP
.nf
\fB/dev/ksyms\fR
.fi

.SH DESCRIPTION
.sp
.LP
The file
.B /dev/ksyms
is a character special file that allows
read-only access to an
.B ELF
format image containing two sections: a
symbol table and a corresponding string table. The contents of the symbol
table reflect the symbol state of the currently running kernel. You can
determine the size  of the image with the \fBfstat\fR(\|) system call. The
recommended method for accessing the
.B /dev/ksyms
file is by using the
.B ELF
access library. See
.BR elf (3ELF)
for details.  If you are not
familiar with
.B ELF
format, see
.BR a.out (4).
.sp
.LP
.B /dev/ksyms
is an executable for the processor on which you are
accessing it. It contains
.B ELF
program headers which describe the text
and data segment(s) in kernel memory. Since
.B /dev/ksyms
has no text or
data, the fields specific to file attributes are initialized to
.IR NULL .
The remaining fields describe the text or data segment(s) in kernel
memory.
.sp
.ne 2
.mk
.na
.B Symbol table
.ad
.RS 16n
.rt
The
.B SYMTAB
section contains the symbol table entries present in the
currently running kernel. This section is ordered as defined by the
.B ELF
definition with locally-defined symbols first, followed by
globally-defined symbols. Within symbol type, the symbols are ordered by
kernel module load time. For example, the kernel file symbols are first,
followed by the first module's symbols, and so on, ending with the symbols
from the last module loaded.
.sp
The section header index (st_shndx) field of each symbol entry in the
symbol table is set to
.B SHN_ABS,
because any necessary symbol
relocations are performed by the kernel link editor at module load time.
.RE

.sp
.ne 2
.mk
.na
.B String table
.ad
.RS 16n
.rt
The
.B STRTAB
section contains the symbol name strings that the symbol
table entries reference.
.RE

.SH SEE ALSO
.sp
.LP
.BR kernel (1M),
.BR stat (2),
.BR elf (3ELF),
.BR kvm_open (3KVM),
.BR a.out (4),
.BR mem (7D)
.SH WARNINGS
.sp
.LP
The kernel is dynamically configured. It loads kernel modules when
necessary. Because of this aspect of the system, the symbol information
present in the running system can vary from time to time, as kernel modules
are loaded and unloaded.
.sp
.LP
When you open the
.B /dev/ksyms
file, you have access to an 
.B ELF
image which represents a snapshot of the state of the kernel symbol
information at that instant in time. While the
.B /dev/ksyms
file remains
open, kernel module autounloading is disabled, so that you are protected
from the possibility of acquiring stale symbol data.  Note that new modules
can still be loaded, however. If kernel modules are loaded while you have
the
.B /dev/ksyms
file open, the snapshot held by you will not be
updated. In order to have access to the symbol information of the newly
loaded modules, you must first close and then reopen the 
.B /dev/ksyms
file. Be aware that the size of the
.B /dev/ksyms
file will have changed.
You will need to use the
.B fstat()
function (see
.BR stat (2))
to
determine the new size of the file.
.sp
.LP
Avoid keeping the
.B /dev/ksyms
file open for extended periods of time,
either by using
.BR kvm_open (3KVM)
of the default namelist file or with a
.RB "direct open. There are two reasons why you should not hold " " /dev/ksyms"
open. First, the system's ability to dynamically configure itself is
partially disabled by the locking down of loaded modules. Second, the
snapshot of symbol information held by you will not reflect the symbol
information of modules loaded after your initial open of
.BR /dev/ksyms .
.sp
.LP
Note that the
.B ksyms
driver is a loadable module, and that the kernel
driver modules are only loaded during an open system call. Thus it is
possible to run
.BR stat (2)
on the
.B /dev/ksyms
file without causing
the
.B ksyms
driver to be loaded. In this case, the file size returned is
.BR UNKNOWN_SIZE .
A solution for this behavior is to first open the
.B /dev/ksyms
file, causing the
.B ksyms
driver to be loaded (if
necessary). You can then use the file descriptor from this open in a
\fBfstat\fR(\|) system call to get the file's size.
.SH NOTES
.sp
.LP
The kernel virtual memory access library
.RB ( libkvm )
routines use
.B /dev/ksyms
as the default namelist file. See
.BR kvm_open (3KVM)
for
details.
