usr/src/man/man7d/llc1.7d
'\" te
.\" Copyright (c) 1997, Sun Microsystems, Inc.  All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH llc1 7D "13 Feb 1997" "SunOS 5.11" "Devices"
.SH NAME
llc1 \- Logical Link Control Protocol Class 1 Driver
.SH SYNOPSIS
.LP
.nf
\fB#include <sys/stropts.h>\fR
.fi

.LP
.nf
\fB#include <sys/ethernet.h>\fR
.fi

.LP
.nf
\fB#include <sys/dlpi.h>\fR
.fi

.LP
.nf
\fB#include <sys/llc1.h>\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B llc1
driver is a multi-threaded, loadable, clonable, STREAMS
multiplexing driver supporting the connectionless Data Link Provider Interface,
.BR dlpi (7P),
implementing IEEE 802.2 Logical Link Control Protocol Class 1
over a STREAM to a MAC level driver. Multiple MAC level interfaces installed
within the system can be supported by the driver. The
.B llc1
driver
provides basic support for the LLC1 protocol. Functions provided include frame
transmit and receive, XID, and TEST, multicast support, and error recovery and
reporting.
.sp
.LP
The cloning, character-special device,
.BR /dev/llc1 ,
is used to access all
LLC1 controllers configured under
.BR llc1 .
.sp
.LP
The  \fBllc1\fR driver is a "Style 2" Data Link Service provider. All messages
of types
.B M_PROTO
and
.B M_PCPROTO
are interpreted as DLPI primitives.
An explicit
.B DL_ATTACH_REQ
message by the user is required to associate the
opened stream with a particular device
.RB ( ppa ).
The
.B ppa
ID is
interpreted as an unsigned long and indicates the corresponding device instance
(unit) number. An error  (\fBDL_ERROR_ACK\fR) is returned by the driver if the
.B ppa
field value does not correspond to a valid device instance number for
this system.
.sp
.LP
The values returned by the driver in the
.B DL_INFO_ACK
primitive in
response to the
.B DL_INFO_REQ
from the user are as follows:
.RS +4
.TP
.ie t \(bu
.el o
The maximum Service Data UNIT (SDU) is derived from the MAC layer linked below
the driver.  In the case of an Ethernet driver, the SDU will be 1497.
.RE
.RS +4
.TP
.ie t \(bu
.el o
The minimum SDU is 0.
.RE
.RS +4
.TP
.ie t \(bu
.el o
The MAC type is
.B DL_CSMACD
or
.B DL_TPR
as determined by the driver
linked under
.B llc1.
If the driver reports that it is
.B DL_ETHER,
it
will be changed to
.B DL_CSMACD;
otherwise the type is the same as the MAC
type.
.RE
.RS +4
.TP
.ie t \(bu
.el o
The
.B sap
length value is \(mi1, meaning the physical address component is
followed immediately by a 1-octet
.B sap
component within the DLSAP
address.
.RE
.RS +4
.TP
.ie t \(bu
.el o
The service mode is
.BR DL_CLDLS.
.RE
.RS +4
.TP
.ie t \(bu
.el o
The MAC type is
.B DL_CSMACD
or
.B DL_TPR
as determined by the driver
linked under
.B llc1.
If the driver reports that it is
.B DL_ETHER,
it
will be changed to
.B DL_CSMACD;
otherwise the type is the same as the MAC
type.
.RE
.RS +4
.TP
.ie t \(bu
.el o
The
.B dlsap
address length is 7.
.RE
.RS +4
.TP
.ie t \(bu
.el o
No optional quality of service (QOS) support is included at present, so the QOS
fields should be initialized to 0.
.RE
.RS +4
.TP
.ie t \(bu
.el o
The DLPI version is
.BR DL_VERSION_2.
.RE
.RS +4
.TP
.ie t \(bu
.el o
The provider style is
.BR DL_STYLE2.
.RE
.RS +4
.TP
.ie t \(bu
.el o
The broadcast address value is the broadcast address returned from the lower
level driver.
.RE
.sp
.LP
Once in the
.B DL_ATTACHED
state, the user must send a
.B DL_BIND_REQ
to
associate a particular Service Access Point (SAP) with the stream. The
.B llc1
driver interprets the
.B sap
field within the
.BR DL_BIND_REQ
as an IEEE 802.2 "SAP," therefore valid values for the \fBsap\fR field are in
the [0-0xFF] range with only even values being legal.
.sp
.LP
The
.B llc1
driver DLSAP address format consists of  the 6-octet physical
(e.g., Ethernet) address component followed immediately by the 1-octet \fBsap\fR
(type) component producing a 7-octet DLSAP address. Applications should
.I not
hard-code to this particular implementation-specific DLSAP address
format, but use information returned in the
.B DL_INFO_ACK
primitive to
compose and decompose DLSAP addresses. The
.B sap
length, full DLSAP length,
and
.BR sap "/physical ordering are included within the "
.B DL_INFO_ACK.
The
physical address length can be computed by subtracting the absolute value of the
.B sap
length from the full DLSAP address length or by issuing the
.B DL_PHYS_ADDR_REQ
to obtain the current physical address associated with
the stream.
.sp
.LP
Once in the
.B DL_BOUND
state, the user may transmit frames on the LAN by
sending
.B DL_UNITDATA_REQ
messages to the
.B llc1
driver. The
.B llc1
driver will route received frames up all open and bound streams
having a
.B sap
.RB "which matches the IEEE 802.2 DSAP as " " DL_UNITDATA_IND"
messages. Received frames are duplicated and routed up multiple open streams if
necessary. The DLSAP address contained within the
.B DL_UNITDATA_REQ
and
.B DL_UNITDATA_IND
messages consists of both the
.B sap
(type) and
physical (Ethernet) components.
.sp
.LP
In addition to the mandatory, connectionless DLPI message set, the driver
additionally supports the following primitives:
.sp
.LP
The
.B DL_ENABMULTI_REQ
and
.B DL_DISABMULTI_REQ
primitives
enable/disable reception of specific multicast group addresses. A set of
multicast addresses may be iteratively created and modified on a per-stream
basis using these primitives. These primitives are accepted by the driver in any
driver state that is valid while still being attached to the
.BR ppa .
.sp
.LP
The
.B DL_PHYS_ADDR_REQ
primitive returns the 6-octet physical address
.RB "currently associated (attached) to the stream in the " " DL_PHYS_ADDR_ACK"
primitive. This primitive is valid only in states following a successful
.B DL_ATTACH_REQ.
.sp
.LP
The
.B DL_SET_PHYS_ADDR_REQ
primitive changes the 6-octet physical address
currently associated (attached) to this stream. Once changed, all streams
subsequently opened and attached to this device will obtain this new physical
address. Once changed, the physical address will remain set until this primitive
is used to change the physical address again or the system is rebooted,
whichever occurs first.
.sp
.LP
The
.B DL_XID_REQ/DL_TEST_REQ
primitives provide the means for a user to
issue an
.B "LLC XID"
or
.B TEST
request message.  A response to one of
these messages will be in the form of a
.B DL_XID_CON/DL_TEST_CON
message.
.sp
.LP
The
.B DL_XID_RES/DL_TEST_RES
primitives provide a way for the user to
respond to the receipt of an
.B XID
or
.B TEST
message that was received
as a
.B DL_XID_IND/DL_TEST_IND
message.
.sp
.LP
.B XID
and
.B TEST
will be automatically processed by
.B llc1
if the
.B DL_AUTO_XID/DL_AUTO_TEST
bits are set in the
.BR DL_BIND_REQ.
.SH FILES
.sp
.ne 2
.mk
.na
.B /dev/llc1
.ad
.RS 13n
.rt
cloning, character-special device
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Architecturex86
.TE

.SH SEE ALSO
.sp
.LP
.BR attributes (5),
.BR dlpi (7P)
