usr/src/man/man7d/lx_systrace.7d
'\" te
.\" Copyright (c) 2006, Sun Microsystems, Inc.  All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH lx_systrace 7D "19 Sep 2006" "SunOS 5.11" "Devices"
.SH NAME
lx_systrace \- DTrace Linux system call tracing provider
.SH DESCRIPTION
.sp
.LP
The
.B lx_systrace
driver implements the DTrace
.B lxsyscall
dynamic
tracing provider. The lxsyscall provider performs dynamic instrumentation to
offer probes that fire whenever a thread enters or returns from a Linux
system call entry point.
.sp
.LP
The
.B lx_systrace
driver is not a public interface and you access the
instrumentation offered by this provider through DTrace. Refer to the
\fISolaris Dynamic Tracing Guide\fR for a description of the public
documented interfaces available for the DTrace facility and the probes
offered by the
.B lxsyscall
provider.
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for a description of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWlxr
_
Interface StabilityPrivate
.TE

.SH SEE ALSO
.sp
.LP
.BR dtrace (1M),
.BR attributes (5),
.BR lx (5),
.BR dtrace (7D)
.sp
.LP
.I Solaris Dynamic Tracing Guide
