usr/src/man/man7d/mem.7d
'\" te
.\" Copyright 2002 Sun Microsystems Inc. All Rights Reserved.
.\" Copyright 1989 AT&T
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH mem 7D "18 Feb 2002" "SunOS 5.11" "Devices"
.SH NAME
mem, kmem, allkmem \- physical or virtual memory access
.SH SYNOPSIS
.LP
.nf
/dev/mem
.fi

.LP
.nf
/dev/kmem
.fi

.LP
.nf
/dev/allkmem
.fi

.SH DESCRIPTION
.sp
.LP
The file
.B /dev/mem
is a special file that provides access to the
physical memory of the computer.
.sp
.LP
The file
.B /dev/kmem
is a special file that provides access to the
virtual address space of the operating system kernel, excluding memory that
is associated with an I/O device.
.sp
.LP
The file
.B /dev/allkmem
is a special file that provides access to the
virtual address space of the operating system kernel, including memory that
is associated with an I/O device.  You can use any of these devices to
examine and modify the system.
.sp
.LP
Byte addresses in
.B /dev/mem
are interpreted as physical memory
addresses. Byte addresses in
.B /dev/kmem
and
.B /dev/allkmem
are
interpreted as kernel virtual memory addresses. A reference to a
non-existent location returns an error. See ERRORS for more information.
.sp
.LP
The file
.B /dev/mem
accesses physical memory; the size of the file is
equal to the amount of physical memory in the computer. This size may be
larger than 4GB on a system running the 32-bit operating environment. In
this case, you can access memory beyond 4GB using a series of \fBread\fR(2)
and
.BR write (2)
calls, a
.B pread64()
or
.B pwrite64()
call, or a
combination of
.BR llseek (2)
and
.BR read (2)
or
.BR write (2).
.SH ERRORS
.sp
.ne 2
.mk
.na
.B EFAULT
.ad
.RS 10n
.rt
Occurs when trying to 
.BR write (2)
a read-only location
.RB ( allkmem ),
.BR read (2)
a write-only location
.RB ( allkmem ),
or
.BR read (2)
or
.BR write (2)
a non-existent or unimplemented location (\fBmem\fR,
.BR kmem ,
.BR allkmem ).
.RE

.sp
.ne 2
.mk
.na
.B EIO
.ad
.RS 10n
.rt
Occurs when trying to
.BR read (2)
or
.BR write (2)
a memory location
that is associated with an I/O device using the
.B /dev/kmem
special
file.
.RE

.sp
.ne 2
.mk
.na
.B ENXIO
.ad
.RS 10n
.rt
Results from attempting to
.BR mmap (2)
a non-existent physical
(\fBmem\fR) or virtual (\fBkmem\fR,
.BR allkmem )
memory address.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B /dev/mem
.ad
.RS 16n
.rt
Provides access to the computer's physical memory.
.RE

.sp
.ne 2
.mk
.na
.B /dev/kmem
.ad
.RS 16n
.rt
Provides access to the virtual address space of the operating system
kernel, excluding memory that is associated with an I/O device.
.RE

.sp
.ne 2
.mk
.na
.B /dev/allkmem
.ad
.RS 16n
.rt
Provides access to the virtual address space of the operating system
kernel, including memory that is associated with an I/O device.
.RE

.SH SEE ALSO
.sp
.LP
.BR llseek (2),
.BR mmap (2),
.BR read (2),
.BR write (2)
.SH WARNINGS
.sp
.LP
Using these devices to modify (that is, write to) the address space of a
live running operating system or to modify the state of      a hardware
device is extremely dangerous and may result in a system panic if kernel
data structures are damaged or if device state is changed.
