usr/src/man/man7d/mpt_sas.7d
'\" te
.\" Copyright (c) 2009, Sun Microsystems, Inc. All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH mpt_sas 7D "16 Jul 2009" "SunOS 5.11" "Devices"
.SH NAME
mpt_sas \- SAS-2 host bus adapter driver
.SH SYNOPSIS
.sp
.in +2
.nf
scsi@unit-address
.fi
.in -2

.SH DESCRIPTION
.sp
.LP
The
.B mpt_sas
host bus adapter driver is a nexus driver that supports
the LSI SAS200x/2108 series of chips. These chips support SAS/SATA
interfaces, including tagged and untagged queuing, SATA 3G/SAS 3G/SAS 6G.
.SS "Configuration"
.sp
.LP
The
.B mpt_sas
driver is configured by defining properties in
\fBmpt_sas.conf\fR. These properties override the global SCSI settings. The
\fBmpt_sas\fR driver supports one modifiable property:
.sp
.ne 2
.mk
.na
.B mpxio-disable
.ad
.sp .6
.RS 4n
Solaris I/O multipathing is enabled or disabled on SAS devices with the
\fBmpxio-disable\fR property. Specifying \fBmpxio-disable="no"\fR activates
I/O multipathing, while \fBmpxio-disable="yes"\fR disables I/O multipathing.

.sp
Solaris I/O multipathing can be enabled or disabled on a per port basis.
Per port settings override the global setting for the specified ports.
.sp
The following example shows how to disable multipathing on port 0 whose
parent is
.BR /pci@0,0/pci8086,2940@1c/pci1000,72@0 :
.sp
.in +2
.nf
name="mpt_sas"    parent="/pci@0,0/pci8086,2940@1c/pci1000,72@0"
mpxio-disable="yes";
.fi
.in -2

.RE

.SH EXAMPLES
.LP
\fBExample 1\fR Using the \fBmpt_sas\fR Configuration File to Disable
MPXIO
.sp
.LP
Create a file called \fB/kernel/drv/mpt_sas.conf\fR and add the following
line:

.sp
.in +2
.nf
name="mpt_sas"    parent="/pci@0,0/pci8086,2940@1c/pci1000,72@0"
mpxio-disable="yes";
.fi
.in -2

.SH FILES
.sp
.ne 2
.mk
.na
.B /kernel/drv/mpt_sas
.ad
.sp .6
.RS 4n
32-bit ELF kernel module
.RE

.sp
.ne 2
.mk
.na
.B /kernel/drv/sparcv9/mpt_sas
.ad
.sp .6
.RS 4n
64-bit SPARC ELF kernel module
.RE

.sp
.ne 2
.mk
.na
.B /kernel/drv/amd64/mpt_sas
.ad
.sp .6
.RS 4n
64-bit x86 ELF kernel module
.RE

.sp
.ne 2
.mk
.na
\fB/kernel/drv/mpt_sas.conf\fR
.ad
.sp .6
.RS 4n
Optional configuration file
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for a description of the following attributes:
.sp

.sp
.TS
tab() box;
lw(2.75i) |lw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
ArchitectureSPARC, x86
.TE

.SH SEE ALSO
.sp
.LP
\fBprtconf\fR(1M), \fBdriver.conf\fR(4),
.BR pci (4),
.BR attributes (5),
.BR scsi_abort (9F),
.BR scsi_device (9S),
.BR scsi_extended_sense (9S),
.BR scsi_inquiry (9S),
.BR scsi_hba_attach_setup (9F),
\fBscsi_ifgetcap\fR(9F), \fBscsi_ifsetcap\fR(9F),
.BR scsi_pkt (9S),
.BR scsi_reset (9F),
.BR scsi_sync_pkt (9F),
.BR scsi_transport (9F),
