usr/src/man/man7d/mr_sas.7d
'\" te
.\" Copyright (c) 2009, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH mr_sas 7D "28 May 2009" "SunOS 5.11" "Devices"
.SH NAME
mr_sas \- LSI MegaRAID SAS2.0 Controller HBA driver
.SH DESCRIPTION
.sp
.LP
The
.B mr_sas
MegaRAID SAS2.0 controller host bus adapter driver is a
SCSA-compliant nexus driver that supports the LSI MegaRAID SAS
.RI 92 xx
series of controllers and the Sun StorageTek 6Gb/s SAS RAID HBA series of
controllers.
.sp
.LP
Some of the RAID Features include the following:
.RS +4
.TP
.ie t \(bu
.el o
RAID levels 0, 1, 5, and 6
.RE
.RS +4
.TP
.ie t \(bu
.el o
RAID spans 10, 50, and 60
.RE
.RS +4
.TP
.ie t \(bu
.el o
Online Capacity Expansion (OCE)
.RE
.RS +4
.TP
.ie t \(bu
.el o
Online RAID Level Migration (RLM)
.RE
.RS +4
.TP
.ie t \(bu
.el o
Auto resume after loss of system power during arrays array rebuild or
reconstruction (RLM)
.RE
.RS +4
.TP
.ie t \(bu
.el o
Configurable stripe size up to 1MB
.RE
.RS +4
.TP
.ie t \(bu
.el o
Check Consistency for background data integrity
.RE
.RS +4
.TP
.ie t \(bu
.el o
Patrol read for media scanning and repairing
.RE
.RS +4
.TP
.ie t \(bu
.el o
64 logical drive support
.RE
.RS +4
.TP
.ie t \(bu
.el o
Up to 64TB LUN support
.RE
.RS +4
.TP
.ie t \(bu
.el o
Automatic rebuild
.RE
.RS +4
.TP
.ie t \(bu
.el o
Global and dedicated Hot Spare support
.RE
.SS "Configuration"
.sp
.LP
The
.B mr_sas.conf
file contains one user configurable parameter, for
MSI or MSI-X support. Configure your hardware through the related BIOS
utility or the MegaCli Configuration Utility. If you want to install to a
drive attached to a
.B mr_sas
HBA, create the virtual drive first from
the BIOS (X86) before running Solaris install. The
.B MegaCli
utility can
be downloaded from the LSI website.
.sp
.LP
The LSI MegaRAID SAS device can support up to 64 virtual SAS2.0, SAS1.0,
SATA3.0, or SATA 6.0 disks. The BIOS numbers the virtual disks as 1 through
64, however in Solaris these drives are numbered from 0 to 63. Also keep in
mind that SAS and SATA drives can not be configured into the same virtual
disk.
.SH FILES
.sp
.ne 2
.mk
.na
.B /kernel/drv/mr_sas
.ad
.RS 30n
.rt
32-bit x86 ELF kernel module
.RE

.sp
.ne 2
.mk
.na
.B /kernel/drv/amd64/mr_sas
.ad
.RS 30n
.rt
64-bit kernel module x86 ELF kernel module
.RE

.sp
.ne 2
.mk
.na
.B /kernel/drv/sparcv9/mr_sas
.ad
.RS 30n
.rt
64-bit SPARC ELF kernel module
.RE

.sp
.ne 2
.mk
.na
.B /kernel/drv/mr_sas.conf
.ad
.RS 30n
.rt
Driver configuration file containing one user-configurable option
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for a description of the following attributes:
.sp

.sp
.TS
tab() box;
lw(2.75i) |lw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
ArchitectureSPARC, x86
_
AvailabilitySUNWmrsas
_
Interface StabilityUncommitted
.TE

.SH SEE ALSO
.sp
.LP
.BR prtconf (1M),
.BR attributes (5),
.BR sata (7D),
.BR scsi_hba_attach_setup (9F),
.BR scsi_sync_pkt (9F),
.BR scsi_transport (9F),
.BR scsi_device (9S),
.BR scsi_inquiry (9S),
.BR scsi_pkt (9S)
.sp
.LP
.I Small Computer System Interface-2 (SCSI-2)
.SH NOTES
.sp
.LP
The
.B mr_sas
driver only supports internal and external expanders that
are not fully SAS1.0 or fully SAS2.0 compliant.
