usr/src/man/man7d/msglog.7d
'\" te
.\" Copyright (c) 1998, Sun Microsystems, Inc.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH msglog 7D "13 Oct 1998" "SunOS 5.11" "Devices"
.SH NAME
msglog \- message output collection from system startup or background
applications
.SH SYNOPSIS
.LP
.nf
\fB/dev/msglog\fR
.fi

.SH DESCRIPTION
.sp
.LP
Output from system startup ("rc") scripts is directed to \fB/dev/msglog\fR,
which dispatches it appropriately.
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsr
_
Interface StabilityStable
.TE

.SH SEE ALSO
.sp
.LP
.BR syslogd (1M),
.BR syslog (3C),
.BR attributes (5),
.BR sysmsg (7D)
.SH NOTES
.sp
.LP
In the current version of Solaris,
.B /dev/msglog
is an alias for
.BR /dev/sysmsg .
In future versions of Solaris, writes to
\fB/dev/msglog\fR may be directed into a  more general logging mechanism
such as
.BR syslogd (1M).
.sp
.LP
.BR syslog (3C)
provides a more general logging mechanism  than
\fB/dev/msglog\fR and should be used in preference to \fB/dev/msglog\fR
whenever possible.
