usr/src/man/man7d/mxfe.7d
'\" te
.\" Copyright (c) 2001-2007 by Garrett D'Amore.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions are
.\" met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\"
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" 3. Neither the name of the uthor nor the names of any co-contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\" 
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
.\" STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING
.\" IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.\" Portions Copyright (c) 2007 by Sun Microsystems, Inc.  All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.TH mxfe 7D "31 Aug 2007" "SunOS 5.11" "Devices"
.SH NAME
mxfe \- MXFE Fast Ethernet device driver
.SH SYNOPSIS
.LP
.nf
\fB/dev/mxfe*\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B mxfe
is a Solaris STREAMS hardware driver supporting the Data
Link Provider Interface (\fBdlpi\fR(7P)) over the Macronix 98715 family
(including the Lite-On PNIC-II) of Fast Ethernet controllers.
.SH DLPI SPECIFICATIONS
.sp
.LP
The
.B mxfe
driver supports both style 1 and style 2 modes of operation.
Physical points of attachment (PPAs) are interpreted as the instance number
of the
.B mxfe
controller as assigned by the operating system.
.sp
.LP
The  relevant  fields  returned  as part of a DL_INFO_ACK response are:
.RS +4
.TP
.ie t \(bu
.el o
Maximum SDU is 1500.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Minimum SDU is 0.
.RE
.RS +4
.TP
.ie t \(bu
.el o
DLSAP address length is 8.
.RE
.RS +4
.TP
.ie t \(bu
.el o
MAC type is
.BR DL_ETHER .
.RE
.RS +4
.TP
.ie t \(bu
.el o
.B SAP
length value is
.IR -2 ,
meaning the physical address component
is followed immediately by a 2-byte
.B SAP
component within the
.B DLSAP
address.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Service mode is DL_CLDLS.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Broadcast address value is the 6-byte Ethernet/IEEE broadcast address
(ff:ff:ff:ff:ff:ff).
.RE
.sp
.LP
If the SAP provided is zero,
.I "IEEE 802.3"
mode is assumed and outbound
frames will have the frame payload length written into the type field
Likewise, inbound  frames with a SAP between zero and 1500 are interpreted
as
.I "IEEE 802.3"
frames and delivered to streams that have bound to SAP
zero (the
.I 802.3
SAP).
.SH FILES
.sp
.ne 2
.mk
.na
.B /dev/mxfe*
.ad
.RS 28n
.rt
Special character device
.RE

.sp
.ne 2
.mk
.na
.B /kernel/drv/mxfe
.ad
.RS 28n
.rt
32-bit driver binary (x86).
.RE

.sp
.ne 2
.mk
.na
.B /kernel/drv/amd64/mxfe
.ad
.RS 28n
.rt
64-bit ELF kernel module (x86).
.RE

.sp
.ne 2
.mk
.na
.B /kernel/drv/sparcv9/mxfe
.ad
.RS 28n
.rt
Driver binary (SPARC).
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for a description of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
ArchitectureSPARC, x86
_
AvailabilitySUNWmxfe
.TE

.SH SEE ALSO
.sp
.LP
.BR ifconfig (1M),
.BR ndd (1M),
.BR attributes (5),
.BR dlpi (7P)
.sp
.LP
.I IEEE 802.3
\(em Institute of Electrical and Electronics Engineers,
2002
