usr/src/man/man7d/myri10ge.7d
'\" te
.\" Copyright (c) 2007-2009 Myricom, Inc. All Rights Reserved. Use is subject to license terms.
.\" Portions Copyright (c) 2009, Sun Microsystems, Inc. All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH myri10ge 7D "10 Sep 2009" "SunOS 5.11" "Devices"
.SH NAME
myri10ge \- Myricom Myri10GE 10Gb PCI Express NIC Driver
.SH SYNOPSIS
.LP
.nf
/dev/myri10ge*
.fi

.SH DESCRIPTION
.sp
.LP
The
.B myri10ge
Gigabit Ethernet driver is a multi-threaded, loadable,
clonable, GLD-based STREAMS driver that supports the Data Link Provider
Interface,
.BR dlpi (7P),
on Myricom Myri10GE 10-Gigabit Ethernet
controllers.
.sp
.LP
The
.B myri10ge
driver functions include controller initialization,
frame transmit and receive, promiscuous and multicast support, multiple
transmit and receive queues, support for TCP Large Send Offload, support for
TCP Large Receive Offload, and error recovery and reporting.
.SS "Application Programming Interface"
.sp
.LP
The cloning character-special device,
.BR /dev/myri10ge ,
is used to
access all Myricom Myri10GE 10 -Gigabit Ethernet dev ices installed within
the system.
.sp
.LP
The
.B myri10ge
driver is managed by the
.BR dladm "(1M) command line"
utility. dladm allows VLANs to be defined on top of
.B myri10ge
instances
and for
.B myri10ge
instances to be aggregated. See \fBdladm\fR(1M) for
more details.
.sp
.LP
You must send an explicit
.B DL_ATTACH_REQ
message to associate the
opened stream with a particular device
.RB ( PPA ).
The
.B PPA
ID is
interpreted as an unsigned integer data type and indicates the corresponding
device instance (unit) number. The driver returns an error
(\fBDL_ERROR_ACK\fR) if the \fBPPA\fR field value does not correspond to a
valid device instance number for the system. The device is initialized on
first attach and de-initialized (stopped) at last detach.
.sp
.LP
The values returned by the driver in the
.B DL_INFO_ACK
primitive in
response to your
.B DL_INFO_REQ
are:
.RS +4
.TP
.ie t \(bu
.el o
Maximum
.B SDU
is
.BR 9000 .
.RE
.RS +4
.TP
.ie t \(bu
.el o
Minimum
.B SDU
is
.BR 0 .
.RE
.RS +4
.TP
.ie t \(bu
.el o
.B DLSAP
address length is
.BR 8 .
.RE
.RS +4
.TP
.ie t \(bu
.el o
.B MAC
type is
.BR DL_ETHER .
.RE
.RS +4
.TP
.ie t \(bu
.el o
.B SAP
(Service Access Point) length value is
.BR -2 ,
meaning the
physical address component is followed immediately by a 2-byte \fBSAP\fR
component within the
.B DLSAP
address.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Broadcast address value is the Ethernet/IEEE broad- cast address
(\fBFF:FF:FF:FF:FF:FF\fR).
.RE
.RS +4
.TP
.ie t \(bu
.el o
Once in the
.B DL_ATTACHED
state, you must send a
.B DL_BIND_REQ
to
associate a particular SAP with the stream.
.RE
.SS "Configuration"
.sp
.LP
Link speed and mode can only be 10000 Mbps full-duplex. See the \fIIEEE
802.3 Standard\fR for more information.
.SH FILES
.sp
.ne 2
.mk
.na
.B /dev/myri10ge*
.ad
.sp .6
.RS 4n
Special character device.
.RE

.sp
.ne 2
.mk
.na
.B /kernel/drv/myri10ge
.ad
.sp .6
.RS 4n
32-bit device driver (x86)
.RE

.sp
.ne 2
.mk
.na
.B /kernel/drv/amd64/myri10ge
.ad
.sp .6
.RS 4n
64-bit device driver (x86)
.RE

.sp
.ne 2
.mk
.na
.B /kernel/drv/sparcv9/myri10ge
.ad
.sp .6
.RS 4n
64-bit device driver (SPARC)
.RE

.sp
.ne 2
.mk
.na
.B /kernel/drv/myri10ge.conf
.ad
.sp .6
.RS 4n
Configuration file
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for a description of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
ArchitectureSPARC, x86
_
AvailabilitySUNWmyri10ge
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
.BR dladm (1M),
.BR netstat (1M),
.BR driver.conf (4),
.BR attributes (5),
.BR dlpi (7P),
.BR streamio (7I)
.sp
.LP
.I Writing Device Drivers
.sp
.LP
.I Network Interface Guide
.sp
.LP
.I STREAMS Programming Guide
.sp
.LP
.I IEEE 802.3 Standard
