usr/src/man/man7d/npe.7d
'\" te
.\" Copyright (c) 2005, Sun Microsystems, Inc.  All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH npe 7D "12 Oct 2005" "SunOS 5.11" "Devices"
.SH NAME
npe \- PCI Express bus nexus driver
.SH DESCRIPTION
.sp
.LP
The
.B npe
nexus driver is used on X64 servers for PCI Express Root
Complex devices that provide PCI Express interconnect. This driver is
compliant to PCI Express base specification, Revision 1.0a.
.sp
.LP
This nexus driver provides support for the following features: Access to
extended configuration space, IEEE 1275 extensions for PCI Express, Base
line PCI Express error handling and PCI Express MSI interrupts.
.SH FILES
.sp
.ne 2
.mk
.na
.B /platform/i86pc/kernel/drv/npe
.ad
.sp .6
.RS 4n
32-bit ELF kernel module.
.RE

.sp
.ne 2
.mk
.na
.B /platform/i86pc/kernel/drv/amd64/npe
.ad
.sp .6
.RS 4n
64-bit ELF kernel module.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Architecturex64 PCI Express-based systems
_
AvailabilitySUNWcakr.i
.TE

.SH SEE ALSO
.sp
.LP
.BR attributes (5),
.BR pcie (4),
.BR pcie_pci (7D)
.sp
.LP
.I PCI Express Base Specification v1.0a
\(em 2003
.sp
.LP
.I Writing Device Drivers
.sp
.LP
.I IEEE 1275 PCI Bus Binding
\(em 1998
.sp
.LP
.I http://playground.sun.com/1275/bindings/pci/pci-express.txt
