usr/src/man/man7d/ntwdt.7d
'\" te
.\" Copyright (c) 2005, Sun Microsystems, Inc.  All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ntwdt 7D "05 Feb 2005" "SunOS 5.11" "Devices"
.SH NAME
ntwdt \- Netra\(embased application watchdog timer driver
.SH SYNOPSIS
.LP
.nf
/dev/ntwdt
.fi

.SH DESCRIPTION
.sp
.LP
The
.B ntwdt
driver is a multithreaded, loadable, non-STREAMS pseudo
driver that provides an application with an interface for controlling a
system watchdog timer.
.sp
.LP
The
.B ntwdt
driver implements a
.B "virtual watchdog timer"
that a
privileged application (Effective UID == 0) controls via IOCTLs.
.SH CONFIGURATION
.sp
.LP
You configure the
.B ntwdt
driver by modifying the contents of the
.B ntwdt.conf
file.
.SH ERRORS
.sp
.LP
An
.B open()
fails if:
.sp
.ne 2
.mk
.na
.B EPERM
.ad
.RS 10n
.rt
Effective user ID is not zero.
.RE

.sp
.ne 2
.mk
.na
.B ENOENT
.ad
.RS 10n
.rt
.B /dev/ntwdt
is not present or driver is not installed.
.RE

.sp
.ne 2
.mk
.na
.B EAGAIN
.ad
.RS 10n
.rt
.B /dev/ntwdt
has already been successfully open()'d.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B /dev/ntwdt
.ad
.RS 28n
.rt
Special character device.
.RE

.sp
.ne 2
.mk
.na
.B kernel/drv/sparcv9/ntwdt
.ad
.RS 28n
.rt
SPARC ntwdt driver binary.
.RE

.sp
.ne 2
.mk
.na
.B kernel/drv/ntwdt.conf
.ad
.RS 28n
.rt
Driver configuraton file.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcakr.u
_
ArchitectureSPARC
.TE

.SH SEE ALSO
.sp
.LP
.BR driver.conf (4),
.BR attributes (5)
.sp
.LP
.I Writing Device Drivers
