usr/src/man/man7d/ntxn.7d
'\" te
.\" Copyright (c) 2008, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ntxn 7D "13 Oct 2008" "SunOS 5.11" "Devices"
.SH NAME
ntxn \- NetXen 10/1 Gigabit Ethernet network driver
.SH SYNOPSIS
.LP
.nf
\fB/dev/ntxn*\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B ntxn
10/1 Gigabit Ethernet driver is a multi-threaded, loadable,
clonable, GLD-based STREAMS driver supporting the Data Link Provider
Interface,
.BR dlpi (7P),
on NetXen 10/1 Gigabit Ethernet controllers.
.sp
.LP
The
.B ntxn
driver functions include chip initialization, frames
transmit and receive, promiscuous and multicast support, TCP and UDP
checksum off-load (IPv4) and 9600 bytes jumbo frame.
.sp
.LP
The
.B ntxn
driver and hardware support the 10GBASE CX4, 10GBASE-SR/W,
LR/W, and 10/100/1000BASE-T physical layers.
.SH APPLICATION PROGRAMMING INTERFACE
.sp
.LP
The cloning character-special device,
.BR /dev/ntxn ,
is used to access
all NetXen devices installed within the system.
.sp
.LP
The
.B ntxn
driver is managed by the
.BR dladm "(1M) command line"
utility, which allows VLANs to be defined on top of
.B ntxn
instances and
for
.B ntxn
instances to be aggregated. See \fBdladm\fR(1M) for more
details.
.sp
.LP
The values returned by the driver in the DL_INFO_ACK primitive in response
to your DL_INFO_REQ are:
.RS +4
.TP
.ie t \(bu
.el o
Maximum SDU is 9600.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Minimum SDU is 0.
.RE
.RS +4
.TP
.ie t \(bu
.el o
DLSAP address length is 8.
.RE
.RS +4
.TP
.ie t \(bu
.el o
MAC type is DL_ETHER.
.RE
.RS +4
.TP
.ie t \(bu
.el o
SAP (Service Access Point) length value is -2, meaning the physical address
component is followed immediately by a 2-byte SAP component within the DLSAP
address.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Broadcast address value is the Ethernet/IEEE broadcast address
(FF:FF:FF:FF:FF:FF).
.RE
.SH CONFIGURATION
.sp
.LP
By default, the
.B ntxn
driver works without any configuration file.
.SH FILES
.sp
.ne 2
.mk
.na
.B /dev/ntxn*
.ad
.RS 26n
.rt
Special character device.
.RE

.sp
.ne 2
.mk
.na
.B /kernel/drv/ntxn
.ad
.RS 26n
.rt
32-bit device driver (x86).
.RE

.sp
.ne 2
.mk
.na
.B /kernel/drv/amd64/ntxn
.ad
.RS 26n
.rt
64-bit device driver (x86).
.RE

.sp
.ne 2
.mk
.na
.B /kernel/drv/ntxn.conf
.ad
.RS 26n
.rt
Configuration file.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
lw(2.75i) lw(2.75i)
lw(2.75i) lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
AvailabilitySUNWntxn
Architecturex86
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
.BR dladm (1M),
.BR ndd (1M),
.BR netstat (1M),
.BR driver.conf (4),
.BR attributes (5),
.BR streamio (7I),
.BR dlpi (7P)
.sp
.LP
.I Writing Device Drivers
.sp
.LP
.I STREAMS Programming Guide
.sp
.LP
.I Network Interfaces Programmer's Guide
