usr/src/man/man7d/null.7d
'\" te
.\" Copyright 1989 AT&T
.\" Copyright (C) 2001, Sun Microsystems, Inc.
.\" All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH null 7D "4 April 2001" "SunOS 5.11" "Devices"
.SH NAME
null \- the null file, also called the null device
.SH SYNOPSIS
.LP
.nf
\fB/dev/null\fR
.fi

.SH DESCRIPTION
.sp
.LP
Data written on the null special file,
.BR /dev/null ,
is discarded.
.sp
.LP
Reads from a null special file always return 0 bytes.
.sp
.LP
Mapping a null special file creates an address reservation of a length
equal to the length of the mapping, and rounded up to the nearest page size
as returned by \fBsysconf\fR(3C). No resources are consumed by the
reservation. Mappings can be placed in the resulting address range via
subsequent calls to
.B mmap
with the
.B -MAP_FIXED
option set.
.SH FILES
.sp
.ne 2
.mk
.na
.B /dev/null
.ad
.RS 13n
.rt

.RE

.SH SEE ALSO
.sp
.LP
.BR mmap (2),
\fBsysconf\fR(3C)
