usr/src/man/man7d/nv_sata.7d
'\" te
.\" Copyright (c) 2008, Sun Microsystems, Inc.  All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH nv_sata 7D "22 Jul 2008" "SunOS 5.11" "Devices"
.SH NAME
nv_sata \- Nvidia ck804/mcp55 SATA controller driver
.SH SYNOPSIS
.LP
.nf
\fBsata@unit-address\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B nv_sata
driver is a SATA HBA driver that supports Nvidia ck804
and mcp55 SATA HBA controllers.      Note that while these Nvidia
controllers support standard SATA features including SATA-II drives, NCQ,
hotplug and ATAPI drives, the driver currently does not support NCQ
features.
.SH CONFIGURATION
.sp
.LP
The
.B nv_sata
module contains no user configurable parameters.
.SH FILES
.sp
.ne 2
.mk
.na
.B /kernel/drv/nv_sata
.ad
.sp .6
.RS 4n
32-bit
.B ELF
kernel module (x86).
.RE

.sp
.ne 2
.mk
.na
.B /kernel/drv/amd64/nv_sata
.ad
.sp .6
.RS 4n
64-bit
.B ELF
kernel module (x86).
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attribute:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Architecturex86
_
AvailabilitySUNWnvsata
.TE

.SH SEE ALSO
.sp
.LP
\fBcfgadm\fR(1M), \fBcfgadm_sata\fR(1M), \fBprtconf\fR(1M), \fBsata\fR(7D),
.BR sd (7D)
.sp
.LP
.I Writing Device Drivers
