usr/src/man/man7d/nxge.7d
'\" te
.\" Copyright (c) 2008, Sun Microsystems, Inc. All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH nxge 7D "12 Apr 2008" "SunOS 5.11" "Devices"
.SH NAME
nxge \- Sun 10/1 Gigabit Ethernet network driver
.SH SYNOPSIS
.LP
.nf
/dev/nxge*
.fi

.SH DESCRIPTION
.sp
.LP
The
.B nxge
Gigabit Ethernet driver is a multi-threaded, loadable,
clonable, GLD-based STREAMS driver supporting the Data Link Provider
Interface,
.BR dlpi (7P),
on Sun Gigabit Ethernet hardware (NIU, Sun x8,
Express Dual 10 Gigabit Ethernet fiber XFP low profile adapter and the
10/100/1000BASE-T x8 Express low profile adapter).
.sp
.LP
The
.B nxge
driver functions include chip initialization, frame transmit
and receive, flow classification, multicast and promiscuous support, and
error recovery and reporting.
.sp
.LP
The
.B nxge
device provides fully-compliant
.I "IEEE 802.3ae"
10Gb/s
full duplex operation using XFP-based 10GigE optics (NIU, dual 10 Gigabit
fiber XFP adapter). The Sun Ethernet hardware supports the \fIIEEE 802.3x\fR
frame-based flow control capabilities.
.sp
.LP
For the 10/100/1000BASE-T adapter, the
.B nxge
driver and hardware
support auto-negotiation, a protocol specified by the \fI1000 Base-T\fR
standard. Auto-negotiation allows each device to advertise its capabilities
and discover those of its peer (link partner). The highest common
denominator supported by both link partners is automatically selected,
yielding the greatest available throughput while requiring no manual
configuration. The
.B nxge
driver also allows you to configure the
advertised capabilities to less than the maximum (where the full speed of
the interface is not required) or to force a specific mode of operation,
irrespective of the link partner's advertised capabilities.
.SH APPLICATION PROGRAMMING INTERFACE
.sp
.LP
The cloning character-special device,
.BR /dev/nxge ,
is used to access
all Sun Neptune NIU devices installed within the system.
.sp
.LP
The
.B nxge
driver is managed by the
.BR dladm "(1M) command line"
utility, which allows VLANs to be defined on top of
.B nxge
instances
and for
.B nxge
instances to be aggregated. See \fBdladm\fR(1M) for more
details.
.sp
.LP
You must send an explicit DL_ATTACH_REQ message to associate the opened
stream with a particular device (PPA). The PPA ID is interpreted as an
unsigned integer data type and indicates the corresponding device instance
(unit) number. The driver returns an error (DL_ERROR_ACK) if the PPA field
value does not correspond to a valid device instance number for the system.
The device is initialized on first attach and de-initialized (stopped) at
last detach.
.sp
.LP
The values returned by the driver in the DL_INFO_ACK primitive in response
to a DL_INFO_REQ are:
.RS +4
.TP
.ie t \(bu
.el o
Maximum SDU (default 1500).
.RE
.RS +4
.TP
.ie t \(bu
.el o
Minimum SDU (default 0). The driver pads to the  mandatory 60-octet minimum
packet size.
.RE
.RS +4
.TP
.ie t \(bu
.el o
DLSAP address length is 8.
.RE
.RS +4
.TP
.ie t \(bu
.el o
MAC type is
.BR DL_ETHER .
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBSAP\fR length value is
.IR -2 ,
meaning the physical address component
is followed immediately by a 2-byte
.B SAP
component within the
\fBDLSAP\fR address.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Broadcast address value is the Ethernet/IEEE broadcast address
(FF:FF:FF:FF:FF:FF).
.sp
Due to the nature of link address definition for IPoIB, the
DL_SET_PHYS_ADDR_REQ DLPI primitive is not supported.
.sp
In the transmit case for streams that have been put in raw mode via the
DLIOCRAW ioctl, the dlpi application must prepend the 20 byte IPoIB
destination address to the data it wants to transmit over-the-wire. In the
receive case, applications receive the IP/ARP datagram along with the IETF
defined 4 byte header.
.RE
.sp
.LP
Once in the DL_ATTACHED state, you must send a DL_BIND_REQ to associate a
particular Service Access Point (SAP) with the stream.
.SH CONFIGURATION
.sp
.LP
For the
.I 10/100/1000BASE-T
adapter, the
.B nxge
driver performs
auto-negotiation to select the link speed and mode. Link speed and mode may
be 10000 Mbps full-duplex (10 Gigabit adapter), 1000 Mbps full-duplex, 100
Mbps full-duplex, or 10 Mbps full-duplex, depending on the hardware adapter
type. See the
.I " IEEE802.3"
standard for more information.
.sp
.LP
The auto-negotiation protocol automatically selects the 1000 Mbps, 100
Mbps, or 10 Mbps operation modes (full-duplex only) as the highest common
denominator supported by both link partners. Because the
.B nxge
device
supports all modes, the effect is to select the highest throughput mode
supported by the other device.
.sp
.LP
You can also set the capabilities advertised by the
.B nxge
device using
.BR dladm (1M).
The driver supports a number of parameters whose names
begin with
.B en_
(see below). Each of these parameters contains a
boolean value that determines if the device advertises that mode of
operation. The
.B adv_autoneg_cap
parameter controls whether
auto-negotiation is performed. If
.B adv_autoneg_cap
is set to 0, the
driver forces the mode of operation selected by the first non-zero
parameter in priority order as shown below:
.sp
.in +2
.nf
                            (highest priority/greatest throughput)
        en_1000fdx_cap          1000Mbps full duplex
        en_100fdx_cap           100Mpbs full duplex
        en_10fdx_cap            10Mpbs full duplex
                         (lowest priority/least throughput)
.fi
.in -2

.sp
.LP
All capabilities default to enabled. Note that changing any capability
parameter causes the link to go down while the link partners renegotiate the
link speed/duplex using the newly changed capabilities.
.SH FILES
.sp
.ne 2
.mk
.na
.B /dev/nxge*
.ad
.RS 28n
.rt
Special character device.
.RE

.sp
.ne 2
.mk
.na
.B /kernel/drv/nxge
.ad
.RS 28n
.rt
32-bit device driver (x86).
.RE

.sp
.ne 2
.mk
.na
.B /kernel/drv/sparcv9/nxge
.ad
.RS 28n
.rt
64-bit device driver (SPARC).
.RE

.sp
.ne 2
.mk
.na
.B /kernel/drv/amd64/nxge
.ad
.RS 28n
.rt
64-bit device driver (x86).
.RE

.sp
.ne 2
.mk
.na
\fB/kernel/drv/nxge.conf\fR
.ad
.RS 28n
.rt
Configuration file.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
ArchitectureSPARC, x86
.TE

.SH SEE ALSO
.sp
.LP
.BR dladm (1M),
.BR netstat (1M),
.BR attributes (5),
.BR streamio (7I),
.BR dlpi (7P),
.BR driver.conf (4)
.sp
.LP
.I Writing Device Drivers
.sp
.LP
.I STREAMS Programming Guide
.sp
.LP
\fINetwork Interfaces Programmer's Guide\fR
.sp
.LP
\fIIEEE 802.3ae Specification\fR \(em 2002
