usr/src/man/man7d/ohci.7d
'\" te
.\" Copyright (c) 2006, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ohci 7D "23 Nov 2006" "SunOS 5.11" "Devices"
.SH NAME
ohci \- OpenHCI host controller driver
.SH SYNOPSIS
.LP
.nf
\fBusb@unit-address\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B ohci
driver is a USBA (Solaris USB Architecture) compliant nexus
driver that supports the \fIOpen Host Controller Interface Specification
1.1\fR, an industry standard developed by Compaq, Microsoft, and National
Semiconductor.
.sp
.LP
The
.B ohci
driver supports bulk, interrupt, control and isochronous
transfers.
.SH FILES
.sp
.ne 2
.mk
.na
.B /kernel/drv/ohci
.ad
.RS 28n
.rt
32-bit x86 ELF kernel module
.RE

.sp
.ne 2
.mk
.na
.B /kernel/drv/amd64/ohci
.ad
.RS 28n
.rt
64-bit x86 ELF kernel module
.RE

.sp
.ne 2
.mk
.na
.B /kernel/drv/sparcv9/ohci
.ad
.RS 28n
.rt
64-bit SPARC ELF kernel module
.RE

.sp
.ne 2
.mk
.na
.B /kernel/drv/ohci.conf
.ad
.RS 28n
.rt
driver configuration file
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
ArchitectureSPARC, x86, PCI-based systems
_
Availability SUNWusb
.TE

.SH SEE ALSO
.sp
.LP
.BR attributes (5),
.BR ehci (7D),
.BR hubd (7D),
.BR uhci (7D),
.BR usba (7D)
.sp
.LP
.I Writing Device Drivers
.sp
.LP
.I Universal Serial Bus Specification 2.0
.sp
.LP
.I "Open Host Controller Interface Specification for USB 1.0a
.sp
.LP
.I System Administration Guide: Basic Administration
.sp
.LP
.I http://www.sun.com/io
.SH DIAGNOSTICS
.sp
.LP
All host controller errors are passed to the client drivers. Root hub
errors are documented in
.BR hubd (7D).
.sp
.LP
In addition to being logged, the following messages may appear on the
system console. All messages are formatted in the following manner:
.sp
.in +2
.nf
WARNING: <device path> <ohci><instance number>>: Error message...
.fi
.in -2
.sp

.sp
.ne 2
.mk
.na
.B Unrecoverable USB Hardware Error.
.ad
.sp .6
.RS 4n
There was an unrecoverable USB hardware error reported by the OHCI
Controller. Please reboot the system. If this problem persists, contact your
system vendor.
.RE

.sp
.ne 2
.mk
.na
\fBNo SOF interrupts have been received. This OHCI USB controller is
unusable.\fR
.ad
.sp .6
.RS 4n
The USB hardware is not generating Start Of Frame interrupts. Please reboot
the system. If this problem persists, contact your system vendor.
.RE

.sp
.LP
The following messages may be entered into the  system  log. They are
formatted in the following manner:
.sp
.in +2
.nf
<device path> <ohci<instance number>): Message...
.fi
.in -2
.sp

.sp
.ne 2
.mk
.na
.B "Failed to program frame interval register.
.ad
.sp .6
.RS 4n
For an unspecified reason, the frame interval register has been nulled out
by the Uli M1575 chip. Please reboot the system. If this problem persists,
contact your system vendor.
.RE

