usr/src/man/man7d/oplpanel.7d
'\" te
.\" Copyright (c) 2006, Sun Microsystems, Inc. All Rights Reserved.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH oplpanel 7D "18 Apr 2006" "SunOS 5.11" "Devices"
.SH NAME
oplpanel \- device driver for the SPARC Enterprise Server family
.SH DESCRIPTION
.sp
.LP
The
.B oplpanel
device driver monitors the panel reset button. If the
button is pressed, a high-level interrupt is generated, and the
\fBoplpanel\fR driver causes a system panic.
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcakr
_
Interface StabilityPrivate
.TE

.SH SEE ALSO
.sp
.LP
.BR attributes (5)
