usr/src/man/man7d/pcata.7d
'\" te
.\" Copyright (c) 2000 Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH pcata 7D "2 Mar 2007" "SunOS 5.11" "Devices"
.SH NAME
pcata \- PCMCIA ATA card device driver
.SH SYNOPSIS
.LP
.nf
pcata@socket#:a -u
.fi

.LP
.nf
pcata@socket#:a -u,raw
.fi

.SH DESCRIPTION
.sp
.LP
The
.B "PCMCIA ATA"
card device driver supports
.B "PCMCIA ATA"
disk and
flash cards that follow the following standards:
.RS +4
.TP
.ie t \(bu
.el o
.B PC
card 2.01 compliance
.RB ( MBR+fdisk
table required for all
platforms).
.RE
.RS +4
.TP
.ie t \(bu
.el o
.B PC
card
.B ATA
2.01 compliance.
.RE
.RS +4
.TP
.ie t \(bu
.el o
.B PC
card services 2.1 compliance.
.RE
.sp
.LP
The driver supports standard
.B "PCMCIA ATA"
cards that contain a Card
Information Structure (CIS). For
.B PCMCIA,
nodes are created in
.B /devices
that include the socket number as one component of the device
name referred to by the node. However, the names in
.BR /dev ,
.BR /dev/dsk ,
and
.B /dev/rdsk
follow the current conventions for
.B ATA
devices, which do not encode the socket number in any part of the
name. For example, you may have the following:
.sp

.sp
.TS
tab() box;
lw(1.49i) |lw(2.08i) |lw(1.93i)
lw(1.49i) |lw(2.08i) |lw(1.93i)
.
\fBPlatform\fR\fB/devices name\fR\fB/dev/dsk name\fR
_
\fBx86\fR\fB/devices/isa/pcic@1,3e0 /disk@0:a\fR/dev/dsk/c1d0s0
_
SPARCT{
\fB/devices/iommu@f,e0000000 /sbus@f,e0001000 /SUNW, pcmcia@3,0 /disk@0:a\fR
T}/dev/dsk/c1d0s0
.TE

.SH PRECONFIGURATION
.sp
.LP
If a PC Card ATA device is recognized, the pcata driver is automatically
loaded, IRQs allocated, devices nodes created, and special files created (if
they do not already exist).
.SS "Known Problems and Limitations"
.RS +4
.TP
.ie t \(bu
.el o
You need to umount the file system before removing the disk.
.RE
.RS +4
.TP
.ie t \(bu
.el o
The
.B ufs
file systems on removable media (PC Card ATA) should have one
of the
.BR "onerror={panic, lock, umount" }
mount options set.
.RE
.SH CONFIGURATION
.sp
.LP
Configuration topics include initial installation and configuration,
identifying an unrecognized device, special files and hot-plugging.
.SS "Initial Installation and Configuration"
.RS +4
.TP
1.
Install the Solaris software.
.RE
.RS +4
.TP
2.
Boot the system.
.RE
.RS +4
.TP
3.
Insert the PC card ATA device.
.RE
.SS "Identifying an Unrecognized Device"
.sp
.LP
If you insert a PC card ATA device and it is not recognized (no special
files created), use the
.B prtconf
command to identify the problem.
.RS +4
.TP
1.
Run the
.B "prtconf -D"
command to see if your
.B pcata
card is
recognized. (A recognized device will appear at the end of the
.B prtconf
output. For example:
.sp
.in +2
.nf
# prtconf -D
\&.  .  .
pcic, instance #0 (driver name: pcic)
    .  .  .
   disk, instance #0
.fi
.in -2

.RE
.RS +4
.TP
2.
If
.B pcata
does not appear in the
.B prtconf
output, there is a
problem with the PC card adapter configuration or with the hardware. Check
to see whether the problem is with the card or the adapter by trying to use
the card on another machine and by seeing if it works on the same machine
using DOS.
.RE
.SS "Special Files"
.sp
.LP
For PC card devices, nodes are created in
.B /devices
that include the
socket number as one component of a device name that the node refers to.
However, the
.B /prtc/dev
names and the names in
.B /dev/dsk
and
.B /dev/rdsk
do follow the current convention for ATA devices, which do
not encode the socket number in any part of the name.
.SS "Hot-Plugging"
.RS +4
.TP
.ie t \(bu
.el o
If you want to remove the disk, you must unmount the file system.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Use the
.BR mkfs_pcfs (1M)
command to create a
.B pcfs
file system:
.sp
.in +2
.nf
# mkfs -F pcfs /dev/rdsk/c#d#p0:d
.fi
.in -2

.RE
.RS +4
.TP
.ie t \(bu
.el o
To mount a
.B pcfs
file system, type:
.sp
.in +2
.nf
# mount -F pcfs /dev/dsk/c#d#p0:c /mnt
.fi
.in -2

.RE
.RS +4
.TP
.ie t \(bu
.el o
.RB "If you want to create a " ufs " file system, use the " newfs " command"
and type:
.sp
.in +2
.nf
# newfs /dev/rdsk/c#d#s#
.fi
.in -2

.RE
.RS +4
.TP
.ie t \(bu
.el o
To mount a
.B ufs
file system, type:
.sp
.in +2
.nf
# mount -F ufs /dev/dsk/c#d#s# /mnt
.fi
.in -2

.RE
.RS +4
.TP
.ie t \(bu
.el o
To create a Solaris partition, run the format command and go to the
Partition menu. For more information, see the
.BR format (1M)
man page.
.RE
.SH FILES
.sp
.ne 2
.mk
.na
.B /kernel/drv/pcata
.ad
.RS 21n
.rt
.B pcata
driver
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWpsdpr
.TE

.SH SEE ALSO
.sp
.LP
.BR format (1M),
.BR mount (1M),
.BR newfs (1M),
.BR pcmcia (7D),
.BR attributes (5),
.BR pcfs (7FS)
