usr/src/man/man7d/pcic.7d
'\" te
.\" Copyright (c) 2006, Sun Microsystems, Inc.  All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH pcic 7D "27 June 2006" "SunOS 5.11" "Devices"
.SH NAME
pcic \- Intel i82365SL PC Card Interface Controller
.SH DESCRIPTION
.sp
.LP
The Intel i82365SL PC Card interface controller provides one or more
.B PCMCIA PC
card sockets. The
.B pcic
driver implements a
.B PCMCIA
bus nexus driver.
.sp
.LP
The driver provides basic support for the Intel 82365SL and compatible
chips. Tested chips are:
.RS +4
.TP
.ie t \(bu
.el o
Intel \(em 82365SL.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Cirrus Logic \(em PD6710/PD6720/PD6722.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Vadem \(em VG365/VG465/VG468/VG469.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Toshiba \(em PCIC and ToPIC
.RE
.RS +4
.TP
.ie t \(bu
.el o
Ricoh \(em RF5C366/RL5C466/RL5C475/RL5C476/RL5C477/RL5C478.
.RE
.RS +4
.TP
.ie t \(bu
.el o
02Micro \(em OZ6912/6972.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Texas Instruments \(em PCI1130/PCI1131/PCI1031/PCI1221/PCI1225/PCI1520/PCI
1410/PCI1420/PCI4520/PCI7510/PCI7621.
.RE
.sp
.LP
While most systems using one of the above chips will work, some systems are
not supported due to hardware designs options that may not be software
detectable.
.sp
.LP
Direct access to the
.B PCMCIA
hardware is not supported. All device
access must be through the DDI.
.SH CONFIGURATION
.sp
.LP
Configuration of PC Card interface controllers are automatically done in
the system by leveraging ACPI on x86 (or OBP on SPARC). Configuration
includes allocation of device memory, I/O ports, CardBus subordinary bus
number and interrupts. There is no      user-interference required. Note
that the controller may not work when ACPI is disabled.
.sp
.LP
There is one driver configuration property defined in the \fBpcic.conf\fR
file:
.sp
.ne 2
.mk
.na
.B interrupt-priorities=6;
.ad
.RS 27n
.rt
This   property must be defined and  must  be below 10.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B /kernel/drv/pcic
.ad
.RS 25n
.rt
.B pcic
driver.
.RE

.sp
.ne 2
.mk
.na
.B /kernel/drv/pcic.conf
.ad
.RS 25n
.rt
.B pcic
configuration file.
.RE

.SH SEE ALSO
.sp
.LP
.BR cardbus (4),
.BR stp4020 (7D),
.BR pcmcia (7D)
