usr/src/man/man7d/pcisch.7d
'\" te
.\" Copyright (c) 2005, Sun Microsystems, Inc.  All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH pcisch 7D "26 May 2005" "SunOS 5.11" "Devices"
.SH NAME
pcisch \- PCI Bus to Safari bus nexus driver
.SH DESCRIPTION
.sp
.LP
The
.B pcisch
nexus driver is used for Schizo and XMITS-based I/O
assemblies for the following high-end and midrange Sun enterprise servers:
Sun Fire E15K, Sun Fire E25K, Sun Fire E2900, Sun Fire E4900 and Sun Fire
E6900. 
.SH FILES
.sp
.ne 2
.mk
.na
\fB/platform/sun4u/kernel/drv/sparcv9/pcisch\fR
.ad
.sp .6
.RS 4n
64-bit ELF kernel module.
.RE

.SH SEE ALSO
.sp
.LP
.BR pcipsy (7D)
