usr/src/man/man7d/pcram.7d
'\" te
.\" Copyright (c) 2000, Sun Microsystems, Inc.  All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH pcram 7D "2 Mar 2007" "SunOS 5.11" "Devices"
.SH NAME
pcram \- PCMCIA RAM memory card device driver
.SH SYNOPSIS
.LP
.nf
\fBmemory@\fI<socket>\fB/pcram@\fI<technology>\fB,0:c\fR
.fi

.LP
.nf
\fBmemory@\fI<socket>\fB/pcram@\fI<technology>\fB,0:c,raw\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B "PCMCIA RAM"
.RB "memory card device driver supports disk-like" " I/O"
access to any standard
.B PCMCIA
static random access memory (SRAM) card
and dynamic random access memory (DRAM) card. The driver supports standard
.B PCMCIA SRAM/DRAM
cards that contain a Card Information Structure
(CIS).
.B RAM
card densities in the 512Kilobytes to 64Mbyte range are
supported.
.SH PRECONFIGURATION
.sp
.LP
If a PC card memory device is recognized, the
.B pcram
device driver is
automatically loaded, the physical address allocated, and special files
created (if they do not already exist).
.SS "Known Problems and Limitations"
.sp
.LP
The Solaris \fBpcmem\fR driver is not capable of handling "combo" memory
cards with multiple types of memory on them (for example, combined SRAM and
nonvolatile FLASH). Inserting such a card into a system running the Solaris
software may cause a system panic.
.sp
.LP
Because the PC card memory device is designed as a pseudo-floppy diskette
type, the only utility that can be used for formatting is
.BR fdformat (1).
.SH CONFIGURATION
.sp
.LP
Configuration topics include initial installation and configuration,
identifying an unrecognized device, special files, using PC card memory
devices, and hot-plugging.
.SS "Initial Installation and Configuration"
.RS +4
.TP
1.
Install the Solaris software.
.RE
.RS +4
.TP
2.
Boot the system.
.RE
.RS +4
.TP
3.
Insert the card.
.RE
.SS "Identifying an Unrecognized Device"
.sp
.LP
If you insert a memory device and it is not recognized (no special files
created), use the
.B prtconf
command.
.RS +4
.TP
1.
Become root.
.RE
.RS +4
.TP
2.
Run the
.B "prtconf -D"
command to display the configuration recognized by
the system. A recognized device will appear in the
.B prtconf
output. For
example:
.sp
.in +2
.nf
# prtconf -D
\&.  .  .
pcic, instance #0 (driver name: pcic)
    .  .  .
   memory, instance #0 (driver name: pcmem)
         pcram, instance #0 (driver name: pcram)
.fi
.in -2

.RE
.RS +4
.TP
3.
If your memory device does not appear at the end of the \fBprtconf\fR
.RB "output, it is not supported and cannot be used with the" " pcram"
driver.
.RE
.SS "Special Files"
.sp
.LP
The special files created for PC card memory devices act like disks and
have names in the form \fB/dev/dsk/c\fI#\fRt\fI#\fRd\fI#\fRp\fI#\fR or
\fB/dev/dsk/c\fI#\fRt\fI#\fRd\fI#\fRs\fI#\fR. Abbreviations used in the
names are:
.RS +4
.TP
.ie t \(bu
.el o
c\fI#\fR Controller \fI#\fR
.RE
.RS +4
.TP
.ie t \(bu
.el o
t\fI#\fR Card technology type
.IR # ,
defined as follows:
.br
.in +2
0 Null--no device
.in -2
.br
.in +2
1 ROM
.in -2
.br
.in +2
2 OTPROM (One Time PROM)
.in -2
.br
.in +2
3 UV EPROM
.in -2
.br
.in +2
4 EEPROM
.in -2
.br
.in +2
5 Flash EPROM
.in -2
.br
.in +2
6 SRAM
.in -2
.br
.in +2
7 DRAM
.in -2
.RE
.RS +4
.TP
.ie t \(bu
.el o
d\fI#\fR Device region of type
.IR # ,
usually zero
.RE
.RS +4
.TP
.ie t \(bu
.el o
p\fI#\fR fdisk partition \fI#\fR
.RE
.RS +4
.TP
.ie t \(bu
.el o
s\fI#\fR Solaris slice \fI#\fR
.RE
.LP
Note -
.sp
.RS 2
A device name can be specified either by a partition name (p\fI#\fR) or a
slice name (s\fI#\fR), but not both.
.RE
.SS "Using PC Card Memory Devices"
.sp
.LP
Solaris recognizes a PC Card memory device automatically upon the card's
insertion. If you do not want automatic handling of a PC card memory device,
insert an entry for the device in \fB/etc/vfstab\fR and set the \fBmount at
boot\fR field to
.BR no .
See
.BR vfstab (4).
.sp
.LP
PC Card memory devices do not need to have file systems on them, though
typically, before using a new PC Card memory card, you will want to create a
file system on it. DOS PCFS is the best format to use. (You can use
virtually any file system format on a PC card memory card, but most other
file system formats are platform-dependent, making them unsuitable for
moving data between different types of machines. See "Using a PCMCIA Memory
Card" in the \fIOpenWindows Advanced User's Guide\fR.)
.LP
Note -
.sp
.RS 2
If you want to redirect the output of a
.B tar
command (or
.B dd
or
.BR cpio )
to a PC card memory device, first create a file system on the
card, using the
.BR fdformat (1)
command without arguments. The card must
be reformatted before it can be written on again.
.RE
.SS "Hot-Plugging"
.sp
.LP
If a memory card is removed while in use, the device driver returns errors
until the memory card is inserted into the appropriate socket. Close and
reopen the device with the card reinserted, and the memory card will work.
.RS +4
.TP
.ie t \(bu
.el o
If you remove the card while in use as a file system, unmount the file
system using the
.B umount
command. Then reinsert the card and remount
the file system using the
.B mount
command.
.RE
.RS +4
.TP
.ie t \(bu
.el o
If you remove the card and interrupt a
.B tar
or
.B cpio
process,
stop the process, reinsert the card, and restart the process.
.RE
.SH FILES
.sp
.ne 2
.mk
.na
.B /kernel/drv/pcram
.ad
.RS 22n
.rt
.B pcram
driver
.RE

.sp
.ne 2
.mk
.na
\fB/dev/dsk/c\fIn\fBt\fIn\fBd\fIn\fBs\fIn\fR
.ad
.RS 22n
.rt
block files
.RE

.sp
.ne 2
.mk
.na
\fB/dev/rdsk/c\fIn\fBt\fIn\fBd\fIn\fBs\fIn\fR
.ad
.RS 22n
.rt
raw fileswhere:
.sp
.ne 2
.mk
.na
\fBc\fIn\fR
.ad
.RS 6n
.rt
controller
.IR n
.RE

.sp
.ne 2
.mk
.na
\fBt\fIn\fR
.ad
.RS 6n
.rt
technology type
.IR n
.sp
\fB0x1\fIROM,\fB0x2\fIOTPROM,\fB0x3\fIEPROM,\fR
.sp
\fB0x4\fIEEPROM,\fB0x5\fIFLASH,\fB0x6\fISRAM,\fR
.sp
\fB0x7\fIDRAM\fR
.RE

.sp
.ne 2
.mk
.na
\fBd\fIn\fR
.ad
.RS 6n
.rt
technology region in type
.IR n
.RE

.sp
.ne 2
.mk
.na
\fBs\fIn\fR
.ad
.RS 6n
.rt
slice
.IR n
.RE

.RE

.SH SEE ALSO
.sp
.LP
.BR fdformat (1),
.BR pcmcia (7D),
.BR dkio (7I),
.BR pcmem (7D)
