usr/src/man/man7d/pcwl.7d
'\" te
.\" Copyright (c) 2007, Sun Microsystems, Inc.  All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH pcwl 7D "24 Jan 2007" "SunOS 5.11" "Devices"
.SH NAME
pcwl \- Lucent/PrismII 802.11b wireless NIC driver
.SH DESCRIPTION
.sp
.LP
The
.B pcwl
.I 802.11b
wireless NIC driver is a multi- threaded,
loadable, clonable, GLDv3-based STREAMS driver. It supports the pccard and
PCI/MiniPCI cards with the Lucent and PrismII
.I 802.11b
chipsets on x86
and SPARC.
.SH DRIVER CONFIGURATION
.sp
.LP
The
.B pcwl
driver supports
.I 802.11b
data rates of 1, 2, 5.5 and 11
(Mbits/sec). The default is 11.
.sp
.LP
The
.B
pcwl
driver supports BSS networks (also known as "ap" or
"infrastructure" networks) and IBSS (or "ad-hoc") networks. For
authentication type, the
.B
pcwl
driver supports the "open" (or
"open-system") mode and the "shared-key" mode. For encryption type, only WEP
is currently supported. You perform configuration and administration tasks
using the
.BR dladm (1M)
and
.BR wificonfig (1M)
utilities.
.SH FILES
.sp
.ne 2
.mk
.na
.B /dev/pcwl*
.ad
.RS 28n
.rt
Special character device.
.RE

.sp
.ne 2
.mk
.na
.B /kernel/drv/pcwl
.ad
.RS 28n
.rt
32-bit ELF kernel module (x86).
.RE

.sp
.ne 2
.mk
.na
.B /kernel/drv/amd64/pcwl
.ad
.RS 28n
.rt
64-bit ELF kernel module (x86).
.RE

.sp
.ne 2
.mk
.na
.B /kernel/drv/sparcv9/pcwl
.ad
.RS 28n
.rt
64-bit ELF kernel module (SPARC).
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for a description of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySPARC, x86
.TE

.SH SEE ALSO
.sp
.LP
.BR dladm (1M),
.BR wificonfig (1M),
.BR attributes (5),
.BR gld (7D)
.sp
.LP
.I "802.11b Standard for Wireless Local Area Networks (WLANs)
- IEEE
