usr/src/man/man7d/physmem.7d
'\" te
.\" Copyright (c) 2006, Sun Microsystems, Inc.  All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH physmem 7D "15 Nov 2006" "SunOS 5.11" "Devices"
.SH NAME
physmem \-  physmem driver
.SH DESCRIPTION
.sp
.LP
The
.B physmem
driver is a private mechanism used by diagnostic test
suites to test the physical memory of the system.
.SH FILES
.sp
.ne 2
.mk
.na
.B /dev/physmem
.ad
.sp .6
.RS 4n
Kernel module.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for a description of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface stability Private
.TE

.SH CAUTION
.sp
.LP
This driver is used by Sun internal diagnostic programs only. Any other use
may have a harmful impact on the system.
