usr/src/man/man7d/pty.7d
'\" te
.\" Copyright (c) 1994, Sun Microsystems, Inc.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH pty 7D "8 Aug 1994" "SunOS 5.11" "Devices"
.SH NAME
pty \- pseudo-terminal driver
.SH DESCRIPTION
.sp
.LP
The
.B pty
driver provides support for a pair of devices collectively
known as a
.IR pseudo-terminal .
The two devices comprising a
pseudo-terminal are known as a
.I controller
and a
.IR slave .
The slave
device distinguishes between the
.B B0
baud rate and other baud rates
specified in the
.B c_cflag
word of the
.B termios
structure, and the
.B CLOCAL
flag in that word. It does not support any of the other
.BR termio (7I)
device control functions specified by flags in the
.B c_cflag
word of the
.B termios
structure and by the
\fBIGNBRK, IGNPAR, PARMRK,
\fRor \fBINPCK\fR flags in the \fBc_iflag\fR word of the \fBtermios\fR
structure, as these functions apply only to asynchronous serial ports.  All
other \fBtermio\fR(7I) functions must be performed by
.B STREAMS
modules
pushed atop the driver; when a slave device is opened, the
.BR ldterm (7M)
and
.BR ttcompat (7M)
.B STREAMS
modules are automatically pushed on top
of the stream, providing the standard \fBtermio\fR(7I) interface.
.sp
.LP
Instead of having a hardware interface and associated hardware that
supports the terminal functions, the functions are implemented by another
process manipulating the controller device of the pseudo-terminal.
.sp
.LP
The controller and the slave devices of the pseudo-terminal are tightly
connected. Any data written on the controller device is given to the slave
device as input, as though it had been received from a hardware interface.
Any data written on the slave terminal can be read from the controller
device (rather than being transmitted from a
.BR UAR ).
.sp
.LP
By default, 48 pseudo-terminal pairs are configured as follows:
.sp
.in +2
.nf
/dev/pty[p-r][0-9a-f] controller devices
/dev/tty[p-r][0-9a-f] slave devices
.fi
.in -2

.SH IOCTLS
.sp
.LP
The standard set of
.BR "termio ioctl" "s are supported by the slave device."
None of the bits in the
.B c_cflag
word have any effect on the
pseudo-terminal, except that if the baud rate is set to
.BR B0 ,
it will
appear to the process on the controller device as if the last process on the
.RB "slave device had closed the line; thus, setting the baud rate to" " B0"
has the effect of ``hanging up'' the pseudo-terminal, just as it has the
effect of ``hanging up'' a real terminal.
.sp
.LP
There is no notion of ``parity'' on a pseudo-terminal, so none of the flags
in the
.B c_iflag
word that control the processing of parity errors have
any effect. Similarly, there is no notion of a ``break'', so none of the
flags that control the processing of breaks, and none of the \fBioctl\fRs
that generate breaks, have any effect.
.sp
.LP
Input flow control is automatically performed; a process that attempts to
write to the controller device will be blocked if too much unconsumed data
is buffered on the slave device.  The input flow control provided by the
.B IXOFF
flag in the
.B c_iflag
word is not supported.
.sp
.LP
The delays specified in the
.B c_oflag
word are not supported.
.sp
.LP
As there are no modems involved in a pseudo-terminal, the \fBioctl\fRs that
return or alter the state of modem control lines are silently ignored.
.sp
.LP
A few special \fBioctl\fRs are provided on the controller devices of
pseudo-terminals to provide the functionality needed by applications
programs to emulate real hardware interfaces:
.sp
.ne 2
.mk
.na
.B TIOCSTOP
.ad
.RS 14n
.rt
The argument is ignored. Output to the pseudo-terminal is suspended, as if
a
.B STOP
character had been typed.
.RE

.sp
.ne 2
.mk
.na
.B TIOCSTART
.ad
.RS 14n
.rt
The argument is ignored. Output to the pseudo-terminal is restarted, as if
a
.B START
character had been typed.
.RE

.sp
.ne 2
.mk
.na
.B TIOCPKT
.ad
.RS 14n
.rt
The argument is a pointer to an
.BR int .
If the value of the
.B int
is
non-zero,
.I packet
mode is enabled; if the value of the
.B int
is
zero, packet mode is disabled. When a pseudo-terminal is in packet mode,
each subsequent
.BR read (2)
from the controller device will return data
written on the slave device preceded by a zero byte (symbolically defined as
.B TIOCPKT_DATA),
or a single byte reflecting control status
information. In the latter case, the byte is an inclusive-or of zero or more
of the bits:
.sp
.ne 2
.mk
.na
.B TIOCPKT_FLUSHREAD
.ad
.RS 22n
.rt
whenever the read queue for the terminal is flushed.
.RE

.sp
.ne 2
.mk
.na
.B TIOCPKT_FLUSHWRITE
.ad
.RS 22n
.rt
whenever the write queue for the terminal is flushed.
.RE

.sp
.ne 2
.mk
.na
.B TIOCPKT_STOP
.ad
.RS 22n
.rt
whenever output to the terminal is stopped using ^S.
.RE

.sp
.ne 2
.mk
.na
.B TIOCPKT_START
.ad
.RS 22n
.rt
whenever output to the terminal is restarted.
.RE

.sp
.ne 2
.mk
.na
.B TIOCPKT_DOSTOP
.ad
.RS 22n
.rt
whenever
.B XON/XOFF
flow control is enabled after being disabled; it is
considered ``enabled'' when the
.B IXON
flag in the
.B c_iflag
word is
set, the
.B VSTOP
member of the
.B c_cc
array is ^S and the
.B VSTART
member of the
.B c_cc
array is ^Q.
.RE

.sp
.ne 2
.mk
.na
.B TIOCPKT_NOSTOP
.ad
.RS 22n
.rt
whenever
.B XON/XOFF
flow control is disabled after being enabled.
.RE

.RE

.sp
.ne 2
.mk
.na
.B TIOCREMOTE
.ad
.RS 14n
.rt
The argument is a pointer to an
.BR int .
If the value of the
.B int
is
non-zero,
.I remote
mode is enabled; if the value of the
.B int
is
zero, remote mode is disabled. This mode can be enabled or disabled
independently of packet mode. When a pseudo-terminal is in remote mode,
input to the slave device of the pseudo-terminal is flow controlled and not
input edited (regardless of the mode the slave side of the pseudo-terminal).
Each write to the controller device produces a record boundary for the
process reading the slave device.  In normal usage, a write of data is like
the data typed as a line on the terminal; a write of 0 bytes is like typing
an
.B EOF
character. Note: this means that a process writing to a
pseudo-terminal controller in
.I remote
mode must keep track of line
boundaries, and write only one line at a time to the controller.  If, for
example, it were to buffer up several
.B NEWLINE
characters and write
them to the controller with one
.BR write() ,
it would appear to a process
reading from the slave as if a single line containing several
.BR NEWLINE
characters had been typed (as if, for example, a user had typed the
.B LNEXT
character before typing all but the last of those
.BR NEWLINE
characters). Remote mode can be used when doing remote line editing in a
window manager, or whenever flow controlled input is required.
.RE

.SH EXAMPLES
.sp
.in +2
.nf
#include <fcntl.h>
#include <sys/termios.h>

int fdm fds;
fdm = open("/dev/ptyp0, O_RDWR);  /* open master */
fds = open("/dev/ttyp0, O_RDWR);  /* open slave */
.fi
.in -2

.SH FILES
.sp
.ne 2
.mk
.na
.B /dev/pty[p-z][0-9a-f]
.ad
.RS 25n
.rt
pseudo-terminal controller devices
.RE

.sp
.ne 2
.mk
.na
.B /dev/tty[p-z][0-9a-f]
.ad
.RS 25n
.rt
pseudo-terminal slave devices
.RE

.SH SEE ALSO
.sp
.LP
.BR rlogin (1),
.BR rlogind (1M),
.BR ldterm (7M),
.BR termio (7I),
.BR ttcompat (7M),
.SH NOTES
.sp
.LP
It is apparently not possible to send an
.B EOT
by writing zero bytes in
.B TIOCREMOTE
mode.
