usr/src/man/man7d/radeon.7d
'\" te
.\" Copyright (c) 2009 Sun Microsystems, Inc.  All Rights Reserved.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH radeon 7d "24 Jun 2009" "SunOS 5.11" "Devices"
.SH NAME
radeon \- DRI (Direct Rendering Infrastructure)-compliant kernel driver
providing 3-dimensional graphic hardware acceleration support.
.SH DESCRIPTION
.sp
.LP
The
.B radeon
driver is a DRI-compliant  kernel driver that provides
graphics hardware acceleration support. DRI is a framework for coordinating
OS kernel, 3D  graphics hardware, X window system and OpenGL applications.
.sp
.LP
The
.B radeon
driver currently supports certain low-end ATI radeon
graphics cards, including Radeon X700.
.SH FILES
.sp
.ne 2
.mk
.na
.B /kernel/drv/radeon
.ad
.RS 28n
.rt
32-bit ELF kernel module (x86).
.RE

.sp
.ne 2
.mk
.na
.B /kernel/drv/amd64/radeon
.ad
.RS 28n
.rt
64-bit ELF kernel module (x86).
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWdrmr
_
Architecture x86
_
Interface Stability Committed
.TE

.SH SEE ALSO
.sp
.LP
.B /usr/X11/share/man/man1/Xserver.1
.sp
.LP
.B /usr/X11/share/man/man1/Xorg.1
.sp
.LP
.B /usr/X11/share/man/man5/X11.5
.sp
.LP
.BR attributes (5)
