usr/src/man/man7d/ramdisk.7d
'\" te
.\" Copyright (c) 2003, Sun Microsystems, Inc.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ramdisk 7D "04 Mar 2003" "SunOS 5.11" "Devices"
.SH NAME
ramdisk \- RAM disk device driver
.SH SYNOPSIS
.LP
.nf
\fBramdisk@0:\fIdiskname\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B ramdisk
driver supports numerous ramdisk devices that are created
by the system during the boot process (see
.BR boot (1M))
or during normal
system operation (see \fBramdiskadm\fR(1M) for more information).
.SH DEVICE SPECIAL FILES
.sp
.LP
Each ramdisk can be accessed either as a block device or as a raw device.
When accessed as a block device, the normal buffering mechanism is
used when reading from and writing to the device, without regard to physical
disk records. Accessing the ramdisk as a raw device enables direct
transmission between the disk and the read or write buffer. A single read or
write call usually results in a single  I/O operation, meaning that raw I/O
is more efficient when many bytes are  transmitted. You can find block files
names in
.BR /dev/ramdisk .
Raw file names are found in
.BR /dev/rramdisk .
.sp
.LP
There are no alignment or length restrictions on I/O requests to either
block or character devices.
.SH ERRORS
.sp
.ne 2
.mk
.na
.B EFAULT
.ad
.RS 10n
.rt
The argument features a bad address.
.RE

.sp
.ne 2
.mk
.na
.B EINVAL
.ad
.RS 10n
.rt
Invalid argument. EIO. An I/O error occurred.
.RE

.sp
.ne 2
.mk
.na
.B EPERM
.ad
.RS 10n
.rt
Cannot create or delete a ramdisk without write permission on
.BR /dev/ramdiskctl .
.RE

.sp
.ne 2
.mk
.na
.B ENOTTY
.ad
.RS 10n
.rt
The device does not support the requested ioctl function.
.RE

.sp
.ne 2
.mk
.na
.B ENXIO
.ad
.RS 10n
.rt
The device did not exist during opening.
.RE

.sp
.ne 2
.mk
.na
.B EBUSY
.ad
.RS 10n
.rt
Cannot exclusively open
.BR /dev/ramdiskctl .
One or more ramdisks are
still open.
.RE

.sp
.ne 2
.mk
.na
.B EEXIST
.ad
.RS 10n
.rt
A ramdisk with the indicated name already exists.
.RE

.sp
.ne 2
.mk
.na
.B EAGAIN
.ad
.RS 10n
.rt
Cannot allocate resource for ramdisk. Try again later.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B /dev/ramdisk/diskname
.ad
.sp .6
.RS 4n
Block device for ramdisk named
.IR diskname .
.RE

.sp
.ne 2
.mk
.na
.B /dev/rramdisk/diskname
.ad
.sp .6
.RS 4n
Raw device for ramdisk name
.IR diskname
.RE

.sp
.ne 2
.mk
.na
.B /kernel/drv/ramdisk
.ad
.sp .6
.RS 4n
32-bit driver
.RE

.sp
.ne 2
.mk
.na
\fB/kernel/drv/ramdisk.conf\fR
.ad
.sp .6
.RS 4n
Driver configuration file. (Do not alter).
.RE

.sp
.ne 2
.mk
.na
.B /kernel/drv/sparcv9/ramdisk
.ad
.sp .6
.RS 4n
64-bit driver
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attribute:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityEvolving
.TE

.SH SEE ALSO
.sp
.LP
.BR ramdiskadm (1M),
\fBfsck\fR(1M), \fBfstyp\fR(1M), \fBmount\fR(1M),
\fBnewfs\fR(1M), \fBdriver.conf\fR(4),
.BR filesystem (5),
.BR dkio (7I)
.SH NOTES
.sp
.LP
The percentage of available physical memory that can be allocated to
ramdisks is constrained by the variable
.BR rd_percent_physmem .
You can
tune the
.B rd_percent_physmem
variable in
.BR /etc/system .
By default,
the percentage of available physical memory that can be allocated to
ramdisks is fixed at 25%.
.sp
.LP
A ramdisk may not be the best possible use of system memory. Accordingly,
use ramdisks only when absolutely necessary.
