usr/src/man/man7d/rum.7d
'\" te
.\" Copyright (c) 2008, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH rum 7D "29 Oct 2008" "SunOS 5.11" "Devices"
.SH NAME
rum \- Ralink RT2501/RT2601/RT73USB 802.11b/g Wireless Driver
.SH DESCRIPTION
.sp
.LP
The
.B rum
.I 802.11b/g
wireless NIC driver is  a multi-threaded,
loadable, clonable,  GLDv3-based  STREAMS driver supporting the Ralink
RT2501/RT2601/RT73USB chipset-based NIC's.
.SH CONFIGURATION
.sp
.LP
The
.B rum
driver performs auto-negotiation to determine the data  rate and
mode. Supported 802.11b data rates are 1, 2,      5.5 and 11 Mbits/sec.
Supported
802.11g data rates are 1, 2, 5.5, 11, 6, 9, 12, 18, 24, 36, 48 and 54
Mbits/sec.
The \fBrum\fR driver supports only BSS  networks (also known as "ap" or
"infrastructure" networks) and "open" (or "open-system") or "shared system"
authentication.
.SH FILES
.sp
.ne 2
.mk
.na
.B /dev/rum*
.ad
.sp .6
.RS 4n
Special character device.
.RE

.sp
.ne 2
.mk
.na
.B /kernel/drv/rum
.ad
.sp .6
.RS 4n
32-bit ELF kernel module. (x86)
.RE

.sp
.ne 2
.mk
.na
.B /kernel/drv/amd64/rum
.ad
.sp .6
.RS 4n
64-bit ELF kernel module. (x86)
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for a description of the following attributes:
.sp

.sp
.TS
tab() box;
cw(0i) |cw(5.5i)
lw(0i) |lw(5.5i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Architecturex86
_
Availability SUNWrum
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
.BR dladm (1M),
.BR wificonfig (1M),
.BR attributes (5),
.BR gld (7D),
.BR dlpi (7P)
.sp
.LP
\fI802.11 - Wireless LAN  Media  Access Control and  Physical Layer
Specification\fR - IEEE, 2001
