usr/src/man/man7d/rum.7d
'\" te
.\" Copyright (c) 2008, Sun Microsystems, Inc. All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH rum 7D "29 Oct 2008" "SunOS 5.11" "Devices"
.SH NAME
rum \- Ralink RT2501/RT2601/RT73USB 802.11b/g Wireless Driver
.SH DESCRIPTION
.sp
.LP
The \fBrum\fR \fI802.11b/g\fR wireless NIC driver is  a multi-threaded,
loadable, clonable,  GLDv3-based  STREAMS driver supporting the Ralink
RT2501/RT2601/RT73USB chipset-based NIC's.
.SH CONFIGURATION
.sp
.LP
The \fBrum\fR driver performs auto-negotiation to determine the data  rate  and
mode. Supported 802.11b data rates are 1, 2,      5.5 and 11 Mbits/sec. Supported
802.11g data rates are 1, 2, 5.5, 11, 6, 9, 12, 18, 24, 36, 48 and 54 Mbits/sec.
The \fBrum\fR driver supports only BSS  networks (also known as "ap" or
"infrastructure" networks) and "open" (or "open-system") or "shared system"
authentication.
.SH FILES
.sp
.ne 2
.mk
.na
\fB/dev/rum*\fR
.ad
.sp .6
.RS 4n
Special character device.
.RE

.sp
.ne 2
.mk
.na
\fB/kernel/drv/rum\fR
.ad
.sp .6
.RS 4n
32-bit ELF kernel module. (x86)
.RE

.sp
.ne 2
.mk
.na
\fB/kernel/drv/amd64/rum\fR
.ad
.sp .6
.RS 4n
64-bit ELF kernel module. (x86)
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for a description of the following attributes:
.sp

.sp
.TS
tab() box;
cw(0i) |cw(5.5i)
lw(0i) |lw(5.5i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Architecturex86
_
Availability SUNWrum
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBdladm\fR(1M), \fBwificonfig\fR(1M), \fBattributes\fR(5), \fBgld\fR(7D),
\fBdlpi\fR(7P)
.sp
.LP
\fI802.11 - Wireless LAN  Media  Access Control and  Physical Layer
Specification\fR - IEEE, 2001
