usr/src/man/man7d/rwd.7d
'\" te
.\" Copyright (c) 2009, Sun Microsystems Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH rwd 7D "18 Jun 2009" "SunOS 5.11" "Devices"
.SH NAME
rwd \- Ralink RT2561/RT2561S/RT2661 IEEE802.11b/g wireless network driver
.SH DESCRIPTION
.sp
.LP
The rwd IEEE802.11b/g wireless network driver is a multithreaded, loadable,
clonable, GLDv3-based STREAMS driver supporting Ralink RT2561/RT2561S/RT2661
IEEE802.11b/g wireless network driver.
.SH CONFIGURATION
.sp
.LP
The
.B rwd
driver performs auto-negotiation to determine the data rate
and mode. The driver supports only BSS networks (also known as "ap" or
"infrastructure" networks) and "open"(or "open-system") or "shared system"
authentication. For wireless security,  WEP encryption, WPA-PSk, and
WPA2-PSK are currently supported. You can perform configuration and
administration tasks using the
.BR dladm (1M)and
\fBwificonfig\fR(1M)
utilities.
.SH FILES
.sp
.ne 2
.mk
.na
.B /dev/rwd
.ad
.RS 25n
.rt
Special character device
.RE

.sp
.ne 2
.mk
.na
.B /kernel/drv/rwd
.ad
.RS 25n
.rt
32-bit ELF kernel module (x86)
.RE

.sp
.ne 2
.mk
.na
.B /kernel/drv/amd64/rwd
.ad
.RS 25n
.rt
64-bit ELF kernel module (x86)
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Architecturex86
_
AvailabilitySUNWrwd
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
.BR dladm (1M),
.BR wificonfig (1M),
.BR attributes (5),
.BR gld (7D),
.BR dlpi (7P)
.sp
.LP
IEEE802.11b/g - Wireless LAN Standard - IEEE, 2003
