usr/src/man/man7d/rwn.7d
'\" te
.\" Copyright (c) 2009, Sun Microsystems, Inc. All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH rwn 7D "30 Mar 2009" "SunOS 5.11" "Devices"
.SH NAME
rwn \- Ralink RT2700/2800 IEEE802.11 a/b/g/n wireless network device
.SH DESCRIPTION
.sp
.LP
The
.B rwn
IEEE802.11 a/b/g/n wireless driver is a multi-threaded,
loadable, clonable, GLDv3-based STREAMS driver supporting Ralink
RT2700/RT2800 IEEE802.11 a/b/g/n wireless network device.
.SS "Configuration"
.sp
.LP
The
.B rwn
driver performs auto-negotiation to determine the data rate
and mode. The driver supports only BSS networks (also known as
.B ap
or
\fBinfrastructure\fR networks) and \fBopen\fR (\fBopen-system\fR) or
\fBshared system\fR authentication.
.sp
.LP
For wireless security, WEP encryption, WPA-PSK, and WPA2-PSK are currently
supported. You can perform configuration and administration tasks using the
.BR dladm (1M)
and \fBwificonfig\fR(1M) utilities.
.SH FILES
.sp
.ne 2
.mk
.na
.B /dev/rwn
.ad
.RS 25n
.rt
Special character device
.RE

.sp
.ne 2
.mk
.na
.B /kernel/drv/rwn
.ad
.RS 25n
.rt
32-bit ELF kernel module, x86
.RE

.sp
.ne 2
.mk
.na
.B /kernel/drv/amd64/rwn
.ad
.RS 25n
.rt
64-bit ELF kernel module, x86
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWiscsir, SUNWiscsiu
_
AvailabilitySUNWrwn
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
.BR dladm (1M),
\fBwificonfig\fR(1M), \fBattributes\fR(5)
.sp
.LP
.I "IEEE802.11b/g - Wireless LAN Standard - IEEE, 2003
