usr/src/man/man7d/sata.7d
'\" te
.\" Copyright (c) 2009, Sun Microsystems, Inc. All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH sata 7D "10 Sep 2009" "SunOS 5.11" "Devices"
.SH NAME
sata \- Solaris SATA framework
.SH DESCRIPTION
.sp
.LP
Serial ATA is an interconnect technology designed to replace parallel ATA
technology. It is used to connect hard drives, optical drives, removable
magnetic media devices and other peripherals to the host system. For
complete information on Serial ATA technology, visit the Serial ATA web site
at http://\fIwww.serialata.org\fR.
.sp
.LP
Up to 32 SATA devices may be plugged directly to each SATA HBA and up to 15
SATA devices may be plugged directly to each SATA port multiplier supported
by the Solaris SATA framework. The actual number of pluggable devices my be
lower, and is limited by the number of device ports on the SATA HBA or the
SATA port multiplier. The maximum data rate is either 1.5Gb/sec. or
3.0Gb/sec., depending on the capability of a SATA device, port multiplier
and SATA HBA controller.
.sp
.LP
The Solaris SATA framework adheres to the
.IR "Serial ATA 1.0a"
specification and supports SATA-2 signaling speed 3.0Gb/sec. SATA devices
that are connected to SATA HBAs controlled by a SATA framework-compliant HBA
driver are treated by the system as SCSI devices. The Solaris SCSI disk
driver (\fBsd\fR(7D)) is attached as a target driver for each device node
created by the SATA framework. You can use the \fBcfgadm\fR(1M) utility to
manage hot plugged and unplugged SATA devices.
.SH FILES
.sp
.ne 2
.mk
.na
.B /kernel/misc/sata
.ad
.RS 27n
.rt
32-bit
.B ELF
kernel module (x86).
.RE

.sp
.ne 2
.mk
.na
.B /kernel/misc/amd64/sata
.ad
.RS 27n
.rt
64-bit
.B ELF
kernel module (x86).
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attribute:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Architecturex86
_
AvailabilitySUNWckr
.TE

.SH SEE ALSO
.sp
.LP
\fBcfgadm\fR(1M), \fBprtconf\fR(1M), \fBcfgadm_sata\fR(1M),
.BR attributes (5),
.BR ahci (7D),
.BR marvell88sx (7D),
.BR nv_sata (7D),
.BR sd (7D),
.BR si3124 (7D)
.sp
.LP
\fISerial ATA 1.0a Specification\fR \(em Serial ATA International
Organization.
.sp
.LP
\fISerial ATA II (Extension to Serial ATA 1.0.a.)\fR \(em Serial ATA
International Organization.
.sp
.LP
.I http://www.sun.com/
.SH DIAGNOSTICS
.sp
.LP
The messages described below may appear on the system console as well as
being logged. All messages are presented in one of the following formats and
are followed by the diagnostic message:
.sp
.in +2
.nf
sata: WARNING: <\fBcontroller/devices/.. path\fR>:
.fi
.in -2
.sp

.sp
.LP
or:
.sp
.in +2
.nf
sata: NOTICE: <\fBcontroller/devices/.. path\fR>:
.fi
.in -2
.sp

.sp
.LP
\&.\|.\|.where <\fBcontroller/devices/.. path\fR> identifies a specific SATA
HBA issuing a diagnostic message shown below.
.sp
.ne 2
.mk
.na
.B SATA port X: link lost.
.ad
.sp .6
.RS 4n
Communication (via serial link) between the HBA and the device plugged to
the specified SATA device port has been lost.
.RE

.sp
.ne 2
.mk
.na
.B SATA port X: link established.
.ad
.sp .6
.RS 4n
Communication (via serial link) between the HBA and the device plugged to
the specified SATA device port has been established.
.RE

.sp
.ne 2
.mk
.na
.B SATA port X: device reset.
.ad
.sp .6
.RS 4n
The device plugged to the specified SATA device port has been reset. The
reset may be due to a communication or command error, command timeout, or an
explicit request from the host.
.RE

.sp
.ne 2
.mk
.na
\fBSATA port X failed.\fR
.ad
.sp .6
.RS 4n
The specified SATA device port failed and is in an unusable state. You can
change the port state by deactivating the port and activating it again using
cfgadm SATA hardware-specific commands (see \fBcfgadm_sata\fR(1M)).
.RE

.sp
.ne 2
.mk
.na
.B SATA port X error.
.ad
.sp .6
.RS 4n
An error was detected in specified SATA device port operations.
.RE

.sp
.ne 2
.mk
.na
.B "SATA device detached at port X.
.ad
.sp .6
.RS 4n
Communication (via serial link) between the HBA and the device plugged to
the specified SATA device port has been lost and could not be
re-established. The SATA framework assumes that the device is unplugged from
the specified SATA device port.
.RE

.sp
.ne 2
.mk
.na
.B "SATA device detected at port X.
.ad
.sp .6
.RS 4n
Communication( via serial link) between the HBA and the device plugged to
the specified empty SATA device port has been established. The SATA
framework assumes that the new device is plugged to the specified SATA
device port.
.RE

.sp
.ne 2
.mk
.na
.B "SATA disk device at port X.
.ad
.sp .6
.RS 4n
This message is followed by a disk description specifying the disk vendor,
serial number, firmware revision number and the disk capabilities.
.RE

.sp
.ne 2
.mk
.na
.B "SATA CD/DVD (ATAPI) device at port X.
.ad
.sp .6
.RS 4n
This message is followed by a SATA CD/DVD description specifying the DVD
vendor, serial number, firmware revision number and the DVD capabilities.
.RE

.sp
.ne 2
.mk
.na
\fBSATA device at port X cannot be configured. Application(s) accessing
previously attached device have to release it before newly inserted device
can be made accessible.\fR
.ad
.sp .6
.RS 4n
The port cannot be configured because there is application using the
previous attached device, so the application must release it, then the newly
inserted device can be configured.
.RE

.sp
.ne 2
.mk
.na
\fBApplication(s) accessing previously attached SATA device have to release
it before newly inserted device can be made accessible.\fR
.ad
.sp .6
.RS 4n
The target node remained and it belongs to a previously attached device.
This happens when the file was open or the node was waiting for resources at
the time the associated device was removed. Instruct event daemon to retry
the cleanup later.
.RE

.sp
.ne 2
.mk
.na
\fBsata: error recovery request for non-attached device at cport X.\fR
.ad
.sp .6
.RS 4n
When error recovery is requested, the device is not yet attached.
.RE

.sp
.ne 2
.mk
.na
.B "SATA device at port X is not power-managed.
.ad
.sp .6
.RS 4n
When property
.B pm-capable
on the target device node setting fails, the
SATA device won't be power-managed.
.RE

.sp
.ne 2
.mk
.na
.B "SATA disk device at port X does not support LBA.
.ad
.sp .6
.RS 4n
The disk device plugged into specified SATA device port does not support
LBA addressing and cannot be used.
.RE

.sp
.ne 2
.mk
.na
\fBCannot identify SATA device at port X - device is attached.\fR
.ad
.sp .6
.RS 4n
IDENTIFY (PACKET) DEVICE data cannot be retrieved successfully after the
device is attached to the SATA port.
.RE

.sp
.ne 2
.mk
.na
\fBsata: <HBA driver name><instance number>:hba attached failed.\fR
.ad
.sp .6
.RS 4n
The SATA HBA instance attach operation failed. This HBA instance cannot be
configured and is not available.
.RE

.sp
.ne 2
.mk
.na
.B "sata: invalid ATAPI cdb length<command cdb length>.
.ad
.sp .6
.RS 4n
The length of the command cdb is greater than that the device can
support.
.RE

.sp
.ne 2
.mk
.na
\fBsata: invalid sata_hba_tran version X for driver <HBA driver name>.\fR
.ad
.sp .6
.RS 4n
The specified SATA HBA driver and the SATA framework are incompatible. The
driver cannot attach and SATA HBAs controlled by this driver (and devices
plugged to this SATA HBA ports) are not available.
.RE

.sp
.ne 2
.mk
.na
\fBsata_hba_attach: cannot create SATA attachment point for port X.\fR
.ad
.sp .6
.RS 4n
The specified SATA device port cannot be configured in the system and a
device plugged to this port could not be not be configured and used.
.RE

.sp
.ne 2
.mk
.na
\fBsata_create_target_node: cannot create target node for device at port
X.\fR
.ad
.sp .6
.RS 4n
The device target node for the device plugged to the specified SATA device
port could not be created. As a result, the device cannot be configured and
used.
.RE

