usr/src/man/man7d/scsa1394.7d
'\" te
.\" Copyright (c) 2005 Sun Microsystems, Inc. All Rights Reserved.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH scsa1394 7D "2 Mar 2007" "SunOS 5.11" "Devices"
.SH NAME
scsa1394 \- SCSI to 1394 bridge driver
.SH SYNOPSIS
.LP
.nf
\fBunit@GUID\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B scsa1394
driver is a 1394 target and an SCSA HBA driver that
supports 1394 mass storage devices compliant with the \fISerial Bus Protocol
2 (SBP-2\fR) specification. It supports both bus-powered and self-powered
1394 mass storage devices.
.sp
.LP
The
.B scsa1394
nexus driver maps SCSA target driver requests to SBP-2
Operation Request Blocks (\fBORB\fR's).
.sp
.LP
The
.B scsa1394
driver creates a child device info node for each logical
unit (LUN) on the mass storage device. The standard Solaris SCSI disk driver
is attached to those nodes. Refer to
.BR sd (7D).
.sp
.LP
This driver supports multiple LUN devices and creates a separate child
device info node for each LUN. All child LUN nodes attach to
.BR sd (7D).
.sp
.LP
In previous releases, all 1394 mass storage devices were treated as
removable media devices and managed by
.BR rmformat (1)
and volume
management software. In the current release, however, only mass storage
devices with a removable bit (RMB) value of
.B 1
are removable. (The RMB
is part of the device's SCSI INQUIRY data.) See SCSI specifications T10/995D
Revision 11a, T10/1236-D Revision 20 or T10/1416-D Revision 23 for more
information. However, for backward compatibility, all 1394 mass storage
devices can still be managed by
.BR rmformat (1).
With or without a volume
manager, you can mount, eject, hot remove and hot insert a  1394 mass
storage device as the following sections explain.
.SH USING VOLUME MANAGEMENT
.sp
.LP
Mass storage devices are managed by a volume manager. Software that manages
removable media creates a device nickname that can be listed with
.BR eject (1)
or
.BR rmmount (1).
A device that is not mounted
automatically can be mounted using
.BR rmmount (1)
under
\fB/rmdisk/\fIlabel\fR. Note that the \fBmount\fR(1M) and \fBmount\fR(1M)
commands do not accept nicknames; you must use explicit device names with
these commands.
.sp
.LP
See
.BR rmmount (1)
to unmount the device and
.BR eject (1)
to eject the
media. If the device is ejected while it is mounted, volume management
software unmounts the device before ejecting it. It also might kill any
active applications that are accessing the device.
.sp
.LP
Volume management software is hotplug-aware and normally mounts file
systems on USB mass storage devices if the file system is recognized. Before
hot removing the USB device, use
.BR eject (1)
to unmount the file system.

.sp
.LP
You can disable the automatic mounting and unmounting of removable devices
by inserting a entry for a removable device in
.BR /etc/vfstab .
In this
entry, you must set the
.B "mount at boot"
field to
.BR no .
See
.BR vfstab (4).
See the
.I "System Administration Guide, Volume I"
and
.I "Solaris Common Desktop Environment: User's Guide
for details on how to
manage a removable device with CDE and Removable Media Manager. See
.B dtfile.1X
under CDE for information on how to use Removable Media
Manager.
.SH USING \fBmount\fR AND \fBumount\fR
.sp
.LP
Use
.BR mount "(1M) to explicitly mount the device and"
.BR umount (1M)
to
unmount the device. Use
.BR eject (1)
to eject the media. After you have
explicitly mounted a removable device, you cannot use a nickname as an
argument to
.BR eject .
.sp
.LP
Removing the storage device while it is being accessed or mounted fails
with a console warning. To hot remove the storage device from the system,
unmount the file system, then kill all applications accessing the device.
Next, hot remove the device. A storage device can be hot inserted at any
time.
.sp
.LP
For a comprehensive listing of (non-bootable) 1394 mass-storage devices
that are compatible with this driver, see
.BR www.sun.com/io .
.SH DEVICE SPECIAL FILES
.sp
.LP
Block special file names are located in
.BR /dev/dsk .
Raw file names are
located in
.BR /dev/rdsk .
Input/output requests to the devices must follow
the same restrictions as those for SCSI disks. Refer to
.BR sd (7D).
.SH IOCTLS
.sp
.LP
Refer to
.BR cdio "(7I) and"
.BR dkio (7I).
.SH ERRORS
.sp
.LP
Refer to
.BR sd (7D).
.SH FILES
.sp
.LP
The device special files for the 1394 mass storage device are created like
those for a SCSI disk. Refer to
.BR sd (7D).
.sp
.ne 2
.mk
.na
\fB/dev/dsk/c\fIn\fRt\fIn\fRd\fIn\fRs\fIn\fR
.ad
.sp .6
.RS 4n
Block files
.RE

.sp
.ne 2
.mk
.na
\fB/dev/rdsk/c\fIn\fRt\fIn\fRd\fIn\fRs\fIn\fR
.ad
.sp .6
.RS 4n
Raw files
.RE

.sp
.ne 2
.mk
.na
.B /vol/dev/aliases/rmdisk0
.ad
.sp .6
.RS 4n
Symbolic link to the character device for the media in removable drive 0.
This is a generic removable media device.
.RE

.sp
.ne 2
.mk
.na
.B /kernel/drv/scsa1394
.ad
.sp .6
.RS 4n
32-bit x86 ELF kernel module
.RE

.sp
.ne 2
.mk
.na
.B /kernel/drv/amd64/scsa1394
.ad
.sp .6
.RS 4n
64-bit x86 ELF kernel module
.RE

.sp
.ne 2
.mk
.na
.B /kernel/drv/sparcv9/scsa1394
.ad
.sp .6
.RS 4n
64-bit SPARC ELF kernel module
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for a description of the following attributes:
.sp

.sp
.TS
tab() box;
lw(2.75i) |lw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE	VALUE
_
ArchitectureSPARC, x86, PCI-based systems
_
AvailabilitySUNWscsa1394
.TE

.SH SEE ALSO
.sp
.LP
.BR cdrw (1),
.BR eject (1),
.BR rmformat (1),
.BR rmmount (1),
.BR cfgadm_scsi (1M),
.BR fdisk (1M),
.BR mount (1M),
.BR umount (1M),
.B dtfile.1X
(in CDE man pages),
.BR scsi (4),
.BR vfstab (4),
.BR attributes (5),
.BR hci1394 (7D),
.BR sd (7D),
.BR pcfs (7FS),
.BR cdio (7I),
.BR dkio (7I)
.sp
.LP
.I "IEEE Std 1394-1995 Standard for a High Performance Serial Bus
.sp
.LP
.I "ANSI NCITS 325-1998 - Serial Bus Protocol 2 (SBP-2)
.sp
.LP
.I "System Administration Guide: Devices and File Systems
.sp
.LP
SCSI Specification
.I "T10/995D Revision 11a"
\(em March 1997
.sp
.LP
SCSI Specification\fIT10/1236-D Revision 20\fR \(em July 2001
.sp
.LP
SCSI Specification\fIT10/1416-D Revision 23\fR\(em May 2005
.sp
.LP
.I "Solaris Common Desktop Environment: User's Guide
.sp
.LP
.I http://www.sun.com/io
