usr/src/man/man7d/sd.7d
'\" te
.\" Copyright (c) 2009 Sun Microsystems, Inc.  All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH sd 7D "8 Sep 2009" "SunOS 5.11" "Devices"
.SH NAME
sd \- SCSI disk and ATAPI/SCSI CD-ROM device driver
.SH SYNOPSIS
.LP
.nf
\fBsd@target,lun:partition\fR
.fi

.SH DESCRIPTION
.sp
.LP
To open a device without checking if the vtoc is valid, use the O_NDELAY
flag. When the device is opened using O_NDELAY, the first read or write to the
device that happens after the open results in the label being read if the
label is not currently valid. Once read, the label remains valid until the
last close of the device. Except for reading the label, O_NDELAY has no impact
on the driver.
.SS "SPARC"
.sp
.LP
The
.B "sd SCSI"
and
.B SCSI/ATAPI
driver supports embedded
\fBSCSI\fR-2 and \fBCCS\fR-compatible
.B SCSI
disk and CD-ROM drives,
.B ATAPI
2.6 (SFF-8020i)-compliant CD-ROM drives, SFF-8090-compliant
.B SCSI/ATAPI
DVD-ROM drives, IOMEGA
.B SCSI/ATAPI
ZIP drives, \fBSCSI JAZ\fR drives, and USB mass storage devices (refer to
.BR scsa2usb (7D)).
.sp
.LP
To determine the disk drive type, use the
.B SCSI/ATAPI
inquiry command
and read the volume label stored on block 0 of the drive. (The volume label
describes the disk geometry and partitioning and must be present for the disk
to be mounted by the system.) A volume label is not required for removable,
re-writable or read-only media.
.SS "x86 Only"
.sp
.LP
The
.BR sd driver
supports embedded \fBSCSI\fR-2 and \fBCCS\fR-compatible
.B SCSI
disk and CD-ROM drives,
.B ATAPI
2.6 (SFF-8020i)-compliant
CD-ROM drives, SFF-8090-compliant
.B SCSI/ATAPI
DVD-ROM drives, IOMEGA
.B SCSI/ATAPI
ZIP drives\fB, and SCSI JAZ\fR drives.
.sp
.LP
The x86 BIOS legacy requires a master boot record (MBR) and
.B fdisk
table
in the first physical sector of the bootable media. If the x86 hard disk
contains a Solaris disk label, it is located in the second 512-byte sector of
the FDISK partition.
.SH DEVICE SPECIAL FILES
.sp
.LP
Block-files access the disk using normal buffering mechanism and are
read-from and written-to without regard to physical disk records. A
.B raw
interface enables direct transmission between the disk and the user's read or
write buffer. A single
.B read
or
.B write
call usually results in a
single I/O operation, therefore raw I/O is more efficient when many bytes are
transmitted. Block files names are found in
.BR /dev/dsk ;
raw file names are
found in
.BR /dev/rdsk .
.sp
.LP
I/O requests to the raw device must be aligned on a 512-byte
.RB ( DEV_BSIZE )
boundary and all I/O request lengths must be in multiples of
512 bytes. Requests that do not meet these requirements will trigger an
.B EINVAL
error. There are no alignment or length restrictions on I/O
requests to the block device.
.SH CD-ROM DRIVE SUPPORT
.sp
.LP
A CD-ROM disk is single-sided and contains approximately 640 megabytes of
data or 74 minutes of audio. When the CD-ROM is opened, the eject button is
disabled to prevent manual removal of the disk until the last
.B close()
is
called. No volume label is required for a CD-ROM. The disk geometry and
partitioning information are constant and never change. If the CD-ROM contains
data recorded in a Solaris-aware file system format, it can be mounted using
the appropriate Solaris file system support.
.SH DVD-ROM DRIVE SUPPORT
.sp
.LP
DVD-ROM media can be single or double-sided and can be recorded upon using a
single or double layer structure. Double-layer media provides parallel or
opposite track paths. A DVD-ROM can hold from between 4.5 Gbytes and 17 Gbytes
of data, depending on the layer structure used for recording and if the
DVD-ROM is single or double-sided.
.sp
.LP
When the DVD-ROM is opened, the eject button is disabled to prevent the
manual removal of a disk until the last
.B close()
is called. No volume
label is required for a DVD-ROM. If the DVD-ROM contains data recorded in a
Solaris-aware file system format, it can be mounted using the appropriate
Solaris file system support.
.SH ZIP/JAZ DRIVE SUPPORT
.sp
.LP
.B ZIP/JAZ
media provide varied data capacity points; a single \fBJAZ \fRdrive can store up to 2 GBytes of data, while a ZIP-250 can store up to
250MBytes of data.
.B ZIP/JAZ
drives can be read-from or written-to using
the appropriate drive.
.sp
.LP
When a
.B ZIP/JAZ
drive is opened, the eject button is disabled to prevent
the manual removal of a disk until the last
.B close()
is called. No volume
label is required for a
.B ZIP/JAZ
drive. If the
.B ZIP/JAZ
drive
contains data recorded in a Solaris-aware file system format, it can be
mounted using the appropriate Solaris file system support.
.SH DEVICE STATISTICS SUPPORT
.sp
.LP
Each device maintains I/O statistics for the device and for partitions
allocated for that device. For each device/partition, the driver accumulates
reads, writes, bytes read, and bytes written. The driver also initiates
hi-resolution time stamps at queue entry and exit points to enable monitoring
of residence time and cumulative residence-length product for each queue.
.sp
.LP
Not all device drivers make per-partition IO statistics available for
reporting.
.B sd
and
.BR ssd "(7D) per-partition statistics are enabled by"
default but may disabled in their configuration files.
.SH IOCTLS
.sp
.LP
Refer to
.BR dkio "(7I), and"
.BR cdio (7I)
.SS "ERRORS"
.sp
.ne 2
.mk
.na
.B EACCES
.ad
.RS 10n
.rt
Permission denied
.RE

.sp
.ne 2
.mk
.na
.B EBUSY
.ad
.RS 10n
.rt
The partition was opened exclusively by another thread
.RE

.sp
.ne 2
.mk
.na
.B EFAULT
.ad
.RS 10n
.rt
The argument features a bad address
.RE

.sp
.ne 2
.mk
.na
.B EINVAL
.ad
.RS 10n
.rt
Invalid argument
.RE

.sp
.ne 2
.mk
.na
.B ENOTTY
.ad
.RS 10n
.rt
The device does not support the requested ioctl function
.RE

.sp
.ne 2
.mk
.na
.B ENXIO
.ad
.RS 10n
.rt
During opening, the device did not exist. During close, the drive unlock
failed
.RE

.sp
.ne 2
.mk
.na
.B EROFS
.ad
.RS 10n
.rt
The device is read-only
.RE

.sp
.ne 2
.mk
.na
.B EAGAIN
.ad
.RS 10n
.rt
Resource temporarily unavailable
.RE

.sp
.ne 2
.mk
.na
.B EINTR
.ad
.RS 10n
.rt
A signal was caught during the execution of the
.B ioctl()
function
.RE

.sp
.ne 2
.mk
.na
.B ENOMEM
.ad
.RS 10n
.rt
Insufficient memory
.RE

.sp
.ne 2
.mk
.na
.B EPERM
.ad
.RS 10n
.rt
Insufficent access permission
.RE

.sp
.ne 2
.mk
.na
.B EIO
.ad
.RS 10n
.rt
An I/O error occurred. Refer to notes for details on copy-protected DVD-ROM
media.
.RE

.SH CONFIGURATION
.sp
.LP
The
.B sd
driver can be configured by defining properties in the
.B sd.conf
file. The
.B sd
driver supports the following properties:
.sp
.ne 2
.mk
.na
.B enable-partition-kstats
.ad
.RS 27n
.rt
The default value is 1, which causes partition IO statistics to be
maintained. Set this value to zero to prevent the driver from recording
partition statistics. This slightly reduces the CPU overhead for IO, mimimizes
the amount of
.BR sar (1)
data collected and makes these statistics
unavailable for reporting by
.BR iostat "(1M) even though the"
\fB-p\fR/\fB-P\fR option is specified. Regardless of this setting, disk IO
statistics are always maintained.
.RE

.sp
.ne 2
.mk
.na
.B qfull-retries
.ad
.RS 27n
.rt
The supplied value is passed as the
.B qfull-retries
capability value of
the HBA driver. See
.BR scsi_ifsetcap (9F)
for details.
.RE

.sp
.ne 2
.mk
.na
.B qfull-retry-interval
.ad
.RS 27n
.rt
The supplied value is passed as the
.B "qfull-retry interval"
capability
value of the HBA driver. See
.BR scsi_ifsetcap (9F)
for details.
.RE

.sp
.ne 2
.mk
.na
.B allow-bus-device-reset
.ad
.RS 27n
.rt
The default value is 1, which allows resetting to occur. Set this value to
.B 0
(zero) to prevent the
.B sd
driver from calling
.BR scsi_reset (9F)
with a second argument of
.B RESET_TARGET
when in
error-recovery mode. This
.BR scsi_reset (9F)
call may prompt the HBA driver
to send a SCSI Bus Device Reset message. The
.BR scsi_reset (9F)
call with a
second argument of
.B RESET_TARGET
may result from an explicit request via
the
.BR "USCSICMD ioctl" .
Some high-availability multi-initiator systems
may wish to prohibit the Bus Device Reset message; to do this, set the
.B allow-bus-device-reset
property to
.BR 0 .
.RE

.sp
.ne 2
.mk
.na
.B optical-device-bind
.ad
.RS 27n
.rt
Controls the binding of the driver to non self-identifying SCSI target
optical devices. (See
.BR scsi (4)).
The default value is 1, which causes
.B sd
to bind to DTYPE_OPTICAL devices (as noted in
.BR scsi (4)).
Setting this value to 0 prevents automatic binding. The default behavior for
the SPARC-based
.B sd
driver prior to Solaris 9 was not to bind to optical
devices.
.RE

.sp
.ne 2
.mk
.na
.B power-condition
.ad
.RS 27n
.rt
Boolean type, when set to
.BR False ,
it indicates that the disk does not
support
.B "power condition"
field in th\fBe START STOP UNIT\fR command.
.RE

.sp
.LP
In addition to the above properties, some device-specific tunables can be
configured in
.BR sd.conf " using the "
.B sd-config-list
global property.
The value of this property is a list of duplets. The formal syntax is:
.sp
.in +2
.nf
sd-config-list = <duplet> [, <duplet> ]* ;

where

<duplet>:= "<vid+pid>" , "<tunable-list>"

and

<tunable-list>:= <tunable>  [, <tunable> ]*;
<tunable> = <name> : <value>

The <vid+pid> is the string that is returned by the target device
on a SCSI inquiry command.

The <tunable-list> contains one or more tunables to apply to
all target devices with the specified <vid+pid>.

Each <tunable> is a <name> : <value> pair. Supported
tunable names are:

   delay-busy: when busy, nsecs of delay before retry.

   retries-timeout: retries to perform on an IO timeout.
.fi
.in -2

.sp
.ne 2
.mk
.na
.B mmc-gesn-polling
.ad
.RS 20n
.rt
For optical drives compliant with
.B MMC-3
and supporting the \fBGET EVENT STATUS NOTIFICATION\fR command, this command is used for periodic media state
polling, usually initiated by the
.BR "DKIOCSTATE dkio" (7I)
ioctl. To
disable the use of this command, set this boolean property to
.BR false .
In
that case, either the
.B "TEST UNIT READY"
.RB "or zero-length" " WRITE(10)"
command is used instead.
.RE

.SH EXAMPLES
.sp
.in +2
.nf
The following is an example of a global sd-config-list property:

   sd-config-list =
      "SUN     T4", "delay-busy:600, retries-timeout:6",
      "SUN     StorEdge_3510", "retries-timeout:3";
.fi
.in -2

.SH FILES
.sp
.ne 2
.mk
.na
.B /kernel/drv/sd.conf
.ad
.RS 23n
.rt
Driver configuration file
.RE

.sp
.ne 2
.mk
.na
.B /dev/dsk/cntndnsn
.ad
.RS 23n
.rt
Block files
.RE

.sp
.ne 2
.mk
.na
.B /dev/rdsk/cntndnsn
.ad
.RS 23n
.rt
Raw files
.RE

.sp
.LP
Where:
.sp
.ne 2
.mk
.na
.B cn
.ad
.RS 6n
.rt
controller n
.RE

.sp
.ne 2
.mk
.na
.B tn
.ad
.RS 6n
.rt
SCSI target id n (0-6)
.RE

.sp
.ne 2
.mk
.na
.B dn
.ad
.RS 6n
.rt
SCSI LUN n (0-7 normally; some HBAs support LUNs to 15 or 32. See the
specific manpage for details)
.RE

.sp
.ne 2
.mk
.na
.B sn
.ad
.RS 6n
.rt
partition n (0-7)
.RE

.SS "x86 Only"
.sp
.ne 2
.mk
.na
.B /dev/rdsk/cntndnpn
.ad
.RS 22n
.rt
raw files
.RE

.sp
.LP
Where:
.sp
.ne 2
.mk
.na
.B pn
.ad
.RS 6n
.rt
Where
.IR n "=0 the node corresponds to the entire disk."
.RE

.SH SEE ALSO
.sp
.LP
.BR sar (1),
.BR cfgadm_scsi (1M),
.BR fdisk (1M),
.BR format (1M),
.BR iostat (1M),
.BR close (2),
.BR ioctl (2),
.BR lseek (2),
.BR read (2),
.BR write (2),
.BR driver.conf (4),
.BR scsi (4),
.BR filesystem (5),
.BR scsa2usb (7D),
.BR ssd (7D),
.BR hsfs (7FS),
.BR pcfs (7FS),
.BR udfs (7FS),
.BR cdio (7I),
.BR dkio (7I),
.BR scsi_ifsetcap (9F),
.BR scsi_reset (9F)
.sp
.LP
.I "ANSI Small Computer System Interface-2 (SCSI-2)
.sp
.LP
.I "ATA Packet Interface for CD-ROMs, SFF-8020i
.sp
.LP
.I "Mt.Fuji Commands for CD and DVD, SFF8090v3
.sp
.LP
http://\fIwww.sun.com/io\fR
.SH DIAGNOSTICS
.sp
.in +2
.nf
Error for Command:\fI<command name>\fR
Error Level: Fatal
Requested Block: \fI<n>\fR
Error  Block: \fI<m>\fR
Vendor:'\fI<vendorname>\fR\&'
Serial Number:'\fI<serial number>\fR\&'
Sense Key:\fI<sense key name>\fR
.fi
.in -2
.sp

.sp
.ne 2
.mk
.na
.B "ASC: 0x<a> (<ASC name>), ASCQ: 0x<b>, FRU: 0x<c>
.ad
.sp .6
.RS 4n
The command indicated by <command name> failed. The Requested Block is the
block where the transfer started and the Error Block is the block that caused
the error. Sense Key,
.BR ASC ,
and
.B ASCQ
information is returned by the
target in response to a request sense command.
.RE

.sp
.ne 2
.mk
.na
.B Caddy not inserted in drive
.ad
.sp .6
.RS 4n
The drive is not ready because no caddy has been inserted.
.RE

.sp
.ne 2
.mk
.na
.B Check Condition on REQUEST SENSE
.ad
.sp .6
.RS 4n
A REQUEST SENSE command completed with a check condition. The original
command will be retried a number of times.
.RE

.sp
.ne 2
.mk
.na
.B "Label says <m> blocks Drive says <n> blocks
.ad
.sp .6
.RS 4n
There is a discrepancy between the label and what the drive returned on the
.B READ CAPACITY
command.
.RE

.sp
.ne 2
.mk
.na
.B Not enough sense information
.ad
.sp .6
.RS 4n
The request sense data was less than expected.
.RE

.sp
.ne 2
.mk
.na
.B "Request Sense couldn't get sense data
.ad
.sp .6
.RS 4n
The
.B "REQUEST SENSE"
command did not transfer any data.
.RE

.sp
.ne 2
.mk
.na
.B Reservation Conflict
.ad
.sp .6
.RS 4n
The drive was reserved by another initiator.
.RE

.sp
.ne 2
.mk
.na
\fBSCSI transport failed: reason \&'xxxx'\fR: {retrying|giving up}\fR
.ad
.sp .6
.RS 4n
The host adapter has failed to transport a command to the target for the
reason stated. The driver will either retry the command or, ultimately, give
up.
.RE

.sp
.ne 2
.mk
.na
\fBUnhandled Sense Key<\fIn\fR>\fR
.ad
.sp .6
.RS 4n
The REQUEST SENSE data included an invalid sense.
.RE

.sp
.ne 2
.mk
.na
.B "Unit not ready. Additional sense code 0x
.ad
.sp .6
.RS 4n
.I <n>
The drive is not ready.
.RE

.sp
.ne 2
.mk
.na
.B "Can't do switch back to mode 1
.ad
.sp .6
.RS 4n
A failure to switch back to read mode 1.
.RE

.sp
.ne 2
.mk
.na
.B Corrupt label - bad geometry
.ad
.sp .6
.RS 4n
The disk label is corrupted.
.RE

.sp
.ne 2
.mk
.na
.B "Corrupt label - label checksum failed
.ad
.sp .6
.RS 4n
The disk label is corrupted.
.RE

.sp
.ne 2
.mk
.na
.B "Corrupt label - wrong magic number
.ad
.sp .6
.RS 4n
The disk label is corrupted.
.RE

.sp
.ne 2
.mk
.na
.B Device busy too long
.ad
.sp .6
.RS 4n
The drive returned busy during a number of retries.
.RE

.sp
.ne 2
.mk
.na
.B Disk not responding to selection
.ad
.sp .6
.RS 4n
The drive is powered down or died
.RE

.sp
.ne 2
.mk
.na
.B Failed to handle UA
.ad
.sp .6
.RS 4n
A retry on a Unit Attention condition failed.
.RE

.sp
.ne 2
.mk
.na
.B I/O to invalid geometry
.ad
.sp .6
.RS 4n
The geometry of the drive could not be established.
.RE

.sp
.ne 2
.mk
.na
.B Incomplete read/write - retrying/giving up
.ad
.sp .6
.RS 4n
There was a residue after the command completed normally.
.RE

.sp
.ne 2
.mk
.na
.B "No bp for direct access device format geometry
.ad
.sp .6
.RS 4n
A bp with consistent memory could not be allocated.
.RE

.sp
.ne 2
.mk
.na
.B No bp for disk label
.ad
.sp .6
.RS 4n
A bp with consistent memory could not be allocated.
.RE

.sp
.ne 2
.mk
.na
.B No bp for fdisk
.ad
.sp .6
.RS 4n
A bp with consistent memory could not be allocated.
.RE

.sp
.ne 2
.mk
.na
.B "No bp for rigid disk geometry
.ad
.sp .6
.RS 4n
A bp with consistent memory could not be allocated.
.RE

.sp
.ne 2
.mk
.na
.B No mem for property
.ad
.sp .6
.RS 4n
Free memory pool exhausted.
.RE

.sp
.ne 2
.mk
.na
.B "No memory for direct access device format geometry
.ad
.sp .6
.RS 4n
Free memory pool exhausted.
.RE

.sp
.ne 2
.mk
.na
.B No memory for disk label
.ad
.sp .6
.RS 4n
Free memory pool exhausted.
.RE

.sp
.ne 2
.mk
.na
.B "No memory for rigid disk geometry
.ad
.sp .6
.RS 4n
The disk label is corrupted.
.RE

.sp
.ne 2
.mk
.na
.B No resources for dumping
.ad
.sp .6
.RS 4n
A packet could not be allocated during dumping.
.RE

.sp
.ne 2
.mk
.na
.B Offline
.ad
.sp .6
.RS 4n
Drive went offline; probably powered down.
.RE

.sp
.ne 2
.mk
.na
.B Requeue of command fails
.ad
.sp .6
.RS 4n
Driver attempted to retry a command and experienced a transport error.
.RE

.sp
.ne 2
.mk
.na
.B sdrestart transport failed()
.ad
.sp .6
.RS 4n
Driver attempted to retry a command and experienced a transport error.
.RE

.sp
.ne 2
.mk
.na
.B Transfer length not modulo
.ad
.sp .6
.RS 4n
Illegal request size.
.RE

.sp
.ne 2
.mk
.na
.B Transport of request sense fails()
.ad
.sp .6
.RS 4n
Driver attempted to submit a request sense command and failed.
.RE

.sp
.ne 2
.mk
.na
.B Transport rejected()
.ad
.sp .6
.RS 4n
Host adapter driver was unable to accept a command.
.RE

.sp
.ne 2
.mk
.na
.B Unable to read label
.ad
.sp .6
.RS 4n
Failure to read disk label.
.RE

.sp
.ne 2
.mk
.na
.B "Unit does not respond to selection
.ad
.sp .6
.RS 4n
Drive went offline; probably powered down.
.RE

.SH NOTES
.sp
.LP
DVD-ROM media containing DVD-Video data may follow/adhere to the requirements
of content scrambling system or copy protection scheme. Reading of
copy-protected sector will cause I/O error. Users are advised to use the
appropriate playback software to view video contents on DVD-ROM media
containing DVD-Video data.
