usr/src/man/man7d/ses.7d
'\" te
.\" Copyright (c) 20081 Sun Microsystems. Inc.  All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ses 7D "27 May 2008" "SunOS 5.11" "Devices"
.SH NAME
ses \- SCSI enclosure services device driver
.SH SYNOPSIS
.LP
.nf
\fBses\fI@target\fB,\fIlun\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B ses
device driver is an interface to
.B SCSI
enclosure
services devices. These devices sense and monitor the physical conditions in
an enclosure as well as allow access to the status reporting and
configuration features of the enclosure (such as indicator
.B LEDs
on the
enclosure.)
.sp
.LP
.BR ioctl (9E)
calls may be issued to
.B ses
to determine the state of
the enclosure and to set parameters on the enclosure services device.
.sp
.LP
No
.B ses
driver properties are defined. Use the
.B ses.conf
file to
configure the
.B ses
driver.
.SH EXAMPLES
.LP
.B Example 1 ses.conf
File Format
.sp
.LP
The following is an example of the
.B ses.conf
file format:

.sp
.in +2
.nf
#
# Copyright (c) 1996, by Sun Microsystems, Inc.
# All rights reserved.
#
#
#ident "@(#)ses.conf 1.1    97/02/10 SMI"
#

name="ses" parent="sf"
      target=15;

name="ses" parent="SUNW,pln" port=0 target=15;
name="ses" parent="SUNW,pln" port=1 target=15;
name="ses" parent="SUNW,pln" port=2 target=15;
name="ses" parent="SUNW,pln" port=3 target=15;
name="ses" parent="SUNW,pln" port=4 target=15;
name="ses" parent="SUNW,pln" port=5 target=15;

name="ses" class="scsi"
      target=15 lun=0;
.fi
.in -2

.SH IOCTLS
.sp
.LP
The SES driver currently supports the SES, SAFTE and SEN enclosure service
chipsets. SEN and SAFTE protocols are translated internally in the driver
into SES compliant data structures. This enables the SES driver to work
seamlessly with  different protocols and eliminates the need to enhance user
applications.
.sp
.ne 2
.mk
.na
.B SESIOC_GETNOBJ
.ad
.RS 21n
.rt
Returns an unsigned integer that represents the number of SES data
structures in the enclosure services chip.
.RE

.sp
.ne 2
.mk
.na
.B SESIOC_GETOBJMAP
.ad
.RS 21n
.rt
Returns a size array containing
.B ses_object
elements communicated
through
.BR SESIOC_GETNOBJ() .
.B ses_object
is defined in
.BR sesio.h .
.RE

.sp
.ne 2
.mk
.na
.B SESIOC_INIT
.ad
.RS 21n
.rt
Instructs the device to perform a self-diagnostic test. Currently SES & SEN
devices always return success.
.RE

.sp
.ne 2
.mk
.na
.B SESIOC_GETENCSTAT
.ad
.RS 21n
.rt
Returns an unsigned character that represents status enclosure as defined
by Table 25 in Section 7.1.2 of the SES specification \fINCITS 305-199\fIx\fR.
.RE

.sp
.ne 2
.mk
.na
.B SESIOC_GETOBJSTAT
.ad
.RS 21n
.rt
This ioctl is passed an
.B ses_objarg
containing the
.B obj_id
you
want to set, then fills in the remaining fields according to element status
page of the SES specification.
.RE

.sp
.ne 2
.mk
.na
.B SESIOC_SETOBJSTAT
.ad
.RS 21n
.rt
Sets options in the control field. You set control field options by filling
out all fields in
.BR ses_objarg .
Field definitions are presented in
Section 7.2.2 of the SES specification.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B /kernel/drv/ses.conf
.ad
.RS 24n
.rt
Driver configuration file
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
ArchitectureSPARC
.TE

.SH SEE ALSO
.sp
.LP
.BR driver.conf (4),
.BR scsi (4),
.BR attributes (5),
.BR esp (7D),
.BR isp (7D),
.BR ioctl (9E)
