usr/src/man/man7d/sf.7d
'\" te
.\" Copyright (c) 1997, Sun Microsystems, Inc.  All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH sf 7D "27 Mar 1997" "SunOS 5.11" "Devices"
.SH NAME
sf \- SOC+ FC-AL FCP Driver
.SH SYNOPSIS
.LP
.nf
sf@\fIport\fR,0
.fi

.SH DESCRIPTION
.sp
.LP
The
.B sf
driver is a SCSA compliant nexus driver which supports the
Fibre Channel Protocol for SCSI on Private Fibre Channel Arbitrated loops. An
SBus card called the
.B SOC+
card (see
.BR socal (7D))
connects the
Fibre Channel loop to the host system.
.sp
.LP
The
.B sf
driver interfaces with the
.B SOC+
device driver,
.BR socal (7D),
the SCSI disk target driver,
.BR ssd (7D),
and the SCSI-3
Enclosure Services driver,  \fBses\fR(7D). It only supports SCSI devices of
type disk and ses.
.sp
.LP
The
.B sf
driver supports the standard functions provided by the SCSA
interface. The driver supports auto request sense and tagged queueing by
default.
.sp
.LP
The driver requires that all devices have unique hard addresses defined by
switch settings in hardware.  Devices with conflicting hard addresses will
not be accessible.
.SH FILES
.sp
.ne 2
.mk
.na
\fB/platform/\fIarchitecture\fR/kernel/drv/sf\fR
.ad
.sp .6
.RS 4n
ELF kernel module
.RE

.sp
.ne 2
.mk
.na
\fB/platform/\fIarchitecture\fR/kernel/drv/sf.conf\fR
.ad
.sp .6
.RS 4n
.B sf
driver configuration file
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
ArchitectureSPARC
.TE

.SH SEE ALSO
.sp
.LP
.BR luxadm (1M),
.BR prtconf (1M),
.BR driver.conf (4),
.BR socal (7D),
.BR ssd (7D)
.sp
.LP
.I Writing Device Drivers
.sp
.LP
.I "ANSI X3.272-1996, Fibre Channel Arbitrated Loop (FC-AL)
.sp
.LP
.I "ANSI X3.269-1996, Fibre Channel Protocol for SCSI (FCP)
.sp
.LP
.I "ANSI X3.270-1996, SCSI-3 Architecture Model (SAM)
.sp
.LP
.I "Fibre Channel Private Loop SCSI Direct Attach (FC-PLDA)
.SH DIAGNOSTICS
.sp
.LP
In addition to being logged, the messages below may display on the system
console.
.sp
.LP
The first set of messages indicate that the attachment was unsuccessful, and
will only display while the
.B sf
driver is initially attempting to
attach. Each message is preceded by  \fBsf\fI%d\fR , where
.I %d
is
the instance number of the
.B sf
device.
.sp
.ne 2
.mk
.na
.B Failed to alloc soft state
.ad
.sp .6
.RS 4n
Driver was unable to allocate space for the internal state structure.
Driver did not attach to device, SCSI devices will be inaccessible.
.RE

.sp
.ne 2
.mk
.na
.B Bad soft state
.ad
.sp .6
.RS 4n
Driver requested an invalid internal state structure. Driver did not attach
to device, SCSI devices will be inaccessible.
.RE

.sp
.ne 2
.mk
.na
.B Failed to obtain transport handle
.ad
.sp .6
.RS 4n
Driver was unable to obtain a transport handle to communicate with the socal
driver. Driver did not attach to device, SCSI devices will be inaccessible
.RE

.sp
.ne 2
.mk
.na
.B Failed to allocate command/response pool
.ad
.sp .6
.RS 4n
Driver was unable to allocate space for commands and responses. Driver did
not attach to device, SCSI devices will be inaccessible.
.RE

.sp
.ne 2
.mk
.na
.B Failed to allocate kmem cache
.ad
.sp .6
.RS 4n
Driver was unable to allocate space for the packet cache. Driver did not
attach to device, SCSI devices will be inaccessible.
.RE

.sp
.ne 2
.mk
.na
.B "Failed to allocate dma handle for
.ad
.sp .6
.RS 4n
Driver was unable to allocate a dma handle for the loop map. Driver did not
attach to device, SCSI devices will be inaccessible.
.RE

.sp
.ne 2
.mk
.na
.B Failed to allocate lilp map
.ad
.sp .6
.RS 4n
Driver was unable to allocate space for the loop map. Driver did not attach
to device, SCSI devices will be inaccessible.
.RE

.sp
.ne 2
.mk
.na
.B "Failed to bind dma handle for
.ad
.sp .6
.RS 4n
Driver was unable to bind a dma handle for the loop map. Driver did not
attach to device, SCSI devices will be inaccessible.
.RE

.sp
.ne 2
.mk
.na
.B Failed to attach
.ad
.sp .6
.RS 4n
Driver was unable to attach for some reason that may be printed.  Driver did
not attach to device, SCSI devices will be inaccessible.
.RE

.sp
.LP
The next set of messages may display at any time.  The full device pathname,
followed by the shorter form described above, will precede the message.
.sp
.ne 2
.mk
.na
.B Invalid lilp map
.ad
.sp .6
.RS 4n
The driver did not obtain a valid lilp map from the socal driver. SCSI
device will be inaccessible.
.RE

.sp
.ne 2
.mk
.na
.B "Target t, AL-PA x and hard
.ad
.sp .6
.RS 4n
The device with a switch setting t has an AL-PA x which does not match its
hard address y. The device will not be accessible.
.RE

.sp
.ne 2
.mk
.na
.B Duplicate switch settings
.ad
.sp .6
.RS 4n
The driver detected devices with the same switch setting. All such devices
will be inaccessible.
.RE

.sp
.ne 2
.mk
.na
.B WWN changed on target t
.ad
.sp .6
.RS 4n
The World Wide Name (WWN) has changed on the device with switch setting t.
.RE

.sp
.ne 2
.mk
.na
.B Target t, unknown device type
.ad
.sp .6
.RS 4n
The driver does not know the device type reported by the device with switch
setting t.
.RE

