usr/src/man/man7d/sgen.7d
'\" te
.\" Copyright (c) 2008 Sun Microsystems, Inc.  All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH sgen 7D "29 Mar 2008" "SunOS 5.11" "Devices"
.SH NAME
sgen \- Generic SCSI device driver
.SH SYNOPSIS
.LP
.nf
\fB#include <sys/scsi/targets/sgendef.h>\fR
.fi

.LP
.nf
\fBsgen@target,lun:<devtype>\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B sgen
driver exports the
.BR uscsi (7I)
interfaces to user
processes. The
.B sgen
driver can be configured to bind to
.BR SCSI
devices for which no system driver is available. Examples of such devices
include
.B SCSI
scanners and
.B SCSI
processor devices.
.SH SECURITY
.sp
.LP
Typically, drivers which export the
.BR uscsi (7I)
interface
unconditionally require that the user present superuser credentials. The
.B sgen
driver does not, and relies on the filesystem permissions on its
device special file to govern who may access that device. By default, access
is restricted and device nodes created by the
.B sgen
driver are readable
and writable by the superuser exclusively.
.sp
.LP
It is important to understand that
.B SCSI
devices coexisting on the
same
.B SCSI
bus may potentially interact with each other. This may
result from firmware bugs in
.B SCSI
devices, or may be made to happen
programmatically by sending appropriate
.B SCSI
commands to a device.
Potentially, any application controlling a device via the
.B sgen
driver
can introduce data integrity or security problems in that device or any
other device sharing the same
.B SCSI
bus.
.sp
.LP
Granting unprivileged users access to an
.BR sgen -controlled
.B SCSI
device may create other   problems. It may be possible for a user to
instruct a target device to gather data from another target device on the
same bus. It may also be possible for malicious users to install new
firmware onto a device to which they are granted access. In environments
where security is a concern but user access to devices controlled by the
.B sgen
driver is nontheless desired, it is recommended that the devices
be separated onto a dedicated
.B SCSI
bus to mitigate the risk of data
corruption and security violations.
.SH CONFIGURATION
.sp
.LP
The
.B sgen
driver is configurable via the
.B sgen.conf
file. In
addition to standard
.B SCSI
device configuration directives (see
.BR scsi (4)),
administrators can set several additional properties for the
.B sgen
driver.
.sp
.LP
By default, the
.B sgen
driver will not claim or bind to any devices on
the system. To do so, it must be configured by the administrator using the
.B inquiry-config-list
and/or the
.B device-type-config-list
properties.
.sp
.LP
As with other
.B SCSI
drivers, the
.B sgen.conf
configuration file
enumerates the targets
.B sgen
should use. See
.BR scsi (4)
for more
details. For each target enumerated in the
.B sgen.conf
file,  the
.B sgen
driver sends a
.B "SCSI INQUIRY"
command to gather information
about the device present at that target. The
.B inquiry-config-list
property specifies that the
.B sgen
driver should bind to a particular
device returning a particular set of inquiry data. The
.B device-type-config-list
specifies that the
.B sgen
driver should
bind to every device that is of a particular
.B SCSI
device type. When
examining the device, the
.B sgen
driver tests to see if it matches an
.RB "entry in the " device-type-config-list " or the " inquiry-config-list .
For more detail on these two properties, see the PROPERTIES section.
.sp
.LP
When a match against the
.B INQUIRY
data presented by a device is made,
the
.B sgen
driver attaches to that device and creates a device node and
link in the
.B /devices
and
.B /dev
hierarchies. See the FILES section
for more information about how these files are named.
.sp
.LP
It is important for the administrator to ensure that devices claimed by the
.B sgen
driver do not conflict with existing target drivers on the
system. For example, if the
.B sgen
driver is configured to bind to a
direct access device, the standard
.B sd.conf
file will usually cause
.B sd
to claim the device as well. This can cause unpredictable results.
In general, the
.BR uscsi (7I)
interface exported by
.BR sd (7D)
or
.BR st (7D)
should be used to gain access to direct access and sequential
devices.
.sp
.LP
The
.B sgen
driver is disabled by default. The
.B sgen.conf
file is
shipped with all of the '\fBname="sgen" class="scsi" target=.\|.\|.\fR' entries
commented out to shorten boot time and to prevent the driver from consuming
kernel resources. To use the
.B sgen
driver effectively on desktop
systems, simply uncomment all of the name="\fBsgen\fR" lines in
.B sgen.conf
file. On larger systems with many
.B SCSI
controllers,
carefully edit the
.B sgen.conf
file so that
.B sgen
binds only where
needed. Refer to
.BR driver.conf (4)
for further details.
.SH PROPERTIES
.sp
.ne 2
.mk
.na
.B inquiry-config-list
.ad
.RS 23n
.rt
The
.B inquiry-config-list
property is a list of pairs of strings that
enumerates a list of specific devices to which the
.B sgen
driver will
bind. Each pair of strings is referred to as
.RB < vendorid ,
\fBproductid\fR> in the discussion below.
.RE

.sp
.ne 2
.mk
.na
.B vendorid
.ad
.RS 12n
.rt
 is used to match the Vendor ID reported by the device. The \fBSCSI\fR specification limits Vendor IDs to eight characters. Correspondingly, the length of this string should not exceed eight characters. As a special case, "\fB*\fR" may be used as a wildcard which matches any Vendor ID. This is useful in situations where more than one vendor produces a particular model of a product. \fBvendorid\fR is matched against the Vendor ID reported by the device in a case-insensitive manner.
.RE

.sp
.ne 2
.mk
.na
.B productid
.ad
.RS 13n
.rt
 is used to match the product ID reported by the device. The
.B SCSI
specification limits product IDs to sixteen characters (unused characters are filled with the whitespace characters).  Correspondingly, the length  of
.B productid
should not exceed sixteen characters.  When examining the product ID of the
device,
.B sgen
examines the length l of
.B productid
and performs a match against only the first l characters in the device's
product ID.
.B productid
is matched against the product ID reported by the device in a case-insensitive
manner.
.RE

.sp
.LP
For example, to match some fictitious devices from ACME corp, the
.B inquiry-config-list
can be configured as follows:
.sp

.sp
.TS
tab();
lw(2.01i) lw(1.06i) lw(2.43i)
lw(2.01i) lw(1.06i) lw(2.43i)
.
\fBinquiry-config-list = \fR\fB"ACME"\fR,\fB"UltraToast 3000"\fR,
\fB"ACME"\fR,\fB"UltraToast 4000"\fR,
 \fB"ACME"\fR,\fB"UltraToast 5000"\fR;
.TE

.sp
.LP
To match "UltraToast 4000" devices, regardless of vendor,
.B inquiry-config-list
is modified as follows:
.sp

.sp
.TS
tab();
lw(1.97i) lw(1.1i) lw(2.43i)
.
\fBinquiry-config-list = \fR\fB"*",\fR \fB"UltraToast 4000"\fR;
.TE

.sp
.LP
To match every device from ACME in the "UltraToast" series (i.e UltraToast
3000, 4000, 5000, .\|.\|.),
.B  inquiry-config-list
is modified as follows:

.sp

.sp
.TS
tab();
lw(2.05i) lw(.91i) lw(2.53i)
.
\fBinquiry-config-list = \fR \fB"ACME"\fR\fB "UltraToast";\fR
.TE

.sp
.LP
Whitespace characters
.B are
significant when specifying
\fBproductid\fR. For example, a \fBproductid\fR of "UltraToast 1000" is
fifteen characters in length. If a device reported its ID as "UltraToast
10000", the \fBsgen\fR driver would bind to it because only the first
fifteen characters are considered significant when matching. To remedy this
situation, specify \fBproductid\fR as "UltraToast 1000 ", (note trailing
space). This forces the
.B sgen
driver to consider all sixteen characters
in the product ID to be significant.
.sp
.ne 2
.mk
.na
.B device-type-config-list
.ad
.RS 27n
.rt
The
.B device-type-config-list
property is a list of strings that
enumerate a list of device types to which the
.B sgen
driver will bind.
The valid device types correspond to those defined by the \fISCSI-3 SPC Draft Standard, Rev. 11a\fR. These types are:
.RE

.sp

.sp
.TS
tab();
cw(1.75i) |cw(3.75i)
lw(1.75i) |lw(3.75i)
.
Type NameInquiry Type ID
_
direct 0x00
sequential 0x01
printer  0x02
processor 0x03
worm 0x04
rodirect 0x05
scanner  0x06
optical 0x07
changer 0x08
comm 0x09
prepress1 0x0a
prepress2 0x0b
array_ctrl 0x0c
ses 0x0d
rbc 0x0e
ocrw 0x0f
bridge 0x10
type_unknown 0x1f
.TE

.sp
.LP
Alternately, you can specify device types  by
.B INQUIRY
type ID. To do
this, specify
.B type_0x<typenum>
in the
.BR sgen-config-list .
Case is
not significant when specifying device type names.
.sp
.ne 2
.mk
.na
.B sgen-diag
.ad
.RS 13n
.rt
The
.B sgen-diag
property sets the diagnostic output level. This
property can be set globally and/or per target/lun pair.
.B sgen-diag
is
an integer property, and can be set to 0, 1, 2 or 3. Illegal values will
silently default to 0. The meaning of each diagnostic level is as follows:

.RE

.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 5n
.rt
No error reporting [default]
.RE

.sp
.ne 2
.mk
.na
.B 1
.ad
.RS 5n
.rt
Report driver configuration information, unusual conditions, and indicate
when sense data has been returned from the device.
.RE

.sp
.ne 2
.mk
.na
.B 2
.ad
.RS 5n
.rt
Trace the entry into and exit from routines inside the driver, and provide
extended diagnostic data. No error reporting [default].
.RE

.sp
.ne 2
.mk
.na
.B 3
.ad
.RS 5n
.rt
Provide detailed output about command characteristics, driver state, and
the contents of each CDB passed to the driver.
.RE

.sp
.LP
In ascending order, each level includes the diagnostics that the previous
level reports. See the IOCTLS section for more infomation on the
.B SGEN_IOC_DIAG
ioctl.
.SH FILES
.sp
.ne 2
.mk
.na
.B sgen.conf
.ad
.RS 30n
.rt
Driver configuration file. See CONFIGURATION  for more details.
.RE

.sp
.ne 2
.mk
.na
\fB/dev/scsi/<devtype>/c\fIn\fRt\fIn\fRd\fIn\fR
.ad
.RS 30n
.rt
The
.B sgen
driver categorizes each device in a separate directory by
its
.B SCSI
device type. The files inside the directory are named
according to their controller number, target ID and LUN as follows:
.sp
.RI c n " is the controller number, t" n " is the"
.B SCSI
target id and
d\fIn\fR is the
.B SCSI
LUN
.sp
This is analogous to the
.RB { controller;target;device }
naming scheme,
and the controller numbers correspond to the same controller numbers which
are used for naming disks. For example,
.B /dev/dsk/c0t0d0s0
and
.B /dev/scsi/scanner/c0t5d0
are both connected to controller
.BR c0 .
.RE

.SH IOCTLS
.sp
.LP
The
.B sgen
driver exports the
.BR uscsi (7I)
interface for each device
.RB "it manages. This allows a user process to talk directly to a" " SCSI"
device for which there is no other driver installed in the system.
Additionally, the
.B sgen
driver supports the following ioctls:
.sp
.ne 2
.mk
.na
.B SGEN_IOC_READY
.ad
.RS 18n
.rt
Send a
.B "TEST UNIT READY"
command to the device and return 0 upon
success, non-zero upon failure. This ioctl accepts no arguments.
.RE

.sp
.ne 2
.mk
.na
.B SGEN_IOC_DIAG
.ad
.RS 18n
.rt
Change the level of diagnostic reporting provided by the driver. This ioctl
accepts a single integer argument between 0 and 3. The levels have the same
meaning as in the
.B sgen-diag
property discussed in PROPERTIES above.
.RE

.SH ERRORS
.sp
.ne 2
.mk
.na
.B EBUSY
.ad
.RS 10n
.rt
The device was opened by another  thread or process using the O_EXCL flag,
or the device is       currently open and O_EXCL is being requested.
.RE

.sp
.ne 2
.mk
.na
.B ENXIO
.ad
.RS 10n
.rt
.RB "During opening, the device did not respond to a" " TEST UNIT READY"
.B SCSI
command.
.RE

.sp
.ne 2
.mk
.na
.B ENOTTY
.ad
.RS 10n
.rt
Indicates that the device does  not  support the  requested ioctl
function.
.RE

.SH EXAMPLES
.sp
.LP
Here is an example of how
.B sgen
can be configured to bind to scanner
devices on the system:
.sp
.LP
\fBdevice-type-config-list = "scanner";\fR
.sp
.LP
The administrator should subsequently uncomment the appropriate
\fBname="sgen".\|.\|.\fR lines for the \fBSCSI\fR target ID to which the scanner
corresponds. In this example, the scanner is at target 4.
.sp
.LP
\fBname= "sgen" class= "scsi" target=4 lun=0;\fR
.sp
.LP
If it is expected that the scanner will be moved from target to target over
time, or that more scanners might be added in the future, it is recommended
that all of the \fBname="sgen".\|.\|.\fR lines be uncommented, so that
.B sgen
checks all of the targets on the bus.
.sp
.LP
For large systems where boot times are a concern, it is recommended that
the \fBparent=""\fR property be used to specify which \fBSCSI\fR bus
.B sgen
should examine.
.SH SEE ALSO
.sp
.LP
.BR driver.conf (4),
.BR scsi (4),
.BR sd (7D),
.BR st (7D),
.BR uscsi (7I)
.sp
.LP
.I Writing Device Drivers
.sp
.LP
.I "ANSI Small Computer System Interface-2 (SCSI-2)
.sp
.LP
.I "SCSI-3 SPC Draft Standard, Rev. 11a
