usr/src/man/man7d/si3124.7d
'\" te
.\" Copyright (c) 2007 Sun Microsystems, Inc.  All Rights Reserved.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH si3124 7D "17 August 2007" "SunOS 5.11" "Devices"
.SH NAME
si3124 \- SiliconImage 3124/3132 SATA controller driver
.SH SYNOPSIS
.LP
.nf
\fBsata@unit-address\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B si3124
driver is a
.B SATA
framework-compliant HBA driver that
supports Silicon Image 3124 and 3132
.B SATA
controllers. Note that while
the Silicon Image controllers supports standard
.B SATA
features
including SATA-II disks, NCQ, hotplug, port multiplier and ATAPI disks, the
.B si3124
driver currently does not support NCQ, port multiplier or ATAPI
features.
.SH CONFIGURATION
.sp
.LP
There are no tunable parameters in the
.B si3124.conf
file.
.SH FILES
.sp
.ne 2
.mk
.na
.B /kernel/drv/si3124
.ad
.RS 28n
.rt
32-bit ELF kernel module (x86).
.RE

.sp
.ne 2
.mk
.na
.B /kernel/drv/amd64/si3124
.ad
.RS 28n
.rt
64-bit ELF kernel module. (x86).
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Architecturex86
_
AvailabilitySUNWsi3124
.TE

.SH SEE ALSO
.sp
.LP
.BR cfgadm (1M),
.BR prtconf (1M),
.BR cfgadm_sata (1M),
.BR attributes (5),
.BR nv_sata (7D),
.BR sata (7D)
.sp
.LP
.I Writing Device Drivers
