usr/src/man/man7d/smbios.7d
'\" te
.\" Copyright (c) 2005, Sun Microsystems, Inc. All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH smbios 7D "26 August 2005" "SunOS 5.11" "Devices"
.SH NAME
smbios \- System Management BIOS image
.SH SYNOPSIS
.LP
.nf
\fB/dev/smbios\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B smbios
device is a character special file that provides access to
a snapshot of the System Management BIOS (\fBSMBIOS\fR) image exported by
the current system.
.B SMBIOS
is an industry-standard mechanism that
enables low-level system software to export hardware configuration
information to higher-level system management software. The \fBSMBIOS\fR
data format is defined by the Distributed Management Task Force
(\fBDMTF\fR). For more information on \fBSMBIOS\fR and to obtain a copy of
the
.B SMBIOS
specification and implementation guidelines, refer to
http://\fIwww.dmtf.org\fR.
.sp
.LP
The
.B SMBIOS
image consists of a table of structures, each describing
some aspect of the system software or hardware configuration. The content of
the image varies widely by platform and BIOS vendor and may not exist on
some systems. You can use the
.BR smbios (1M)
utility to inspect the
contents of the
.B SMBIOS
image and copy it to a file.
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for a description of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWkvm.i
_
Interface StabilityStable
.TE

.SH SEE ALSO
.sp
.LP
.BR prtdiag (1M),
.BR smbios (1M),
.BR attributes (5)
.sp
.LP
.IR "System Management BIOS Reference Specification" ,
Version 2, Release 4
\(em 2005
.SH NOTES
.sp
.LP
The implementation of a System Management BIOS image is entirely at the
discretion of the system and BIOS vendors. Not all systems export a
.BR SMBIOS .
The
.B SMBIOS
structure content varies widely between
systems and BIOS vendors and frequently does not comply with the guidelines
included in the specification. For example, some structure fields may not be
filled in by the BIOS, while others may be filled in with non-conforming
values.
