usr/src/man/man7d/smbus.7d
'\" te
.\" Copyright 2003 Sun Microsystems, Inc. All rights reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH smbus 7D "23 July 2003" "SunOS 5.11" "Devices"
.SH NAME
smbus \- System Management Bus controller driver
.SH DESCRIPTION
.sp
.LP
The
.B smbus
driver is a I2C (Inter IC) nexus driver that allows the system
to communicate with various system      component chips. SMBus is a two-wire
control bus based on the I2C protocol through which systems can communicate
with various I2C devices connected to the bus.
.sp
.LP
The
.B smbus
driver supports byte and block level transfer based on
interrupt and polled mode.
.SH FILES
.sp
.ne 2
.mk
.na
.B /platform/sun4u/kernel/drv/sparcv9/smbus
.ad
.sp .6
.RS 4n
64 bit ELF kernel module
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcarx
_
Architecture SPARC
.TE

.SH SEE ALSO
.sp
.LP
.BR attributes (5)
.sp
.LP
.I Writing Device Drivers
.sp
.LP
.I "System Management Bus (SMBus) Specification 2.0
\(em SBS Implementation
Forum
.sp
.LP
.I "The I2C Bus and How To Use It
\(emPhilips Semiconductor Document #
98-8080-575-01
