usr/src/man/man7d/stp4020.7d
'\" te
.\" Copyright (c) 1999 Sun Microsystems, Inc.  All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH stp4020 7D "27 Jul 1999" "SunOS 5.11" "Devices"
.SH NAME
stp4020 \- STP 4020 PCMCIA Adapter
.SH DESCRIPTION
.sp
.LP
The STP 4020
.B PCMCIA
Adapter provides for two
.B "PCMCIA PC"
Card
sockets. The
.B stp4020
adapter driver provides an interface between the
.B PCMCIA
sockets and the
.B PCMCIA
nexus. The driver supports the Sun
.B PCMCIA
Interface/Sbus card.
.sp
.LP
Direct access to the
.B PCMCIA
hardware is not supported. The driver
exists solely to support the
.B PCMCIA
nexus.
.SH FILES
.sp
.ne 2
.mk
.na
.B /kernel/drv/stp4020
.ad
.RS 23n
.rt
.B stp4020
driver.
.RE

.SH SEE ALSO
.sp
.LP
.BR pcmcia (7D)
