usr/src/man/man7d/su.7d
'\" te
.\" Copyright (c) 2004, Sun Microsystems, Inc.  All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH su 7D "18 June 2004" "SunOS 5.11" "Devices"
.SH NAME
su \- asynchronous serial port driver
.SH SYNOPSIS
.LP
.nf
#include <fcntl.h>
#include <sys/termios.h>
open("/dev/tty\fI[a-z]\fR", _\fImode\fR);
open("/dev/term\fI[a-z]\fR", _\fImode\fR);
open("/dev/cua\fI[a-z]\fR", _\fImode\fR);
.fi

.LP
.nf

.fi

.SH DESCRIPTION
.sp
.LP
The
.B su
module is a loadable STREAMS driver that provides basic
support for standard
.B UARTS
that use Intel-8250, National
Semiconductor-16450/16550 hardware and Southbridge 1535D (16550 compatable)
Super I/O hardware. The module also provides keyboard and mouse I/O support
for Sun machines using those same Intel, National Semiconductor and
Southbridge chipsets. The
.B su
driver provides basic asynchronous
communication support for serial ports. Both the serial devices and
keyboard/mouse devices will have streams built with appropriate modules
pushed atop the
.B su
driver by means of either the
.BR autopush (1M)
or
.BR dacf.conf (4)
facilities, depending on the OS revision and
architecture in use.
.sp
.LP
The
.B su
module supports those
.BR termio "(7I) device control"
.RB "functions specified by flags in the " c_cflag " word of the " termios 
structure, and by the
.B "IGNBRK, IGNPAR,"
.B PARMRK,
or
.B INPCK
flags in the
.B c_iflag
word of the
.B termios
structure.
All other
.BR termio (7I)
functions must be performed by
.B
STREAMS
modules pushed atop the driver.  When a device is opened, the
.BR ldterm (7M)
and
.BR ttcompat (7M)
.B STREAMS
modules are
automatically pushed on top of the stream, providing the standard
.BR termio (7I)
interface.
.sp
.LP
The character-special devices
.B /dev/ttya
and
.B /dev/ttyb
are used
to access the two standard serial ports. The
.B su
module supports up to
ten serial ports, including the standard ports. The
.BI tty [a-z]
devices have minor device numbers in the range 00-03, and may be assigned
names of the form
.BI /dev/ttyd_ n_,
where
.I _n_
denotes the line
to be accessed.  These device names are typically used to provide a logical
access point for a
.I _dial-in_
line that is used with a modem.
.sp
.LP
To allow a single tty line to be connected to a modem and used for incoming
and outgoing calls, a special feature is available that is controlled by the
minor device number. By accessing character-special devices with names of
the form
.BI /dev/cua _n,
it is possible to open a port without the
.B Carrier Detect
signal being asserted, either through hardware or an
equivalent software mechanism. These devices are commonly known as
.I _dial-out_
lines.
.SH APPLICATION PROGRAMMING INTERFACE
.sp
.LP
Once a
.BI /dev/cua _n_
line is opened, the corresponding tty, or
ttyd line cannot be opened until the
.BI /dev/cua _n_
line is closed.
A blocking open will wait until the
.BI /dev/cua _n_
line is closed
(which will drop
.BR "Data Terminal Ready" ,
after which
.BR "Carrier Detect"
will usually drop as well) and carrier is detected again. A non-blocking
open will return an error. If the
.BI /dev/ttyd _n_
line has been
opened successfully (usually only when carrier is recognized on the modem),
the corresponding
.BI /dev/cua _n_
line cannot be opened. This allows
a modem to be attached to a device, (for example,
.BR /dev/ttyd0 ,
which is
renamed from
.BR /dev/tty00 )
and used for dial-in (by enabling the line
for login in
.BR /etc/inittab )
or dial-out (by
.BR tip (1)
or
.BR uucp (1C))
as
.B /dev/cua0
when no one is logged in on the line.
.SH IOCTLS
.sp
.LP
The standard set of
.B "termio ioctl()"
calls are supported by
.BR su .
.sp
.LP
Breaks can be generated by the
.B "TCSBRK, TIOCSBRK,"
and
.B TIOCCBRK ioctl()
calls.
.sp
.LP
The input and output line speeds may be set to any of the following baud
rates: 0, 50, 75, 110, 134, 150, 200, 300, 600,   1200, 1800, 2400, 4800,
9600, 19200, 38400, 57600 or 115200. The speeds cannot be set independently;
for example, when the output speed is set, the input speed is automatically
set to the same speed.
.sp
.LP
When the
.B su
module is used to service the serial console port, it
supports a BREAK condition that allows the system to enter the debugger or
the monitor. The BREAK condition is generated by hardware and it is usually
enabled by default.
.sp
.LP
A BREAK condition originating from erroneous electrical signals cannot be
distinguished from one deliberately sent by remote DCE. The Alternate Break
sequence can be used as a remedy against this. Due to a risk of incorrect
sequence interpretation, SLIP and certain other binary protocols should not
be run over the serial console port when Alternate Break sequence is in
effect. Although PPP is a binary protocol, it is able to avoid these
sequences using the ACCM feature in
.IR "RFC 1662" .
For Solaris PPP 4.0, you
do this by adding the following line to the
.B /etc/ppp/options
file (or
other configuration files used for the connection; see
.BR pppd (1M)
for
details):
.sp
.in +2
.nf
asyncmap  0x00002000
.fi
.in -2

.sp
.LP
By default, the Alternate Break sequence is a three character sequence:
carriage return, tilde and control-B (CR ~ CTRL-B), but may be changed by
the driver. For more information on breaking (entering the debugger or
monitor), see
.BR kbd (1)
and
.BR kb (7M).
.SH ERRORS
.sp
.LP
An
.B open()
will fail under the following conditions:
.sp
.ne 2
.mk
.na
.B ENXIO
.ad
.RS 9n
.rt
The unit being opened does not exist.
.RE

.sp
.ne 2
.mk
.na
.B EBUSY
.ad
.RS 9n
.rt
The dial-out device is being opened while the dial-in device is already
open, or the dial-in device is being opened with a no-delay open and the
dial-out device is already open.
.RE

.sp
.ne 2
.mk
.na
.B EBUSY
.ad
.RS 9n
.rt
The unit has been marked as exclusive-use by another process with a
.B TIOCEXCL ioctl()
call.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B /dev/cua/[a-z]
.ad
.RS 19n
.rt
dial-out tty lines
.RE

.sp
.ne 2
.mk
.na
.B /dev/term/[a-z]
.ad
.RS 19n
.rt
dial-in tty lines
.RE

.sp
.ne 2
.mk
.na
.B /dev/tty[a-z]
.ad
.RS 19n
.rt
binary compatibility package device names
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Architecture SPARC
.TE

.SH SEE ALSO
.sp
.LP
.BR strconf (1),
\fBkbd\fR(1), \fBtip\fR(1),\fBuucp\fR(1C),
.BR autopush (1M),
.BR kstat (1M),
.BR pppd (1M),
.BR ioctl (2),
.BR open (2),
.BR termios (3C),
.BR dacf.conf (4),
.BR attributes (5),
.BR kb (7M),
.BR ldterm (7M),
.BR ttcompat (7M),
.BR termio (7I)
.SH DIAGNOSTICS
.sp
.LP
The
.B su
driver keeps track of various warning and error conditions
using
.B kstat
counters. The output of the
.B "kstat su"
command
provides
.B kstat
counters. The counters and their meaning follow:
.sp
.ne 2
.mk
.na
.B silo overflow
.ad
.RS 24n
.rt
The internal chip FIFO received more data than it could handle. This
indicates that the Solaris operating environment was not servicing data
interrupts fast enough possibly due to a system with too many interrupts or
a data line with a data rate that is too high.
.RE

.sp
.ne 2
.mk
.na
.B ring buffer overflow
.ad
.RS 24n
.rt
The
.B su
module was unable to  store  data it removed from the chips
internal FIFO into a software buffer. The user process is not reading data
fast enough, possibly due to an overloaded system. If possible, the
application should enable flow control (either CTSRTS or XONXOFF) to allow
the driver to backpressure the remote system when the local buffers fill
up.
.RE

