usr/src/man/man7d/sv.7d
'\" te
.\" Copyright (c) 2007, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH sv 7D "8 Jun 2007" "SunOS 5.11" "Devices"
.SH NAME
sv \- Storage Volume system call device
.SH DESCRIPTION
.sp
.LP
The
.B sv
driver allows standard system call access (see
.BR Intro (2))
to a disk device to be redirected into the StorageTek architecture software.
This enables standard applications to use Sun StorageTek Availability Suite
components such as Point-in-Time Copy and Remote Mirror software.
.SH FILES
.sp
.ne 2
.mk
.na
.B kernel/drv/sv
.ad
.RS 17n
.rt
SV control and administration driver.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for a description of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Architecturex86
_
Availability SUNWspsvu
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
.BR iiadm (1M)
