usr/src/man/man7d/ticlts.7d
'\" te
.\" Copyright 2000, Sun Microsystems, Inc.  All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" Copyright 1989 AT&T
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ticlts 7D "3 Jul 1990" "SunOS 5.11" "Devices"
.SH NAME
ticlts, ticots, ticotsord \- loopback transport providers
.SH SYNOPSIS
.LP
.nf
#include <sys/ticlts.h>
.fi

.LP
.nf
#include <sys/ticots.h>
.fi

.LP
.nf
#include <sys/ticotsord.h>
.fi

.SH DESCRIPTION
.sp
.LP
The devices known as
.BR ticlts ,
.BR ticots ,
and
.B ticotsord
are
``loopback transport providers,'' that is, stand-alone networks at the
transport level. Loopback transport providers are transport providers in
every sense except one: only one host (the local machine) is ``connected
.RB "to'' a loopback network. Loopback transports present a" " TPI"
(STREAMS-level) interface to application processes and are intended to be
accessed via the
.B TLI
(application-level) interface. They are
implemented as clone devices and support address spaces consisting of
``flex-addresses,'' that is, arbitrary sequences of octets of length > 0,
represented by a
.B netbuf
structure.
.sp
.LP
.B ticlts
is a datagram-mode transport provider. It offers
(connectionless) service of type
.BR T_CLTS .
Its default address size is
.BR TCL_DEFAULTADDRSZ .
.B ticlts
prints the following error messages
(see
.BR t_rcvuderr (3NSL)):
.sp
.ne 2
.mk
.na
.B TCL_BADADDR
.ad
.RS 20n
.rt
bad address specification
.RE

.sp
.ne 2
.mk
.na
.B TCL_BADOPT
.ad
.RS 20n
.rt
bad option specification
.RE

.sp
.ne 2
.mk
.na
.B TCL_NOPEER
.ad
.RS 20n
.rt
bound
.RE

.sp
.ne 2
.mk
.na
.B TCL_PEERBADSTATE
.ad
.RS 20n
.rt
peer in wrong state
.RE

.sp
.LP
.B ticots
is a virtual circuit-mode transport provider. It offers
(connection-oriented) service of type
.BR T_COTS .
Its default address size
is
.BR TCO_DEFAULTADDRSZ .
.B ticots
prints the following disconnect
messages (see
.BR t_rcvdis (3NSL)):
.sp
.ne 2
.mk
.na
.B TCO_NOPEER
.ad
.RS 25n
.rt
no listener on destination address
.RE

.sp
.ne 2
.mk
.na
.B TCO_PEERNOROOMONQ
.ad
.RS 25n
.rt
peer has no room on connect queue
.RE

.sp
.ne 2
.mk
.na
.B TCO_PEERBADSTATE
.ad
.RS 25n
.rt
peer in wrong state
.RE

.sp
.ne 2
.mk
.na
.B TCO_PEERINITIATED
.ad
.RS 25n
.rt
peer-initiated disconnect
.RE

.sp
.ne 2
.mk
.na
.B TCO_PROVIDERINITIATED
.ad
.RS 25n
.rt
provider-initiated disconnect
.RE

.sp
.LP
.B ticotsord
is a virtual circuit-mode transport provider, offering
service of type
.B T_COTS_ORD
(connection-oriented service with orderly
release). Its default address size is
.BR TCOO_DEFAULTADDRSZ .
.B ticotsord
prints the following disconnect messages (see
.BR t_rcvdis (3NSL)):
.sp
.ne 2
.mk
.na
.B TCOO_NOPEER
.ad
.RS 26n
.rt
no listener on destination address
.RE

.sp
.ne 2
.mk
.na
.B TCOO_PEERNOROOMONQ
.ad
.RS 26n
.rt
peer has no room on connect queue
.RE

.sp
.ne 2
.mk
.na
.B TCOO_PEERBADSTATE
.ad
.RS 26n
.rt
peer in wrong state
.RE

.sp
.ne 2
.mk
.na
.B TCOO_PEERINITIATED
.ad
.RS 26n
.rt
provider-initiated disconnect
.RE

.sp
.ne 2
.mk
.na
.B TCOO_PROVIDERINITIATED
.ad
.RS 26n
.rt
peer-initiated disconnect
.RE

.SH USAGE
.sp
.LP
Loopback transports support a local
.B IPC
mechanism through the
.B TLI
interface. Applications implemented in a transport
.RB "provider-independent manner on a client-server model using this" " IPC"
are transparently transportable to networked environments.
.sp
.LP
Transport provider-independent applications must not include the headers
listed in the synopsis section above. In particular, the options are (like
all transport provider options) provider dependent.
.sp
.LP
.B ticlts
and
.B ticots
support the same service types (\fBT_CLTS\fR
and
.BR T_COTS )
supported by the
.B OSI
transport-level model.
.sp
.LP
.B ticotsord
supports the same service type (\fBT_COTSORD\fR) supported
by the
.B TCP/IP
model.
.SH FILES
.sp
.LP
.B /dev/ticlts
.sp
.LP
.B /dev/ticots
.sp
.LP
.B /dev/ticotsord
.SH SEE ALSO
.sp
.LP
.BR t_rcvdis (3NSL),
.BR t_rcvuderr (3NSL)
