usr/src/man/man7d/tpf.7d
'\" te
.\" Copyright (c) 1995, Sun Microsystems, Inc.  All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH tpf 7D "1 Jan 1997" "SunOS 5.11" "Devices"
.SH NAME
tpf \- Platform Specific Module (PSM) for Tricord Systems Enterprise Server
Models ES3000, ES4000 and ES5000.
.SH DESCRIPTION
.sp
.LP
.B tpf
provides the platform dependent functions for Solaris x86 MP
support. These functions adhere to the PSMI Specifications.  (Platform
Specific Module Interface Specifications.) Tricord Systems Enterprise
Servers are Intel APIC based MP platforms  which run from 1 to 12 Intel
processors. The
.B tpf
psm supports dynamic interrupt distribution
across all processors in an MP configuration.
.sp
.LP
The psm is automatically invoked on an ESxxxx platform at system boot
time.
.SH FILES
.sp
.ne 2
.mk
.na
.B /kernel/mach/tpf
.ad
.RS 20n
.rt
MP module.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Architecturex86
.TE

.SH SEE ALSO
.sp
.LP
.BR attributes (5)
