usr/src/man/man7d/tzmon.7d
'\" te
.\" Copyright (c) 2006 Sun Microsystems, Inc.  All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH tzmon 7d "31 Oct 2006" "SunOS 5.11" "Devices"
.SH NAME
tzmon \- ACPI Thermal Zone Monitor
.SH DESCRIPTION
.sp
.LP
The
.B tzmon
is a pseudo driver that serves as an ACPI thermal zone
monitor. Thermal zones are logical regions  within a computer system for
which ACPI performs temperature monitoring and control functions. The number
of thermal zones on a system with ACPI support varies. For example, some
systems may have one or more thermal zones, while others may have none. See
the \fIAdvanced Configuration and Power Interface Specification, (ACPI) Version 3.0A.\fR for more details.
.sp
.LP
The
.B tzmon
handles thermal Zone events from ACPI and polls the
temperature for each zone exposed  by the ACPI implementation. If threshold
temperatures are reached,
.B tzmon
takes appropriate action.  For
example, if the temperature is sufficiently high and the ACPI implementation
supports it,
.B tzmon
initiates system shutdown.
.sp
.LP
Note that by default,  system temperature control functions are usually
performed by the BIOS and may supersede
.B tzmon
functions, depending on
the BIOS implementation. Also, many ACPI implementations expose no thermal
zones and in these cases,
.B tzmon
performs no functions.
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWckr
_
Architecture x86/x64 only
_
Interface stability Private
.TE

.SH SEE ALSO
.sp
.LP
.BR attributes (5)
.sp
.LP
\fIAdvanced Configuration and Power Interface Specification, (ACPI),
Version 3.0A.\fR
