usr/src/man/man7d/usb_as.7d
'\" te
.\" Copyright (c) 2009, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH usb_as 7D "15 May 2009" "SunOS 5.11" "Devices"
.SH NAME
usb_as \- USB audio streaming driver
.SH SYNOPSIS
.LP
.nf
sound@unit-address
.fi

.SH DESCRIPTION
.sp
.LP
The
.B usb_as
driver is a USBA (Solaris USB Architecture) compliant
client driver that supports the
.I "USB Audio Class 1.0"
specification.
.sp
.LP
The
.B usb_as
driver processes audio data messages during play and
record and sets sample frequency, precision, encoding and other functions on
request from the USB audio control driver. See
.BR usb_ac (7D).
.sp
.LP
This driver is plumbed under the USB audio control driver and does not
directly interface with the user application.
.SH FILES
.sp
.ne 2
.mk
.na
.B /kernel/drv/usb_as
.ad
.RS 30n
.rt
32-bit x86 ELF kernel module
.RE

.sp
.ne 2
.mk
.na
.B /kernel/drv/amd64/usb_as
.ad
.RS 30n
.rt
64-bit x86 ELF kernel module
.RE

.sp
.ne 2
.mk
.na
.B /kernel/drv/sparcv9/usb_as
.ad
.RS 30n
.rt
64-bit SPARC ELF kernel module
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
ArchitectureSPARC, x86, PCI-based systems
_
AvailabilitySUNWusb
_
Stability level Committed
.TE

.SH SEE ALSO
.sp
.LP
.BR attributes (5),
.BR usba (7D),
.BR usb_ac (7D),
.BR audio (7I)
.sp
.LP
.I Writing Device Drivers
.sp
.LP
.I "Universal Serial Bus Specification 1.0 and 1.1
.sp
.LP
.I System Administration Guide: Basic Administration
.SH DIAGNOSTICS
.sp
.LP
In addition to being logged, the following messages can appear on the
system console. All messages are formatted in the following manner:
.sp
.in +2
.nf
Warning: <device path> (usb_as<instance num>): Error Message...
.fi
.in -2
.sp

.sp
.LP
where
.I "<device path>"
is the physical path to the device in
.B /devices
directory.
.sp
.ne 2
.mk
.na
.B No bandwidth available.
.ad
.sp .6
.RS 4n
There is no bandwidth available for the isochronous pipe. As a result, no
data is transferred during play and record.
.RE

.sp
.ne 2
.mk
.na
\fBOperating a full/high speed audio device on a high speed port is not
supported.\fR
.ad
.sp .6
.RS 4n
The USB software does not currently support full or high speed audio
devices connected to an external USB 2.0 hub that is linked to a port of a
USB 2.0 host controller. Audio devices must be connected directly to a port
of a USB 2.0 controller or to any USB 1.1 port.
.RE

.sp
.ne 2
.mk
.na
.B "Cannot access device. Please reconnect <name>.
.ad
.sp .6
.RS 4n
There was an error in accessing the device during reconnect. Please
reconnect the device.
.RE

.sp
.ne 2
.mk
.na
\fBDevice is not identical to the previous one on this port. Please
disconnect and reconnect.\fR
.ad
.sp .6
.RS 4n
A USB audio streaming interface was hot-removed while open. A new device
was hot-inserted which is not identical to the original USB audio device.
Please disconnect the USB device and reconnect the device to the same
port.
.RE

.SH NOTES
.sp
.LP
The USB audio streaming interface is power managed if the device is idle.
