usr/src/man/man7d/usb_ac.7d
'\" te
.\" Copyright (c) 2009, Sun Microsystems, Inc. All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH usb_ac 7D "13 May 2009" "SunOS 5.11" "Devices"
.SH NAME
usb_ac \- USB audio control driver
.SH SYNOPSIS
.LP
.nf
sound-control@unit-address
.fi

.SH DESCRIPTION
.sp
.LP
The
.B usb_ac
driver is a USBA (Solaris USB Architecture) compliant
client driver that supports the
.I "USB Audio Class 1.0"
specification.
.sp
.LP
The audio control driver is a USB class driver and offers functionality
similar to the
.B audiocs
(sun4u) and
.B audiots
(Sun Blade 100)
drivers which use the Solaris audio mixer framework (\fBmixer\fR(7I)).
Unlike the
.B audiocs
and
.B audiots
drivers, the USB audio device can
have play-only or record-only capability.
.sp
.LP
Drivers corresponding to other USB audio interfaces on the device,
including the
.BR usb_as "(7D) audio streaming driver or the"
.BR hid (7D)
driver, are plumbed under the USB audio control driver and do not directly
interface with user applications.
.sp
.LP
The
.B usb_ac
driver supports USB audio class compliant devices with a
feature unit.
.SH ERRORS
.sp
.LP
If a device is hot-removed while it is active, all subsequent opens returns
EIO. All other errors are defined in the
.BR audio (7I)
man page.
.SH FILES
.sp
.ne 2
.mk
.na
.B /kernel/drv/usb_ac
.ad
.RS 30n
.rt
32-bit x86 ELF kernel module
.RE

.sp
.ne 2
.mk
.na
.B /kernel/drv/amd64/usb_ac
.ad
.RS 30n
.rt
64-bit x86 ELF kernel module
.RE

.sp
.ne 2
.mk
.na
.B /kernel/drv/sparcv9/usb_ac
.ad
.RS 30n
.rt
64-bit SPARC ELF kernel module.
.RE

.sp
.ne 2
.mk
.na
\fB/kernel/drv/usb_ac.conf\fR
.ad
.RS 30n
.rt
USB audio driver configuration file.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
ArchitectureSPARC, x86, PCI-based systems
_
AvailabilitySUNWusb
_
Interface StabilityUncommitted
.TE

.SH SEE ALSO
.sp
.LP
.BR cfgadm_usb (1M),
.BR ioctl (2),
.BR attributes (5),
.BR hid (7D),
.BR usba (7D),
.BR usb_as (7D),
.BR audio (7I),
.BR mixer (7I),
.BR streamio (7I),
.BR usb_ah (7M)
.sp
.LP
.I Writing Device Drivers
.sp
.LP
\fIUniversal Serial Bus Specification 1.0 and 1.1\fR
.sp
.LP
\fIUniversal Serial Bus Device Class Definition for Audio Devices, Release
1.0\fR
.sp
.LP
.I System Administration: Basic Administration
.SH DIAGNOSTICS
.sp
.LP
In addition to being logged, the following messages can appear on the
system console. All messages are formatted in the following manner:
.sp
.in +2
.nf
Warning: <device path> (usb_ac<instance num>): Error Message...
.fi
.in -2
.sp

.sp
.ne 2
.mk
.na
.B "Failure to plumb audio streams drivers.
.ad
.sp .6
.RS 4n
The
.B usb
audio streaming driver or the
.B hid
driver could not be
plumbed under the audio control driver and the device is not usable.
.RE

