usr/src/man/man7d/usb_ia.7d
'\" te
.\" Copyright (c) 2006, Sun Microsystems, Inc.  All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH usb_ia 7D "21 Dec 2006" "SunOS 5.11" "Devices"
.SH NAME
usb_ia \- USB interface association driver
.SH SYNOPSIS
.LP
.nf
interface association@unit-address
.fi

.LP
.nf

.fi

.SH DESCRIPTION
.sp
.LP
The
.B usb_ia
driver is a USBA (Solaris Universal Serial Bus
Architecture)-compliant nexus driver that binds to a device's interface
association nodes when no vendor or class specific driver is available. To
do this,
.B usb_ia
creates nodes for the internal interfaces and then
attempts to bind drivers to each child interface.
.sp
.LP
Each interface association node has a parent device node that is created by
.BR usb_mid (7D)
and all
.BR ugen (7D)
interfaces are exported by
.BR usb_mid (7D).
(Note: attempting to export
.BR ugen (7D)
interfaces
using
.B usb_ia
is prohibited.)
.SH FILES
.sp
.ne 2
.mk
.na
.B /kernel/drv/usb_ia
.ad
.sp .6
.RS 4n
32-bit ELF kernel module. (x86).
.RE

.sp
.ne 2
.mk
.na
.B /kernel/drv/amd64/usb_ia
.ad
.sp .6
.RS 4n
64-bit ELF kernel module. (x86).
.RE

.sp
.ne 2
.mk
.na
.B /kernel/drv/sparcv9/usb_ia
.ad
.sp .6
.RS 4n
64-bit ELF kernel module. (SPARC).
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
ArchitectureSPARC & x86 PCI-based systems
_
AvailabilitySUNWusb
.TE

.SH SEE ALSO
.sp
.LP
\fBattributes\fR(5),\fBugen\fR(7D), \fBusb_mid\fR(7D), \fBusba\fR(7D)
.sp
.LP
.I Writing Device Drivers
.sp
.LP
.I System Administration Guide: Basic Administration
.sp
.LP
.I Universal Serial Bus Specification 2.0
\(em 2000
.sp
.LP
\fIInterface Association Descriptor Engineering Change Notice
(ECN)\fR\(em2003
.sp
.LP
.I http://www.sun.com/io
.sp
.LP
.I http://docs.sun.com
.SH DIAGNOSTICS
.sp
.LP
In addition to being logged, the following messages may appear on the
system console. All messages are formatted in the     following manner:
.sp
.in +2
.nf
<device path> (usb_ia<instance num>):message...
.fi
.in -2
.sp

.sp
.ne 2
.mk
.na
.B "No driver found for interface <n> (nodename: <string>) of <device>.
.ad
.sp .6
.RS 4n
No driver is available for this interface.
.RE

