usr/src/man/man7d/usb_mid.7d
'\" te
.\" Copyright 2006 Sun Microsystems, Inc. All rights reserved.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH usb_mid 7D "22 Dec 2006" "SunOS 5.11" "Devices"
.SH NAME
usb_mid \- USB Multi Interface Driver
.SH SYNOPSIS
.LP
.nf
\fBdevice@\fIunit-address\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B usb_mid
driver is a
.B USBA
(Solaris Universal Serial Bus
Architecture)-compliant nexus  driver that binds to device level nodes of a
composite (multi interface) device if no vendor or class-specific driver is
available. The
.B usb_mid
driver creates interface nodes or interface
association nodes and attempts to bind drivers to them. If no driver is
found for interface association nodes, \fBusb_ia\fR(7D) is bound by default.

.SS "UGEN (Generic USB)"
.sp
.LP
The
.B usb_mid
driver also supports a \fBugen\fR(7D) interface allowing
raw access to the device, for example by
.BR libusb (3LIB)
applications, by
passing the drivers bound to each interface. Since a libusb application
might change the state of the device, you should not access the device
through the child interface drivers. Note that the
.B usb_mid
driver
creates a ugen interface only if none of its children are explicitly bound
to the
.BR ugen "(7D) driver. Additionally,"
.B usb_mid
does not create
children.
.SH FILES
.sp
.ne 2
.mk
.na
.B /kernel/drv/usb_mid
.ad
.sp .6
.RS 4n
32-bit x86 ELF kernel module
.RE

.sp
.ne 2
.mk
.na
.B /kernel/drv/amd64/usb_mid
.ad
.sp .6
.RS 4n
64-bit x86 ELF kernel module
.RE

.sp
.ne 2
.mk
.na
.B /kernel/drv/sparcv9/usb_mid
.ad
.sp .6
.RS 4n
64-bit SPARC ELF kernel module
.RE

.sp
.ne 2
.mk
.na
.B /dev/usb/*/*/*
.ad
.sp .6
.RS 4n
ugen(7D) nodes.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
ArchitectureSPARC & x86, PCI-based systems
_
Availability SUNWusb
.TE

.SH SEE ALSO
.sp
.LP
.BR cfgadm_usb (1M),
.BR libusb (3LIB),
.BR attributes (5),
.BR usba (7D),
.BR usb_ia (7D)
.sp
.LP
.I Writing Device Drivers
.sp
.LP
\fIUniversal Serial Bus Specification 2.0\fR\(em2000
.sp
.LP
\fIInterface Association Descriptor Engineering Change Notice
(ECN)\fR\(em2003
.sp
.LP
.I System Administration Guide: Basic Administration
.sp
.LP
http://\fIwww.sun.com/io\fR
.SH DIAGNOSTICS
.sp
.LP
In addition to being logged, the following messages may appear on the
system console. All messages are formatted in the following manner:
.sp
.in +2
.nf
Warning: <device path> (usb_mid<instance number>): Error Message...
.fi
.in -2
.sp

.sp
.ne 2
.mk
.na
.B Cannot access <device>. Please reconnect.
.ad
.sp .6
.RS 4n
This device has been disconnected because a device other than the original
one has been inserted. The driver informs you of this fact by displaying the
name of the original device.
.RE

.sp
.ne 2
.mk
.na
\fBDevice not identical to the previous one on this port. Please disconnect
and reconnect.\fR
.ad
.sp .6
.RS 4n
Same condition as described above; however in this case, the driver is
unable to identify the original device with a name string.
.RE

.sp
.ne 2
.mk
.na
.B "Please disconnect and reconnect this device.
.ad
.sp .6
.RS 4n
A hotplug of the device is needed before it can be restored.
.RE

.sp
.LP
The following messages may be logged into the system log. They are
formatted in the following manner:
.sp
.in +2
.nf
<device path><usb_mid<instance number>): message...
.fi
.in -2
.sp

.sp
.ne 2
.mk
.na
\fBNo driver found for interface <n> (nodename: <string>) of <device>.
\fR
.ad
.sp .6
.RS 4n
No driver is available for this interface.
.RE

.sp
.ne 2
.mk
.na
.B "No driver found for device <device>.
.ad
.sp .6
.RS 4n
No driver is available for this interface.
.RE

.sp
.ne 2
.mk
.na
\fBCan't support ugen for multiple configuration devices that have attached
child interface drivers.\fR
.ad
.sp .6
.RS 4n
No ugen interface is available and
.BR libusb "(3LIB) cannot work with this"
device.
.RE

