usr/src/man/man7d/usba.7d
'\" te
.\" Copyright (c) 2009, Sun Microsystems, Inc.  All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH usba 7D "22 Apr 2009" "SunOS 5.11" "Devices"
.SH NAME
usba, usb \- Solaris USB Architecture (USBA)
.SH DESCRIPTION
.sp
.LP
USB provides a low-cost means for attaching peripheral devices, including
mass-storage devices, keyboards, mice, and printers, to a system. For
complete information on the USB architecture, visit the USB website at
http://www.usb.org.
.sp
.LP
USBA supports 126 hot-pluggable USB devices per USB bus. The maximum data
transfer rate is 1.5 Mbits (low speed USB 1.x) or 12 Mbits (full speed USB
1.x) or 480 MBits (high speed USB 2.0) Mbits per second (Mbps).
.sp
.LP
USBA adheres to the
.I "Universal Serial Bus 2.0"
specification and
provides a transport layer abstraction to USB client drivers.
.sp
.LP
For information on how to write USB client drivers, see \fIWriting Device
Drivers\fR. For the latest information on writing USB drivers, visit
.IR http://developers.sun.com/solaris/developer/support/driver/usb.html .
For a complete list of USBA interfaces, see
.BR Intro (9F)
and
.BR Intro (9S).
.sp
.LP
Devices without a driver may have a
.BR libusb "(3LIB) application. For"
more information, see
.BR /usr/sfw/share/doc/libusb/libusb.txt .
.SH FILES
.sp
.LP
Listed below are drivers and modules which either utilize or are utilized
by USBA. Drivers in
.B /kernel/drv
are 32 bit drivers (x86 only). Drivers
in
.B /kernel/drv/sparcv9
or
.B /kernel/drv/amd64
are 64 bit
drivers.
.sp
.in +2
.nf
\fIClient Driver                           Function/Device\fR

kernel/drv/[sparcv9|amd64/]hid          HID class
kernel/drv/[sparcv9|amd64/]hubd         hub class
kernel/drv/[sparcv9|amd64/]hwahc        HWA Host Controller class
kernel/drv/[sparcv9|amd64/]hwarc        HWA Radio Controller class
kernel/drv/[sparcv9|amd64/]scsa2usb     mass storage class
kernel/drv/[sparcv9|amd64/]usbprn       printer class
kernel/drv/[sparcv9|amd64/]usb_as       audio streaming class
kernel/drv/[sparcv9|amd64/]usb_ac       audio control class
kernel/drv/[sparcv9|amd64/]usbvc        video class
kernel/drv/[sparcv9|amd64/]usb_mid      multi-interface device
kernel/drv/[sparcv9|amd64/]usb_ia       interface-association driver
kernel/drv/[sparcv9|amd64/]usbser_edge  Edgeport USB to serial port
kernel/drv/[sparcv9|amd64/]usbsksp      Keyspan USB to serial port
kernel/drv/[sparcv9|amd64/]usbsprl      pl2303 USB to serial port
kernel/drv/[sparcv9|amd64/]usbsacm      CDC ACM class to serial port
kernel/drv/[sparcv9|amd64/]ugen         generic USB driver
kernel/drv/[sparcv9|amd64/]wusb_ca      WUSB Cable Association class
kernel/drv/[sparcv9|amd64/]ohci         open host controller driver
kernel/drv/[sparcv9|amd64/]uhci         universal host controller driver
kernel/drv/[sparcv9|amd64/]ehci         enhanced host controller driver
.fi
.in -2
.sp

.sp
.in +2
.nf
\fIClient Streams Modules                   Function/Device\fR
/kernel/strmod/[sparcv9|amd64]usbkbm     Keyboad
/kernel/strmod/[sparcv9|amd64]usbms      Mouse
/kernel/strmod/[sparcv9|amd64]usb_ah     Audio HID
.fi
.in -2
.sp

.sp
.in +2
.nf
\fIHost Controller Interface Drivers   Device\fR

/kernel/drv/[sparcv9|amd64]ehci     Enhanced HCI
/kernel/drv/[sparcv9|amd64]ohci     Open HCI
/kernel/drv/[sparcv|amd64/]uhci     Univeral HCI
.fi
.in -2
.sp

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for a description of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
ArchitecturePCI-based  systems
_
Availability SUNWusb, SUNWusbu
.TE

.SH SEE ALSO
.sp
.LP
.BR cfgadm_usb (1M),
.BR libusb (3LIB),
.BR attributes (5),
.BR ehci (7D),
.BR hid (7D),
.BR hubd (7D),
.BR ohci (7D),
.BR scsa2usb (7D),
.BR uhci (7D),
.BR usb_ac (7D),
.BR usb_as (7D),
.BR usb_ia (7D),
.BR usb_mid (7D),
.BR usbprn (7D),
.BR usbsacm (7D),
.BR usbser_edge (7D),
.BR usbsksp (7D),
.BR usbsprl (7D),
.BR usbvc (7D),
.BR ugen (7D),
.BR virtualkm (7D).
.BR Intro (9F),
.BR Intro (9S)
.sp
.LP
.I Writing Device Drivers
.sp
.LP
\fIUniversal Serial Bus Specification 2.0\fR.
.sp
.LP
.I "Interface Association Descriptor Engineering Change Notice (ECN)
.sp
.LP
.I System Administration Guide: Basic Administration
.sp
.LP
http://www.sun.com
.SH NOTES
.sp
.LP
Booting from USB mass-storage devices is not supported on SPARC, but is
supported on X86.
.SH DIAGNOSTICS
.sp
.LP
The messages described below may appear on the system console as well as
being logged. All  messages are formatted in the following manner:
.sp
.in +2
.nf
WARNING: Error message...
.fi
.in -2
.sp

.sp
.ne 2
.mk
.na
\fBNo driver found for device <device_name> (interface <number> node
name=<node_name>)\fR
.ad
.sp .6
.RS 4n
The installed Solaris software does not contain a supported driver for this
hardware. <number> is the interface number.  <name> is either the device
path name or the device name.
.RE

.sp
.ne 2
.mk
.na
.B Draining callbacks timed out!
.ad
.sp .6
.RS 4n
An internal error occured.  Please reboot your system.  If this problem
persists, contact your system vendor.
.RE

.sp
.LP
The following messages may be logged into the system log. They are
formatted in the following manner:
.sp
.in +2
.nf
<device path><usba<instance number>): message...
.fi
.in -2
.sp

.sp
.ne 2
.mk
.na
.B "Incorrect USB driver version for <n.m>.
.ad
.sp .6
.RS 4n
Driver is incompatible with USBA framework.
.RE

