usr/src/man/man7d/usbsacm.7d
'\" te
.\" Copyright (c) 2006, Sun Microsystems, Inc.  All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH usbsacm 7D "1 Nov 2006" "SunOS 5.11" "Devices"
.SH NAME
usbsacm \- USB communication device class ACM driver
.SH SYNOPSIS
.LP
.nf
#include <sys/termio.h>

usbsacm@unit
.fi

.LP
.nf

.fi

.SH DESCRIPTION
.sp
.LP
The
.B usbsacm
driver is a loadable STREAMS and USBA (Solaris USB
architecture)-compliant client driver that provides basic asynchronous
communication support for USB modems and ISDN terminal adapters that conform
to the \fIUniversal Serial Bus Communication Device Class Abstract Control
Model (USB CDC ACM)\fR specification. You can download the \fIUSB CDC\fR
specification from the USB website at
\fIhttp://www.usb.org/developers/devclass_docs/usbcdc11.pdf\fR.
Supported devices include mobile phones and PCMCIA cards which provide
modem function by the usb cable. Serial device streams are built with
appropriate modules that are pushed atop the usbsacm driver by the
.BR autopush (1M)
facility.
.sp
.LP
The
.B usbsacm
module supports the
.BR termio "(7I) device control"
functions specified by flags in the c_cflag word of termios structure, and
by the IGNBRK, IGNPAR, PARMRK and INPCK flags in the c_iflag word of the
termios structure. All other \fBtermio\fR(7I) functions must be performed by
STREAMS modules pushed atop the driver. When a device is opened, the
.BR ldterm (7M)
and
.BR ttcompat "(7M) STREAMS modules are automatically"
pushed on top of the stream, providing the standard \fBtermio\fR(7I)
interface. 
.sp
.LP
You use device logical names /dev/term/[\fI0-9\fR]* to access the serial
ports. These names are typically used to provide a logical access point for
a dial-in line that is used with a modem. You can use
.BR pppd (1M)
to
transmit datagrams over these serial ports.
.sp
.LP
A special feature (controlled by the minor device number) is available that
enables a single tty line to be connected to a modem and used for incoming
and outgoing calls. By accessing through device logical name
/dev/cua/[\fI0-9\fR]*, you can open a port without the carrier detect signal
being asserted, either through hardware or an equivalent software mechanism.
These devices are commonly known  as 'dial-out' lines.
.sp
.LP
Unlike onboard serial ports, the
.B usbsacm
ports cannot serve as a
local serial console.
.SH APPLICATION PROGRAMMING INTERFACE
.sp
.LP
A dial-in line can  be  opened  only  if  the corresponding dial-out  line
is closed. A blocking /dev/term open waits until the /dev/cua line is closed
(which drops Data Terminal Ready, after which Carrier Detect usually drops
as well) and carrier is detected again.  A non-blocking  /dev/term open
returns an error if the /dev/cua is open.
.sp
.LP
If the /dev/term line is opened successfully  (usually  only when  carrier
is recognized on the modem), the corresponding      /dev/cua line cannot be
opened. This allows a modem and port to  be  used  for dial-in (by enabling
the line for login in
.BR /etc/inittab )
or dial-out (by
.BR tip (1)
or
.BR uucp (1C))
as
.B /dev/cua0
when no one is logged in on the line.
.sp
.LP
Device hot-removal  is functionally equivalent to a modem disconnect event,
as defined in
.BR termio (7I).
.SH IOCTLS
.sp
.LP
The 
.B usbsacm
driver supports the standard set of
.BR termio (7I)
ioctl calls.
.sp
.LP
The input and output line speeds may be set to any of the following baud
rates: 75, 150, 300, 600, 1200, 1800, 2400, 4800, 9600, 19200, 38400, 57600,
115200, 230400 or 460800. The speeds cannot be set independently. For
example, when the output speed is set, the input speed is automatically set
to the same speed.
.SH ERRORS
.sp
.LP
An
.B open()
fails under the following conditions:
.sp
.ne 2
.mk
.na
.B ENXIO
.ad
.RS 9n
.rt
The unit being opened does not exist.
.RE

.sp
.ne 2
.mk
.na
.B EBUSY
.ad
.RS 9n
.rt
The /dev/cua (dial-out) device is being opened  while the /dev/term
(dial-in device) is open, or the dial-in device is being opened with a
no-delay open while the dial-out device is open.
.RE

.sp
.ne 2
.mk
.na
.B EBUSY
.ad
.RS 9n
.rt
The unit has been marked as exclusive-use by another process with a
\fBTIOCEXCL ioctl()\fR call.
.RE

.sp
.ne 2
.mk
.na
.B EIO
.ad
.RS 9n
.rt
USB device I/O error.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B /kernel/drv/usbsacm
.ad
.sp .6
.RS 4n
32-bit ELF kernel module. (x86)
.RE

.sp
.ne 2
.mk
.na
.B /kernel/drv/amd64/usbsacm
.ad
.sp .6
.RS 4n
64-bit ELF kernel module. (x86)
.RE

.sp
.ne 2
.mk
.na
.B /kernel/drv/sparcv9/usbsacm
.ad
.sp .6
.RS 4n
64-bit ELF kernel module. (SPARC)
.RE

.sp
.ne 2
.mk
.na
\fB/dev/cua/[0-9]\fR
.ad
.sp .6
.RS 4n
dial-out tty lines
.RE

.sp
.ne 2
.mk
.na
\fB/dev/term/[0-9]\fR
.ad
.sp .6
.RS 4n
dial-in tty lines
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Architecture SPARC, x86 PCI-based systems
_
AvailabilitySUNWuacm
.TE

.SH SEE ALSO
.sp
.LP
\fBstrconf\fR(1), \fBtip\fR(1),\fBuucp\fR(1C), \fBautopush\fR(1M),
.BR pppd (1M),
.BR ioctl (2),
.BR open (2),
.BR termios (3C),
.BR attributes (5),
.BR usba (7D),
.BR termio (7I),
.BR ldterm (7M),
.BR ttcompat (7M)
.SH DIAGNOSTICS
.sp
.LP
In addition to being logged, the following messages may appear on the
system console. All messages are formatted in the     following manner:
.sp
.in +2
.nf
Warning: <device path> (usbsacm<instance num>):Error Message...
.fi
.in -2
.sp

.sp
.ne 2
.mk
.na
.B "Device was disconnected while open. Data may have been lost.
.ad
.sp .6
.RS 4n
The device has been hot-removed or powered off while it was open and a
possible data transfer was in progress. The job may be aborted.
.RE

.sp
.ne 2
.mk
.na
\fBDevice is not identical to the previous one on this port. Please
disconnect and reconnect.\fR
.ad
.sp .6
.RS 4n
The device was hot-removed while open. A new device was hot-inserted which
is not identical to the original device. Please disconnect the device and
reconnect the original device to the same port.
.RE

.sp
.ne 2
.mk
.na
.B "Device has been reconnected, but data may have been lost.
.ad
.sp .6
.RS 4n
The device that was hot-removed from its USB port has been 	re-inserted
again to the same port. It is available for access but data from a previous
transfer may be lost.
.RE

.sp
.ne 2
.mk
.na
.B Cannot access <device>. Please reconnect.
.ad
.sp .6
.RS 4n
This device has been disconnected because a device other than the original
one has been inserted. The driver informs you of this fact by displaying the
name of the original device.
.RE

.sp
.LP
The following messages may be logged into the system log. They are
formatted in the following manner:
.sp
.in +2
.nf
<device path><usbsacm<instance number>): message...
.fi
.in -2
.sp

.sp
.ne 2
.mk
.na
.B Input overrun.
.ad
.RS 18n
.rt
Data was lost.
.RE

