usr/src/man/man7d/usbsksp.7d
'\" te
.\" Copyright (c) 2006, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH usbsksp 7D "23 August 2006" "SunOS 5.11" "Devices"
.SH NAME
usbsksp \- Keyspan USB to serial converter driver
.SH SYNOPSIS
.LP
.nf
#include <fcntl.h>
.fi

.LP
.nf
#include <sys/termio.h>
.fi

.LP
.nf
usbskpsp@unit
.fi

.SH DESCRIPTION
.sp
.LP
The
.B usbsksp
driver is a loadable
.B STREAMS
and
.B USBA
(Solaris
USB architecture) compliant client driver that provides basic asynchronous
communication support for Keyspan USB-to-serial converters. The
.B usbsksp
driver supports the Keyspan USA19HS, USA49WG and USA49WLC models. By default,
the USA19HS and USA49WG models are compatible with the
.B usbsksp
driver and
no configuration or installation steps are required.  (The USA49WG model is a
USB 2.0 device comforming to
.I "Universal Serial Bus Specification 2.0"
and
the USB 2.0 host controller is required to support the USA49WG model. Note that
the USA49WG is not compatible with USB 1.1 host controllers). If you use the
Keyspan USA49WLC model, you must download and install a firmware package to
enable the device to work with the
.B usbsksp
driver. See the Keyspan website
.RI ( http://www.keyspan.com/downloads/sun/ )
for more information. Serial
device streams are built with appropriate modules that  are  pushed atop the
.B usbsksp
driver by the
.BR autopush (1M)
facility.
.sp
.LP
The
.B usbsksp
module supports the
.BR termio (7I)
device control functions
specified by flags in the
.B c_cflag
word of the termios structure, and by
the IGNBRK,  IGNPAR,  PARMRK and INPCK flags in the
.B c_iflag
word of the
termios structure. All other
.BR termio (7I)
functions must be performed by
.B STREAMS
modules pushed atop the driver. When a device is opened, the
.BR ldterm (7M)
and
.BR ttcompat "(7M) "
.B STREAMS
modules are automatically
pushed on top of the stream, providing the standard
.BR termio (7I)
interface.

.sp
.LP
Use device logical names
.BR /dev/term/[0-9] *
to  access  the serial ports.
These names are typically used to provide a logical access point for a dial-in
line that is used with a modem.
.sp
.LP
A special feature (controlled by the minor device number) is available that
enables a single tty line to be connected to a modem and used for incoming and
outgoing calls. By accessing through device logical name
.BR /dev/cua/[0-9] *,
you can open a port without  the carrier detect signal being asserted, either
through hardware or an equivalent software mechanism. These devices are
commonly
known as  'dial-out' lines.
.sp
.LP
Unlike onboard serial ports, the
.B usbsksp
ports  cannot serve as a local
serial console.
.SH APPLICATION PROGRAMMING INTERFACE
.sp
.LP
A dial-in line can be opened only if the corresponding dial-out line is closed.
A blocking
.B /dev/term
open waits until the
.B /dev/cua
line is closed
(which drops Data Terminal Ready, after which Carrier Detect usually drops as
well) and carrier is detected again.  A non-blocking
.B /dev/term
open
returns an error if the
.B /dev/cua
is open.
.sp
.LP
If the
.B /dev/term
line is opened successfully  (usually  only when
carrier is recognized on the modem), the corresponding
.B /dev/cua
line
cannot be opened. This allows a modem and port to be used  for dial-in (by
enabling the line for login in
.BR /etc/inittab )
or dial-out (by
.BR tip (1),
or
.BR uucp "(1C)) when no one is logged in on the line."
.sp
.LP
Device hot-removal  is functionally equivalent to a modem disconnect event, as
defined in
.BR termio (7I).
.SH IOCTLS
.sp
.LP
The
.B usbsksp
driver supports the  standard set of
.BR termio "(7I) ioctl"
calls.
.sp
.LP
Input and output line speeds can be set to the following baud rates:  0, 50,
75, 110, 134, 150, 200, 300, 600, 1200, 1800, 2400, 4800, 9600,  19200,  38400,
57600, 115200, or 230400.  Input and output line speeds cannot be set
independently. For example, when the output speed is set, the input speed is
automatically set to the same speed.
.SH ERRORS
.sp
.LP
An
.B open()
fails under the following conditions:
.sp
.ne 2
.mk
.na
.B ENXIO
.ad
.RS 9n
.rt
The  unit being opened does not exist.
.RE

.sp
.ne 2
.mk
.na
.B EBUSY
.ad
.RS 9n
.rt
The
.B /dev/cua
.RB "(dial-out) device is being opened while  the" " /dev/term"
(dial-in device) is open, or the dial-in device is being opened with a no-delay
open while the dial-out device is open.
.RE

.sp
.ne 2
.mk
.na
.B EBUSY
.ad
.RS 9n
.rt
The  unit has been marked as exclusive-use by another  process with a TIOCEXCL
ioctl() call.
.RE

.sp
.ne 2
.mk
.na
.B EIO
.ad
.RS 9n
.rt
USB device I/O error.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B /kernel/drv/usbsksp
.ad
.sp .6
.RS 4n
32-bit x86 ELF kernel module.
.RE

.sp
.ne 2
.mk
.na
.B /kernel/drv/amd64/usbsksp
.ad
.sp .6
.RS 4n
64-bit x86 ELF kernel module.
.RE

.sp
.ne 2
.mk
.na
.B /kernel/drv/sparcv9/usbsksp
.ad
.sp .6
.RS 4n
64-bit SPARC ELF kernel module.
.RE

.sp
.ne 2
.mk
.na
.B /dev/cua/[0-9]*
.ad
.sp .6
.RS 4n
dial-out tty lines.
.RE

.sp
.ne 2
.mk
.na
.B /dev/term/[0-9]*
.ad
.sp .6
.RS 4n
dial-in tty lines.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
ArchitectureSPARC, x86, PCI-based systems
_
AvailabilitySUNWuksp
.TE

.SH SEE ALSO
.sp
.LP
.BR strconf (1),
.BR tip (1),
.BR uucp (1C),
.BR autopush (1M),
.BR ioctl (2),
.BR open (2),
.BR termios (3C),
.BR attributes (5),
.BR usba (7D),
.BR termio (7I),
.BR ldterm (7M),
.BR ttcompat (7M)
.SH DIAGNOSTICS
.sp
.LP
In addition to being logged, the following messages may appear on the system
console. All messages are formatted in the following manner:
.sp
.in +2
.nf
Warning: <device path> (usbsksp<instance num>): Error Message...
.fi
.in -2
.sp

.sp
.ne 2
.mk
.na
.B "Device was disconnected while open. Data may have been lost.
.ad
.sp .6
.RS 4n
The device has been hot-removed or powered off while it was open and a possible
data transfer was in progress. The job may be aborted.
.RE

.sp
.ne 2
.mk
.na
\fBDevice is not identical to the previous one on this port. Please disconnect
and reconnect.\fR
.ad
.sp .6
.RS 4n
The device was hot-removed while open. A new device  was hot-inserted which is
not identical to the original device. Please disconnect the device and
reconnect
the original device to the same port.
.RE

.sp
.ne 2
.mk
.na
.B "Device has been reconnected, but data may have been lost.
.ad
.sp .6
.RS 4n
The device that was hot-removed from its USB port has been re-inserted again to
the same port. It is available for access but data from a  previous transfer
may
be lost.
.RE

.sp
.ne 2
.mk
.na
\fBCannot access <\fIdevice\fR>. Please reconnect.\fR
.ad
.sp .6
.RS 4n
This device has been disconnected because a device other than the original one
has been inserted. The driver informs you of this fact by displaying the name
of
the original device.
.RE

.sp
.ne 2
.mk
.na
\fBNo valid firmware available for Keyspan usa49wlc usb-to-serial adapter.
Please download it from Keyspan website and install it.\fR
.ad
.sp .6
.RS 4n
By default, only an empty firmware package is installed for the usa49wlc model.
Please download the SUNWukspfw package from Keyspan's web site and install it.
.RE

.sp
.LP
The following messages may be logged into the system log. They are formatted in
the following manner:
.sp
.in +2
.nf
<device path><usbsksp<instance number>): message...
.fi
.in -2
.sp

.sp
.ne 2
.mk
.na
.B Input overrun
.ad
.RS 17n
.rt
Data was lost.
.RE

