usr/src/man/man7d/uwba.7d
'\" te
.\" Copyright (c) 2009, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH uwba 7D "17 Apr 2009" "SunOS 5.11" "Devices"
.SH NAME
uwba, uwb \- Solaris UWB Architecture (UWBA)
.SH DESCRIPTION
.sp
.LP
Ultra-WideBand (UWB) radio technology supports high bandwidth for wireless
devices. UWBA is a miscellaneous module and it supports radio controller
drivers for UWB based devices like HWA (Host Wire Adapter), WHCI (Wireless
Host Controller Interface) and so forth. For example, both HWA radio
controller driver
.RB ( hwarc )
and
.B whci
driver register to
.B
uwba
during attach.
.sp
.LP
UWBA provides a series of common interfaces for drivers that support UWB
radio technology. Each radio controller driver register itself as a UWB dev
to the uwba model in the attach entry, then other driver or module can
control this device to perform the UWB functions through a list of common
interface. For example, a
.B hwahc
driver can control the
.BR hwarc
driver to scan in a specific channel, start/stop beacon, manage device/MAC
address, and so forth.
.SH FILES
.sp
.ne 2
.mk
.na
.B /kernel/misc/uwba
.ad
.RS 29n
.rt
32-bit ELF 86 kernel module
.RE

.sp
.ne 2
.mk
.na
.B /kernel/misc/amd64/uwba
.ad
.RS 29n
.rt
64-bit x86 ELF kernel module
.RE

.sp
.ne 2
.mk
.na
.B /kernel/misc/sparcv9/uwba
.ad
.RS 29n
.rt
64-bit SPARC ELF kernel module
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for a description of the following attributes:
.sp

.sp
.TS
tab() box;
lw(2.75i) |lw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
ArchitecturePCI-based systems
_
AvailabilitySUNWuwb
.TE

.SH SEE ALSO
.sp
.LP
.BR attributes (5),
.BR hwahc (7D),
.BR hwarc (7D),
.BR usba (7D)
.sp
.LP
.I Writing Device Drivers
.sp
.LP
.I "ECMA-368 High Rate Ultra Wideband PHY and MAC Standard, 1st Edition
.sp
.LP
\fIWireless Host Controller Interface Specification for Certified Wireless
Universal Serial Bus, Version 0.95\fR
.sp
.LP
.I "Wireless Universal Serial Bus Specification 1.0
