usr/src/man/man7d/vr.7d
'\" te
.\" Copyright (c) 2009, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH vr 7D "5 May 2009" "SunOS 5.11" "Devices"
.SH NAME
vr \- driver for VIA Rhine fast Ethernet controllers
.SH DESCRIPTION
.sp
.LP
The
.B vr
Fast Ethernet driver is GLD based and supporting the VIA Rhine
family of Fast Ethernet adapters:
.sp
.in +2
.nf
pci1106,3043 VIA VT86C100A Fast Ethernet
pci1106,3065 VT6102 VIA Rhine II
pci1106,3106 VT6105 VIA Rhine III
pci1106,3053 VT6105 VIA Rhine III Management Adapter
.fi
.in -2
.sp

.sp
.LP
The
.B vr
driver supports IEEE 802.3 auto-negotiation, flow control and
VLAN tagging.
.SS "Configuration"
.sp
.LP
The default configuration is
.B autonegotiation
with bidirectional flow
control. The advertised capabilities for
.B autonegotiation
are based on
the capabilities of the PHY.
.sp
.LP
You can set the capabilities advertised by the
.B vr
controlled device
using \fBdladm\fR(1M). The driver supports a number of parameters, the names
of which begin with
.B en_
(enabled). Each of these boolean parameters
determines if the device advertises that mode of operation when the hardware
supports it.
.sp
.LP
The
.B adv_autoneg_cap
parameter controls whether auto-negotiation is
performed. If
.B adv_autoneg_cap
is 0, the driver selects the
speed/duplex combination from the first non-zero parameter from this list:
.sp
.in +2
.nf
en_100fdx_cap     100Mpbs full duplex
en_100hdx_cap     100Mpbs half duplex
en_10fdx_cap      10Mpbs full duplex
en_10hdx_cap      10Mpbs half duplex
.fi
.in -2
.sp

.sp
.LP
All capabilities default to enabled. Changing any capability parameter
causes the link to go down while the link partners renegotiate the link
using the newly changed capabilities.
.SS "Limitations"
.sp
.LP
The
.B vr
driver does not support asymmetric
.BR flowcontrol .
VT86C100A and Rhine II adapters are not capable of transmitting
.B flowcontrol
messages
.SH FILES
.sp
.ne 2
.mk
.na
.B /dev/vr
.ad
.RS 26n
.rt
Special character device
.RE

.sp
.ne 2
.mk
.na
.B /kernel/drv/vr
.ad
.RS 26n
.rt
32-bit device driver (x86)
.RE

.sp
.ne 2
.mk
.na
.B /kernel/drv/sparcv9/vr
.ad
.RS 26n
.rt
64-bit device driver (SPARC)
.RE

.sp
.ne 2
.mk
.na
.B /kernel/drv/amd64/vr
.ad
.RS 26n
.rt
64-bit device driver (x86)
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for a description of the following attributes:
.sp

.sp
.TS
tab() box;
lw(2.75i) |lw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
ArchitectureSPARC, x86
.TE

.SH SEE ALSO
.sp
.LP
.BR dladm (1M),
.BR netstat (1M),
.BR driver.conf (4),
.BR attributes (5),
.BR ieee802.3 (5),
.BR dlpi (7P),
.BR streamio (7I)
.sp
.LP
.I Writing Device Drivers
.sp
.LP
.I STREAMS Programmer's Guide
.sp
.LP
.I Network Interfaces Programmer's Guide
.sp
.LP
.I IEEE 802.3ae Specification - 2002
