usr/src/man/man7d/wusb_df.7d
'\" te
.\" Copyright (c) 2009, Sun Microsystems, Inc. All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH wusb_df 7D "18 Sep 2009" "SunOS 5.11" "Devices"
.SH NAME
wusb_df, hwa1480_fw \- WUSB firmware download driver and firmware module
for Intel i1480 chipset
.SH DESCRIPTION
.sp
.LP
The \fBwusb_df\fR driver is a Solaris USB Architecture (USBA) compliant
client driver that is used to download firmware for Host Wire Adapter (HWA)
dongles that use Intel i1480 chipsets.
.sp
.LP
Currently, the \fBwusb_df\fR driver can only download driver for Intel
i1480 based HWA dongles. The \fBhwa1480_fw\fR is a miscellaneous module
which is transformed from Intel's firmware binary version RC1.3PA2-20070828.
\fBwusb_df\fR reads firmware data from \fBhwa1480_fw\fR module and downloads
it to HWA hardware.
.sp
.LP
Users can use
.BR elfwrap (1)
to transform new firmware binary. Users must
use the same name as
.BR hwa1480_fw ,
since \fBwusb_df\fR only recognizes
this symbol.
.SH FILES
.sp
.ne 2
.mk
.na
\fB/kernel/drv/wusb_df\fR
.ad
.sp .6
.RS 4n
32-bit ELF 86 kernel module
.RE

.sp
.ne 2
.mk
.na
\fB/kernel/drv/sparcv9/wusb_df\fR
.ad
.sp .6
.RS 4n
64-bit SPARC ELF kernel module
.RE

.sp
.ne 2
.mk
.na
\fB/kernel/drv/amd64/wusb_df\fR
.ad
.sp .6
.RS 4n
64-bit x86 ELF kernel module
.RE

.sp
.ne 2
.mk
.na
.B /kernel/misc/hwa_1480
.ad
.sp .6
.RS 4n
32-bit ELF 86 kernel module
.RE

.sp
.ne 2
.mk
.na
.B /kernel/misc/sparcv9/hwa_1480
.ad
.sp .6
.RS 4n
64-bit SPARC ELF kernel module
.RE

.sp
.ne 2
.mk
.na
.B /kernel/drv/amd64/hwa_1480
.ad
.sp .6
.RS 4n
64-bit x86 ELF kernel module
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for a description of the following attributes:
.sp

.sp
.TS
tab() box;
lw(2.75i) |lw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
ArchitectureSPARC, x86, PCI-based systems
_
AvailabilitySUNWusb
.TE

.SH SEE ALSO
.sp
.LP
\fBelfwrap\fR(1)\fBadd_drv\fR(1M), \fBrem_drv\fR(1M), \fBupdate_drv\fR(1M),
.BR attributes (5)
.sp
.LP
.I Writing Device Drivers
.sp
.LP
.I System Administration Guide: Basic Administration
.sp
.LP
\fIWireless Universal Serial Bus Specification 1.0\fR
.sp
.LP
http://www.usb.org
.sp
.LP
http://www.sun.com
