usr/src/man/man7d/wusb_ca.7d
'\" te
.\" Copyright (c) 2009, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH wusb_ca 7D "17 Apr 2009" "SunOS 5.11" "Devices"
.SH NAME
wusb_ca \- WUSB Cable Association Driver
.SH DESCRIPTION
.sp
.LP
The
.B wusb_ca
driver is a USBA (Solaris USB Architecture) compliant
client driver that supports the cable association model which is defined in
Association Models Supplement to the Certified WUSB specification.
.sp
.LP
The wireless USB cable association driver is a USB class driver that
provides interfaces for establishing a first-time connection between
Wireless USB hosts and devices. This process of establishing a first-time
connection is called
.I association
in WUSB standard. It is a
prerequisite process that must be completed by hosts and devices prior to
implementing the security requirements outlined in
.IR "Wireless Universal Serial Bus Specification 1.0" .
.sp
.LP
Users should use
.BR wusbadm (1M)
to do cable association for WUSB
devices.
.SH FILES
.sp
.ne 2
.mk
.na
.B /kernel/drv/wusb_ca
.ad
.sp .6
.RS 4n
32-bit ELF 86 kernel module
.RE

.sp
.ne 2
.mk
.na
.B /kernel/drv/amd64/wusb_ca
.ad
.sp .6
.RS 4n
64-bit x86 ELF kernel module
.RE

.sp
.ne 2
.mk
.na
.B /kernel/drv/sparcv9/wusb_ca
.ad
.sp .6
.RS 4n
64-bit SPARC ELF kernel module
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for a description of the following attributes:
.sp

.sp
.TS
tab() box;
lw(2.75i) |lw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
ArchitectureSPARC, x86, PCI-based systems
_
AvailabilitySUNWusb
.TE

.SH SEE ALSO
.sp
.LP
.BR wusbadm (1M),
.BR attributes (5),
.BR hwahc (7D),
.BR hwarc (7D),
.BR usba (7D)
.sp
.LP
.I Writing Device Drivers
.sp
.LP
.I System Administration Guide: Basic Administration
.sp
.LP
.I "Wireless Universal Serial Bus Specification 1.0
.sp
.LP
http://www.usb.org
.sp
.LP
http://www.sun.com
