usr/src/man/man7d/wusb_df.7d
'\" te
.\" Copyright (c) 2009, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH wusb_df 7D "18 Sep 2009" "SunOS 5.11" "Devices"
.SH NAME
wusb_df, hwa1480_fw \- WUSB firmware download driver and firmware module
for Intel i1480 chipset
.SH DESCRIPTION
.sp
.LP
The
.B wusb_df
driver is a Solaris USB Architecture (USBA) compliant
client driver that is used to download firmware for Host Wire Adapter (HWA)
dongles that use Intel i1480 chipsets.
.sp
.LP
Currently, the
.B wusb_df
driver can only download driver for Intel
i1480 based HWA dongles. The
.B hwa1480_fw
is a miscellaneous module
which is transformed from Intel's firmware binary version RC1.3PA2-20070828.
.B wusb_df
reads firmware data from
.B hwa1480_fw
module and downloads
it to HWA hardware.
.sp
.LP
Users can use
.BR elfwrap (1)
to transform new firmware binary. Users must
use the same name as
.BR hwa1480_fw ,
since
.B wusb_df
only recognizes
this symbol.
.SH FILES
.sp
.ne 2
.mk
.na
.B /kernel/drv/wusb_df
.ad
.sp .6
.RS 4n
32-bit ELF 86 kernel module
.RE

.sp
.ne 2
.mk
.na
.B /kernel/drv/sparcv9/wusb_df
.ad
.sp .6
.RS 4n
64-bit SPARC ELF kernel module
.RE

.sp
.ne 2
.mk
.na
.B /kernel/drv/amd64/wusb_df
.ad
.sp .6
.RS 4n
64-bit x86 ELF kernel module
.RE

.sp
.ne 2
.mk
.na
.B /kernel/misc/hwa_1480
.ad
.sp .6
.RS 4n
32-bit ELF 86 kernel module
.RE

.sp
.ne 2
.mk
.na
.B /kernel/misc/sparcv9/hwa_1480
.ad
.sp .6
.RS 4n
64-bit SPARC ELF kernel module
.RE

.sp
.ne 2
.mk
.na
.B /kernel/drv/amd64/hwa_1480
.ad
.sp .6
.RS 4n
64-bit x86 ELF kernel module
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for a description of the following attributes:
.sp

.sp
.TS
tab() box;
lw(2.75i) |lw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
ArchitectureSPARC, x86, PCI-based systems
_
AvailabilitySUNWusb
.TE

.SH SEE ALSO
.sp
.LP
\fBelfwrap\fR(1)\fBadd_drv\fR(1M), \fBrem_drv\fR(1M), \fBupdate_drv\fR(1M),
.BR attributes (5)
.sp
.LP
.I Writing Device Drivers
.sp
.LP
.I System Administration Guide: Basic Administration
.sp
.LP
.I "Wireless Universal Serial Bus Specification 1.0
.sp
.LP
http://www.usb.org
.sp
.LP
http://www.sun.com
