usr/src/man/man7d/yge.7d
'\" te
.\" Copyright (c) 2009, Sun Microsystems, Inc. All rights reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH yge 7D "15 Sep 2009" "SunOS 5.11" "Devices"
.SH NAME
yge \- Marvell Yukon 2 Ethernet device driver
.SH SYNOPSIS
.sp
.in +2
.nf
/dev/net/yge
.fi
.in -2

.SH DESCRIPTION
.sp
.LP
The
.B yge
driver supports Marvell Yukon 2 Fast Ethernet and Gigabit
Ethernet controllers.
.SS "Properties"
.sp
.LP
The following properties can be configured using
.BR dladm (1M):
.sp
.ne 2
.mk
.na
.B adv_autoneg_cap
.ad
.RS 19n
.rt
Enables (default) or disables IEEE 802.3 auto-negotiation of link speed and
duplex settings. If enabled, the device negotiates among the supported (and
configured, see below) link options with the link partner. If disabled, at
least one of the link options below must be specified. The driver selects
the first enabled link option according to the IEEE 802.3 specified
preferences.
.RE

.sp
.ne 2
.mk
.na
.B adv_1000fdx_cap
.ad
.RS 19n
.rt
Enables the 1000 Mbps full-duplex link option.
.RE

.sp
.ne 2
.mk
.na
.B adv_1000hdx_cap
.ad
.RS 19n
.rt
Enables the 1000 Mbps half-duplex link option.
.RE

.sp
.ne 2
.mk
.na
.B adv_100T4_cap
.ad
.RS 19n
.rt
Enables the 100 BaseT4 link option. (Note that most hardware does not
support this unusual link style. Also, this uses two pairs of wires for
data, rather than one.)
.RE

.sp
.ne 2
.mk
.na
.B adv_100fdx_cap
.ad
.RS 19n
.rt
Enables the 1000 Mbps full-duplex link option.
.RE

.sp
.ne 2
.mk
.na
.B adv_100hdx_cap
.ad
.RS 19n
.rt
Enables the 1000 Mbps half-duplex link option.
.RE

.sp
.ne 2
.mk
.na
.B adv_10fdx_cap
.ad
.RS 19n
.rt
Enables the 10 Base-T full-duplex link option.
.RE

.sp
.ne 2
.mk
.na
.B adv_10hdx_cap
.ad
.RS 19n
.rt
Enables the 10 Base-T half-duplex link option.
.RE

.sp
.ne 2
.mk
.na
.B mtu
.ad
.RS 19n
.rt
On most devices, can be set between 1500 (default) and 9000. This property
can only be changed when the device is not in use.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B /dev/net/yge
.ad
.RS 27n
.rt
Special network device
.RE

.sp
.ne 2
.mk
.na
.B /kernel/drv/yge
.ad
.RS 27n
.rt
32-bit driver binary (x86)
.RE

.sp
.ne 2
.mk
.na
.B /kernel/drv/amd64/yge
.ad
.RS 27n
.rt
64-bit driver binary (x86)
.RE

.sp
.ne 2
.mk
.na
.B /kernel/drv/sparcv9/yge
.ad
.RS 27n
.rt
64-bit driver binary (SPARC)
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for a descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(1.83i) |cw(3.67i)
lw(1.83i) |lw(3.67i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Architecturex86, SPARC
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
.BR dladm (1M),
.BR attributes (5),
.BR dlpi (7P)
