usr/src/man/man7d/yge.7d
'\" te
.\" Copyright (c) 2009, Sun Microsystems, Inc. All rights reserved.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH yge 7D "15 Sep 2009" "SunOS 5.11" "Devices"
.SH NAME
yge \- Marvell Yukon 2 Ethernet device driver
.SH SYNOPSIS
.sp
.in +2
.nf
/dev/net/yge
.fi
.in -2

.SH DESCRIPTION
.sp
.LP
The \fByge\fR driver supports Marvell Yukon 2 Fast Ethernet and Gigabit
Ethernet controllers.
.SS "Properties"
.sp
.LP
The following properties can be configured using \fBdladm\fR(1M):
.sp
.ne 2
.mk
.na
\fBadv_autoneg_cap\fR
.ad
.RS 19n
.rt
Enables (default) or disables IEEE 802.3 auto-negotiation of link speed and
duplex settings. If enabled, the device negotiates among the supported (and
configured, see below) link options with the link partner. If disabled, at
least one of the link options below must be specified. The driver selects
the first enabled link option according to the IEEE 802.3 specified
preferences.
.RE

.sp
.ne 2
.mk
.na
\fBadv_1000fdx_cap\fR
.ad
.RS 19n
.rt
Enables the 1000 Mbps full-duplex link option.
.RE

.sp
.ne 2
.mk
.na
\fBadv_1000hdx_cap\fR
.ad
.RS 19n
.rt
Enables the 1000 Mbps half-duplex link option.
.RE

.sp
.ne 2
.mk
.na
\fBadv_100T4_cap\fR
.ad
.RS 19n
.rt
Enables the 100 BaseT4 link option. (Note that most hardware does not
support this unusual link style. Also, this uses two pairs of wires for
data, rather than one.)
.RE

.sp
.ne 2
.mk
.na
\fBadv_100fdx_cap\fR
.ad
.RS 19n
.rt
Enables the 1000 Mbps full-duplex link option.
.RE

.sp
.ne 2
.mk
.na
\fBadv_100hdx_cap\fR
.ad
.RS 19n
.rt
Enables the 1000 Mbps half-duplex link option.
.RE

.sp
.ne 2
.mk
.na
\fBadv_10fdx_cap\fR
.ad
.RS 19n
.rt
Enables the 10 Base-T full-duplex link option.
.RE

.sp
.ne 2
.mk
.na
\fBadv_10hdx_cap\fR
.ad
.RS 19n
.rt
Enables the 10 Base-T half-duplex link option.
.RE

.sp
.ne 2
.mk
.na
\fBmtu\fR
.ad
.RS 19n
.rt
On most devices, can be set between 1500 (default) and 9000. This property
can only be changed when the device is not in use.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
\fB/dev/net/yge\fR
.ad
.RS 27n
.rt
Special network device
.RE

.sp
.ne 2
.mk
.na
\fB/kernel/drv/yge\fR
.ad
.RS 27n
.rt
32-bit driver binary (x86)
.RE

.sp
.ne 2
.mk
.na
\fB/kernel/drv/amd64/yge\fR
.ad
.RS 27n
.rt
64-bit driver binary (x86)
.RE

.sp
.ne 2
.mk
.na
\fB/kernel/drv/sparcv9/yge\fR
.ad
.RS 27n
.rt
64-bit driver binary (SPARC)
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for a descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(1.83i) |cw(3.67i)
lw(1.83i) |lw(3.67i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Architecturex86, SPARC
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
\fBdladm\fR(1M), \fBattributes\fR(5), \fBdlpi\fR(7P)
