usr/src/man/man7d/zcons.7d
'\" te
.\" Copyright 2003 Sun Microsystems, Inc. All rights reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH zcons 7D "24 Aug 2003" "SunOS 5.11" "Devices"
.SH NAME
zcons \- Zone console device driver
.SH DESCRIPTION
.sp
.LP
The
.B zcons
character driver exports the console for system zones. The
driver is comprised of two "sides:" a master side with which applications in
the global zone communicate, and a slave side, which receives I/O from the
master side. The slave side is available in the global zones.
.sp
.LP
Applications must not depend on the location of
.B /dev
or
.B /devices
entries exported by
.BR zcons .
Inside a zone, the
.B zcons
slave  side is fronted by
.B /dev/console
and other
console-related symbolic links, which are used by applications that expect
to write to the system console.
.sp
.LP
The
.B zcons
driver is Sun Private, and may change in future releases.
.SH FILES
.sp
.ne 2
.mk
.na
\fB/dev/zcons/<\fIzonename\fR>/masterconsole\fR
.ad
.sp .6
.RS 4n
Global zone master side console for zone <\fIzonename\fR>.
.RE

.sp
.ne 2
.mk
.na
\fB/dev/zcons/<\fIzonename\fR>/slaveconsole\fR
.ad
.sp .6
.RS 4n
Global zone slave side console for zone <\fIzonename\fR>.
.RE

.sp
.ne 2
.mk
.na
.B /dev/zconsole
.ad
.sp .6
.RS 4n
Non-global zone console (slave side).
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
_
 Interface StabilitySun Private
.TE

.SH SEE ALSO
.sp
.LP
.BR zoneadm (1M),
.BR zonecfg (1M),
.BR attributes (5),
.BR zones (5)
