usr/src/man/man7d/zero.7d
'\" te
.\" Copyright 1989 AT&T  Copyright (c) 1990, Sun Microsystems, Inc.  All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH zero 7D "3 Jul 1990" "SunOS 5.11" "Devices"
.SH NAME
zero \- source of zeroes
.SH DESCRIPTION
.sp
.LP
A zero special file is a source of zeroed unnamed memory.
.sp
.LP
Reads from a zero special file always return a buffer full of zeroes. The
file is of infinite length.
.sp
.LP
Writes to a zero special file are always successful, but the data written
is ignored.
.sp
.LP
Mapping a zero special file creates a zero-initialized unnamed memory
object of a length equal to the length of the mapping and rounded up to the
nearest page size as returned by
.BR sysconf .
Multiple processes can share
such a zero special file object provided a common ancestor mapped the object
.BR MAP_SHARED .
.SH FILES
.sp
.ne 2
.mk
.na
.B /dev/zero
.ad
.RS 13n
.rt

.RE

.SH SEE ALSO
.sp
.LP
.BR fork (2),
.BR mmap (2),
.BR sysconf (3C)
