usr/src/man/man7d/zs.7d
'\" te
.\" Copyright (c) 2009, Sun Microsystems, Inc.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH zs 7D "16 Jul 2009" "SunOS 5.11" "Devices"
.SH NAME
zs \- Zilog 8530 SCC serial communications driver
.SH SYNOPSIS
.LP
.nf
#include <fcntl.h>
.fi

.LP
.nf
#include <sys/termios.h>
.fi

.LP
.nf
open("/dev/term/\fIn\fR", \fImode\fR);
.fi

.LP
.nf
open("/dev/tty\fIn\fR", \fImode\fR);
.fi

.LP
.nf
open("/dev/cua/\fIn\fR", \fImode\fR);
.fi

.SH DESCRIPTION
.sp
.LP
The Zilog 8530 provides two serial input/output channels capable of
supporting a variety of communication protocols.  A typical system uses two
or more of these devices to implement essential functions, including RS-423
ports (which also support most RS-232 equipment), and the console keyboard
and mouse devices.
.sp
.LP
The
.B zs
module is a loadable STREAMS driver that provides basic
support for the Zilog 8530 hardware and basic asynchronous communication
support. The driver supports the
.BR termio (7I)
device control functions
specified by flags in the
.B c_cflag
word of the
.B termios
structure
and by the
.B "IGNBRK, IGNPAR,"
.B PARMRK,
or
.B INPCK
flags in
.RB "the " c_iflag " word. All other " termio (7I)
functions must be
performed by
.B STREAMS
modules pushed atop the driver. When a device is
opened, the
.BR ldterm (7M)
and
.BR ttcompat (7M)
.B STREAMS
modules
are automatically pushed on top of the stream, providing the standard
.BR termio (7I)
interface.
.sp
.LP
The character-special devices
.B /dev/term/a
and
.B /dev/term/b
are
used to access the two serial ports on the
.B CPU
board.
.sp
.LP
Valid name space entries are
.BR /dev/cua/ [\fIa-z\fR],
\fB/dev/term/\fR[\fIa-z\fR] and \fB/dev/tty\fR[\fIa-z\fR]. The number of
entries used in a name space are machine dependent.
.sp
.LP
To allow a single tty line to be connected to a modem and used for both
incoming and outgoing calls, a special feature is available that is
controlled by the minor device number. By accessing character-special
devices with names of the form  \fB/dev/cua/\fR[\fIn\fR], it is possible to
open a port without the
.B "Carrier Detect"
signal being asserted, either
through hardware or an equivalent software mechanism.  These devices are
commonly known as dial-out lines.
.sp
.LP
Once a \fB/dev/cua/\fR[\fIn\fR] line is opened, the corresponding tty line
cannot be opened until the
.BI /dev/cua/ n
line is closed. A blocking
open will wait until the \fB/dev/cua/\fR[\fIn\fR] line is closed (which will
drop
.BR "Data Terminal Ready" ,
and
.BR "Carrier Detect" )
and carrier is
detected again. A non-blocking open will return an error. If the tty line
has been opened successfully (usually only when carrier is recognized on the
modem) , the corresponding \fB/dev/cua/\fR[\fIn\fR] line cannot be opened.
This allows a modem to be attached to \fB/dev/term/\fR[\fIn\fR] (renamed
from \fB/dev/tty\fR[\fIn\fR]) and used for dial-in (by enabling the line for
login in
.BR /etc/inittab )
and also used for dial-out (by
.BR tip (1)
or
.BR uucp (1C))
as \fB/dev/cua/\fR[\fIn\fR] when no one is logged in on the
line.
.LP
Note -
.sp
.RS 2
This module is affected by the setting of specific eeprom variables. For
information on parameters that are persistent across reboots, see the
.BR eeprom (1M)
man page.
.RE
.SH IOCTLS
.sp
.LP
The
.B zs
module supports the standard set of
.BR "termio ioctl" (\|)
calls.
.sp
.LP
If the
.B CRTSCTS
flag in the
.B c_cflag
field is set, output will be
generated only if
.B CTS
is high; if
.B CTS
is low, output will be
frozen. If the
.B CRTSCTS
flag is clear, the state of
.B CTS
has no
effect.
.sp
.LP
If the
.B CRTSXOFF
flag in the
.B c_cflag
field is set, input will
be received only if
.B RTS
is high; if
.B RTS
is low, input will be
frozen. If the
.B CRTSXOFF
flag is clear, the state of
.B RTS
has no
effect.
.sp
.LP
The
.B "termios CRTSCTS"
(respectively
.B CRTSXOFF)
flag and
.B termiox CTSXON
(respectively
.B RTSXOFF)
can be used
interchangeably.
.sp
.LP
Breaks can be generated by the
.B "TCSBRK, TIOCSBRK,"
and
\fBTIOCCBRK ioctl\fR(\|) calls.
.sp
.LP
The state of the
.B "DCD, CTS,"
.B RTS,
and
.B DTR
interface
signals may be queried through the use of the
.BR TIOCM_CAR,
.B TIOCM_CTS, TIOCM_RTS,
and
.B TIOCM_DTR
arguments to the
.B TIOCMGET ioctl
command, respectively.  Due to hardware limitations,
only the
.B RTS
and
.B DTR
signals may be set through their respective
arguments to the
.B "TIOCMSET, TIOCMBIS,"
and
.BR "TIOCMBIC ioctl"
commands.
.sp
.LP
The input and output line speeds may be set to any of the speeds supported
by
.BR termio .
The input and output line speeds cannot be set
independently; for example, when you set the the output speed, the input
speed is automatically set to the same speed.
.sp
.LP
When the driver is used to service the serial console port, it supports a
BREAK condition that allows the system to enter the debugger or the monitor.
The BREAK condition is generated by hardware and it is usually enabled by
default. A BREAK condition originating from erroneous electrical signals
cannot be distinguished from one deliberately sent by remote DCE. The
Alternate Break sequence can be used to remedy this.
.sp
.LP
Due to a risk of incorrect sequence interpretation, SLIP and certain other
binary protocols should not be run over the serial console port when
Alternate Break sequence is in effect. Although PPP is a binary protocol, it
is able to avoid these sequences using the ACCM feature in
.IR "RFC 1662" .
For Solaris PPP 4.0, you do this by adding the following line to the
.B /etc/ppp/options
file (or other configuration files used for the
connection; see
.BR pppd (1M)
for details):
.sp
.in +2
.nf
asyncmap  0x00002000
.fi
.in -2

.sp
.LP
By default, the Alternate Break sequence is three characters: carriage
return, tilde and control-B (CR ~ CTRL-B), but may be changed by the driver.
For more information on breaking (entering the debugger or monitor), see
.BR kbd (1)
and
.BR kb (7M).
.SH ERRORS
.sp
.LP
An
.B open
will fail under the following conditions:
.sp
.ne 2
.mk
.na
.B ENXIO
.ad
.RS 9n
.rt
The unit being opened does not exist.
.RE

.sp
.ne 2
.mk
.na
.B EBUSY
.ad
.RS 9n
.rt
The dial-out device is being opened and the dial-in device is already open,
or the dial-in device is being opened with a no-delay open and the dial-out
device is already open.
.RE

.sp
.ne 2
.mk
.na
.B EBUSY
.ad
.RS 9n
.rt
The port is in use by another serial protocol.
.RE

.sp
.ne 2
.mk
.na
.B EBUSY
.ad
.RS 9n
.rt
The unit has been marked as exclusive-use by another process with a
\fBTIOCEXCL ioctl\fR(\|) call.
.RE

.sp
.ne 2
.mk
.na
.B EINTR
.ad
.RS 9n
.rt
The open was interrupted by the delivery of a signal.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
\fB/dev/cua/\fR[\fIa-z\fR]\fR
.ad
.RS 19n
.rt
dial-out tty lines
.RE

.sp
.ne 2
.mk
.na
\fB/dev/term/\fR[\fIa-z\fR]\fR
.ad
.RS 19n
.rt
dial-in tty lines
.RE

.sp
.ne 2
.mk
.na
\fB/dev/tty\fR[\fIa-z\fR]\fR
.ad
.RS 19n
.rt
binary compatibility package device names
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
ArchitectureSPARC
.TE

.SH SEE ALSO
.sp
.LP
.BR eeprom (1M),
.BR kadb (1M),
.BR tip (1),
.BR cu (1C),
.BR uucp (1C),
.BR ports (1M),
.BR pppd (1M),
.BR ioctl (2),
.BR open (2),
.BR attributes (5),
.BR zsh (7D),
.BR termio (7I),
.BR kb (7M),
.BR ldterm (7M),
.BR ttcompat (7M)
.SH DIAGNOSTICS
.sp
.ne 2
.mk
.na
\fBzs\fIn\fB\|: silo overflow.\fR
.ad
.sp .6
.RS 4n
The Zilog 8530 character input silo overflowed before it could be
serviced.
.RE

.sp
.ne 2
.mk
.na
\fBzs\fIn\fB\|: ring buffer overflow.\fR
.ad
.sp .6
.RS 4n
The driver's character input ring buffer overflowed before it could be
serviced.
.RE

