usr/src/man/man9s/datab.9s
'\" te
.\" Copyright (c) 2003 Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" Copyright 1989 AT&T
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH datab 9S "24 Oct 2003" "SunOS 5.11" "Data Structures for Drivers"
.SH NAME
datab, dblk \- STREAMS message data structure
.SH SYNOPSIS
.LP
.nf
#include <sys/stream.h>
.fi

.SH INTERFACE LEVEL
.sp
.LP
Architecture independent level 1 (DDI/DKI).
.SH DESCRIPTION
.sp
.LP
The
.B datab
structure describes the data of a STREAMS message. The
actual data contained in a STREAMS message is stored in a data buffer
pointed to by this structure. A
.B msgb
(message block) structure
includes a field that points to a
.B datab
structure.
.sp
.LP
Because a data block can have more than one message block pointing to it at
one time, the
.B db_ref
member keeps track of a data block's references,
preventing it from being deallocated until all message blocks are finished
with it.
.SH STRUCTURE MEMBERS
.sp
.in +2
.nf
unsigned char     *db_base;     /* first byte of buffer */
unsigned char     *db_lim;      /* last byte (+1) of buffer */
unsigned char      db_ref;      /* # of message pointers to this data */
unsigned char      db_type;     /* message type */
.fi
.in -2

.sp
.LP
A
.B datab
structure is defined as type
.BR dblk_t .
.SH SEE ALSO
.sp
.LP
.BR free_rtn (9S),
.BR msgb (9S)
.sp
.LP
.I Writing Device Drivers
.sp
.LP
.I STREAMS Programming Guide
