usr/src/man/man9s/ddi_idevice_cookie.9s
'\" te
.\" Copyright (c) 2005, Sun Microsystems, Inc.,  All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ddi_idevice_cookie 9S "19 Oct 2005" "SunOS 5.11" "Data Structures for Drivers"
.SH NAME
ddi_idevice_cookie \- device interrupt cookie
.SH SYNOPSIS
.LP
.nf
#include <sys/ddi.h>
#include <sys/sunddi.h>
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI). This interface is obsolete. Use the new
interrupt interfaces referenced in \fBIntro\fR(9F). Refer to \fIWriting Device Drivers\fR for more information.
.SH DESCRIPTION
.sp
.LP
The
.B ddi_idevice_cookie_t
structure contains interrupt priority and
interrupt vector information for a device. This structure is useful for
devices having programmable bus-interrupt levels.
.BR ddi_add_intr (9F)
assigns values to the
.B ddi_idevice_cookie_t
structure members.
.SH STRUCTURE MEMBERS
.sp
.in +2
.nf
u_short	idev_vector;      /* interrupt vector */
ushort_t	idev_priority;    /* interrupt priority */
.fi
.in -2

.sp
.LP
The
.B idev_vector
field contains the interrupt vector number for
vectored bus architectures such as VMEbus. The
.B idev_priority
field
contains the bus interrupt priority level.
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityObsolete
.TE

.SH SEE ALSO
.sp
.LP
.BR ddi_add_intr (9F),
.BR Intro (9F)
.sp
.LP
.I Writing Device Drivers
