usr/src/man/man9s/ddi_idevice_cookie.9s
'\" te
.\" Copyright (c) 2005, Sun Microsystems, Inc.,  All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ddi_idevice_cookie 9S "19 Oct 2005" "SunOS 5.11" "Data Structures for Drivers"
.SH NAME
ddi_idevice_cookie \- device interrupt cookie
.SH SYNOPSIS
.LP
.nf
#include <sys/ddi.h>
#include <sys/sunddi.h>
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI). This interface is obsolete. Use the new
interrupt interfaces referenced in \fBIntro\fR(9F). Refer to \fIWriting
Device Drivers\fR for more information.
.SH DESCRIPTION
.sp
.LP
The
.B ddi_idevice_cookie_t
structure contains interrupt priority and
interrupt vector information for a device. This structure is useful for
devices having programmable bus-interrupt levels. \fBddi_add_intr\fR(9F)
assigns values to the
.B ddi_idevice_cookie_t
structure members.
.SH STRUCTURE MEMBERS
.sp
.in +2
.nf
u_short	idev_vector;      /* interrupt vector */
ushort_t	idev_priority;    /* interrupt priority */
.fi
.in -2

.sp
.LP
The
.B idev_vector
field contains the interrupt vector number for
vectored bus architectures such as VMEbus. The
.B idev_priority
field
contains the bus interrupt priority level.
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityObsolete
.TE

.SH SEE ALSO
.sp
.LP
.BR ddi_add_intr (9F),
.BR Intro (9F)
.sp
.LP
.I Writing Device Drivers
