usr/src/man/man9s/dev_ops.9s
'\" te
.\" Copyright (c) 2008, Sun Microsystems, Inc., All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH dev_ops 9S "16 Sep 2008" "SunOS 5.11" "Data Structures for Drivers"
.SH NAME
dev_ops \- device operations structure
.SH SYNOPSIS
.LP
.nf
#include <sys/conf.h>
#include <sys/devops.h>
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI).
.SH DESCRIPTION
.sp
.LP
\fBdev_ops\fR contains driver common fields and pointers to the
\fBbus_ops\fR and
.BR cb_ops (9S).
.sp
.LP
Following are the device functions provided in the device operations
structure. All fields must be set at compile time.
.sp
.ne 2
.mk
.na
.B devo_rev
.ad
.RS 17n
.rt
Driver build version. Set this to
.BR DEVO_REV .
.RE

.sp
.ne 2
.mk
.na
\fBdevo_refcnt\fR
.ad
.RS 17n
.rt
Driver reference count. Set this to
.BR 0 .
.RE

.sp
.ne 2
.mk
.na
\fBdevo_getinfo\fR
.ad
.RS 17n
.rt
Get device driver information (see \fBgetinfo\fR(9E)).
.RE

.sp
.ne 2
.mk
.na
\fBdevo_identify\fR
.ad
.RS 17n
.rt
This entry point is obsolete. Set to
.BR nulldev .
.RE

.sp
.ne 2
.mk
.na
.B devo_probe
.ad
.RS 17n
.rt
Probe device. See
.BR probe (9E).
.RE

.sp
.ne 2
.mk
.na
.B devo_attach
.ad
.RS 17n
.rt
Attach driver to
.BR dev_info .
See
.BR attach (9E).
.RE

.sp
.ne 2
.mk
.na
.B devo_detach
.ad
.RS 17n
.rt
Detach/prepare driver to unload. See
.BR detach (9E).
.RE

.sp
.ne 2
.mk
.na
.B devo_reset
.ad
.RS 17n
.rt
Reset device. (Not supported in this release.) Set this to
.BR nodev .
.RE

.sp
.ne 2
.mk
.na
.B devo_cb_ops
.ad
.RS 17n
.rt
Pointer to \fBcb_ops\fR(9S) structure for leaf drivers.
.RE

.sp
.ne 2
.mk
.na
.B devo_bus_ops
.ad
.RS 17n
.rt
Pointer to bus operations structure for nexus drivers. Set this to
\fINULL\fR if this is for a leaf driver.
.RE

.sp
.ne 2
.mk
.na
.B devo_power
.ad
.RS 17n
.rt
Power a device attached to system. See
.BR power (9E).
.RE

.sp
.ne 2
.mk
.na
.B devo_quiesce
.ad
.RS 17n
.rt
Quiesce a device attached to system (see \fBquiesce\fR(9E) for more
information). This can be set to
.B ddi_quiesce_not_needed()
if the
driver does not need to implement quiesce.
.RE

.SH STRUCTURE MEMBERS
.sp
.in +2
.nf
int             devo_rev;
int             devo_refcnt;
int             (*devo_getinfo)(dev_info_t *dip,
                ddi_info_cmd_t infocmd, void *arg, void **result);
int             (*devo_identify)(dev_info_t *dip);
int             (*devo_probe)(dev_info_t *dip);
int             (*devo_attach)(dev_info_t *dip,
                ddi_attach_cmd_t cmd);
int             (*devo_detach)(dev_info_t *dip,
                ddi_detach_cmd_t cmd);
int             (*devo_reset)(dev_info_t *dip, ddi_reset_cmd_t cmd);
struct cb_ops   *devo_cb_ops;
struct bus_ops  *devo_bus_ops;
int             (*devo_power)(dev_info_t *dip, int component, int level);
int             (*devo_quiesce)(dev_info_t *dip);
.fi
.in -2

.SH SEE ALSO
.sp
.LP
.BR attach (9E),
.BR detach (9E),
.BR getinfo (9E),
.BR probe (9E),
.BR power (9E),
.BR quiesce (9E),
.BR nodev (9F)
.sp
.LP
.I Writing Device Drivers
