usr/src/man/man9s/hook_pkt_event.9s
'\" te
.\" Copyright (c) 2008 Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH hook_pkt_event 9S "1 May 2008" "SunOS 5.11" "Data Structures for Drivers"
.SH NAME
hook_pkt_event \- packet event structure passed through to hooks
.SH SYNOPSIS
.LP
.nf
#include <sys/neti.h>
#include <sys/hook.h>
#include <sys/hook_event.h>
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI).
.SH DESCRIPTION
.sp
.LP
The
.B hook_pkt_event
structure contains fields that relate to a packet
in a network protocol handler. This structure is passed through to a
callback for
.BR NH_PRE_ROUTING ,
.BR NH_POST_ROUTING ,
.BR NH_FORWARDING ,
.B NH_LOOPBACK_IN
and
.BR NH_LOOPBACK_OUT
events.
.sp
.LP
A callback may only modify the
.BR hpe_hdr ,
.B hpe_mp
and
.BR hpe_mb
fields.
.sp
.LP
The following table documents which fields can be safely used as a result
of each event.
.sp
.in +2
.nf
Event            hpe_ifp     hpe_ofp     hpe_hdr     hpe_mp     hpe_mb
-----            -------     -------     -------     ------     ------
NH_PRE_ROUTING      yes                     yes         yes       yes
NH_POST_ROUTING                 yes         yes         yes       yes
NH_FORWARDING       yes         yes         yes         yes       yes
NH_LOOPBACK_IN      yes                     yes         yes       yes
NH_LOOPBACK_OUT                 yes         yes         yes       yes
.fi
.in -2
.sp

.SH STRUCTURE MEMBERS
.sp
.in +2
.nf
net_data_t           hne_family;
phy_if_t             hpe_ifp;
phy_if_t             hpe_ofp;
void                 *hpe_hdr;
mblk_t               *hpe_mp;
mblk_t               *hpe_mb;
uint32_t             hpe_flags;


.fi
.in -2

.sp
.LP
The following fields are set for each event:
.sp
.ne 2
.mk
.na
.B hne_family
.ad
.RS 14n
.rt
The protocol family for this packet. This value matches the corresponding
value returned from a call to
.BR net_protocol_lookup (9F).
.RE

.sp
.ne 2
.mk
.na
.B hpe_ifp
.ad
.RS 14n
.rt
The inbound interface for a packet.
.RE

.sp
.ne 2
.mk
.na
.B hpe_ofp
.ad
.RS 14n
.rt
The outbound interface for a packet.
.RE

.sp
.ne 2
.mk
.na
.B hpe_hdr
.ad
.RS 14n
.rt
Pointer to the start of the network protocol header within an
.BR mblk_t
structure.
.RE

.sp
.ne 2
.mk
.na
.B hpe_mp
.ad
.RS 14n
.rt
Pointer to the
.B mblk_t
pointer that points to the first
.BR mblk_t
structure in this packet.
.RE

.sp
.ne 2
.mk
.na
.B hpe_mb
.ad
.RS 14n
.rt
Pointer to the
.B mblk_t
structure that contains
.BR hpe_hdr .
.RE

.sp
.ne 2
.mk
.na
.B hpe_flags
.ad
.RS 13n
.rt
This field is used to carry additional properties of packets. The current
collection of defined bits available is:
.sp
.ne 2
.mk
.na
.B HPE_BROADCAST
.ad
.RS 17n
.rt
This bit is set if the packet was recognized as a broadcast packet from the
link layer. The bit cannot be set if
.B HPE_MULTICAST
is set, currently
only possible with physical in packet events.
.RE

.sp
.ne 2
.mk
.na
.B HPE_MULTICAST
.ad
.RS 17n
.rt
This set if the packet was recognized as a multicast packet from the link
layer. This bit cannot be set if
.B HPE_BROADCAST
is set, currently only
possible with physical in packet events.
.RE

.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
.BR net_protocol_lookup (9F),
.BR netinfo (9F)
