usr/src/man/man9s/hook_nic_event.9s
'\" te
.\" Copyright (c) 2008 Sun Microsystems, Inc.  All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH hook_nic_event 9S "1 May 2008" "SunOS 5.11" "Data Structures for Drivers"
.SH NAME
hook_nic_event \- data structure describing events related to network
interfaces
.SH SYNOPSIS
.LP
.nf
#include <sys/neti.h>
#include <sys/hook.h>
#include <sys/hook_event.h>
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI).
.SH DESCRIPTION
.sp
.LP
The
.B hook_nic_event
structure contains fields that relate to an event
that has occurred and belongs to a network interface. This structure is
passed through to callbacks for
.BR NE_PLUMB ,
.BR NE_UNPLUMB ,
.BR NE_UP ,
.B NE_DOWN
and
.B NE_ADDRESS_CHANGE
events.
.sp
.LP
A callback may not alter any of the fields in this structure.
.SH STRUCTURE MEMBERS
.sp
.in +2
.nf
net_data_t           hne_family;
phy_if_t             pkt_private;
lif_if_t             hne_lif;
nic_event_t          hne_event;
nic_event_data_t     hne_data;
size_t               hne_datalen;

.fi
.in -2

.sp
.LP
The following fields are set for each event:
.sp
.ne 2
.mk
.na
.B hne_family
.ad
.RS 14n
.rt
A valid reference for the network protocol that owns this network interface
and can be in calls to other \fBnetinfo\fR(9F) functions.
.RE

.sp
.ne 2
.mk
.na
.B hne_nic
.ad
.RS 14n
.rt
The physical interface to which an event belongs.
.RE

.sp
.ne 2
.mk
.na
.B hne_event
.ad
.RS 14n
.rt
A value that indicates the respective event. The current list of available
events is:
.sp
.ne 2
.mk
.na
.B NE_PLUMB
.ad
.RS 21n
.rt
an interface has just been created.
.RE

.sp
.ne 2
.mk
.na
.B NE_UNPLUMB
.ad
.RS 21n
.rt
an interface has just been destroyed and no more events should be received
for it.
.RE

.sp
.ne 2
.mk
.na
.B NE_UP
.ad
.RS 21n
.rt
an interface has changed the state to "up" and may now generate packet
events.
.RE

.sp
.ne 2
.mk
.na
.B NE_DOWN
.ad
.RS 21n
.rt
an interface has changed the state to "down" and will no longer generate
packet events.
.RE

.sp
.ne 2
.mk
.na
.B NE_ADDRESS_CHANGE
.ad
.RS 21n
.rt
an address on an interface has changed.
.B hne_lif
refers to the logical
interface for which the change is occurring,
.B hne_data
is a pointer to
a
.B sockaddr
structure that is
.B hne_datalen
bytes long and contains
the new network address.
.RE

.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
.BR netinfo (9F)
