usr/src/man/man9s/kstat_io.9s
'\" te
.\" Copyright (c) 2000, Sun Microsystems, Inc.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH kstat_io 9S "4 Apr 1994" "SunOS 5.11" "Data Structures for Drivers"
.SH NAME
kstat_io \- structure for I/O kstats
.SH SYNOPSIS
.LP
.nf
#include <sys/types.h>
#include <sys/kstat.h>
#include <sys/ddi.h>
#include <sys/sunddi.h>
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI)
.SH DESCRIPTION
.sp
.LP
I/O kstat statistics are kept in a
.B kstat_io
structure. When
.BR kstat_create (9F)
creates an
.BR "I/O kstat" ,
the
.BR ks_data
field is a pointer to one of these structures. The macro
.B KSTAT_IO_PTR()
is provided to retrieve this field. It looks like this:

.sp
.in +2
.nf
#define KSTAT_IO_PTR(kptr)	((kstat_io_t *)(kptr)->ks_data)
.fi
.in -2

.SH STRUCTURE MEMBERS
.sp
.in +2
.nf
u_longlong_t      nread;      /* number of bytes read */
u_longlong_t      nwritten;   /* number of bytes written *]/
ulong_t           reads;      /* number of read operations */
ulong_t           writes;     /* number of write operations */
.fi
.in -2

.sp
.LP
The
.B nread
field should be updated by the driver with the number of
bytes successfully read upon completion.
.sp
.LP
The
.B nwritten
field should be updated by the driver with the number of
bytes successfully written upon completion.
.sp
.LP
The
.B reads
field should be updated by the driver after each successful
read operation.
.sp
.LP
The
.B writes
field should be updated by the driver after each
successful write operation.
.sp
.LP
Other
.B I/O
statistics are updated through the use of the
.BR kstat_queue (9F)
functions.
.SH SEE ALSO
.sp
.LP
.BR kstat_create (9F),
.BR kstat_named_init (9F),
.BR kstat_queue (9F),
.BR kstat_runq_back_to_waitq (9F),
.BR kstat_runq_enter (9F),
.BR kstat_runq_exit (9F),
.BR kstat_waitq_enter (9F),
.BR kstat_waitq_exit (9F),
.BR kstat_waitq_to_runq (9F)
.sp
.LP
.I Writing Device Drivers
