usr/src/man/man9s/linkblk.9s
'\" te
.\" Copyright (c) 2000, Sun Microsystems, Inc.,  All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH linkblk 9S "7 Jul 1994" "SunOS 5.11" "Data Structures for Drivers"
.SH NAME
linkblk \- STREAMS data structure sent to multiplexor drivers to indicate a
link
.SH SYNOPSIS
.LP
.nf
#include <sys/stream.h>
.fi

.SH INTERFACE LEVEL
.sp
.LP
Architecture independent level 1 (DDI/DKI)
.SH DESCRIPTION
.sp
.LP
The
.B linkblk
structure is used to connect a lower Stream to an upper
STREAMS multiplexor driver.  This structure is used in conjunction with the
.BR I_LINK ,
.BR I_UNLINK ,
.BR P_LINK ,
and
.B P_UNLINK
ioctl
commands. See 
.BR streamio (7I).
The  \fBM_DATA\fR portion of the
.B M_IOCTL
message contains the
.B linkblk
structure.  Note that the
.B linkblk
structure is allocated and initialized by the Stream head as a
result of  one of the above ioctl commands.
.SH STRUCTURE MEMBERS
.sp
.in +2
.nf
queue_t   *l_qtop;   /* lowest level write queue of upper stream */
                     /* (set to NULL for persistent links) */
queue_t   *l_qbot;   /* highest level write queue of lower stream */
int       l_index;   /* index for lower stream. */
.fi
.in -2

.SH SEE ALSO
.sp
.LP
.BR ioctl (2),
.BR streamio (7I)
.sp
.LP
.I STREAMS Programming Guide
