usr/src/man/man9s/modldrv.9s
'\" te
.\" Copyright (C) 2001, Sun Microsystems, Inc., All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH modldrv 9S "5 Mar 2001" "SunOS 5.11" "Data Structures for Drivers"
.SH NAME
modldrv \- linkage structure for loadable drivers
.SH SYNOPSIS
.LP
.nf
#include <sys/modctl.h>
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI)
.SH DESCRIPTION
.sp
.LP
The
.B modldrv
structure is used by device drivers to export driver
specific information to the kernel.
.SH STRUCTURE MEMBERS
.sp
.in +2
.nf
struct mod_ops    *drv_modops;
char              *drv_linkinfo;
struct dev_ops    *drv_dev_ops;
.fi
.in -2

.sp
.ne 2
.mk
.na
.B drv_modops
.ad
.RS 17n
.rt
Must always be initialized to the address of
.BR mod_driverops .
This
member identifies the module as a loadable driver.
.RE

.sp
.ne 2
.mk
.na
.B drv_linkinfo
.ad
.RS 17n
.rt
Can be any string up to
.B MODMAXNAMELEN
characters (including the
terminating NULL character), and is used to describe the module and its
version number. This is usually the name of the driver and module version
information, but can contain other information as well.
.RE

.sp
.ne 2
.mk
.na
.B drv_dev_ops
.ad
.RS 17n
.rt
Pointer to the driver's
.BR dev_ops (9S)
structure.
.RE

.SH SEE ALSO
.sp
.LP
.BR add_drv (1M),
.BR dev_ops (9S),
.BR modlinkage (9S)
.sp
.LP
.I Writing Device Drivers
