usr/src/man/man9s/modlinkage.9s
'\" te
.\" Copyright (c) 2000, Sun Microsystems, Inc.,  All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH modlinkage 9S "18 Sep 1992" "SunOS 5.11" "Data Structures for Drivers"
.SH NAME
modlinkage \- module linkage structure
.SH SYNOPSIS
.LP
.nf
#include <sys/modctl.h>
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI)
.SH DESCRIPTION
.sp
.LP
The
.B modlinkage
structure is provided by the module writer to the
routines that install, remove, and retrieve information from a module. See
.BR _init (9E),
\fB_fini\fR(9E), and \fB_info\fR(9E).
.SH STRUCTURE MEMBERS
.sp
.in +2
.nf
int    ml_rev
void   *ml_linkage[4];
.fi
.in -2

.sp
.ne 2
.mk
.na
.B ml_rev
.ad
.RS 15n
.rt
Is the revision of the loadable modules system.  This must have the value
\fBMODREV_1\fR .
.RE

.sp
.ne 2
.mk
.na
.B ml_linkage
.ad
.RS 15n
.rt
Is a null-terminated array of pointers to linkage structures. Driver
modules have only one linkage structure.
.RE

.SH SEE ALSO
.sp
.LP
.BR add_drv (1M),
\fB_fini\fR(9E), \fB_info\fR(9E),
.BR _init (9E),
.BR modldrv (9S),
.BR modlstrmod (9S)
.sp
.LP
.I Writing Device Drivers
