usr/src/man/man9s/modlstrmod.9s
'\" te
.\" Copyright (c) 2000, Sun Microsystems, Inc.,  All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH modlstrmod 9S "7 Jun 1993" "SunOS 5.11" "Data Structures for Drivers"
.SH NAME
modlstrmod \- linkage structure for loadable STREAMS modules
.SH SYNOPSIS
.LP
.nf
#include <sys/modctl.h>
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI)
.SH DESCRIPTION
.sp
.LP
The
.B modlstrmod
structure is used by STREAMS modules to export module
specific information to the kernel.
.SH STRUCTURE MEMBERS
.sp
.in +2
.nf
struct mod_ops     *strmod_modops;
char               *strmod_linkinfo;
struct fmodsw      *strmod_fmodsw;
.fi
.in -2

.sp
.ne 2
.mk
.na
.B strmod_modops
.ad
.RS 20n
.rt
Must always be initialized to the address of
.BR mod_strmodops .
This
identifies the module as a loadable STREAMS module.
.RE

.sp
.ne 2
.mk
.na
.B strmod_linkinfo
.ad
.RS 20n
.rt
Can be any string up to
.BR MODMAXNAMELEN ,
and is used to describe the
module. This string is usually the name of the module, but can contain other
information (such as a version number).
.RE

.sp
.ne 2
.mk
.na
.B strmod_fmodsw
.ad
.RS 20n
.rt
Is a pointer to a template of a class entry within the module that is
copied to the kernel's class table when the module is loaded.
.RE

.SH SEE ALSO
.sp
.LP
.BR modload (1M)
.sp
.LP
.I Writing Device Drivers
