usr/src/man/man9s/module_info.9s
'\" te
.\" Copyright (c) 2002, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" Copyright 1989 AT&T
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH module_info 9S "26 Nov 2002" "SunOS 5.11" "Data Structures for Drivers"
.SH NAME
module_info \- STREAMS driver identification and limit value structure
.SH SYNOPSIS
.LP
.nf
#include <sys/stream.h>
.fi

.SH INTERFACE LEVEL
.sp
.LP
Architecture independent level 1 (DDI/DKI).
.SH DESCRIPTION
.sp
.LP
When a module or driver is declared, several identification and limit
values can be set. These values are stored in the \fBmodule_info\fR
structure.
.sp
.LP
The
.B module_info
structure is intended to be read-only. However, the
flow control limits (\fBmi_hiwat\fR and
.BR mi_lowat )
and the packet size
limits (\fBmi_minpsz\fR and
.BR mi_maxpsz )
are copied to the
.BR QUEUE
structure, where they can be modified.
.sp
.LP
For a driver,
.B mi_idname
must match the name of the driver binary
file. For a module,
.B mi_idname
must match the fname field of the
.B fmodsw
structure. See \fBfmodsw\fR(9S) for details.
.SH STRUCTURE MEMBERS
.sp
.in +2
.nf
ushort_t      mi_idnum;      /* module ID number */
char          *mi_idname;    /* module name */
ssize_t       mi_minpsz;     /* minimum packet size */
ssize_t       mi_maxpsz;     /* maximum packet size */
size_t        mi_hiwat;      /* high water mark */
size_t        mi_lowat;      /* low water mark */
.fi
.in -2

.sp
.LP
The constant
.BR FMNAMESZ ,
limiting the length of a module's name, is set
to eight in this release.
.SH SEE ALSO
.sp
.LP
.BR fmodsw (9S),
.BR queue (9S)
.sp
.LP
.I STREAMS Programming Guide
