usr/src/man/man9s/msgb.9s
'\" te
.\" Copyright (c) 2000, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" Copyright 1989 AT&T
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH msgb 9S "11 Apr 1991" "SunOS 5.11" "Data Structures for Drivers"
.SH NAME
msgb, mblk \- STREAMS message block structure
.SH SYNOPSIS
.LP
.nf
#include <sys/stream.h>
.fi

.SH INTERFACE LEVEL
.sp
.LP
Architecture independent level 1 (DDI/DKI)
.SH DESCRIPTION
.sp
.LP
A STREAMS message is made up of one or more message blocks, referenced by a
pointer to a
.B msgb
structure. The
.B b_next
and
.B b_prev
pointers
are used to link messages together on a
.BR QUEUE .
The
.B b_cont
pointer
links message blocks together when a message consists of more than one
block.
.sp
.LP
Each
.B msgb
structure also includes a pointer to a
.BR datab (9S)
structure, the data block (which contains pointers to the actual data of the
message), and the type of the message.
.SH STRUCTURE MEMBERS
.sp
.in +2
.nf
struct msgb     *b_next;    /* next message on queue */
struct msgb     *b_prev;    /* previous message on queue */
struct msgb     *b_cont;    /* next message block */
unsigned char   *b_rptr;    /* 1st unread data byte of buffer */
unsigned char   *b_wptr;    /* 1st unwritten data byte of buffer */
struct datab    *b_datap;   /* pointer to data block */
unsigned char   b_band;     /* message priority  */
unsigned short  b_flag;     /* used by stream head  */
.fi
.in -2

.sp
.LP
Valid flags are as follows:
.sp
.ne 2
.mk
.na
.B MSGMARK
.ad
.RS 13n
.rt
Last byte of message is marked.
.RE

.sp
.ne 2
.mk
.na
.B MSGDELIM
.ad
.RS 13n
.rt
Message is delimited.
.RE

.sp
.LP
The
.B msgb
structure is defined as type
.BR mblk_t .
.SH SEE ALSO
.sp
.LP
.BR datab (9S)
.sp
.LP
.I Writing Device Drivers
.sp
.LP
.I STREAMS Programming Guide
