usr/src/man/man9s/net_inject_t.9s
'\" te
.\" Copyright (c) 2008 Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH net_inject_t 9S "1 May 2008" "SunOS 5.11" "Data Structures for Drivers"
.SH NAME
net_inject_t \- structure for describing how to transmit a packet
.SH SYNOPSIS
.LP
.nf
#include <sys/neti.h>
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI).
.SH DESCRIPTION
.sp
.LP
The
.B net_inject_t
data structure passes information in to
.B net_inject
about how to transmit a packet. Transmit includes sending
the packet up into the system as well as out of it.
.SH STRUCTURE MEMBERS
.sp
.in +2
.nf
 mblk_t                  *ni_packet;   /* start of the packet */
  struct sockaddr_storage ni_addr;      /* address of next hop */
  phy_if_t                ni_physical;  /* network interface to use */
.fi
.in -2

.sp
.ne 2
.mk
.na
.B ni_packet
.ad
.RS 15n
.rt
Pointer to the first the
.B mblk_t
data structure that makes up this
packet.
.RE

.sp
.ne 2
.mk
.na
.B ni_addr
.ad
.RS 15n
.rt
This field is only required to be initialized if
.B NI_DIRECT_OUT
is
being used to transmit the packet. The
.B sockaddr_storage
field must be
set to indicate whether the destination address contained in the structure
is
.B IPv4
(cast
.I ni_addr
to struct
.IR sockaddr_in )
or
.BR IPv6
(cast
.I ni_addr
to struct
.IR sockaddr_in6 ).
.RE

.sp
.ne 2
.mk
.na
.B ni_physical
.ad
.RS 15n
.rt
The physical interface where the packet will be injected.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
.BR net_inject (9F),
.BR netinfo (9F),
.BR attributes (5)
