usr/src/man/man9s/qband.9s
'\" te
.\" Copyright (c) 2000, Sun Microsystems, Inc.  All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" Copyright 1989 AT&T
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH qband 9S "14 Nov 1996" "SunOS 5.11" "Data Structures for Drivers"
.SH NAME
qband \- STREAMS queue flow control information structure
.SH SYNOPSIS
.LP
.nf
#include <sys/stream.h>
.fi

.SH INTERFACE LEVEL
.sp
.LP
Architecture independent level 1 (DDI/DKI)
.SH DESCRIPTION
.sp
.LP
The
.B qband
structure contains flow control information for each
priority band in a queue.
.sp
.LP
The
.B qband
structure is defined as type
.BR qband_t .
.SH STRUCTURE MEMBERS
.sp
.in +2
.nf
struct        qband*qb_next;     /* next band's info */
size_t        qb_count           /* number of bytes in band */
struct msgb   *qb_first;         /* start of band's data */
struct msgb   *qb_last;          /* end of band's data */
size_t        qb_hiwat;          /* band's high water mark */
size_t        qb_lowat;          /* band's low water mark */
uint_t        qb_flag;           /* see below */
.fi
.in -2

.sp
.LP
Valid flags are as follows:
.sp
.ne 2
.mk
.na
.B QB_FULL
.ad
.RS 13n
.rt
Band is considered full.
.RE

.sp
.ne 2
.mk
.na
.B QB_WANTW
.ad
.RS 13n
.rt
Someone wants to write to band.
.RE

.SH SEE ALSO
.sp
.LP
.BR strqget (9F),
.BR strqset (9F),
.BR msgb (9S),
.BR queue (9S)
.sp
.LP
.I STREAMS Programming Guide
.SH NOTES
.sp
.LP
All access to this structure should be through
.BR strqget "(9F) and"
.BR strqset (9F).
It is logically part of the
.BR queue "(9S) and its"
layout and partitioning with respect to that structure might change in
future releases. If portability is a concern, do not declare or store
instances of or references to this structure.
