usr/src/man/man9s/scsi_address.9s
'\" te
.\" Copyright (c) 2000, Sun Microsystems, Inc.,  All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH scsi_address 9S "30 Aug 1995" "SunOS 5.11" "Data Structures for Drivers"
.SH NAME
scsi_address \- SCSI address structure
.SH SYNOPSIS
.LP
.nf
#include <sys/scsi/scsi.h>
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris architecture specific (Solaris DDI)
.SH DESCRIPTION
.sp
.LP
A
.B scsi_address
structure defines the addressing components for a
.B SCSI
target device. The address of the target device is separated into
two components: target number and logical unit number. The two addressing
components are used to uniquely identify any type of
.B SCSI
device;
however, most devices can be addressed with the target component of the
address.
.sp
.LP
In the case where only the target component is used to address the device,
the logical unit should be set to
.BR 0 .
If the
.B SCSI
target device
supports logical units, then the
.B HBA
must interpret the logical units
field of the data structure.
.sp
.LP
The
.B pkt_address
member of a
.BR scsi_pkt "(9S) is initialized by"
.BR scsi_init_pkt (9F).
.SH STRUCTURE MEMBERS
.sp
.in +2
.nf
scsi_hba_tran_t   *a_hba_tran;  /* Transport vectors for the SCSI bus */
ushort_t          a_target;     /* SCSI target id */
uchar_t           a_lun;        /* SCSI logical unit */
.fi
.in -2

.sp
.LP
.B a_hba_tran
is a pointer to the controlling
.BR HBA "'s transport"
vector structure. The
.B SCSA
interface uses this field to pass any
transport requests from the
.B SCSI
target device drivers to the
.B HBA
driver.
.sp
.LP
.B a_target
is the target component of the
.B SCSI
address.
.sp
.LP
.B a_lun
is the logical unit component of the
.B SCSI
address. The
logical unit is used to further distinguish a
.B SCSI
target device that
supports multiple logical units from one that does not. The
.BR makecom (9F)
family of functions use the
.B a_lun
field to set the
logical unit field in the
.BR "SCSI CDB" ,
for compatibility with
.BR SCSI-1 .
.SH SEE ALSO
.sp
.LP
.BR makecom (9F),
.BR scsi_init_pkt (9F),
.BR scsi_hba_tran (9S),
.BR scsi_pkt (9S)
.sp
.LP
.I Writing Device Drivers
