usr/src/man/man9s/scsi_extended_sense.9s
'\" te
.\" Copyright (c) 2000, Sun Microsystems, Inc. , All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH scsi_extended_sense 9S "30 Aug 1995" "SunOS 5.11" "Data Structures for Drivers"
.SH NAME
scsi_extended_sense \- SCSI extended sense structure
.SH SYNOPSIS
.LP
.nf
#include <sys/scsi/scsi.h>
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI).
.SH DESCRIPTION
.sp
.LP
The
.B scsi_extended_sense
structure for error codes
.B 0x70
(current
errors) and
.B 0x71
(deferred errors) is returned on a successful \fBREQUEST SENSE\fR command.
.B SCSI-2
compliant targets are required to return at
least the first 18 bytes of this structure. This structure is part of
.BR scsi_device (9S)
structure.
.SH STRUCTURE MEMBERS
.sp
.in +2
.nf
uchar_t  es_valid   :1;     /* Sense data is valid */
uchar_t  es_class   :3;     /* Error Class- fixed at 0x7 */
uchar_t  es_code    :4;     /* Vendor Unique error code */
uchar_t  es_segnum;         /* Segment number: for COPY cmd only */
uchar_t  es_filmk   :1;     /* File Mark Detected */
uchar_t  es_eom     :1;     /* End of Media */
uchar_t  es_ili     :1;     /* Incorrect Length Indicator */
uchar_t  es_key     :4;     /* Sense key */
uchar_t  es_info_1;         /* Information byte 1 */
uchar_t  es_info_2;         /* Information byte 2 */
uchar_t  es_info_3;         /* Information byte 3 */
uchar_t  es_info_4;         /* Information byte 4 */
uchar_t  es_add_len;        /* Number of additional bytes */
uchar_t  es_cmd_info[4];    /* Command specific information */
uchar_t  es_add_code;       /* Additional Sense Code */
uchar_t  es_qual_code;      /* Additional Sense Code Qualifier */
uchar_t  es_fru_code;       /* Field Replaceable Unit Code */
uchar_t  es_skey_specific[3]; /* Sense Key Specific information */
.fi
.in -2

.sp
.LP
.BR es_valid ,
if set, indicates that the information field contains valid
information.
.sp
.LP
.B es_class
should be
.BR 0x7 .
.sp
.LP
.B es_code
is either
.B 0x0
or
.BR 0x1 .
.sp
.LP
.B es_segnum
contains the number of the current segment descriptor if the
.B REQUEST SENSE
command is in response to a
.BR COPY ,
.BR COMPARE ,
and
.B COPY AND VERIFY
command.
.sp
.LP
.BR es_filmk ,
if set, indicates that the current command had read a file
mark or set mark (sequential access devices only).
.sp
.LP
.BR es_eom ,
if set, indicates that an end-of-medium condition exists
(sequential access and printer devices only).
.sp
.LP
.BR es_ili ,
if set, indicates that the requested logical block length did
not match the logical block length of the data on the medium.
.sp
.LP
.B es_key
indicates generic information describing an error or exception
condition. The following sense keys are defined:
.sp
.ne 2
.mk
.na
.B KEY_NO_SENSE
.ad
.sp .6
.RS 4n
Indicates that there is no specific sense key information to be reported.
.RE

.sp
.ne 2
.mk
.na
.B KEY_RECOVERABLE_ERROR
.ad
.sp .6
.RS 4n
Indicates that the last command completed successfully with some recovery
action performed by the target.
.RE

.sp
.ne 2
.mk
.na
.B KEY_NOT_READY
.ad
.sp .6
.RS 4n
Indicates that the logical unit addressed cannot be accessed.
.RE

.sp
.ne 2
.mk
.na
.B KEY_MEDIUM_ERROR
.ad
.sp .6
.RS 4n
Indicates that the command terminated with a non-recovered error condition
that was probably caused by a flaw on the medium or an error in the recorded
data.
.RE

.sp
.ne 2
.mk
.na
.B KEY_HARDWARE_ERROR
.ad
.sp .6
.RS 4n
Indicates that the target detected a non-recoverable hardware failure while
performing the command or during a self test.
.RE

.sp
.ne 2
.mk
.na
.B KEY_ILLEGAL_REQUEST
.ad
.sp .6
.RS 4n
Indicates that there was an illegal parameter in the
.B CDB
or in the
additional parameters supplied as data for some commands.
.RE

.sp
.ne 2
.mk
.na
.B KEY_UNIT_ATTENTION
.ad
.sp .6
.RS 4n
Indicates that the removable medium might have been changed or the target has
been reset.
.RE

.sp
.ne 2
.mk
.na
.B KEY_WRITE_PROTECT/KEY_DATA_PROTECT
.ad
.sp .6
.RS 4n
Indicates that a command that reads or writes the medium was attempted on a
block that is protected from this operation.
.RE

.sp
.ne 2
.mk
.na
.B KEY_BLANK_CHECK
.ad
.sp .6
.RS 4n
Indicates that a write-once device or a sequential access device encountered
blank medium or format-defined end-of-data indication while reading or a
write-once device encountered a non-blank medium while writing.
.RE

.sp
.ne 2
.mk
.na
.B KEY_VENDOR_UNIQUE
.ad
.sp .6
.RS 4n
This sense key is available for reporting vendor-specific conditions.
.RE

.sp
.ne 2
.mk
.na
.B KEY_COPY_ABORTED
.ad
.sp .6
.RS 4n
Indicates that a
.BR COPY ,
.BR COMPARE ,
and
.B "COPY AND VERIFY"
command
was aborted.
.RE

.sp
.ne 2
.mk
.na
.B KEY_ABORTED_COMMAND
.ad
.sp .6
.RS 4n
Indicates that the target aborted the command.
.RE

.sp
.ne 2
.mk
.na
.B KEY_EQUAL
.ad
.sp .6
.RS 4n
Indicates that a
.B "SEARCH DATA"
command has satisfied an equal
comparison.
.RE

.sp
.ne 2
.mk
.na
.B KEY_VOLUME_OVERFLOW
.ad
.sp .6
.RS 4n
Indicates that a buffered peripheral device has reached the end-of-partition
and data might remain in the buffer that has not been written to the medium.
.RE

.sp
.ne 2
.mk
.na
.B KEY_MISCOMPARE
.ad
.sp .6
.RS 4n
Indicates that the source data did not match the data read from the medium.
.RE

.sp
.ne 2
.mk
.na
.B KEY_RESERVE
.ad
.sp .6
.RS 4n
Indicates that the target is currently reserved by a different initiator.
.RE

.sp
.LP
.B es_info_{1,2,3,4}
is device-type or command specific.
.sp
.LP
.B es_add_len
indicates the number of additional sense bytes to follow.
.sp
.LP
.B es_cmd_info
contains information that depends on the command that was
executed.
.sp
.LP
.B es_add_code
.RB ( ASC )
indicates further information related to the
error or exception condition reported in the sense key field.
.sp
.LP
.B es_qual_code
(\fBASCQ)\fR indicates detailed information related to the
additional sense code.
.sp
.LP
.B es_fru_code
.RB ( FRU )
indicates a device-specific mechanism to unit
that has failed.
.sp
.LP
.B es_skey_specific
is defined when the value of the sense-key specific
valid bit (bit 7) is
.BR 1 .
This field is reserved for sense keys not defined
above.
.SH SEE ALSO
.sp
.LP
.BR scsi_device (9S)
.sp
.LP
.I "ANSI Small Computer System Interface-2 (SCSI-2)
.sp
.LP
.I Writing Device Drivers
