usr/src/man/man9s/scsi_status.9s
'\" te
.\" Copyright (c) 2000, Sun Microsystems, Inc.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" , All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH scsi_status 9S "30 Aug 1995" "SunOS 5.11" "Data Structures for Drivers"
.SH NAME
scsi_status \- SCSI status structure
.SH SYNOPSIS
.LP
.nf
#include <sys/scsi/scsi.h>
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI)
.SH DESCRIPTION
.sp
.LP
The \fBSCSI-2\fRstandard defines a status byte that is normally sent by the
target to the initiator during the status phase at the completion of each
command.
.SH STRUCTURE MEMBERS
.sp
.in +2
.nf
uchar  sts_scsi2    :1;       /* SCSI-2 modifier bit */
uchar  sts_is       :1;       /* intermediate status sent */
uchar  sts_busy     :1;       /* device busy or reserved */
uchar  sts_cm       :1;       /* condition met */
ucha   sts_chk      :1;       /* check condition */
.fi
.in -2

.sp
.LP
.B sts_chk
indicates that a contingent allegiance condition has
occurred.
.sp
.LP
.B sts_cm
is returned whenever the requested operation is satisfied
.sp
.LP
.B sts_busy
indicates that the target is busy. This status is returned
whenever a target is unable to accept a command from an otherwise acceptable
initiator (that is, no reservation conflicts). The recommended initiator
recovery action is to issue the command again later.
.sp
.LP
.B sts_is
is returned for every successfully completed command in a
series of linked commands (except the last command), unless the command is
terminated with a check condition status, reservation conflict, or command
terminated status. Note that host bus adapter drivers may not support linked
commands (see \fBscsi_ifsetcap\fR(9F)). If \fBsts_is\fR and \fBsts_busy\fR
are both set, then a reservation conflict has occurred.
.sp
.LP
.B sts_scsi2
is the
.B SCSI-2
modifier bit. If
.B sts_scsi2
and
.B sts_chk
are both set, this indicates a command terminated status. If
.B sts_scsi2
and
.B sts_busy
are both set, this indicates that the
command queue in the target is full.
.sp
.LP
For accessing the status as a byte, the following values are appropriate:
.sp
.ne 2
.mk
.na
.B STATUS_GOOD
.ad
.sp .6
.RS 4n
This status indicates that the target has successfully completed the
command.
.RE

.sp
.ne 2
.mk
.na
.B STATUS_CHECK
.ad
.sp .6
.RS 4n
This status indicates that a contingent allegiance condition has
occurred.
.RE

.sp
.ne 2
.mk
.na
.B STATUS_MET
.ad
.sp .6
.RS 4n
This status is returned when the requested operations are satisfied.
.RE

.sp
.ne 2
.mk
.na
.B STATUS_BUSY
.ad
.sp .6
.RS 4n
This status indicates that the target is busy.
.RE

.sp
.ne 2
.mk
.na
.B STATUS_INTERMEDIATE
.ad
.sp .6
.RS 4n
This status is returned for every successfully completed command in a
series of linked commands.
.RE

.sp
.ne 2
.mk
.na
.B STATUS_SCSI2
.ad
.sp .6
.RS 4n
This is the
.B SCSI-2
modifier bit.
.RE

.sp
.ne 2
.mk
.na
.B STATUS_INTERMEDIATE_MET
.ad
.sp .6
.RS 4n
This status is a combination of
.B STATUS_MET
and
.BR STATUS_INTERMEDIATE .
.RE

.sp
.ne 2
.mk
.na
.B STATUS_RESERVATION_CONFLICT
.ad
.sp .6
.RS 4n
This status is a combination of
.B STATUS_INTERMEDIATE
and
.BR STATUS_BUSY ,
and it is returned whenever an initiator attempts to
access a logical unit or an extent within a logical unit is reserved.
.RE

.sp
.ne 2
.mk
.na
.B STATUS_TERMINATED
.ad
.sp .6
.RS 4n
This status is a combination of
.B STATUS_SCSI2
and
.BR STATUS_CHECK,
and it is returned whenever the target terminates the current
.BR I/O
process after receiving a terminate
.B I/O
process message.
.RE

.sp
.ne 2
.mk
.na
.B STATUS_QFULL
.ad
.sp .6
.RS 4n
This status is a combination of
.B STATUS_SCSI2
and
.BR STATUS_BUSY ,
and it is returned when the command queue in the target is full.
.RE

.SH SEE ALSO
.sp
.LP
.BR scsi_ifgetcap (9F),
.BR scsi_init_pkt (9F),
.BR scsi_extended_sense (9S),
.BR scsi_pkt (9S)
.sp
.LP
.I Writing Device Drivers
