usr/src/man/man9s/stroptions.9s
'\" te
.\" Copyright (c) 2002, Sun Microsystems, Inc.  All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" Copyright 1989 AT&T
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH stroptions 9S "14 Nov 1996" "SunOS 5.11" "Data Structures for Drivers"
.SH NAME
stroptions \- options structure for M_SETOPTS message
.SH SYNOPSIS
.LP
.nf
#include <sys/stream.h>
#include <sys/stropts.h>
#include <sys/ddi.h>
#include <sys/sunddi.h>
.fi

.SH INTERFACE LEVEL
.sp
.LP
Architecture independent level 1 (DDI/DKI)
.SH DESCRIPTION
.sp
.LP
The
.B M_SETOPTS
message contains a
.B stroptions
structure and is
used to control options in the stream head.
.SH STRUCTURE MEMBERS
.sp
.in +2
.nf
uint_t           so_flags;      /* options to set */
short            so_readopt;    /* read option */
ushort_t         so_wroff;      /* write offset */
ssize_t          so_minpsz;     /* minimum read packet size */
ssize_t          so_maxpsz;     /* maximum read packet size */
size_t           so_hiwat;      /* read queue high water mark */
size_t           so_lowat;      /* read queue low water mark */
unsigned char    so_band;       /* band for water marks */
ushort_t         so_erropt;     /* error option */
.fi
.in -2

.sp
.LP
The following are the flags that can be set in the
.B so_flags
bit mask
in the
.B stroptions
structure.  Note that multiple flags can be set.
.sp
.ne 2
.mk
.na
.B SO_READOPT
.ad
.RS 21n
.rt
Set read option.
.RE

.sp
.ne 2
.mk
.na
.B SO_WROFF
.ad
.RS 21n
.rt
Set write offset.
.RE

.sp
.ne 2
.mk
.na
.B SO_MINPSZ
.ad
.RS 21n
.rt
Set minimum packet size
.RE

.sp
.ne 2
.mk
.na
.B SO_MAXPSZ
.ad
.RS 21n
.rt
Set maximum packet size.
.RE

.sp
.ne 2
.mk
.na
.B SO_HIWAT
.ad
.RS 21n
.rt
Set high water mark.
.RE

.sp
.ne 2
.mk
.na
.B SO_LOWAT
.ad
.RS 21n
.rt
Set low water mark.
.RE

.sp
.ne 2
.mk
.na
.B SO_MREADON
.ad
.RS 21n
.rt
Set read notification ON.
.RE

.sp
.ne 2
.mk
.na
.B SO_MREADOFF
.ad
.RS 21n
.rt
Set read notification OFF.
.RE

.sp
.ne 2
.mk
.na
.B SO_NDELON
.ad
.RS 21n
.rt
Old TTY semantics for NDELAY reads and writes.
.RE

.sp
.ne 2
.mk
.na
.B SO_NDELOFFSTREAMS
.ad
.RS 21n
.rt
Semantics for NDELAY reads and writes.
.RE

.sp
.ne 2
.mk
.na
.B SO_ISTTY
.ad
.RS 21n
.rt
The stream is acting as a terminal.
.RE

.sp
.ne 2
.mk
.na
.B SO_ISNTTY
.ad
.RS 21n
.rt
The stream is not acting as a terminal.
.RE

.sp
.ne 2
.mk
.na
.B SO_TOSTOP
.ad
.RS 21n
.rt
Stop on background writes to this stream.
.RE

.sp
.ne 2
.mk
.na
.B SO_TONSTOP
.ad
.RS 21n
.rt
Do not stop on background writes to this stream.
.RE

.sp
.ne 2
.mk
.na
.B SO_BAND
.ad
.RS 21n
.rt
Water marks affect band.
.RE

.sp
.ne 2
.mk
.na
.B SO_ERROPT
.ad
.RS 21n
.rt
Set error option.
.RE

.sp
.LP
When
.B SO_READOPT
is set, the
.B so_readopt
field of the
.B stroptions
structure can take one of the following values. See
.BR read (2).
.sp
.ne 2
.mk
.na
.B RNORM
.ad
.RS 9n
.rt
Read message normal.
.RE

.sp
.ne 2
.mk
.na
.B RMSGD
.ad
.RS 9n
.rt
Read message discard.
.RE

.sp
.ne 2
.mk
.na
.B RMSGN
.ad
.RS 9n
.rt
Read message, no discard.
.RE

.sp
.LP
When
.B SO_BAND
is set,
.B so_band
determines to which band
.B so_hiwat
and
.B so_lowat
apply.
.sp
.LP
When
.B SO_ERROPT
is set, the
.B so_erropt
field of the
.B stroptions
structure can take a value that is either none or one of:

.sp
.ne 2
.mk
.na
.B RERRNORM
.ad
.RS 18n
.rt
Persistent read errors; default.
.RE

.sp
.ne 2
.mk
.na
.B RERRNONPERSIST
.ad
.RS 18n
.rt
Non-persistent read errors.
.RE

.sp
.LP
.B OR'ed
with either none or one of:
.sp
.ne 2
.mk
.na
.B WERRNORM
.ad
.RS 18n
.rt
Persistent write errors; default.
.RE

.sp
.ne 2
.mk
.na
.B WERRNONPERSIST
.ad
.RS 18n
.rt
Non-persistent write errors.
.RE

.SH SEE ALSO
.sp
.LP
.BR read (2),
.BR streamio (7I)
.sp
.LP
.I STREAMS Programming Guide
