usr/src/man/man9s/usb_string_descr.9s
'\" te
.\" Copyright (c) 2004, Sun Microsystems, Inc., All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH usb_string_descr 9S "5 Jan 2004" "SunOS 5.11" "Data Structures for Drivers"
.SH NAME
usb_string_descr \- USB string descriptor
.SH SYNOPSIS
.LP
.nf
#include <sys/usb/usba.h>
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI)
.SH DESCRIPTION
.sp
.LP
The
.B usb_string_descr_t
string descriptor defines the attributes of a
string, including size and Unicode language ID.  Other USB descriptors may
have string descriptor index fields which refer to specific string
descriptors retrieved as part of a device's configuration.
.sp
.LP
Please refer to Section
.I 9.6.7
of the
.I "USB 2.0"
specification. The
.I USB 2.0
specification is available at
.IR www.usb.org .
.sp
.LP
A  string descriptor has the following fields:
.sp
.in +2
.nf
uint8_t       bLength                Size of this descriptor,
                                     in bytes.

uint8_t       bDescriptorType        Set to USB_DESCR_TYPE_STRING.

uint16_t      bString[1];            Variable length Unicode encoded
                                     string.
.fi
.in -2

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
ArchitecturePCI-based systems
_
Interface stabilityCommitted
_
AvailabilitySUNWusbu
.TE

.SH SEE ALSO
.sp
.LP
.BR attributes (5),
.BR usb_get_alt_if (9F),
.BR usb_get_cfg (9F),
.BR usb_get_dev_data (9F),
.BR usb_get_string_descr (9F),
.BR usb_parse_data (9F),
.BR usb_ctrl_request (9S)
