usr/src/man/man9s/usb_other_speed_cfg_descr.9s
'\" te
.\" Copyright (c) 2004, Sun Microsystems, Inc., All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH usb_other_speed_cfg_descr 9S "5 Jan 2004" "SunOS 5.11" "Data Structures for Drivers"
.SH NAME
usb_other_speed_cfg_descr \- USB other speed configuration descriptor
.SH SYNOPSIS
.LP
.nf
#include <sys/usb/usba.h>
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI)
.SH DESCRIPTION
.sp
.LP
The
.B usb_other_speed_cfg_descr_t
configuration descriptor defines how
fields of a high speed device's configuration descriptor change if that
device is run at its other speed. Fields of this descriptor reflect
configuration descriptor field changes if a device's speed is changed from
full to high speed, or from high to full speed.
.sp
.LP
Please refer to Section
.I 9.6.4
of the
.I "USB 2.0"
specification. The
.I USB 2.0
specification is available at
.IR www.usb.org .
.sp
.LP
This descriptor has the following fields:
.sp
.in +2
.nf
uint8_t     bLength                Size of this descriptor,
                                   in bytes.

uint8_t     bDescriptorType        Set to USB_DESCR_TYPE_OTHER_SPEED_CFG.

uint16_t    wTotalLength           Total length of data returned */
                                   including all descriptors in
                                   the current other-speed
                                   configuration.

uint8_t     bNumInterfaces         Number of interfaces in
                                   the selected configuration.

uint8_t     bConfigurationValue    ID of the current other-speed
                                   configuration (1-based).

uint8_t     iConfiguration         Configuration value.
                                   Valid if > 0. Pass to
                                   usb_get_string_descr(9F)
                                   to retrieve string.

uint8_t     bmAttributes           Configuration characteristics
                                   [See usb_cfg_descr(9S).]

uint8_t     bMaxPower              Maximum power consumption
                                   in 2mA units.
.fi
.in -2

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
ArchitecturePCI-based systems
_
Interface stabilityCommitted
_
AvailabilitySUNWusbu
.TE

.SH SEE ALSO
.sp
.LP
.BR attributes (5),
.BR usb_get_alt_if (9F),
.BR usb_get_cfg (9F),
.BR usb_get_dev_data (9F),
.BR usb_get_string_descr (9F),
.BR usb_parse_data (9F),
.BR usb_cfg_descr (9S),
.BR usb_ctrl_request (9S),
.BR usb_dev_descr (9S),
.BR usb_dev_qlf_descr (9S)
