usr/src/man/man4/alias.4
'\" te
.\" Copyright (c) 2001, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH alias 4 "2 Oct 2001" "SunOS 5.11" "File Formats"
.SH NAME
alias \- alias table file of encoding names
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/iconv/alias\fR
.fi

.SH DESCRIPTION
.sp
.LP
This file contains the alias table of encoding names for
.BR iconv_open (3C).
.sp
.LP
The format of the alias table is as follows:
.sp
.in +2
.nf
"%s %s\en", <variant encoding name>, <canonical encoding name>
.fi
.in -2

.sp
.LP
The string specified for the variant encoding name is case-insensitive. A
line beginning with '#' is treated as a comment.
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityEvolving
.TE

.SH SEE ALSO
.sp
.LP
.BR iconv (3C),
.BR iconv_close (3C),
.BR iconv_open (3C),
.BR attributes (5)
