usr/src/man/man4/audit_user.4
'\" te
.\" Copyright (c) 2008, Sun Microsystems, Inc. All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH audit_user 4 "26 Jun 2008" "SunOS 5.11" "File Formats"
.SH NAME
audit_user \- per-user auditing data file
.SH SYNOPSIS
.LP
.nf
\fB/etc/security/audit_user\fR
.fi

.SH DESCRIPTION
.sp
.LP
.B audit_user
is a database that stores per-user auditing preselection
data. You can use the
.B audit_user
file with other authorization
sources, including the
.B NIS
map
.B audit_user.byname
and the
.B NIS+
table
.BR audit_user .
Programs use the
.BR getauusernam (3BSM)
routines to access this information.
.sp
.LP
The search order for multiple user audit information sources is specified
in the
.B /etc/nsswitch.conf
file. See
.BR nsswitch.conf (4).
The lookup
follows the search order for
.BR passwd (4).
.sp
.LP
The fields for each user entry are separated by colons
.RB ( : ).
Each user
is separated from the next by a newline.
.B audit_user
does not have
general read permission. Each entry in the
.B audit_user
file has the
form:
.sp
.in +2
.nf
\fIusername\fR:\fIalways-audit-flags\fR:\fInever-audit-flags\fR
.fi
.in -2
.sp

.sp
.LP
The fields are defined as follows:
.sp
.ne 2
.mk
.na
.I username
.ad
.RS 22n
.rt
User's login name.
.RE

.sp
.ne 2
.mk
.na
.I always-audit-flags
.ad
.RS 22n
.rt
Flags specifying event classes to
.I always
audit.
.RE

.sp
.ne 2
.mk
.na
.I never-audit-flags
.ad
.RS 22n
.rt
Flags specifying event classes to
.I never
audit.
.RE

.sp
.LP
For a complete description of the audit flags and how to combine them, see
.BR audit_control (4).
.SH EXAMPLES
.LP
.B Example 1
Using the
.B audit_user
File
.sp
.in +2
.nf
other:lo,am:io,cl
fred:lo,ex,+fc,-fr,-fa:io,cl
ethyl:lo,ex,nt:io,cl
.fi
.in -2
.sp

.SH FILES
.sp
.LP
.B /etc/nsswitch.conf
.sp
.LP
.B /etc/passwd
.sp
.LP
.B /etc/security/audit_user
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface Stability  See below.
.TE

.sp
.LP
The file format stability is Committed. The file content is Uncommitted.
.SH SEE ALSO
.sp
.LP
.BR bsmconv (1M),
.BR getauusernam (3BSM),
.BR audit_control (4),
.BR nsswitch.conf (4),
.BR passwd (4)
.sp
.LP
Part\ VII, \fISolaris Auditing,\fR in \fISystem Administration Guide:
Security Services\fR
.SH NOTES
.sp
.LP
This functionality is available only if the Basic Security Module
(\fBBSM\fR) has been enabled. See \fBbsmconv\fR(1M) for more information.
.sp
.LP
Configuration changes do not affect audit sessions that are currently
running, as the changes do not modify a process's preselection mask. To
.RB "change the preselection mask on a running process, use the" " -setpmask"
option of the \fBauditconfig\fR command (see \fBauditconfig\fR(1M)). If the
user logs out and logs back in, the new configuration changes will be
reflected in the next audit session.
