usr/src/man/man4/autofs.4
'\" te
.\" Copyright (c) 2002 Sun Microsystems, Inc. All rights reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH autofs 4 "2 Aug 2005" "SunOS 5.11" "File Formats"
.SH NAME
autofs \- file containing parameter values for automountd daemon and automount
command
.SH SYNOPSIS
.LP
.nf
\fB/etc/default/autofs\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.BR autofs " file resides in directory "
.B /etc/default
and supplies
default parameters for the
.BR automountd "(1M) daemon and the"
.BR automount (1M)
command.
.sp
.LP
The
.B autofs
file format is
.BR ASCII ;
comment lines begin with the
crosshatch
.RB ( # )
character. Parameters consist of a keyword followed by an
equal sign followed by the parameter value, of the form:
.sp
.in +2
.nf
\fIkeyword\fR=\fIvalue\fR
.fi
.in -2
.sp

.sp
.LP
As shipped, the parameters in the
.B autofs
file are commented out. As
root, you must uncomment a keyword-value line to make the value for that
parameter take effect.
.sp
.LP
Administrators can make changes to the startup parameters for
.BR automountd
by logging in as root and editing the
.B autofs
file. Changes made to
.B autofs
values on an
.B automount
or
.B automountd
command line
override values in
.BR /etc/default/autofs .
The
.B /etc/default/autofs
file is preserved across operating system upgrades.
.sp
.LP
The following parameters are currently supported in the
.B autofs
file:
.sp
.ne 2
.mk
.na
.BI AUTOMOUNT_TIMEOUT= <num>
.ad
.sp .6
.RS 4n
Specifies a duration, in seconds, that a file system is to remain mounted when
not in use. The default value is 600 (10 minutes). Equivalent to the
.B -t
option in
.BR automount .
.RE

.sp
.ne 2
.mk
.na
.B AUTOMOUNT_VERBOSE=TRUE | FALSE
.ad
.sp .6
.RS 4n
Verbose mode. Causes you to be notified of non-critical events, suchs as
.B autofs
mounts and unmounts. The default value is
.BR FALSE .
Equivalent
to the
.B -v
option in
.BR automount .
.RE

.sp
.ne 2
.mk
.na
.B AUTOMOUNTD_VERBOSE=TRUE | FALSE
.ad
.sp .6
.RS 4n
Verbose mode. Causes status messages to be logged to
.BR /var/svc/log/system-filesystem-autofs:default.log .
(See
.BR smf (5).)
The default value is
.BR FALSE .
Equivalent to the
.B -v
option in
.BR automountd .
.RE

.sp
.ne 2
.mk
.na
.BI AUTOMOUNTD_NOBROWSE= <num>
.ad
.sp .6
.RS 4n
Turn on or off browsing for all
.B autofs
mount points. The default value
is
.BR FALSE .
Equivalent to the
.B -n
option in
.BR automountd .
.RE

.sp
.ne 2
.mk
.na
.BI AUTOMOUNTD_TRACE= <num>
.ad
.sp .6
.RS 4n
Expands each RPC call and logs it to
.BR /var/svc/log/system-filesystem-autofs:default.log .
(See
.BR smf (5).)
The default value,
.BR 0 ,
turns off such tracing. Starting with 1, with each
higher value, the verbosity of trace output increases.
.RE

.sp
.ne 2
.mk
.na
\fBAUTOMOUNTD_ENV\fR=\fI<name>\fB=\fI<value>\fR
.ad
.sp .6
.RS 4n
Environment variables. Each environment variable-value pairing must be on its
own line. You can specify multiple such pairings. There are no environment
.RB "variable settings supplied. For example:" " AUTOMOUNTD_ENV=DAY=TUES"
.RE

.SH SEE ALSO
.sp
.LP
.BR automount (1M),
.BR automountd (1M),
.BR smf (5)
