usr/src/man/man4/bart_rules.4
'\" te
.\" Copyright (c) 2003, Sun Microsystems, Inc. All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH bart_rules 4 "9 Sep 2003" "SunOS 5.11" "File Formats"
.SH NAME
bart_rules \- bart rules file
.SH DESCRIPTION
.sp
.LP
The
.B bart_rules
file is a text file that is used by the
.BR bart (1M)
command. The rules file determines which files to validate and which file
attributes of those files to ignore.
.sp
.LP
Some lines are ignored by the manifest comparison tool. Ignored lines
include blank lines, lines that consist only of white space, and comments
that begin with
.BR # .
.sp
.LP
The rules file supports three directives:
.BR CHECK ,
.BR IGNORE ,
and a
\fIsubtree\fR directive, which is an absolute path name and optional pattern
matching modifiers. Each
.BR CHECK ,
.BR IGNORE ,
and
.IR subtree
directive must be on a separate line. Bart supports continuation of long
lines using a backslash (\fB\e\fR). The rules file uses the directives to
create logical blocks.
.SS "Syntax"
.sp
.LP
The syntax for the rules file is as follows:
.sp
.in +2
.nf
[IGNORE \fIattribute\fR.\|.\|.]*
[CHECK] [\fIattribute\fR.\|.\|.]*

\fIsubtree1\fR [\fIpattern\fR.\|.\|.]*
[IGNORE \fIattribute\fR.\|.\|.]*
[CHECK] [\fIattribute\fR.\|.\|.]*

\fIsubtree2\fR [\fIpattern\fR.\|.\|.]*
\fIsubtree3\fR [\fIpattern\fR.\|.\|.]*
\fIsubtree4\fR [\fIpattern\fR.\|.\|.]*
[IGNORE \fIattribute\fR.\|.\|.]*
[CHECK] [\fIattribute\fR.\|.\|.]*
\&.\|.\|.
.fi
.in -2

.SS "Rule Blocks"
.sp
.LP
Rule blocks are composed of statements that are created by using directives
and arguments.
.sp
.LP
There are three types of blocks:
.sp
.ne 2
.mk
.na
.B Global Block
.ad
.RS 16n
.rt
The first block in the file. The block is considered ``global'' if it
specifies
.B CHECK
and
.B IGNORE
statements, but no previous subtree
statement. A global block pertains to all subsequent blocks.
.RE

.sp
.ne 2
.mk
.na
.B Local block
.ad
.RS 16n
.rt
A block that specifies
.B CHECK
and
.B IGNORE
statements as well as a
subtree directive. The rules in this block pertain to files and directories
found in the specified subtree.
.RE

.sp
.ne 2
.mk
.na
.B Heir block
.ad
.RS 16n
.rt
A block that contains a null
.B CHECK
statement, no arguments. This
block inherits the global
.B CHECK
statements and
.BR IGNORE
statements.
.RE

.sp
.LP
The order in which
.B CHECK
and
.B IGNORE
statements appear in blocks
is important. The
.B bart
command processes
.B CHECK
and
.BR IGNORE
statements in the order in which they are read, with later statements
overriding earlier statements.
.sp
.LP
Subtree specifications must appear one per line. Each specification must
begin with an absolute path name. Optionally, each specification can be
followed by pattern-matching arguments.
.sp
.LP
When a file system being tracked belongs to more than one subtree
directive,
.B bart
performs the following resolution steps:
.RS +4
.TP
.ie t \(bu
.el o
Applies the
.B CHECK
and
.B IGNORE
statements set in the global
block. Note that all
.B CHECK
and
.B IGNORE
statements are processed
in order.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Finds the last subtree directive that matches the file.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Processes the
.B CHECK
and
.B IGNORE
statements that belong to the
last matching subtree directive. These statements are processed in the order
in which they are read, overriding global settings.
.RE
.SS "Pattern Matching Statements"
.sp
.LP
There are two types of pattern matching statements
.sp
.ne 2
.mk
.na
.B AND
.ad
.RS 7n
.rt
For a given subtree directive, all pattern matching statements are
logically ANDed with the subtree. Patterns have the following syntax:
.RS +4
.TP
.ie t \(bu
.el o
Wildcards are permitted for both the subtree and pattern matching
statements.
.RE
.RS +4
.TP
.ie t \(bu
.el o
The exclamation point (\fB!\fR) character represents logical NOT.
.RE
.RS +4
.TP
.ie t \(bu
.el o
A pattern that terminates with a slash is a subtree. The absence of a slash
indicates that the pattern is not a directory. The subtree itself does not
require an end slash.
.RE
For example, the following subtree example includes the contents of
\fB/home/nickiso/src\fR except for object files, core files, and all of the
SCCS subtrees. Note that directory names that terminate with \fB\&.o\fR and
directories named
.B core
are
.B not
excluded because the patterns
specified do not terminate with
.BR / .
.sp
.in +2
.nf
/home/nickiso/src !*.o !core !SCCS/
CHECK  all
.fi
.in -2

.RE

.sp
.ne 2
.mk
.na
.B OR
.ad
.RS 7n
.rt
Group multiple subtree directives together. Such subtree directives are
logically ORed together.
.sp
.in +2
.nf
/home/nickiso/src !*.o !core
/home/nickiso/Mail
/home/nickiso/docs *.sdw
CHECK   all
IGNORE  mtime lnmtime dirmtime
.fi
.in -2

The files included in the previous example are as follows:
.RS +4
.TP
.ie t \(bu
.el o
Everything under
.B /home/nickiso/src
except for
.B *.o
and
\fBcore\fR files
.RE
.RS +4
.TP
.ie t \(bu
.el o
Everything under
.BR /home/nickiso/Mail
.RE
.RS +4
.TP
.ie t \(bu
.el o
All files under
.B /home/nickiso/docs
that end in
.BR *.sdw
.RE
For these files, all attributes are checked except for modification
times.
.RE

.SS "File Attributes"
.sp
.LP
The
.B bart
command uses
.B CHECK
and
.B IGNORE
statements to
define which attributes to track or ignore. Each attribute has an associated
keyword.
.sp
.LP
The attribute keywords are as follows:
.sp
.ne 2
.mk
.na
.B acl
.ad
.RS 12n
.rt
ACL attributes for the file. For a file with ACL attributes, this field
contains the output from
.BR acltotext() .
.RE

.sp
.ne 2
.mk
.na
.B all
.ad
.RS 12n
.rt
All attributes.
.RE

.sp
.ne 2
.mk
.na
.B contents
.ad
.RS 12n
.rt
Checksum value of the file. This attribute is only specified for regular
files. If you turn off context checking or if checksums cannot be computed,
the value of this field is
.BR - .
.RE

.sp
.ne 2
.mk
.na
.B dest
.ad
.RS 12n
.rt
Destination of a symbolic link.
.RE

.sp
.ne 2
.mk
.na
.B devnode
.ad
.RS 12n
.rt
Value of the device node. This attribute is for character device files and
block device files only.
.RE

.sp
.ne 2
.mk
.na
.B dirmtime
.ad
.RS 12n
.rt
Modification time in seconds since 00:00:00 UTC, January 1, 1970 for
directories.
.RE

.sp
.ne 2
.mk
.na
.B gid
.ad
.RS 12n
.rt
Numerical group ID of the owner of this entry.
.RE

.sp
.ne 2
.mk
.na
.B lnmtime
.ad
.RS 12n
.rt
Creation time for links.
.RE

.sp
.ne 2
.mk
.na
.B mode
.ad
.RS 12n
.rt
Octal number that represents the permissions of the file.
.RE

.sp
.ne 2
.mk
.na
.B mtime
.ad
.RS 12n
.rt
Modification time in seconds since 00:00:00 UTC, January 1, 1970 for
files.
.RE

.sp
.ne 2
.mk
.na
.B size
.ad
.RS 12n
.rt
File size in bytes.
.RE

.sp
.ne 2
.mk
.na
.B type
.ad
.RS 12n
.rt
Type of file.
.RE

.sp
.ne 2
.mk
.na
.B uid
.ad
.RS 12n
.rt
Numerical user ID of the owner of this entry.
.RE

.SH EXAMPLES
.LP
\fBExample 1\fR Sample Rules File
.sp
.LP
The following is a sample rules file:

.sp
.in +2
.nf
# Global rules, track everything except dirmtime.
CHECK   all
IGNORE  dirmtime

# The files in /data* are expected to change, so don't bother
# tracking the attributes expected to change.
# Furthermore, by specifying ``IGNORE contents,'' you save
# time and resources.
/data*
IGNORE  contents mtime size

/home/nickiso f* bar/
IGNORE  acl

# For /usr, apply the global rules.
/usr
CHECK

# Note: Since /usr/tmp follows the /usr block, the /usr/tmp
# subtree is subjected to the ``IGNORE all.''
/usr/tmp
/home/nickiso *.o
/home/nickiso core
/home/nickiso/proto
IGNORE  all
.fi
.in -2

.sp
.LP
The following files are cataloged based on the sample rules file:

.RS +4
.TP
.ie t \(bu
.el o
All attributes, except for
.BR dirmtime ,
.BR mtime ,
.BR size ,
and
.BR contents ,
are tracked for files under the
.B /data*
subtrees.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Files under the
.B /usr
subtree, except for
.BR /usr/tmp ,
are
cataloged by using the global rules.
.RE
.RS +4
.TP
.ie t \(bu
.el o
If the \fB/home/nickiso/foo.c\fR file exists, its attributes, except for
\fBacl\fR and
.BR dirmtime ,
are cataloged.
.RE
.RS +4
.TP
.ie t \(bu
.el o
All \fB\&.o\fR and \fBcore\fR files under
.BR /home/nickiso ,
as well as
the
.B /home/nickiso/proto
and
.B /usr/tmp
subtrees, are ignored.
.RE
.RS +4
.TP
.ie t \(bu
.el o
If the \fB/home/nickiso/bar/foo.o\fR file exists, it is ignored because it
is subject to the last block.
.RE
.SH SEE ALSO
.sp
.LP
.BR bart (1M),
\fBbart_manifest\fR(4), \fBattributes\fR(5)
