usr/src/man/man4/bootparams.4
'\" te
.\" Copyright (C) 2002, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH bootparams 4 "22 Jul 2004" "SunOS 5.11" "File Formats"
.SH NAME
bootparams \- boot parameter data base
.SH SYNOPSIS
.LP
.nf
\fB/etc/bootparams\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B bootparams
file contains a list of client entries that diskless
clients use for booting. Diskless booting clients retrieve this information
by issuing requests to a server running the
.BR rpc.bootparamd (1M)
program. The
.B bootparams
file may be used in conjunction with or in
place of other sources for the
.B bootparams
information. See
.BR nsswitch.conf (4).
.sp
.LP
For each client the file contains an entry with the client's name and a
list of boot parameter values for that client. Each entry has the form:
.sp
.in +2
.nf
\fIclientname    keyword=value\fR...
.fi
.in -2
.sp

.sp
.LP
The first item of each entry is the host name of the diskless client. You
can use the asterisk ('*') character as a "wildcard" in place of the client
name in a single entry. A wildcard entry applies to all clients for which
there is not an entry that specifically names them.
.sp
.LP
In a given entry, the host name or asterisk is followed by one or more
whitespace characters and a series of keyword\(emvalue pairs separated by
whitespace characters. There must not be any whitespace within a
keyword\(emvalue pair.
.sp
.LP
Each keyword\(emvalue pair has the syntax:
.sp
.in +2
.nf
\fIkeyword\fB=\fIvalue\fR
.fi
.in -2
.sp

.sp
.LP
The preceding form breaks out further as:
.sp
.in +2
.nf
\fIkeyword\fB=\fIserver\fB:\fIvalue\fR
.fi
.in -2
.sp

.sp
.LP
Where
.I server
can be null and
.I value
can be a pathname.
.sp
.LP
An example that includes a server is:
.sp
.in +2
.nf
client1 root=server1:/export/client1/root
.fi
.in -2
.sp

.sp
.LP
An example where
.I server
is null is:
.sp
.in +2
.nf
client1 rootopts=:vers2
.fi
.in -2
.sp

.sp
.LP
A minor variation of the
.I keyword=value
syntax is used for the
.B domain
keyword. Unlike the forms shown above, this syntax does not use
a colon. For example:
.sp
.in +2
.nf
client1 domain=bldg1.workco.com
.fi
.in -2
.sp

.sp
.LP
Entries can span multiple lines. Use the backslash ('\e') character as the
last character of a line to continue the entry to the following line. For
multiple-line entries, you can split a line only in places where whitespace
is allowed. For example, you can use a backslash to split the following
entry between the end of the path
.RB ( root )
and the keyword
.BR domain :
.sp
.in +2
.nf
client1 root=server1:/export/client1/root domain=bldg1.workco.com
.fi
.in -2
.sp

.sp
.LP
In entries that specify a server,
.I server
is the name of the server
that will provide the file or filesystem to the diskless client and
.I value
is the pathname of the exported file or filesystem on that
server.
.sp
.LP
In entries that use the
.B domain
keyword, the domain name specified
must be the client's domain name. The algorithm for determining a client's
domain name is to first check for a
.B domain
keyword in the
client-specific entry and then in "wildcard" entry. If none is found, the
server's domain name is used.
.sp
.LP
For the JumpStart installation of machines that do not have video displays,
use the
.B term
keyword to identify the terminal type of the boot server.
Terminal types are listed in
.B /usr/share/lib/terminfo
(see
.BR terminfo (4)).
.sp
.LP
An entry with the
.B ns
keyword associates a server (a name server)
with, instead of a pathname, a specific name service
.RB ( NIS+ ,
.BR NIS ,
.BR LDAP ,
or
.BR none )
and, if that server is not on a local subnet, the
netmask needed to reach it. For example:
.sp
.in +2
.nf
ns=hoot:nisplus(255.255.255.0)
.fi
.in -2
.sp

.sp
.LP
An
.B ns
entry forces
.BR sysidtool (1M)
to use the specified name
service. By default,
.B sysidtool
uses
.B NIS+
in preference to
.B NIS
or
.B LDAP
if it can find an
.B NIS+
server for the system's
domain on the subnet. An
.B ns
entry might be necessary if you are trying
to set up a hands-off installation, or if the name server is on a different
subnet, which is common with
.BR NIS+ .
.sp
.LP
If an
.B ns
keyword is not used,
.B sysidtool
uses broadcast to
attempt to bind to either a
.BR NIS+ ,
.BR NIS ,
or
.B LDAP
server. If
a name server is not on the local subnet, which is possible for
.B NIS+
or
.BR LDAP ,
the bind will fail, automatic configuration of the name
service will fail, and an interactive screen is displayed, prompting the
user to specify the name service.
.sp
.LP
The
.B ns
keyword can be set in
.B add_install_client
or by Host
Manager.
.SH EXAMPLES
.LP
.B Example 1
Sample
.B bootparams
Entry
.sp
.LP
Here is an example of an entry in the
.B bootparams
file:

.sp
.in +2
.nf
	client1 root=server1:/export/client1/root rootopts=:vers=2 \e
		domain=bldg1.workco.com
	client2 root=server2:/export/client2/root ns=:nis
	client3 root=server2:/export/client3/root ns=watson:
	client4 root=server2:/export/client4/root \e
		ns=mach:nisplus(255.255.255.0)
.fi
.in -2
.sp

.LP
.B Example 2
Sample Entry for JumpStart
.sp
.LP
The following is an example of an entry that might be used for the
JumpStart installation of diskless clients that do not have displays.

.sp
.in +2
.nf
mozart root=haydn:/export/install/sparc/os/latest/Solaris_9/boot \e
install=haydn:/export/install/sparc/os/8.1/latest boottype=:in \e
install_config=haydn:/usr/local/share/lib/jump-net \e
ns=otis:nisplus(255.255.255.0) term=:xterms domain=eu.cte.work.com
.fi
.in -2
.sp

.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/bootparams
.ad
.RS 19n
.rt

.RE

.SH SEE ALSO
.sp
.LP
.BR rpc.bootparamd (1M),
.BR sysidtool (1M),
.BR nsswitch.conf (4)
.SH NOTES
.sp
.LP
Solaris diskless clients use the keywords
.B root
and
.B rootopts
to
look up the pathname for the root filesystem and the mount options for the
root filesystem, respectively. These are the only keywords meaningful for
diskless booting clients. See
.BR mount_ufs (1M).
