usr/src/man/man4/compver.4
'\" te
.\" Copyright 1989 AT&T  Copyright (c) 1996, Sun Microsystems, Inc.  All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH compver 4 "4 Oct 1996" "SunOS 5.11" "File Formats"
.SH NAME
compver \- compatible versions file
.SH DESCRIPTION
.sp
.LP
.B compver
is an
.B ASCII
file used to specify previous versions of
the associated package which are upward compatible. It is created by a
package developer.
.sp
.LP
Each line of the file specifies a previous version of the associated
package with which the current version is backward compatible.
.sp
.LP
Since some packages may require installation of a specific version of
another software package, compatibility information is extremely crucial.
Consider, for example, a package called "A" which requires version "1.0" of
application "B" as a prerequisite for installation. If the customer
installing "A" has a newer version of "B" (version 1.3), the \fBcompver\fR
file for "B" must indicate that "1.3" is compatible with version "1.0" in
order for the customer to install package "A".
.SH EXAMPLES
.LP
.B Example 1
Sample
.B compver
file.
.sp
.LP
A sample
.B compver
file is shown below:

.sp
.in +2
.nf
\fBVersion 1.3
Version 1.0\fR
.fi
.in -2
.sp

.SH SEE ALSO
.sp
.LP
.BR pkginfo (4)
.sp
.LP
\fIApplication Packaging Developer\&'s Guide\fR
.SH NOTES
.sp
.LP
The comparison of the version string disregards white space and tabs. It is
performed on a word-by-word basis. Thus, "Version 1.3" and "Version 1.3"
would be considered the same.
.sp
.LP
The entries in the
.B compver
file must match the values assigned to the
.B VERSION
parameter in the
.BR pkginfo (4)
files.
