usr/src/man/man4/copyright.4
'\" te
.\" Copyright 1989 AT&T  Copyright (c) 1997, Sun Microsystems, Inc.  All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH copyright 4 "7 Feb 1997" "SunOS 5.11" "File Formats"
.SH NAME
copyright \- copyright information file
.SH DESCRIPTION
.sp
.LP
.B copyright
is an
.B ASCII
file used to provide a copyright notice
for a package. The text may be in any format. The full file contents
(including comment lines) are displayed on the terminal at the time of
package installation.
.SH SEE ALSO
.sp
.LP
\fIApplication Packaging Developer\&'s Guide\fR
