usr/src/man/man4/d_passwd.4
'\" te
.\" Copyright (c) 2004, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright 1989 AT&T
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH d_passwd 4 "2 Sep 2004" "SunOS 5.11" "File Formats"
.SH NAME
d_passwd \- dial-up password file
.SH SYNOPSIS
.LP
.nf
\fB/etc/d_passwd\fR
.fi

.SH DESCRIPTION
.sp
.LP
A dial-up password is an additional password required of users who access
the computer through a modem or dial-up port. The correct password must be
entered before the user is granted access to the computer.
.sp
.LP
\fBd_passwd\fR is an \fBASCII\fR file which contains a list of executable
programs (typically shells) that require a dial-up password and the
associated encrypted passwords. When a user attempts to log in on any of the
ports listed in the
.B dialups
file (see
.BR dialups (4)),
the login
program looks at the user's login entry stored in the
.B passwd
file (see
.BR passwd (4)),
and compares the login shell field to the entries in
.BR d_passwd .
These entries determine whether the user will be required to
supply a dial-up password.
.sp
.LP
Each entry in
.B d_passwd
is a single line of the form:
.sp
.in +2
.nf
\fIlogin-shell\fB:\fIpassword\fB:\fR
.fi
.in -2
.sp

.sp
.LP
where
.sp
.ne 2
.mk
.na
.I login-shell
.ad
.RS 15n
.rt
The name of the login program that will require an additional dial-up
password.
.RE

.sp
.ne 2
.mk
.na
.I password
.ad
.RS 15n
.rt
An encrypted password. Users accessing the computer through a  dial-up port
or modem using
.I login-shell
will be required to enter this password
before gaining access to the computer.
.RE

.sp
.LP
\fBd_passwd\fR should be owned by the \fBroot\fR user and the \fBroot\fR
group. The file should have read and write permissions for the owner
(\fBroot\fR) only.
.sp
.LP
If the user's login program in the
.B passwd
file is not found in
\fBd_passwd\fR or if the login shell field in \fBpasswd\fR is empty, the
user must supply the default password. The default password is the entry for
.BR /usr/bin/sh .
If
.B d_passwd
has no entry for
.BR /usr/bin/sh ,
then those users whose login shell field in
.B passwd
is empty or does
not match any entry in
.B d_passwd
will not be prompted for a dial-up
password.
.sp
.LP
Dial-up logins are disabled if
.B d_passwd
has only the following
entry:
.sp
.in +2
.nf
/usr/bin/sh:*:
.fi
.in -2
.sp

.SH EXAMPLES
.LP
\fBExample 1\fR Sample \fBd_passwd\fR file.
.sp
.LP
Here is a sample
.B d_passwd
file:

.sp
.in +2
.nf
/usr/lib/uucp/uucico:q.mJzTnu8icF0:
/usr/bin/csh:6k/7KCFRPNVXg:
/usr/bin/ksh:9df/FDf.4jkRt:
/usr/bin/sh:41FuGVzGcDJlw:
.fi
.in -2
.sp

.SS "Generating An Encrypted Password"
.sp
.LP
The
.B passwd
(see
.BR passwd (1))
utility can be used to generate the
encrypted password for each login program.
.B passwd
generates encrypted
passwords for users and places the password in the
.B shadow
(see
.BR shadow (4))
file. Passwords for the
.B d_passwd
file will need to be
generated by first adding a temporary user id using
.B useradd
(see
.BR useradd (1M)),
and then using
.BR passwd (1)
to generate the desired
password in the
.B shadow
file. Once the encrypted version of the
password has been created, it can be copied to the
.B d_passwd
file.
.sp
.LP
For example:
.RS +4
.TP
1.
Type
.B "useradd tempuser"
and press Return. This creates a user
named
.BR tempuser .
.RE
.RS +4
.TP
2.
Type
.B "passwd tempuser"
and press Return. This creates an
encrypted password for
.B tempuser
and places it in the
.BR shadow
file.
.RE
.RS +4
.TP
3.
Find the entry for
.B tempuser
in the
.B shadow
file and copy the
encrypted password to the desired entry in the
.B d_passwd
file.
.RE
.RS +4
.TP
4.
Type
.B "userdel tempuser"
and press Return to delete
.BR tempuser .
.RE
.sp
.LP
These steps must be executed as the
.B root
user.
.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/d_passwd
.ad
.RS 17n
.rt
dial-up password file
.RE

.sp
.ne 2
.mk
.na
.B /etc/dialups
.ad
.RS 17n
.rt
list of dial-up ports requiring dial-up passwords
.RE

.sp
.ne 2
.mk
.na
.B /etc/passwd
.ad
.RS 17n
.rt
password file
.RE

.sp
.ne 2
.mk
.na
.B /etc/shadow
.ad
.RS 17n
.rt
shadow password file
.RE

.SH SEE ALSO
.sp
.LP
.BR passwd (1),
.BR useradd (1M),
.BR dialups (4),
.BR passwd (4),
.BR shadow (4)
.SH WARNINGS
.sp
.LP
When creating a new dial-up password, be sure to remain logged in on at
least one terminal while testing the new password. This ensures that there
is an available terminal from which you can correct any mistakes that were
made when the new password was added.
