usr/src/man/man4/dacf.conf.4
'\" te
.\" Copyright (c) 2001 Sun Microsystems, Inc. All Rights Reserved.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH dacf.conf 4 "15 May 2001" "SunOS 5.11" "File Formats"
.SH NAME
dacf.conf \- device auto-configuration configuration file
.SH SYNOPSIS
.LP
.nf
\fB/etc/dacf.conf\fR
.fi

.SH DESCRIPTION
.sp
.LP
The kernel uses the
.B dacf.conf
file to automatically configure hot
plugged devices. Because the
.B dacf.conf
file contains important kernel
state information, it should not be modified.
.sp
.LP
The format of the
.B /etc/dacf.conf
file is not public and might change
in versions of the Solaris operating environment that are not compatible
with Solaris 8.
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsr
.TE

.SH SEE ALSO
.sp
.LP
.BR attributes (5)
.SH NOTES
.sp
.LP
 This document does not constitute an
.BR API .
The
.B /etc/dacf.conf
file might not exist or might contain different contents or interpretations in versions of the Solaris operating environment that are not compatible with Solaris 8. The existence of this notice does not imply that any other documentation lacking this notice constitutes an
.BR API .
