usr/src/man/man4/dat.conf.4
'\" te
.\" Copyright (c) 2003, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH dat.conf 4 "18 Jun 2004" "SunOS 5.11" "File Formats"
.SH NAME
dat.conf \- DAT static registry
.SH SYNOPSIS
.LP
.nf
\fB/etc/dat/dat.conf\fR
.fi

.SH DESCRIPTION
.sp
.LP
The DAT static registry,
.B /etc/dat/dat.conf
is a system-wide data
resource maintained by the system administrative command
.BR datadm (1M).

.sp
.LP
.B /etc/dat/dat.conf
contains a list of interface adapters supported by
uDAPL service providers. An interface adapter on Infiniband (IB) corresponds
to an IPoIB device instance, for example,
.BR ibd0 .
An IPoIB device name
represents an IP interface plumbed by \fBifconfig\fR(1M) on an IB
partition/Host Channel Adapter port combination.
.sp
.LP
Each entry in the DAT static registry is a single line that contains eight
fields. Fields are separated by a SPACE. Lines that begin with a pound sign
(\fB#\fR) are considered comments. All characters that follow the \fB#\fR
are ignored. Enclose Solaris specific strings
(\fISolaris_specific_string\fR) and service provider's instance data
(\fIservice _provider_instance_data\fR) in quotes.
.sp
.LP
The following shows the order of the fields in a
.B dat.conf
entry:
.sp
.in +2
.nf
"\fIinterface_adapter_name\fR" "\fIAPI_version\fR" "\fIthreadsafe\fR | \fInonthreadsafe\fR" \e
"\fIdefault\fR | \fInondefault\fR" "\fIservice_provider_library_pathname\fR" \e
"\fIservice_provider_version\fR" "\fIservice _provider_instance_data\fR"\e
"\fISolaris_specific_string\fR"
.fi
.in -2

.sp
.LP
The fields are defined as follows:
.sp
.ne 2
.mk
.na
.I interface_adapter_name
.ad
.sp .6
.RS 4n
Specifies the Interface Adapter (IA) name. In IB, this is the IPoIB device
instance name, for example,
.BR ibd0 .
This represents an IP interface
plumbed on an IB partition/port combination of the HCA.
.RE

.sp
.ne 2
.mk
.na
.I API_version
.ad
.sp .6
.RS 4n
Specifies the API version of the service provide library: For example,
\fB"u"major.minor\fR is \fBu1.2\fR.
.RE

.sp
.ne 2
.mk
.na
.I threadsafe
| \fInonthreadsafe\fR
.ad
.sp .6
.RS 4n
Specifies a threadsafe or non-threadsafe library.
.RE

.sp
.ne 2
.mk
.na
.I default
| \fInondefault\fR
.ad
.sp .6
.RS 4n
Specifies a default or non-default version of library. A service provider
can offer several versions of the library. If so, one version is designated
as \fBdefault\fR with the rest as \fBnondefault\fR.
.RE

.sp
.ne 2
.mk
.na
.I service_provider_library_pathname
.ad
.sp .6
.RS 4n
Specifies the pathname of the library image.
.RE

.sp
.ne 2
.mk
.na
.I service_provider_version
.ad
.sp .6
.RS 4n
Specifies the version of the service provider. By convention, specify the
company stock symbol as the service provider, followed by major and minor
version numbers, for example,
.BR SUNW1.0 .
.RE

.sp
.ne 2
.mk
.na
.I service _provider_instance_data
.ad
.sp .6
.RS 4n
Specifies the service provider instance data.
.RE

.sp
.ne 2
.mk
.na
.I Solaris_specific_string
.ad
.sp .6
.RS 4n
Specifies a platform specific string, for example, the device name in the
.B service_provider.conf
file.
.RE

.SH EXAMPLES
.LP
.B Example 1
Sample
.B dat.conf
File
.sp
.LP
The following
.B dat.conf
file shows a
.B "uDAPL 1.2"
service provider
for
.B "tavor, udapl_tavor.so.1"
supporting two interfaces,
.B ibd0
and
.BR ibd1 :

.sp
.in +2
.nf
#
# dat.conf for uDAPL 1.2
#
ibd0 u1.2 nonthreadsafe default udapl_tavor.so.1 SUNW.1.0 ""
"driver_name=tavor"
ibd1 u1.2 nonthreadsafe default udapl_tavor.so.1 SUNW.1.0 ""
"driver_name=tavor"
.fi
.in -2

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWudaplr
_
Interface StabilityStandard
.TE

.SH SEE ALSO
.sp
.LP
.BR datadm (1M),
.BR ifconfig (1M),
.BR libdat (3LIB),
.BR service_provider.conf (4),
.BR attributes (5)
.SH NOTES
.sp
.LP
An empty \fBdat.conf\fR is created during the package \fBSUNWudaplr\fR
installation if no file is present beforehand. Entries in the file are added
or removed by running
.BR datadm (1M).
.sp
.LP
The content of the platform specific string does not constitute an API. It
is generated by \fBdatadm\fR(1M) and might have a different content or
interpretation in a future release.
