usr/src/man/man4/defaultdomain.4
'\" te
.\" Copyright (c) 2000, Sun Microsystems, Inc. All Rights Reserved.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH defaultdomain 4 "22 February 2000" "SunOS 5.11" "File Formats"
.SH NAME
defaultdomain \- specify host's domain name
.SH SYNOPSIS
.LP
.nf
\fB/etc/defaultdomain\fR
.fi

.SH DESCRIPTION
.sp
.LP
The file
.B /etc/defaultdomain
determines a host's domain name for
direct use by the
.B NIS
and
.B NIS+
name services. The
.B defaultdomain
file is read at boot time and its contents used by the
.BR domainname (1M)
command. Because of its use by
.BR domainname ,
.B defaultdomain
is also used by the
.B LDAP
service (see
.BR ldap (1)).
Under certain, narrow circumstances (see
.BR resolv.conf (4)),
because
.B domainname
uses
.BR defaultdomain ,
a
.B DNS
client can use the contents of \fBdefaultdomain\fR.
.sp
.LP
The contents of
.B defaultdomain
consists of a single line containing a
host's domain name.
.SH SEE ALSO
.sp
.LP
.BR NIS+ (1),
.BR uname (1),
.BR ldapclient (1M),
.BR nisclient (1M),
.BR ypbind (1M),
.BR ypinit (1M),
.BR resolv.conf (4)
.SH NOTES
.sp
.LP
The
.B defaultdomain
file is created and modified by Solaris
installation and configuration scripts. Only users knowledgeable of name
service configuration should edit the file.
