usr/src/man/man4/defaultrouter.4
'\" te
.\" Copyright (c) 2000, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH defaultrouter 4 "17 Aug 2004" "SunOS 5.11" "File Formats"
.SH NAME
defaultrouter \- configuration file for default router(s)
.SH SYNOPSIS
.LP
.nf
\fB/etc/defaultrouter\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B /etc/defaultrouter
file specifies a IPv4 host's default router(s).
.sp
.LP
The format of the file is as follows:
.sp
.in +2
.nf
IP_address
\&...
.fi
.in -2
.sp

.sp
.LP
The
.B /etc/defaultrouter
file can contain the IP addresses or hostnames of
one or more default routers, with each entry on its own line. If you use
.RB "hostnames, each hostname must also be listed in the local" " /etc/hosts"
file, because no name services are running at the time that
.B defaultrouter
is read.
.sp
.LP
Lines beginning with the ``#'' character are treated as comments.
.sp
.LP
The default routes listed in this file replace those added by the kernel
during diskless booting. An empty
.B /etc/defaultrouter
file will cause the
default route added by the kernel to be deleted.
.sp
.LP
Use of a default route, whether received from a
.B DHCP
server or from
.BR /etc/defaultrouter ,
prevents a machine from acting as an IPv4 router. You
can use
.BR routeadm "(1M) to override this behavior."
.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/defaultrouter
.ad
.RS 22n
.rt
Configuration file containing the hostnames or IP addresses of one or more
default routers.
.RE

.SH SEE ALSO
.sp
.LP
.BR in.rdisc (1M),
.BR in.routed (1M),
.BR routeadm (1M),
.BR hosts (4)
