usr/src/man/man4/defaultrouter.4
'\" te
.\" Copyright (c) 2000, Sun Microsystems, Inc. All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH defaultrouter 4 "17 Aug 2004" "SunOS 5.11" "File Formats"
.SH NAME
defaultrouter \- configuration file for default router(s)
.SH SYNOPSIS
.LP
.nf
\fB/etc/defaultrouter\fR
.fi

.SH DESCRIPTION
.sp
.LP
The \fB/etc/defaultrouter\fR file specifies a IPv4 host's default router(s).
.sp
.LP
The format of the file is as follows:
.sp
.in +2
.nf
IP_address
\&...
.fi
.in -2
.sp

.sp
.LP
The \fB/etc/defaultrouter\fR file can contain the IP addresses or hostnames of
one or more default routers, with each entry on its own line. If you use
.RB "hostnames, each hostname must also be listed in the local" " /etc/hosts"
file, because no name services are running at the time that \fBdefaultrouter\fR
is read.
.sp
.LP
Lines beginning with the ``#'' character are treated as comments.
.sp
.LP
The default routes listed in this file replace those added by the kernel
during diskless booting. An empty \fB/etc/defaultrouter\fR file will cause the
default route added by the kernel to be deleted.
.sp
.LP
Use of a default route, whether received from a
.B DHCP
server or from
\fB/etc/defaultrouter\fR, prevents a machine from acting as an IPv4 router. You
can use
.BR routeadm "(1M) to override this behavior."
.SH FILES
.sp
.ne 2
.mk
.na
\fB/etc/defaultrouter\fR
.ad
.RS 22n
.rt
Configuration file containing the hostnames or IP addresses of one or more
default routers.
.RE

.SH SEE ALSO
.sp
.LP
.BR in.rdisc (1M),
\fBin.routed\fR(1M), \fBrouteadm\fR(1M), \fBhosts\fR(4)
