usr/src/man/man4/default_fs.4
'\" te
.\" Copyright 1989 AT&T
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH default_fs 4 "20 Mar 1992" "SunOS 5.11" "File Formats"
.SH NAME
default_fs, fs \- specify the default file system type for local or remote
file systems
.SH DESCRIPTION
.sp
.LP
When file system administration commands have both specific and generic
components (for example,
.BR fsck (1M)),
the file system type must be
specified. If it is not explicitly specified using the
.B -F
.I FSType
command line option, the generic command looks in
.B /etc/vfstab
in order
to determine the file system type, using the supplied raw or block device or
mount point.  If the file system type can not be determined by searching
.BR /etc/vfstab ,
the command will use the default file system type
.RB "specified in either " /etc/default/fs " or " /etc/dfs/dfstypes ,
depending on whether the file system is local or remote.
.sp
.LP
The default local file system type is specified in
.B /etc/default/fs
by
a line of the form \fBLOCAL=\fIfstype\fR (for example, \fBLOCAL=ufs\fR).
The default remote file system type is determined by the first entry in the
.B /etc/dfs/fstypes
file.
.sp
.LP
File system administration commands will determine whether the file system
is local or remote by examining the specified device name.  If the device
name starts with ``/'' (slash), it is considered to be local; otherwise it
is remote.
.sp
.LP
The default file system types can be changed by editing the default files
with a text editor.
.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/vfstab
.ad
.RS 20n
.rt
list of default parameters for each file system
.RE

.sp
.ne 2
.mk
.na
.B /etc/default/fs
.ad
.RS 20n
.rt
the default local file system type
.RE

.sp
.ne 2
.mk
.na
.B /etc/dfs/fstypes
.ad
.RS 20n
.rt
the default remote file system type
.RE

.SH SEE ALSO
.sp
.LP
.BR fsck (1M),
.BR fstypes (4),
.BR vfstab (4)
