usr/src/man/man4/device_maps.4
'\" te
.\" Copyright (c) 2008, Sun Microsystems, Inc. All Rights Reserved.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH device_maps 4 "30 Apr 2008" "SunOS 5.11" "File Formats"
.SH NAME
device_maps \- device_maps file
.SH SYNOPSIS
.LP
.nf
\fB/etc/security/device_maps\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B device_maps
file contains access control information about each
physical device. Each device is represented by a one line entry of the
form:
.sp
.in +2
.nf
\fIdevice-name\fR \fB:\fR \fIdevice-type\fR \fB:\fR \fIdevice-list\fR \fB:\fR
.fi
.in -2

.sp
.LP
where
.sp
.ne 2
.mk
.na
.I device-name
.ad
.sp .6
.RS 4n
This is an arbitrary
.B ASCII
string naming the physical device. This
field contains no embedded white space or non-printable characters.
.RE

.sp
.ne 2
.mk
.na
.I device-type
.ad
.sp .6
.RS 4n
This is an arbitrary
.B ASCII
string naming the generic device type.
This field identifies and groups together devices of like type. This field
contains no embedded white space or non-printable characters.
.RE

.sp
.ne 2
.mk
.na
.I device-list
.ad
.sp .6
.RS 4n
This is a list of the device special files associated with the physical
device. This field contains valid device special file path names separated
by white space.
.RE

.sp
.LP
The
.B device_maps
file is an
.B ASCII
file that resides in the
.B /etc/security
directory.
.sp
.LP
Lines in
.B device_maps
can end with a `\fB\e\fR\&' to continue an entry
on the next line.
.sp
.LP
Comments may also be included. A `\fB#\fR' makes a comment of all further
text until the next
.B NEWLINE
not immediately preceded by a
`\fB\e\fR\&'.
.sp
.LP
Leading and trailing blanks are allowed in any of the fields.
.sp
.LP
The
.B device_maps
file must be created by the system administrator
bef\eore device allocation is enabled.
.sp
.LP
This file is owned by root, with a group of
.BR sys ,
and a mode of
0644.
.SH EXAMPLES
.LP
.B Example 1
A Sample
.B device_maps
File
.sp
.LP
The following is a sample
.B device_maps
file:

.sp
.in +2
.nf
# scsi tape
st1:\e
rmt:\e
/dev/rst21 /dev/nrst21 /dev/rst5 /dev/nrst5 /dev/rst13 \e
/dev/nrst13 /dev/rst29 /dev/nrst29 /dev/rmt/1l /dev/rmt/1m \e
/dev/rmt/1 /dev/rmt/1h /dev/rmt/1u /dev/rmt/1ln /dev/rmt/1mn \e
/dev/rmt/1n /dev/rmt/1hn /dev/rmt/1un /dev/rmt/1b /dev/rmt/1bn:\e
.fi
.in -2
.sp

.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/security/device_maps
.ad
.RS 29n
.rt
Contains access control information for devices.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityUncommitted
.TE

.SH SEE ALSO
.sp
.LP
.BR allocate (1),
.BR bsmconv (1M),
.BR deallocate (1),
.BR list_devices (1),
.BR dminfo (1M),
.BR device_allocate (4),
.BR attributes (5)
.SH NOTES
.sp
.LP
The functionality described in this man page is available only if Solaris
Auditing has been enabled. See \fBbsmconv\fR(1M) for more information.
.sp
.LP
On systems configured with Trusted Extensions, the functionality is enabled
by default. On such systems, the
.BR device_allocate (4)
file is updated
automatically by the system.
