usr/src/man/man4/device_allocate.4
'\" te
.\" Copyright (c) 2008, Sun Microsystems, Inc.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH device_allocate 4 "12 May 2008" "SunOS 5.11" "File Formats"
.SH NAME
device_allocate \- device_allocate file
.SH SYNOPSIS
.LP
.nf
\fB/etc/security/device_allocate\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B device_allocate
file is an
.B ASCII
file that resides in the
.B /etc/security
directory. It contains mandatory access control
information about each physical device. Each device is represented by a one-
line entry of the form:
.sp
.LP
\fIdevice-name\fR;\fIdevice-type\fR;reserved1;reserved2;\fIauths\fR;\fIdevice-exec\fR
.sp
.LP
where:
.sp
.ne 2
.mk
.na
.I device-name
.ad
.sp .6
.RS 4n
Represents an arbitrary
.B ASCII
string naming the physical device. This
field contains no embedded white space or non-printable characters.
.RE

.sp
.ne 2
.mk
.na
.I device-type
.ad
.sp .6
.RS 4n
Represents an arbitrary
.B ASCII
string naming the generic device type.
This field identifies and groups together devices of like type. This field
contains no embedded white space or non-printable characters. The following
types of devices are currently managed by the system: audio, \fBsr\fR
(represents CDROM drives), \fBfd\fR (represents floppy drives), \fBst\fR
(represents tape drives),
.B rmdisk
(removable media devices).
.RE

.sp
.ne 2
.mk
.na
.B reserved1
.ad
.sp .6
.RS 4n
On systems configured with Trusted Extensions, this field stores a
colon-separated (\fB:\fR) list of key-value pairs that describe device
allocation attributes used in Trusted Extensions. Zero or more keys can be
specified. The following keys are currently interpreted by Trusted
Extensions systems:
.sp
.ne 2
.mk
.na
.B minlabel
.ad
.sp .6
.RS 4n
Specifies the minimum label at which device can be allocated. Default value
is
.BR admin_low .
.RE

.sp
.ne 2
.mk
.na
.B maxlabel
.ad
.sp .6
.RS 4n
Specifies the maximum label at which device can be allocated. Default value
is
.BR admin_high .
.RE

.sp
.ne 2
.mk
.na
.B zone
.ad
.sp .6
.RS 4n
Specifies the name of the zone in which device is currently allocated.
.RE

.sp
.ne 2
.mk
.na
.B class
.ad
.sp .6
.RS 4n
Specifies  a  logical grouping of devices. For example, all Sun Ray devices
of all device types. There is no default class.
.RE

.sp
.ne 2
.mk
.na
.B xdpy
.ad
.sp .6
.RS 4n
Specifies the X display name. This is used to identify devices associated
with that X session. There is no default
.B xdpy
value.
.RE

.RE

.sp
.ne 2
.mk
.na
.B reserved2
.ad
.sp .6
.RS 4n
Represents a field reserved for future use.
.RE

.sp
.ne 2
.mk
.na
.I auths
.ad
.sp .6
.RS 4n
Represents a field that contains a comma-separated list of authorizations
required to allocate the device, an asterisk (\fB*\fR) to indicate that the
device is
.I not
allocatable, or an '\fB@\fR' symbol to indicate that no
explicit authorization is needed to allocate the device. The default
authorization is
.BR solaris.device.allocate .
See
.BR auths (1).
.RE

.sp
.ne 2
.mk
.na
.I device-exec
.ad
.sp .6
.RS 4n
The physical device's data clean program to be run any time the device is
acted on by
.BR allocate (1).
This ensures that unmanaged data does not
remain in the physical device between uses. This field contains the filename
of a program in
.B /etc/security/lib
or the full pathname of a cleanup
script provided by the system administrator.
.RE

.SS "Notes on \fBdevice_allocate\fR"
.sp
.LP
The
.B device_allocate
file is an ASCII file that resides in the
.B /etc/security
directory.
.sp
.LP
Lines in
.B device_allocate
can end with a `\fB\e\fR\&' to continue an
entry on the next line.
.sp
.LP
Comments can also be included. A `\fB#\fR' makes a comment of all further
text until the next NEWLINE not immediately preceded by a `\fB\e\fR\&'.
.sp
.LP
White space is allowed in any field.
.sp
.LP
The
.B device_allocate
file must be created by the system administrator
before device allocation is enabled.
.sp
.LP
The
.B device_allocate
file is owned by root, with a group of
.BR sys ,
and a mode of 0644.
.SH EXAMPLES
.LP
.B Example 1
Declaring an Allocatable Device
.sp
.LP
Declare that physical device
.B st0
is a type
.BR st .
.B st
is
allocatable, and the script used to clean the device after running
.BR deallocate (1)
is named
.BR /etc/security/lib/st_clean .

.sp
.in +2
.nf
# scsi tape
st0;\e
     st;\e
     reserved;\e
     reserved;\e
     solaris.device.allocate;\e
     /etc/security/lib/st_clean
.fi
.in -2
.sp

.LP
.B Example 2
Declaring an Allocatable Device with Authorizations
.sp
.LP
Declare that physical device
.B fd0
is of type
.BR fd .
.B fd
is
allocatable by users with the
.B solaris.device.allocate
authorization,
and the script used to clean the device after running
.BR deallocate (1)
is
named
.BR /etc/security/lib/fd_clean .

.sp
.in +2
.nf
# floppy drive
fd0;\e
     fd;\e
     reserved;\e
     reserved;\e
     solaris.device.allocate;\e
     /etc/security/lib/fd_clean
.fi
.in -2
.sp

.sp
.LP
Making a device allocatable means that you need to allocate and deallocate
it to use it (with
.BR allocate (1)
and
.BR deallocate (1)).
If a device
is not allocatable, there is an asterisk (\fB*\fR) in the \fIauths\fR field,
and no one can use the device.
.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/security/device_allocate
.ad
.sp .6
.RS 4n
Contains list of allocatable devices
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityUncommitted
.TE

.SH SEE ALSO
.sp
.LP
.BR auths (1),
.BR allocate (1),
.BR bsmconv (1M),
.BR deallocate (1),
.BR list_devices (1),
.BR auth_attr (4),
.BR attributes (5)
.SH NOTES
.sp
.LP
The functionality described in this man page is available only if Solaris
Auditing has been enabled. See \fBbsmconv\fR(1M) for more information.
.sp
.LP
On systems configured with Trusted Extensions, the functionality is enabled
by default. On such systems, the
.B device_allocate
file is updated
automatically by the system.
