usr/src/man/man4/dfstab.4
'\" te
.\" Copyright (c) 2008, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" Copyright 1989 AT&T
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH dfstab 4 "15 Aug 2008" "SunOS 5.11" "File Formats"
.SH NAME
dfstab \- file containing commands for sharing resources across a network
.SH DESCRIPTION
.sp
.LP
.B dfstab
resides in directory
.B /etc/dfs
and contains commands for
sharing resources across a network.
.B dfstab
gives a system
administrator a uniform method of controlling the automatic sharing of local
resources.
.sp
.LP
Each line of the
.B dfstab
file consists of a
.BR share (1M)
command.
The
.B dfstab
file can be read by the shell to share all resources.
System administrators can also prepare their own shell scripts to execute
particular lines from
.BR dfstab .
.sp
.LP
The contents of
.B dfstab
put into effect when the command shown below
is run. See
.BR svcadm (1M).
.sp
.in +2
.nf
/usr/sbin/svcadm enable network/nfs/server
.fi
.in -2

.SH SEE ALSO
.sp
.LP
.BR share (1M),
.BR shareall (1M),
.BR sharemgr (1M),
.BR svcadm (1M)
.SH NOTES
.sp
.LP
Do not modify this file directly. This file is reconstructed and only
maintained for backwards compatibility. Configuration lines could be lost.
.sp
.LP
Use the \fBsharemgr\fR(1M) command for all share management.
