usr/src/man/man4/dhcptab.4
'\" te
.\" Copyright (c) 2002,  Sun Microsystems, Inc.  All Rights Reserved.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH dhcptab 4 "15 Mar 2002" "SunOS 5.11" "File Formats"
.SH NAME
dhcptab \- DHCP configuration parameter table
.SH DESCRIPTION
.sp
.LP
The
.B dhcptab
configuration table allows network administrators to
organize groups of configuration parameters as macro definitions, which can
then be referenced in the definition of other useful macros. These macros are
then used by the
.B DHCP
server to return their values to
.B DHCP
and
\fBBOOTP\fR clients.
.sp
.LP
The preferred method of managing the
.B dhcptab
is through the  use of the
.BR dhcpmgr (1M)
or \fBdhtadm\fR(1M) utility. The description of \fBdhcptab\fR
entries included in this manual page is intended for informational purposes
only, and should not be used to manually edit entries.
.sp
.LP
You can view the contents of the
.B dhcptab
using the DHCP manager's tabs
for Macros and Options, or using the
.B "dhtadm -P"
command.
.SS "Syntax of dhcptab Entries"
.sp
.LP
The format of a
.B dhcptab
table depends on the data store used to maintain
it. However, any
.B dhcptab
must contain the following fields in each
record:
.sp
.ne 2
.mk
.na
.B Name
.ad
.RS 9n
.rt
This field identifies the macro or symbol record and is used as a search key
into the
.B dhcptab
table. The name of a macro or symbol must consist of
\fBASCII\fR characters, with the length limited to 128 characters. Names can
include spaces, except at the end of the name. The name is not
case-sensitive.
.RE

.sp
.ne 2
.mk
.na
.B Type
.ad
.RS 9n
.rt
This field specifies the type of record and is used as a search key into the
.BR dhcptab .
Currently, there are only two legal values for
.BR Type :
.sp
.ne 2
.mk
.na
.B m
.ad
.RS 5n
.rt
This record is a
.B DHCP
macro definition.
.RE

.sp
.ne 2
.mk
.na
.B s
.ad
.RS 5n
.rt
This record is a
.B DHCP
symbol definition. It is used to define vendor and
site-specific options.
.RE

.RE

.sp
.ne 2
.mk
.na
.B Value
.ad
.RS 9n
.rt
This field contains the value for the specified type of record. For the
\fBm\fR type, the value will consist of a series of symbol=value pairs,
separated by the colon (\fB:\fR) character. For the
.B s
type, the value
will consist of a series of fields, separated by a comma
.RB ( , ),
which
define a symbol's characteristics. Once defined, a symbol can be used in macro
definitions.
.RE

.SS "Symbol Characteristics"
.sp
.LP
The Value field of a symbols definition contain the following fields
describing the characteristics of a symbol:
.sp
.ne 2
.mk
.na
.B Context
.ad
.RS 15n
.rt
This field defines the context in which the symbol definition is to be used.
It can have one of the following values:
.sp
.ne 2
.mk
.na
.B Site
.ad
.RS 27n
.rt
This symbol defines a site-specific option, codes 128-254.
.RE

.sp
.ne 2
.mk
.na
\fBVendor=Client Class .\|.\|.\fR
.ad
.RS 27n
.rt
This symbol defines a vendor-specific option, codes 1-254. The Vendor context
takes
.B ASCII
string arguments which identify the client class that this
vendor option is associated with. Multiple client class names can be specified,
separated by white space. Only those clients whose client class matches one of
these values will see this option. For Sun machines, the Vendor client class
matches the value returned by the command
.B "uname -i"
on the client, with
periods replacing commas.
.RE

.RE

.sp
.ne 2
.mk
.na
.B Code
.ad
.RS 15n
.rt
This field specifies the option code number associated with this symbol. Valid
values are 128-254 for site-specific options, and 1-254 for vendor-specific
options.
.RE

.sp
.ne 2
.mk
.na
.B Type
.ad
.RS 15n
.rt
This field defines the type of data expected as a value for this symbol, and
is not case-sensitive. Legal values are:
.sp
.ne 2
.mk
.na
.B ASCII
.ad
.RS 11n
.rt
\fBNVT ASCII\fR text. Value is enclosed in double-quotes (\fB"\fR).
Granularity setting has no effect on symbols of this type, since \fBASCII\fR
strings have a natural granularity of one (1).
.RE

.sp
.ne 2
.mk
.na
.B BOOLEAN
.ad
.RS 11n
.rt
No value is associated with this data type. Presence of symbols of this type
denote boolean
.B TRUE,
whereas absence denotes
.B FALSE.
Granularity and
Miximum values have no meaning for symbols of this type.
.RE

.sp
.ne 2
.mk
.na
.B IP
.ad
.RS 11n
.rt
Dotted decimal form of an Internet address. Multi-IP address granularity is
supported.
.RE

.sp
.ne 2
.mk
.na
.B NUMBER
.ad
.RS 11n
.rt
An unsigned number with a supported granularity of
.BR 1 ,
.BR 2 ,
.BR 4 ,
and
.B 8
octets.
.sp
Valid
.B NUMBER
types are:
.BR UNUMBER8 ,
.BR SNUMBER8 ,
.BR UNUMBER16 ,
.BR SNUMBER16 ,
.BR UNUMBER32 ,
.BR SNUMBER32 ,
.BR UNUMBER64 ,
and
.BR SNUMBER64 .
See
.BR dhcp_inittab (4)
for details.
.RE

.sp
.ne 2
.mk
.na
.B OCTET
.ad
.RS 11n
.rt
Uninterpreted
.B ASCII
representation of binary data. The client identifier
is one example of an \fBOCTET\fR string. Valid characters are \fB0\fR-\fB9\fR,
\fBa\fR-\fBf\fR, \fBA\fR-\fBF\fR. One \fBASCII\fR character represents one
nibble (4 bits), thus two
.B ASCII
characters are needed to represent an 8
bit quantity. The granularity setting has no effect on symbols of this type,
since
.B OCTET
strings have a natural granularity of one
.RB ( 1 ).
.sp
For example, to encode a sequence of bytes with decimal values
.BR 77 ,
.BR 82 ,
.BR 5 ,
.BR 240 ,
.BR 14 ,
the option value would be encoded as
\fB4d5205f00e\fR. A macro which supplies a value for option code \fB78\fR,
.BR SLP_DA ,
with a
.B 0
Mandatory byte and Directory Agents at
\fB192.168.1.5\fR and \fB192.168.0.133\fR  would appear in the \fBdhcptab\fR
as:
.sp
.in +2
.nf
slpparams
Macro
:SLP_DA=00c0a80105c0a80085:
.fi
.in -2

.RE

.RE

.sp
.ne 2
.mk
.na
.B Granularity
.ad
.RS 15n
.rt
This value specifies how many objects of
.B Type
define a single
\fBinstance\fR of the symbol value. For example, the static route option is
defined to be a variable list of routes. Each route consists of two \fBIP\fR
addresses, so the
.B Type
is defined to be
.BR IP ,
and the data's
granularity is defined to be
.B "2 IP"
addresses. The granularity field
affects the
.B IP
and
.B NUMBER
data types.
.RE

.sp
.ne 2
.mk
.na
.B Maximum
.ad
.RS 15n
.rt
This value specifies the maximum items of
.B Granularity
which are
permissible in a definition using this symbol. For example, there can only be
one
.B IP
address specified for a subnet mask, so the
.B Maximum
number
of items in this case is one
.RB ( 1 ).
A
.B Maximum
value of zero
(\fB0\fR) means that a variable number of items is permitted.
.RE

.sp
.LP
The following example defines a site-specific option (symbol) called
.BR MystatRt ,
of code
.BR 130 ,
type
.B IP,
and granularity
.BR 2 ,
and
a
.B Maximum
of
.BR 0 .
This definition corresponds to the internal
definition of the static route option
.RB ( StaticRt ).
.sp
.in +2
.nf
MystatRt s Site,130,IP,2,0
.fi
.in -2

.sp
.LP
The following example demonstrates how a SLP Service Scope symbol
(\fBSLP_SS\fR) with a scope value of \fBhappy\fR and mandatory byte set to
\fB0\fR is encoded. The first octet of the option is the Mandatory octet, which
is set either to
.B 0
or
.BR 1 .
In this example, it is set to \fB0
(00)\fR. The balance of the value is the hexidecimal ASCII code numbers
representing the name
.BR happy ,
that is,
.BR 6861707079 .
.sp
.in +2
.nf
SLP_SS=006861707079
.fi
.in -2

.SS "Macro Definitions"
.sp
.LP
The following example illustrates a macro defined using the
.BR MystatRt
site option symbol just defined:
.sp
.in +2
.nf
10netnis m :MystatRt=3.0.0.0 10.0.0.30:
.fi
.in -2

.sp
.LP
Macros can be specified in the
.B Macro
field in
.B DHCP
network tables
(see
.BR dhcp_network (4)),
which will bind particular macro definitions to
specific
.BR "IP addresses."
.sp
.LP
Up to four macro definitions are consulted by the
.B DHCP
server to
determine the options that are returned to the requesting client.
.sp
.LP
These macros are processed in the following order:
.sp
.ne 2
.mk
.na
.B Client Class
.ad
.RS 21n
.rt
A macro named using the
.B ASCII
representation of the client class (e.g.
.BR SUNW.Ultra-30 )
is searched for in the
.BR dhcptab .
If found, its
symbol/value pairs will be selected for delivery to the client. This mechanism
permits the network administrator to select configuration parameters to be
returned to all clients of the same class.
.RE

.sp
.ne 2
.mk
.na
.B Network
.ad
.RS 21n
.rt
A macro named by the dotted Internet form of the network address of the
client's network (for example,
.BR 10.0.0.0 )
is searched for in the
.BR dhcptab .
If found, its symbol/value pairs will be combined with those of
the
.B "Client Class"
macro. If a symbol exists in both macros, then the
\fBNetwork\fR macro value overrides the value defined in the \fBClient Class\fR
macro. This mechanism permits the network administrator to select configuration
parameters to be returned to all clients on the same network.
.RE

.sp
.ne 2
.mk
.na
.B IP Address
.ad
.RS 21n
.rt
This macro may be named anything, but must be specified in the \fBDHCP\fR
network table for the IP address record assigned to the requesting client. If
this macro is found in the
.BR dhcptab ,
then its symbol/value pairs will be
combined with those of the
.B "Client Class"
macro and the
.BR Network
macro. This mechanism permits the network administrator to select configuration
parameters to be returned to clients using a particular
.B IP
address. It
can also be used to deliver a macro defined to include "server-specific"
information by including this macro definition in all
.B DHCP
network table
entries owned by a specific server.
.RE

.sp
.ne 2
.mk
.na
\fBClient Identifier\fR
.ad
.RS 21n
.rt
A macro named by the
.B ASCII
representation of the client's unique
identifier as shown in the
.B DHCP
network table (see
.BR dhcp_network (4)).
If found, its symbol/value pairs are combined to the
sum of the
.BR "Client Class" ,
.BR Network ,
and
.B "IP Address"
macros. Any
symbol collisions are replaced with those specified in the client identifier
macro. The client mechanism permits the network administrator to select
configuration parameters to be returned to a particular client, regardless of
what network that client is connected to.
.RE

.sp
.LP
Refer to
.I "System Administration Guide: IP Services"
for more information
about macro processing.
.sp
.LP
Refer to the
.BR dhcp_inittab (4)
man page for more information about symbols
used in Solaris DHCP.
.SH SEE ALSO
.sp
.LP
.BR dhcpmgr (1M),
.BR dhtadm (1M),
.BR in.dhcpd (1M),
.BR dhcp_inittab (4),
.BR dhcp_network (4),
.BR dhcp (5)
.sp
.LP
.I System Administration Guide: IP Services
.sp
.LP
Alexander, S., and R. Droms,
.IR "DHCP Options and BOOTP Vendor Extensions" ,
RFC 2132, Silicon Graphics, Inc., Bucknell University, March 1997.
.sp
.LP
Droms, R.,
.IR "Interoperation Between DHCP and BOOTP" ,
RFC 1534, Bucknell
University, October 1993.
.sp
.LP
Droms, R.,
.IR "Dynamic Host Configuration Protocol" ,
RFC 2131, Bucknell
University, March 1997.
.sp
.LP
Wimer, W.,
.IR "Clarifications and Extensions for the Bootstrap Protocol" ,
RFC
1542, Carnegie Mellon University, October 1993.
