usr/src/man/man4/dhcp_network.4
'\" te
.\" Copyright (c) 2001 by Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH dhcp_network 4 "5 Mar 2004" "SunOS 5.11" "File Formats"
.SH NAME
dhcp_network \- DHCP network tables
.SH DESCRIPTION
.sp
.LP
The Dynamic Host Configuration Protocol (\fBDHCP\fR) network tables are
used to map the client identifiers of
.B DHCP
clients to
.BR IP
addresses and the associated configuration parameters of that address. One
.B DHCP
network table exists for each network served by the
.BR DHCP
server, and each table is named using the network's
.B IP
address. There
is no table or file with the name
.BR dhcp_network .
.sp
.LP
The
.B DHCP
network tables can exist as
.B ASCII
text files, binary
text files, or
.B NIS+
tables, depending on the data store used. Since
the format of the file could change, the preferred method of managing the
.B DHCP
network tables is through the use of
.BR dhcpmgr "(1M) or the"
.BR pntadm (1M)
command.
.sp
.LP
The
.B dhcp_network
file is used as a policy mechanism for whether
.BR in.dhcpd (1M)
leases addresses on a given network. If the \fBDHCP\fR
server is not serving leases or information to a network, there should be no
.B dhcp_network
file for that network. To set the
.B DHCP
server in
.B informational
mode, where it responds to
.B INFORM
messages but
.RB "does not lease addresses on that network, create an empty" " dhcp_network"
file for that network. For normal operations, where the
.B DHCP
server
both leases addresses and responds to
.B INFORM
packets, create a
.B dhcp_network
file using
.BR dhcpmgr "(1M) or"
.BR pntadm (1M)
and
populate it with leasable addresses.
.sp
.LP
The format of the records in a
.B DHCP
network table depends on the data
store used to maintain the table. However, an entry in a
.B DHCP
network
table must contain the following fields:
.sp
.ne 2
.mk
.na
.B Client_ID
.ad
.RS 14n
.rt
The client identifier field,
.BR Client_ID ,
is an
.B ASCII
hexadecimal
representation of the unique octet string value of the
.B DHCP
Client
Identifier Option (code 61) which identifies a
.B DHCP
client. In the
absence of the
.B DHCP
Client Identifier Option, the
.B DHCP
client is
identified using the form given below for
.B BOOTP
clients. The number of
characters in this field must be an even number, with a maximum length of 64
characters. Valid characters are
.B "0 -"
.B 9
and
\fBA\fR-\fBF\fR. Entries with values of \fB00\fR are freely available for
dynamic allocation to requesting clients.
.B BOOTP
clients are identified
by the concatenation of the network's hardware type (as defined by \fBRFC\fR
1340, titled "Assigned Numbers") and the client's hardware address. For
example, the following
.B BOOTP
client has a hardware type of '\fB01\fR'
(10mb ethernet) and a hardware address of
.BR 8:0:20:11:12:b7 ,
so its
client identifier would be: \fB010800201112B7\fR
.RE

.sp
.ne 2
.mk
.na
.B Flags
.ad
.RS 14n
.rt
The
.B Flags
field is a decimal value, the bit fields of which can have
a combination of the following values:
.sp
.ne 2
.mk
.na
.B 1 (PERMANENT)
.ad
.RS 18n
.rt
Evaluation of the
.B Lease
field is turned off (lease is permanent). If
this bit is not set, Evaluation of the
.B Lease
field is enabled and the
.B Lease
is
.BR DYNAMIC.
.RE

.sp
.ne 2
.mk
.na
.B 2 (MANUAL)
.ad
.RS 18n
.rt
This entry has a manual client
.B ID
binding (cannot be reclaimed by
.B DHCP
server). Client will not be allocated another address.
.RE

.sp
.ne 2
.mk
.na
.B 4 (UNUSABLE)
.ad
.RS 18n
.rt
When set, this value means that either through
.B ICMP
echo or client
.B DECLINE,
this address has been found to be unusable. Can also be used
by the network administrator to
.I prevent
a certain client from booting,
if used in conjunction with the
.B MANUAL
flag.
.RE

.sp
.ne 2
.mk
.na
.B 8 (BOOTP)
.ad
.RS 18n
.rt
This entry is reserved for allocation to
.B BOOTP
clients only.
.RE

.RE

.sp
.ne 2
.mk
.na
.B Client_IP
.ad
.RS 14n
.rt
The
.B Client_IP
field holds the
.B IP
address for this entry. This
value must be unique in the database.
.RE

.sp
.ne 2
.mk
.na
.B Server_IP
.ad
.RS 14n
.rt
This field holds the
.B IP
address of the
.B DHCP
server which
.I owns
this client
.B IP
address, and thus is responsible for initial
allocation to a requesting client. On a multi-homed DHCP server, this IP
address must be the first address returned by
.BR gethostbyname (3NSL).
.RE

.sp
.ne 2
.mk
.na
.B Lease
.ad
.RS 14n
.rt
This numeric field holds the entry's absolute lease expiration time, and is
in seconds since
.BR "January 1, 1970" .
It can be decimal, or hexadecimal
(if
.B 0x
prefixes number). The special value
.B -1
is used to denote
a permanent lease.
.RE

.sp
.ne 2
.mk
.na
.B Macro
.ad
.RS 14n
.rt
This
.B ASCII
text field contains the
.B dhcptab
macro name used to
look up this entry's configuration parameters in the
.BR dhcptab (4)
database.
.RE

.sp
.ne 2
.mk
.na
.B Comment
.ad
.RS 14n
.rt
This
.B ASCII
text field contains an optional comment.
.RE

.SS "TREATISE ON LEASES"
.sp
.LP
This section describes how the
.B DHCP/BOOTP
server calculates a
client's configuration lease using information contained in the
.BR dhcptab (4)
and
.B DHCP
network tables. The server consults the
.B LeaseTim
and
.B LeaseNeg
symbols in the
.BR dhcptab ,
and the
.B Flags
and
.B Lease
fields of the chosen IP address record in the
.B DHCP
network table.
.sp
.LP
The server first examines the
.B Flags
field for the identified
.B DHCP
network table record. If the
.B PERMANENT
flag is on, then the
client's lease is considered permanent.
.sp
.LP
If the
.B PERMANENT
flag is not on, the server checks if the client's
lease as represented by the
.B Lease
field in the network table record
has expired. If the lease is not expired, the server checks if the client
has requested a new lease. If the
.B LeaseNeg
symbol has not been
included in the client's
.B dhcptab
parameters, then the client's
requested lease extension is ignored, and the lease is set to be the time
remaining as shown by the
.B Lease
field. If the
.B LeaseNeg
symbol
.I has
been included, then the server will extend the client's lease to
the value it requested if this requested lease is less than or equal to the
current time plus the value of the client's \fBLeaseTim dhcptab\fR
parameter.
.sp
.LP
If the client's requested lease is greater than policy allows (value of
.BR LeaseTim ),
then the client is given a lease equal to the current time
plus the value of
.BR LeaseTim .
If
.B LeaseTim
is not set, then the
default
.B LeaseTim
value is one hour.
.sp
.LP
For more information about the
.B dhcptab
symbols, see
.BR dhcptab (4).

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for a description of the following attribute:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWdhcsu
_
Interface StabilityEvolving
.TE

.SH SEE ALSO
.sp
.LP
.BR dhcpconfig (1M),
.BR dhcpmgr (1M),
.BR dhtadm (1M),
.BR in.dhcpd (1M),
.BR pntadm (1M),
.BR dhcptab (4),
.BR dhcp (5),
.BR dhcp_modules (5),
.BR attributes (5)
.sp
.LP
\fISolaris DHCP Service Developer\&'s Guide\fR
.sp
.LP
.I System Administration Guide: IP Services
.sp
.LP
Reynolds, J. and J. Postel,
.IR "Assigned Numbers" ,
STD 2, RFC 1340,
USC/Information Sciences Institute, July 1992.
