usr/src/man/man4/dialups.4
'\" te
.\" Copyright 1989 AT&T
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH dialups 4 "4 May 1994" "SunOS 5.11" "File Formats"
.SH NAME
dialups \- list of terminal devices requiring a dial-up password
.SH SYNOPSIS
.LP
.nf
\fB/etc/dialups\fR
.fi

.SH DESCRIPTION
.sp
.LP
.B dialups
is an
.B ASCII
file which contains a list of terminal
devices that require a dial-up password. A dial-up password is an additional
password required of users who access the computer through a modem or
dial-up port.  The correct password must be entered before the user is
granted access to the computer. The set of ports that require a dial-up
password are  listed in the
.B dialups
file.
.sp
.LP
Each entry in the
.B dialups
file is a single line of the form:
.sp
.in +2
.nf
\fIterminal-device\fR
.fi
.in -2
.sp

.sp
.LP
where
.sp
.ne 2
.mk
.na
.I terminal-device
.ad
.RS 19n
.rt
The full path name of the terminal device that will require a dial-up
password for users accessing the computer through a modem or dial-up port.
.RE

.sp
.LP
The
.B dialups
file should be owned by the
.B root
user and the
.B root
group.  The file should have read and write permissions for the
owner
.RB ( root )
only.
.SH EXAMPLES
.LP
.B Example 1
A sample
.B dialups
file.
.sp
.LP
Here is a sample
.B dialups
file:

.sp
.in +2
.nf
/dev/term/a
/dev/term/b
/dev/term/c
.fi
.in -2
.sp

.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/d_passwd
.ad
.RS 17n
.rt
dial-up password file
.RE

.sp
.ne 2
.mk
.na
.B /etc/dialups
.ad
.RS 17n
.rt
list of dial-up ports requiring dial-up passwords
.RE

.SH SEE ALSO
.sp
.LP
.BR d_passwd (4)
