usr/src/man/man4/ds.log.4
'\" te
.\" Copyright (C) 2007 Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ds.log 4 "08 Jun 2007" "SunOS 5.11" "File Formats"
.SH NAME
ds.log \- Availability Suite data services log file
.SH DESCRIPTION
.sp
.LP
The
.B /var/adm/ds.log
file contains the Availability Suite data
services command log. The administration commands log activities to the file
in the format:
.sp
.in +2
.nf
date time product: message
.fi
.in -2

.sp
.LP
Note that when the size of the log file exceeds 10 Mbytes, ds.log is
renamed
.B /var/adm/ds.log.bak
and a new
.B /var/adm/ds.log
file is
created.
.sp
.LP
The
.B ds.log
fields are:
.sp
.ne 2
.mk
.na
.B date
.ad
.sp .6
.RS 4n
The date format is
.IR "mmm nn" ,
where
.I mmm
is  the local
three-character abbreviation for the month and
.I nn
is the day of the
month on which the event occurred.
.RE

.sp
.ne 2
.mk
.na
.B time
.ad
.sp .6
.RS 4n
The time of the event, in
.I hh:mm:ss
format.
.RE

.sp
.ne 2
.mk
.na
.B product
.ad
.sp .6
.RS 4n
A product code that identifies which component of the data services
produced the event. The code is separated from the message that follows by a
colon (:) and a space.
.RE

.sp
.ne 2
.mk
.na
.B message
.ad
.sp .6
.RS 4n
A message that can extend over  more  than  one  line describing the event
that occurred. The second or following lines are not prefixed by  the date,
time, and product code strings.
.RE

.SH EXAMPLES
.sp
.LP
The example below shows sample
.B ds.log
file content:
.sp
.in +2
.nf
Jan 25 05:26:17 ii: iiboot suspend cluster tag <none>
Jan 25 05:32:02 ii: iiboot resume cluster tag <none>
Jan 25 05:32:04 sv: svboot: resume /dev/vx/rdsk/bigmaster
Jan 25 05:32:04 sv: svboot: resume /dev/vx/rdsk/bigshadow
Jan 25 05:32:04 sv: svboot: resume /dev/vx/rdsk/mstvxfs
Jan 25 05:32:04 sv: svboot: resume /dev/vx/rdsk/master01
.fi
.in -2

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(0i) |cw(5.5i)
lw(0i) |lw(5.5i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Architecturex86
_
AvailabilitySUNWscmu
_
Interface Stability Committed
.TE

.SH SEE ALSO
.sp
.LP
.BR iiadm (1M),
.BR sndradm (1M),
.BR svadm (1M),
.BR attributes (5)
