usr/src/man/man4/exec_attr.4
'\" te
.\" Copyright (c) 2006 by Sun Microsystems, Inc. All rights reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH exec_attr 4 "30 Mar 2006" "SunOS 5.11" "File Formats"
.SH NAME
exec_attr \- execution profiles database
.SH SYNOPSIS
.LP
.nf
\fB/etc/security/exec_attr\fR
.fi

.SH DESCRIPTION
.sp
.LP
.B /etc/security/exec_attr
is a local database that specifies the
execution attributes associated with profiles. The
.B exec_attr
file can
be used with other sources for execution profiles, including the
.B exec_attr NIS
map and
.B NIS+
table. Programs use the
.BR getexecattr (3SECDB)
routines to access this information.
.sp
.LP
The search order for multiple execution profile sources is specified in the
.B /etc/nsswitch.conf
file, as described in the \fBnsswitch.conf\fR(4)
man page. The search order follows the entry for
.BR prof_attr (4).
.sp
.LP
A profile is a logical grouping of authorizations and commands that is
interpreted by a profile shell to form a secure execution environment. The
shells that interpret profiles are
.BR pfcsh ,
.BR pfksh ,
and \fBpfsh\fR.
See the
.BR pfsh (1)
man page. Each user's account is assigned zero or more
profiles in the
.BR user_attr (4)
database file.
.sp
.LP
Each entry in the
.B exec_attr
database consists of one line of text
containing seven fields separated by colons
.RB ( : ).
Line continuations
using the backslash (\fB\efR) character are permitted. The basic format of
each entry is:
.sp
.LP
\fIname\fR:\fIpolicy\fR:\fItype\fR:\fIres1\fR:\fIres2\fR:\fIid\fR:\fIattr\fR
.sp
.ne 2
.mk
.na
.I name
.ad
.RS 10n
.rt
The name of the profile. Profile names are case-sensitive.
.RE

.sp
.ne 2
.mk
.na
.I policy
.ad
.RS 10n
.rt
The security policy that is associated with the profile entry. The valid
policies are
.B suser
(standard Solaris superuser) and
.BR solaris .
The
.B solaris
policy recognizes privileges (see
.BR privileges (5));
the
.B suser
policy does not.
.sp
The
.B solaris
and
.B suser
policies can coexist in the same
.B exec_attr
database, so that Solaris releases prior to the current
release can use the
.B suser
policy and the current Solaris release can
use a
.B solaris
policy.
.B solaris
is a superset of
.BR suser ;
it
allows you to specify privileges in addition to UIDs. Policies that are
specific to the current release of Solaris or that contain privileges should
use
.BR solaris .
Policies that use UIDs only or that are not specific to
the current Solaris release should use
.BR suser .
.RE

.sp
.ne 2
.mk
.na
.I type
.ad
.RS 10n
.rt
The type of object defined in the profile. There are two valid types:
.B cmd
and
.BR act .
The
.B cmd
type specifies that the
.BR ID
field is a command that would be executed by a shell. The
.B act
type is
available only if the system is configured with Trusted Extensions. It
specifies that the
.B ID
field is a
.B CDE
action that should be
executed by the Trusted Extensions
.B CDE
action mechanism.
.RE

.sp
.ne 2
.mk
.na
.I res1
.ad
.RS 10n
.rt
Reserved for future use.
.RE

.sp
.ne 2
.mk
.na
.I res2
.ad
.RS 10n
.rt
Reserved for future use.
.RE

.sp
.ne 2
.mk
.na
.I id
.ad
.RS 10n
.rt
A string that uniquely identifies the object described by the profile. For
a profile of type
.B cmd,
the id is either the full path to the command
or the asterisk (\fB*\fR) symbol, which is used to allow all commands. An
asterisk that replaces the filename component in a pathname indicates all
files in a particular directory.
.sp
To specify arguments, the pathname should point to a shell script that is
written to execute the command with the desired argument. In a Bourne shell,
the effective UID is reset to the real UID of the process when the effective
UID is less than 100 and not equal to the real UID. Depending on the
.B euid
and
.B egid
values, Bourne shell limitations might make other
shells preferable. To prevent the effective UIDs from being reset to real
UIDs, you can start the script with the
.B -p
option.
.sp
.in +2
.nf
#!/bin/sh -p
.fi
.in -2
.sp

If the Trusted Extensions feature is configured and the profile entry type
is
.BR act ,
the
.B id
is either the fully qualified name of a
.BR CDE
action, or an asterisk (\fB*\fR) representing a wildcard. A fully qualified
.B CDE
action is specified using the action name and four additional
semicolon-separated fields. These fields can be empty but the semicolons are
required. The fields in a
.B CDE
action are as follows:
.sp
.ne 2
.mk
.na
.I argclass
.ad
.RS 12n
.rt
Specifies the argument class (for example,
.B FILE
or
.BR SESSION .)
Corresponds to
.B ARG_CLASS
for
.B CDE
actions.
.RE

.sp
.ne 2
.mk
.na
.I argtype
.ad
.RS 12n
.rt
Specifies the data type for the argument. Corresponds to
.B ARG_TYPE
for
.B CDE
actions.
.RE

.sp
.ne 2
.mk
.na
.I argmode
.ad
.RS 12n
.rt
Specifies the read or write mode for the argument. Corresponds to
.B ARG_MODE
for
.B CDE
actions.
.RE

.sp
.ne 2
.mk
.na
.I argcount
.ad
.RS 12n
.rt
Specifies the number of arguments that the action can accept. Corresponds
to
.B ARG_COUNT
for
.B CDE
actions.
.RE

.RE

.sp
.ne 2
.mk
.na
.I attr
.ad
.RS 10n
.rt
An optional list of semicolon-separated (\fB;\fR) key-value pairs that
describe the security attributes to apply to the object upon execution. Zero
or more keys may be specified. The list of valid key words depends on the
policy enforced. The following key words are valid:
.BR euid ,
.B uid,
.BR egid ,
.BR gid ,
.BR privs ,
and
.BR limitprivs .
.sp
.B euid
and
.B uid
contain a single user name or a numeric user
.BR ID .
Commands designated with
.B euid
run with the effective
.B UID
indicated, which is similar to setting the setuid bit on an
executable file. Commands designated with
.B uid
run with both the real
and effective
.BR UID "s. Setting"
.B uid
may be more appropriate than
setting the
.B euid
on privileged shell scripts.
.sp
.B egid
and
.B gid
contain a single group name or a numeric group
.BR ID .
Commands designated with
.B egid
run with the effective
.B GID
indicated, which is similar to setting the setgid bit on a file.
Commands designated with
.B gid
run with both the real and effective
\fBGID\fRs. Setting \fBgid\fR may be more appropriate than setting
.B guid
on privileged shell scripts.
.sp
.B privs
contains a privilege set which will be added to the inheritable
set prior to running the command.
.sp
.B limitprivs
contains a privilege set which will be assigned to the
limit set prior to running the command.
.sp
.B privs
and
.B limitprivs
are only valid for the
.BR solaris
policy.
.RE

.SH EXAMPLES
.LP
.B Example 1
Using Effective User ID
.sp
.LP
The following example shows the
.B audit
command specified in the Audit
Control profile to execute with an effective user
.B ID
of root
(\fB0\fR):

.sp
.in +2
.nf
\fBAudit Control:suser:cmd:::/usr/sbin/audit:euid=0\fR
.fi
.in -2
.sp

.SH FILES
.sp
.LP
.B /etc/nsswitch.conf
.sp
.LP
.B /etc/user_attr
.sp
.LP
.B /etc/security/exec_attr
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailibilitySUNWcsr
_
Interface StabilitySee below.
.TE

.sp
.LP
The command-line syntax is Committed. The output is Uncommitted.
.SH CAVEATS
.sp
.LP
When deciding which authorization source to use (see DESCRIPTION), keep in
mind that
.B NIS+
provides stronger authentication than
.BR NIS .
.sp
.LP
Because the list of legal keys is likely to expand, any code that parses
this database must be written to ignore unknown key-value pairs without
error. When any new keywords are created, the names should be prefixed with
a unique string, such as the company's stock symbol, to avoid potential
naming conflicts.
.sp
.LP
The following characters are used in describing the database format and
must be escaped with a backslash if used as data: colon
.RB ( : ),
semicolon
(\fB;\fR), equals
.RB ( = ),
and backslash (\fB\efR).
.SH SEE ALSO
.sp
.LP
.BR auths (1),
.BR dtaction (1),
.BR profiles (1),
.BR roles (1),
.BR sh (1),
.BR makedbm (1M),
.BR getauthattr (3SECDB),
.BR getauusernam (3BSM),
.BR getexecattr (3SECDB),
.BR getprofattr (3SECDB),
.BR getuserattr (3SECDB),
.BR kva_match (3SECDB),
.BR auth_attr (4),
.BR prof_attr (4),
.BR user_attr (4),
.BR attributes (5),
.BR privileges (5)
