usr/src/man/man4/fd.4
'\" te
.\" Copyright (c) 1993, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" Copyright 1989 AT&T
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH fd 4 "3 Jul 1990" "SunOS 5.11" "File Formats"
.SH NAME
fd \- file descriptor files
.SH DESCRIPTION
.sp
.LP
These files, conventionally called
.BR /dev/fd/0 ,
.BR /dev/fd/1 ,
.BR /dev/fd/2 ,
and so on, refer to files accessible through file
descriptors. If file descriptor
.I n
is open, these two system calls
have the same effect:
.sp
.in +2
.nf
\fBfd = open("/dev/fd/\fIn\fR",mode);
fd = dup(\fIn\fR);
.fi
.in -2
.sp

.sp
.LP
On these files
.BR creat (2)
is equivalent to
.BR open ,
and
.BR mode
is ignored. As with
.BR dup ,
subsequent reads or writes on
.B fd
fail
unless the original file descriptor allows the operations.
.sp
.LP
For convenience in referring to standard input, standard output, and
standard error, an additional set of names is provided:
.B /dev/stdin
is
a synonym for
.BR /dev/fd/0 ,
.B /dev/stdout
for
.BR /dev/fd/1 ,
and
.B /dev/stderr
for 
.BR /dev/fd/2 .
.SH SEE ALSO
.sp
.LP
.BR creat (2),
.BR dup (2),
.BR open (2)
.SH DIAGNOSTICS
.sp
.LP
.BR open (2)
returns \fB\(mi1\fR and 
.B EBADF
if the associated file
descriptor is not open.
