usr/src/man/man4/format.dat.4
'\" te
.\" Copyright (c) 1999, Sun Microsystems, Inc.  All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH format.dat 4 "19 Apr 2001" "SunOS 5.11" "File Formats"
.SH NAME
format.dat \- disk drive configuration for the format command
.SH DESCRIPTION
.sp
.LP
.B format.dat
enables you to use your specific disk drives with
.BR format (1M).
On Solaris 2.3 and compatible systems,
.B format
will
automatically configure and label SCSI drives, so that they need not be
defined in
.BR format.dat .
Three things can be defined in the data file:
.RS +4
.TP
.ie t \(bu
.el o
search paths
.RE
.RS +4
.TP
.ie t \(bu
.el o
disk types
.RE
.RS +4
.TP
.ie t \(bu
.el o
partition tables.
.RE
.SS "Syntax"
.sp
.LP
The following syntax rules apply to the data file:
.RS +4
.TP
.ie t \(bu
.el o
The pound
.B #
sign is the comment character. Any text on a line after a
pound sign is not interpreted by
.BR format .
.RE
.RS +4
.TP
.ie t \(bu
.el o
Each definition in the
.B format.dat
file appears on a single logical
line. If the definition is more than one line long, all but the last line of
the definition must end with a backslash (\e).
.RE
.RS +4
.TP
.ie t \(bu
.el o
A definition consists of a series of assignments that have an identifier on
the left side and one or more values on the right side. The assignment
operator is the equal sign (=). Assignments within a definition must be
separated by a colon (:).
.RE
.RS +4
.TP
.ie t \(bu
.el o
White space is ignored by \fBformat\fR(1M). If you want an assigned value
to contain white space, enclose the entire value in double quotes ("). This
will cause the white space within quotes to be preserved as part of the
assignment value.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Some assignments can have multiple values on the right hand side. Separate
values by a comma (,).
.RE
.SS "Keywords"
.sp
.LP
The data file contains disk definitions that are read in by
.BR format (1M)
when it starts up. Each definition starts with one of the
following keywords:
.BR search_path ,
.BR disk_type ,
and
.BR partition .
.sp
.ne 2
.mk
.na
.B search_path
.ad
.RS 15n
.rt
4.x: Tells
.B format
which disks it should search for when it starts up.
The list in the default data file contains all the disks in the GENERIC
configuration file. If your system has disks that are not in the GENERIC
configuration file, add them to the
.B search_path
definition in your
data file. The data file can contain only one
.B search_path
definition.
However, this single definition lets you specify all the disks you have in
your system.
.sp
5.x: By default, \fBformat\fR(1M) understands all the logical devices that
are of the form
.BR /dev/rdsk/cntndnsn ;
hence
.B search_path
is not
normally defined on a 5.x system.
.RE

.sp
.ne 2
.mk
.na
.B disk_type
.ad
.RS 15n
.rt
Defines the controller and disk model. Each
.B disk_type
definition
contains information concerning the physical geometry of the disk. The
default data file contains definitions for the controllers and disks that
the Solaris operating environment supports. You need to add a new
.B disk_type
only if you have an unsupported disk. You can add as many
.B disk_type
definitions to the data file as you want.
.sp
The following controller types are supported by \fBformat\fR(1M):
.sp
.ne 2
.mk
.na
.B XY450
.ad
.RS 10n
.rt
Xylogics 450 controller (SMD)
.RE

.sp
.ne 2
.mk
.na
.B XD7053
.ad
.RS 10n
.rt
Xylogics 7053 controller (SMD)
.RE

.sp
.ne 2
.mk
.na
.B SCSI
.ad
.RS 10n
.rt
True SCSI (CCS or SCSI-2)
.RE

.sp
.ne 2
.mk
.na
.B ISP-80
.ad
.RS 10n
.rt
IPI panther controller
.RE

The keyword itself is assigned the name of the disk type. This name appears
in the disk's label and is used to identify the disk type whenever
.BR format (1M)
is run. Enclose the name in double quotes to preserve any
white space in the name.
.sp
Below are lists of identifiers for supported controllers. Note that an
asterisk ('*') indicates the identifier is mandatory for that controller --
it is not part of the keyword name.
.sp
The following identifiers are assigned values in all
.BR disk_type
definitions:
.sp
.ne 2
.mk
.na
.B acyl*
.ad
.RS 12n
.rt
alternate cylinders
.RE

.sp
.ne 2
.mk
.na
.B asect
.ad
.RS 12n
.rt
alternate sectors per track
.RE

.sp
.ne 2
.mk
.na
.B atrks
.ad
.RS 12n
.rt
alternate tracks
.RE

.sp
.ne 2
.mk
.na
.B fmt_time
.ad
.RS 12n
.rt
formatting time per cylinder
.RE

.sp
.ne 2
.mk
.na
.B ncyl*
.ad
.RS 12n
.rt
number of logical cylinders
.RE

.sp
.ne 2
.mk
.na
.B nhead*
.ad
.RS 12n
.rt
number of logical heads
.RE

.sp
.ne 2
.mk
.na
.B nsect*
.ad
.RS 12n
.rt
number of logical sectors per track
.RE

.sp
.ne 2
.mk
.na
.B pcyl*
.ad
.RS 12n
.rt
number of physical cylinders
.RE

.sp
.ne 2
.mk
.na
.B phead
.ad
.RS 12n
.rt
number of physical heads
.RE

.sp
.ne 2
.mk
.na
.B psect
.ad
.RS 12n
.rt
number of physical sectors per track
.RE

.sp
.ne 2
.mk
.na
.B rpm*
.ad
.RS 12n
.rt
drive RPM
.RE

These identifiers are for SCSI and MD-21 Controllers
.sp
.ne 2
.mk
.na
.B read_retries
.ad
.RS 17n
.rt
page 1 byte 3 (read retries)
.RE

.sp
.ne 2
.mk
.na
.B write_retries
.ad
.RS 17n
.rt
page 1 byte 8 (write retries)
.RE

.sp
.ne 2
.mk
.na
.B cyl_skew
.ad
.RS 17n
.rt
page 3 bytes 18-19 (cylinder skew)
.RE

.sp
.ne 2
.mk
.na
.B trk_skew
.ad
.RS 17n
.rt
page 3 bytes 16-17 (track skew)
.RE

.sp
.ne 2
.mk
.na
.B trks_zone
.ad
.RS 17n
.rt
page 3 bytes 2-3 (tracks per zone)
.RE

.sp
.ne 2
.mk
.na
.B cache
.ad
.RS 17n
.rt
page 38 byte 2 (cache parameter)
.RE

.sp
.ne 2
.mk
.na
.B prefetch
.ad
.RS 17n
.rt
page 38 byte 3 (prefetch parameter)
.RE

.sp
.ne 2
.mk
.na
.B max_prefetch
.ad
.RS 17n
.rt
page 38 byte 4 (minimum prefetch)
.RE

.sp
.ne 2
.mk
.na
.B min_prefetch
.ad
.RS 17n
.rt
page 38 byte 6 (maximum prefetch)
.RE

Note: The Page 38 values are device-specific. Refer the user to the
particular disk's manual for these values.
.sp
For SCSI disks, the following geometry specifiers may cause a mode select
on the byte(s) indicated:
.sp
.ne 2
.mk
.na
.B asect
.ad
.RS 9n
.rt
page 3 bytes 4-5 (alternate sectors per zone)
.RE

.sp
.ne 2
.mk
.na
.B atrks
.ad
.RS 9n
.rt
page 3 bytes 8-9 (alt. tracks per logical unit)
.RE

.sp
.ne 2
.mk
.na
.B phead
.ad
.RS 9n
.rt
page 4 byte 5 (number of heads)
.RE

.sp
.ne 2
.mk
.na
.B psect
.ad
.RS 9n
.rt
page 3 bytes 10-11 (sectors per track)
.RE

And these identifiers are for SMD Controllers Only
.sp
.ne 2
.mk
.na
.B bps*
.ad
.RS 8n
.rt
bytes per sector (SMD)
.RE

.sp
.ne 2
.mk
.na
.B bpt*
.ad
.RS 8n
.rt
bytes per track (SMD)
.RE

Note: under SunOS 5.x, bpt is only required for SMD disks. Under SunOS 4.x,
bpt was required for all disk types, even though it was only used for SMD
disks.
.sp
And this identifier is for XY450 SMD Controllers Only
.sp
.ne 2
.mk
.na
.B drive_type*
.ad
.RS 15n
.rt
drive type (SMD) (just call this "xy450 drive type")
.RE

.RE

.sp
.ne 2
.mk
.na
.B partition
.ad
.RS 15n
.rt
Defines a partition table for a specific disk type. The partition table
contains the partitioning information, plus a name that lets you refer to it
in \fBformat\fR(1M). The default data file contains default partition
definitions for several kinds of disk drives. Add a partition definition if
you repartitioned any of the disks on your system. Add as many partition
definitions to the data file as you need.
.sp
Partition naming conventions differ in SunOS 4.x and in SunOS 5.x.
.sp
4.x: the partitions are named as
.BR a ,
.BR b ,
.BR c ,
.BR d ,
.BR e ,
.BR f ,
.BR g ,
.BR h .
.sp
5.x: the partitions are referred to by numbers
.BR 0 ,
.BR 1 ,
.BR 2 ,
.BR 3 ,
.BR 4 ,
.BR 5 ,
.BR 6 ,
.BR 7 .
.RE

.SH EXAMPLES
.LP
.B Example 1
A sample
.B disk_type
and
.BR partition .
.sp
.LP
Following is a sample
.B disk_type
and
.B partition
definition in
.B format.dat
file for SUN0535 disk device.

.sp
.in +2
.nf
disk_type = "SUN0535" \e
	: ctlr = SCSI : fmt_time = 4 \e
	: ncyl = 1866 : acyl = 2 : pcyl = 2500 : nhead = 7 : nsect = 80 \e
	: rpm = 5400
partition = "SUN0535" \e
	: disk = "SUN0535" : ctlr = SCSI \e
      : 0 = 0, 64400 : 1 = 115, 103600 : 2 = 0, 1044960 : 6 = 300, 876960
.fi
.in -2
.sp

.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/format.dat
.ad
.RS 19n
.rt
default data file if
.B "format -x"
is not specified, nor is there a
.B format.dat
file in the current directory.
.RE

.SH SEE ALSO
.sp
.LP
.BR format (1M)
.sp
.LP
.I System Administration Guide: Basic Administration
