usr/src/man/man4/fspec.4
'\" te
.\" Copyright 1989 AT&T
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH fspec 4 "3 Jul 1990" "SunOS 5.11" "File Formats"
.SH NAME
fspec \- format specification in text files
.SH DESCRIPTION
.sp
.LP
It is sometimes convenient to maintain text files on the system with
non-standard tabs, (tabs that are not set at every eighth column). Such files
must generally be converted to a standard format, frequently by replacing all
tabs with the appropriate number of spaces, before they can be processed by
system commands. A format specification occurring in the first line of a text
file specifies how tabs are to be expanded in the remainder of the file.
.sp
.LP
A format specification consists of a sequence of parameters separated by
blanks and surrounded by the brackets
.B <:
and
.BR :> .
Each parameter
consists of a keyletter, possibly followed immediately by a value. The
following parameters are recognized:
.sp
.ne 2
.mk
.na
.BI t tabs
.ad
.RS 11n
.rt
The
.B t
parameter specifies the tab settings for the file. The value of
.B tabs
must be one of the following:
.RS +4
.TP
.ie t \(bu
.el o
A list of column numbers separated by commas, indicating tabs set at the
specified columns.
.RE
.RS +4
.TP
.ie t \(bu
.el o
A '\fB\(mi\fR\&' followed immediately by an integer
.IR n ,
indicating tabs
at intervals of
.I n
columns.
.RE
.RS +4
.TP
.ie t \(bu
.el o
A '\fB\(mi\fR\&' followed by the name of a ``canned'' tab specification.
.RE
Standard tabs are specified by \fBt\(mi8\fR, or equivalently,
.B t1,9,17,25,
etc. The canned tabs that are recognized are defined by the
.BR tabs (1)
command.
.RE

.sp
.ne 2
.mk
.na
.BI s size
.ad
.RS 11n
.rt
The
.B s
parameter specifies a maximum line size. The value of
.B size
must be an integer. Size checking is performed after tabs have been expanded,
but before the margin is prepended.
.RE

.sp
.ne 2
.mk
.na
.BI m margin
.ad
.RS 11n
.rt
The
.B m
parameter specifies a number of spaces to be prepended to each
line. The value of
.I margin
must be an integer.
.RE

.sp
.ne 2
.mk
.na
.B d
.ad
.RS 11n
.rt
The
.B d
parameter takes no value. Its presence indicates that the line
containing the format specification is to be deleted from the converted
file.
.RE

.sp
.ne 2
.mk
.na
.B e
.ad
.RS 11n
.rt
The
.B e
parameter takes no value. Its presence indicates that the
current format is to prevail only until another format specification is
encountered in the file.
.RE

.sp
.LP
Default values, which are assumed for parameters not supplied, are
\fBt\(mi8\fR and
.BR m0 .
If the
.B s
parameter is not specified, no size
checking is performed. If the first line of a file does not contain a format
specification, the above defaults are assumed for the entire file. The
following is an example of a line containing a format specification:
.sp
.LP
.B * <:t5,10,15 s72:> *
.sp
.LP
If a format specification can be disguised as a comment, it is not necessary
to code the
.B d
parameter.
.SH SEE ALSO
.sp
.LP
.BR ed (1),
.BR newform (1),
.BR tabs (1)
