usr/src/man/man4/fstypes.4
'\" te
.\" Copyright (c) 1993, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" Copyright 1989 AT&T
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH fstypes 4 "18 Dec 1991" "SunOS 5.11" "File Formats"
.SH NAME
fstypes \- file that registers distributed file system packages
.SH DESCRIPTION
.sp
.LP
.B fstypes
resides in directory
.B /etc/dfs
and lists distributed
file system utilities packages installed on  the system.  For each installed
distributed file system type, there is a line that begins with the file
system type name (for example, ``nfs''), followed by white space and
descriptive text.
.sp
.LP
The file system indicated in the first line of the file is the default
file system; when Distributed File System (DFS)  Administration commands are
entered without the  option  \fB\(miF\fR
.IR fstypes ,
the system takes the
file system type from the first line of the
.B fstypes
file.
.sp
.LP
The default file system can be changed by editing the
.B fstypes
file
with any supported text editor.
.SH SEE ALSO
.sp
.LP
.BR dfmounts (1M),
.BR dfshares (1M),
.BR share (1M),
.BR shareall (1M),
.BR unshare (1M)
