usr/src/man/man4/ftp.4
'\" te
.\" Copyright (C) 2002, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ftp 4 "22 Oct 2002" "SunOS 5.11" "File Formats"
.SH NAME
ftp \- FTP client configuration file
.SH SYNOPSIS
.LP
.nf
\fB/etc/default/ftp\fR
.fi

.SH DESCRIPTION
.sp
.LP
Use the
.B ftp
file to configure the behavior of the FTP client. Lines
that begin with a hash symbol ("# ") are treated as comment  lines and are
ignored.
.SS "Behavior Directives"
.sp
.LP
The
.B ftp
file supports the following behavior directives:
.sp
.ne 2
.mk
.na
.B FTP_LS_SENDS_NLST=yes | no
.ad
.RS 30n
.rt
The
.B ls
command of the ftp client sends an
.B NLST
to the FTP
Server by default. Several non-Solaris clients send
.B LIST
instead. In
order to make the Solaris \fBftp\fR client send
.B LIST
when the \fBls\fR
command is issued, set
.B FTP_LS_SENDS_NLST
to
.BR no .
The value of
.B FTP_LS_SENDS_NLST
is
.B yes
by default.
.RE

.sp
.LP
If the user sets a value for
.B FTP_LS_SENDS_NLST
in the user's
environment, this value will override any
.B FTP_LS_SENDS_NLST
directive
that is specified in
.BR /etc/default/ftp .
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWbipr
.TE

.SH SEE ALSO
.sp
.LP
.BR ftp (1),
.BR attributes (5)
