usr/src/man/man4/ftpaccess.4
'\" te
.\" Copyright (C) 2003, Sun Microsystems, Inc. All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ftpaccess 4 "10 Sep 2003" "SunOS 5.11" "File Formats"
.SH NAME
ftpaccess \- FTP Server configuration file
.SH SYNOPSIS
.LP
.nf
\fB/etc/ftpd/ftpaccess\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B ftpaccess
file is used to configure the operation of the FTP
Server.
.SS "Access Capabilities "
.sp
.LP
The following access capabilities are supported:
.sp
.ne 2
.mk
.na
.B autogroup
.I "groupname class"
.IR class .\|.\|.\fR
.ad
.sp .6
.RS 4n
If an
.I anonymous
user is a member of any of
.IR class ,
the FTP
Server will perform a
.BR setegid (2)
to
.IR groupname .
This allows
access to group and owner read-only files and directories to a particular
class of anonymous users.
.I groupname
is a valid group returned by
.BR getgrnam (3C).
.RE

.sp
.ne 2
.mk
.na
.B class
.I class typelist
\fIaddrglob\fIaddrglob\fR.\|.\|.\fR
.ad
.sp .6
.RS 4n
Define
.I class
of users, with source addresses of the form
.IR addrglob .
Multiple members of
.I class
may be defined. There may be
multiple
.B class
commands listing additional members of the class. If
multiple
.B class
commands can apply to the current session, the first
one listed in the access file is used. If a valid class for a host is not
defined, access will be denied.
.I typelist
is a comma-separated list of
any of the keywords
.BR anonymous ,
.BR guest ,
and
.BR real .
If the
.B real
keyword is included, the class can match users using FTP to
access real accounts. If the
.B anonymous
keyword is included the class
can match users using anonymous FTP. The
.B guest
keyword matches guest
access accounts.
.sp
.I addrglob
may be a globbed domain name or a globbed numeric IPv4
address. It may also be the name of a file, starting with a slash ('/'),
which contains additional address globs. IPv4 numeric addresses may also be
specified in the form
.B address:netmask
or
.BR address/CIDR .
IPv6
numeric addresses can only be specified with an optional
.BR CIDR ,
not
using globs or netmasks.
.sp
Placing an exclamation (!) before an
.I addrglob
negates the test. For
example,
.sp
.in +2
.nf
class rmtuser real !*.example.com
.fi
.in -2

will classify real users from outside the
.B example.com
domain as the
class
.BR rmtuser .
Use care with this option. Remember, the result of each
test is OR'ed with other tests on the line.
.RE

.sp
.ne 2
.mk
.na
\fBdeny\fR \fIaddrglob\fR [\fImessage_file\fR]\fR
.ad
.sp .6
.RS 4n
Deny access to host(s) that match
.I addrglob
and display
.IR message_file .
If the value of
.I addrglob
is
.BR !nameserved
access to sites without a working nameservers is denied. \fImessage_file\fR
may contain magic cookies. See
.B message
for more details.
.RE

.sp
.ne 2
.mk
.na
.B guestgroup
.IR "groupname groupname" .\|.\|.\fR
.ad
.br
.na
.B guestuser
.IR "username username" .\|.\|.\fR
.ad
.br
.na
.B realgroup
.IR "groupname groupname" .\|.\|.\fR
.ad
.br
.na
.B realuser
.IR "username username" .\|.\|.\fR
.ad
.sp .6
.RS 4n
For
.BR guestgroup ,
if a
.I real
user is a member of any
.IR groupname ,
.RI "the session is set up like anonymous FTP." " groupname"
is a valid group returned by
.BR getgrnam "(3C). The user's home directory"
must be set up exactly as anonymous FTP would be. The home directory field
of the passwd entry is divided into two directories. The first field is the
root directory that will be the argument to the
.BR chroot (2)
call. The
second field is the user's home directory, relative to the root directory.
Use a "\fB/./\fR" to separate the two fields. For example, the following is
the real entry in
.BR /etc/passwd :
.sp
.in +2
.nf
guest1:x:100:92:Guest FTP:/export/home/guests/./guest1:/bin/true
.fi
.in -2

When guest1 successfully logs in, the FTP Server will
.B chroot()
to
.B /export/home/guests
and then
.BR chdir (2)
to
.BR /guest1 .
The
guest user will only be able to access the directory structure under
.BR /export/home/guests ,
which will look and act as
.B /
to
.BR guest1 ,
just as an anonymous FTP user would. The d option to
.BR ftpconfig (1M)
is useful when creating guest FTP user accounts. The
group name may be specified by either name or numeric ID. To use a numeric
group ID, place a percent sign (\fB%\fR) before the number. You can give
ranges. Use an asterisk to indicate all groups.
.B guestuser
works like
.BR guestgroup ,
except that it uses the user name or numeric ID.
.B realuser
and
.B realgroup
have the same syntax, but they reverse
the effect of
.B guestuser
and
.BR guestgroup .
They allow real user
access when the remote user would otherwise be determined a guest.
.sp
.in +2
.nf
guestuser *
realgroup admin
.fi
.in -2

causes all non-anonymous users to be treated as guest, with the sole
exception of users in the
.B admin
group, who are granted real user
access.
.RE

.sp
.ne 2
.mk
.na
.B nice
.I nice-delta class
.ad
.sp .6
.RS 4n
Adjust the process
.B nice
value of the FTP server process by the
indicated
.I nice-delta
value if the remote user is a member of the named
.IR class .
If
.I class
is not specified, then use
.I nice-delta
as
the default adjustment to the FTP server process
.B nice
value. This
default
.B nice
value adjustment is used to adjust the
.B nice
value
of the server process only for those users who do not belong to any class
for which a class-specific
.B nice
directive exists in the
.B ftpaccess
file.
.RE

.sp
.ne 2
.mk
.na
.B defumask
.I umask class
.ad
.sp .6
.RS 4n
Set the
.I umask
applied to files created by the FTP server if the
remote user is a member of the named class. If
.I class
is not specified,
then use the
.I umask
as the default for classes that do not have one
specified.. The mode of files created may be specified by using the
.B upload
directive.
.RE

.sp
.ne 2
.mk
.na
.B tcpwindow
.I size
class\fR
.ad
.sp .6
.RS 4n
Set the TCP window size (socket buffer size) for the data connection. Use
this to control network traffic. For instance, slow PPP dialin links may
need smaller TCP windows to speed up throughput. If you do not know what
this does, do not set it.
.RE

.sp
.ne 2
.mk
.na
\fBipcos\fR control|data \fIvalue\fR [\fItypelist\fR]\fR
.ad
.sp .6
.RS 4n
Set the IP Class of Service for either the control or data connection.
.sp
For connections using
.B AF_INET
type sockets, this sets the Type of
Service field in the IP header to the value specified.
.sp
For connections using
.B AF_INET6
type sockets, this sets the Traffic
Class field in the IP header to the value specified.
.sp
When configured through
.BR inetd.conf (4),
the socket type is controlled
by the protocol field of the
.B ftp
service. When running in standalone
mode the default socket type is
.BR AF_INET6 .
The
.BR in.ftpd "(1M) 4"
option selects
.BR AF_INET .
.sp
.I typelist
is a comma-separated list of any of the keywords
.BR anonymous ,
.BR guest ,
.BR real ,
and
.BR class= .
When
.B class=
appears, it must be followed by a class name.
.RE

.sp
.ne 2
.mk
.na
.BR "keepalive yes" |\fBno\fR
.ad
.sp .6
.RS 4n
Set the TCP
.B SO_KEEPALIVE
option for control and data sockets. This
can be used to control network disconnect. If
.BR yes ,
then set it. If
.BR no ,
then use the system default (usually off). You probably want to
set this.
.RE

.sp
.ne 2
.mk
.na
.B timeout accept
.I seconds
.ad
.br
.na
.B timeout connect
.I seconds
.ad
.br
.na
.B timeout data
.I seconds
.ad
.br
.na
.B timeout idle
.I seconds
.ad
.br
.na
.B timeout maxidle
.I seconds
.ad
.br
.na
.B timeout RFC931
.I seconds
.ad
.sp .6
.RS 4n
Set various timeout conditions.
.sp
.ne 2
.mk
.na
.B accept
.ad
.RS 11n
.rt
How long the FTP Server will wait for an incoming (PASV) data connection.
The default is 120 seconds.
.RE

.sp
.ne 2
.mk
.na
.B connect
.ad
.RS 11n
.rt
How long the FTP Server will wait attempting to establish an outgoing
(PORT) data connection. This effects the actual connection attempt. The
daemon makes several attempts, sleeping between each attempt, before giving
up. The default is 120 seconds.
.RE

.sp
.ne 2
.mk
.na
.B data
.ad
.RS 11n
.rt
How long the FTP Server will wait for some activity on the data connection.
You should keep this long because the remote client may have a slow link,
and there can be quite a bit of data queued for the client. The default is
1200 seconds.
.RE

.sp
.ne 2
.mk
.na
.B idle
.ad
.RS 11n
.rt
How long the FTP Server will wait for the next command. The default is 900
seconds. The default can also be overridden by using the t option at the
command-line. This access clause overrides both.
.RE

.sp
.ne 2
.mk
.na
.B maxidle
.ad
.RS 11n
.rt
The
.B "SITE IDLE"
command allows the remote client to establish a higher
value for the idle timeout. The
.B maxidle
clause sets the upper limit
that the client may request. The default can also be overridden by using the
T option at the command-line. This access clause overrides both. The default
is 7200 seconds.
.RE

.sp
.ne 2
.mk
.na
.B RFC931
.ad
.RS 11n
.rt
The maximum time the FTP server allows for the entire
.BR RFC931
(AUTH/ident) conversation. Setting this to zero (0) disables the server's
use of this protocol. The information obtained by means of
.B RFC931
is
recorded in the system logs and is not actually used in any authentication.
The default is 10 seconds.
.RE

.RE

.sp
.ne 2
.mk
.na
\fBfile-limit\fR \fIraw in\fR|\fIout\fR|\fItotal count\fR
.I class
.ad
.sp .6
.RS 4n
Limit the number of data files a user in the given class may transfer. The
limit may be placed on files
.IR in ,
.IR out ,
or
.IR total .
If no
class is specified, the limit is the default for classes which do not have a
limit specified. The optional parameter
.I raw
applies the limit to the
total traffic rather than just data files.
.RE

.sp
.ne 2
.mk
.na
\fBdata-limit\fR [\fIraw\fR] \fIin\fR|\fIout\fR|\fItotal count\fR
[\fIclass\fR]\fR
.ad
.sp .6
.RS 4n
Limit the number of data bytes a user in the given class may transfer. The
limit may be placed on bytes
.IR in ,
.IR out ,
or
.IR total .
If no
class is specified, the limit is the default for classes which do not have a
limit specified. Note that once it has been exceeded, this limit will
prevent transfers, but it will not terminate a transfer in progress. The
optional parameter
.I raw
applies the limit to total traffic rather than
just data files.
.RE

.sp
.ne 2
.mk
.na
\fBlimit-time\fR \fI*\fR|\fIanonymous\fR|\fIguest minutes\fR
.ad
.sp .6
.RS 4n
Limit the total time a session can take. By default, there is no limit.
Real users are never limited.
.RE

.sp
.ne 2
.mk
.na
\fBguestserver\fR [\fIhostname\fR.\|.\|.]\fR
.ad
.sp .6
.RS 4n
Control which hosts may be used for anonymous access. If used without
.IR hostname ,
all anonymous access is denied to this site. More than one
.I hostname
may be specified. Anonymous access will only be allowed on
the named machines. If access is denied, the user will be asked to use the
first
.I hostname
listed.
.RE

.sp
.ne 2
.mk
.na
\fBlimit\fR \fIclass n\fR \fItimes\fR [\fImessage_file\fR]\fR
.ad
.sp .6
.RS 4n
Limit
.I class
to
.I n
users at times
.IR times ,
displaying
.I message_file
if the user is denied access. A
.B limit
check is
performed at login time only. If multiple
.B limit
commands can apply to
the current session, the first applicable one is used. Failing to define a
valid limit, or a limit of -1, is equivalent to no limits. The format of
.I times
is\(cd:
.sp
.in +2
.nf
\fIday\fR[\fIday\fR.\|.\|.][\fItime-range\fR][|\fIday\fR[\fIday\fR.\|.\|.][\fItime-range\fR]].\|.\|.
.fi
.in -2

The value of
.I day
can be
.BR Su ,
.BR Mo ,
.BR Tu ,
.BR We ,
.BR Th ,
.BR Fr ,
.BR Sa ,
.B Wk
(for any weekday Monday through
Friday), or
.BR Any .
.I time-range
is in 24-hour clock notation. If a
time range is not specified, any time of the day is matched. Multiple
\fIday\fR and \fItime-range\fR may be specified by the "|" symbol. For
example,
.B Wk1730-0900|Sa|Su
specifies 5:30 p.m. to 9:00 a.m., Monday
through Friday, and anytime on weekends.
.I message_file
may contain
magic cookies. See
.B message
for more details.
.RE

.sp
.ne 2
.mk
.na
\fBnoretrieve\fR [\fBabsolute\fR|\fBrelative\fR]\fR
.ad
.br
.na
\fB[class=\fIclassname\fR.\|.\|.][-] \fIfilename\fR
[\fIfilename\fR.\|.\|.]\fR
.ad
.sp .6
.RS 4n
Always deny retrievability of these files. If
.I filename
specifies a
pathname that begins with '/' character, then only those files are marked no
retrieve. Otherwise all files that match the
.I filename
are refused
transfer. For example,
.B "noretrieve /etc/passwd core"
specifies no one
will be able to retrieve the
.B /etc/passwd
file. You will be allowed to
transfer any file named
.B passwd
that is not in
.BR /etc .
.sp
On the other hand, no one will be able to get files named
.BR core ,
wherever they are. Directory specifications mark all files and
subdirectories in the named directory unretrievable. The
.I filename
may
be specified as a file glob. For example,
.sp
.in +2
.nf
noretrieve /etc /home/*/.htaccess
.fi
.in -2

specifies that no files in
.B /etc
or any of its subdirectories may be
retrieved. Also, no files named \fB\&.htaccess\fR anywhere under the
.B /home
directory may be retrieved. The optional first parameter selects
whether names are interpreted as absolute or relative to the current
chroot'd environment. The default is to interpret names beginning with a
slash as absolute. The
.B noretrieve
restrictions may be placed upon
members of particular classes. If any
.B class=
is specified, the named
files cannot be retrieved only if the current user is a member of one of the
given classes.
.RE

.sp
.ne 2
.mk
.na
\fBallow-retrieve\fR [\fBabsolute\fR|\fBrelative\fR]\fR
.ad
.br
.na
\fB[class=\fIclassname\fR.\|.\|.][-] \fIfilename\fR
[\fIfilename\fR.\|.\|.]\fR
.ad
.sp .6
.RS 4n
Allows retrieval of files which would otherwise be denied by noretrieve.
.RE

.sp
.ne 2
.mk
.na
.B loginfails
.I number
.ad
.sp .6
.RS 4n
After \fInumber\fR login failures, log a "repeated login failures" message
and terminate the FTP connection. The default value for
.I number
is 5.
.RE

.sp
.ne 2
.mk
.na
.B private yes
|
.B no
.ad
.sp .6
.RS 4n
Allow or deny use of the
.B "SITE GROUP"
and
.B "SITE GPASS"
commands
after the user logs in. The
.B "SITE GROUP"
and
.B "SITE GPASS"
commands
specify an enhanced access group and associated password. If the group name
and password are valid, the user becomes a member of the group specified in
the group access file
.B /etc/ftpd/ftpgroups
by means of
.BR setegid (2).
See
.BR ftpgroups (4)
for the format of the file. For
this option to work for anonymous FTP users, the  FTP Server must keep
.B /etc/group
permanently open and load the group access file into
memory. This means that the FTP Server now has an additional file descriptor
open, and the necessary passwords and access privileges granted to users by
means of
.B "SITE GROUP"
will be static for the duration of an FTP session.
If you have an urgent need to change the access groups or passwords now, you
have to kill all of the running FTP Servers.
.RE

.SS "Informational Capabilities"
.sp
.LP
The following informational capabilities are supported:
.sp
.ne 2
.mk
.na
\fBgreeting full\fR|\fBbrief\fR|\fBterse\fR
.ad
.br
.na
.B greeting text
.I message
.ad
.sp .6
.RS 4n
The
.B greeting
command allows you to control how much information is
given out before the remote user logs in.
.BR "greeting full" ,
which is the
default greeting, shows the hostname and daemon version. \fBgreeting
brief\fR shows the hostname. \fB greeting terse\fR simply says "FTP Server
ready." Although \fBfull\fR is the default, \fBbrief\fR is suggested.
.sp
The
.B text
form allows you to specify any greeting message.
.I message
can be any string. Whitespace (spaces and tabs) is converted
to a single space.
.RE

.sp
.ne 2
.mk
.na
.B banner
.I path
.ad
.sp .6
.RS 4n
The
.B banner
command operates similarly to the
.B message
command,
except that the banner is displayed before the user enters the username. The
.I path
is relative to the real system root, not to the base of the
anonymous
.B FTP
directory.
.sp
Use of the
.B banner
command can completely prevent non-compliant
.B FTP
clients from making use of the
.B FTP
Server. Not all clients
can handle multi-line responses, which is how the banner is displayed.
.RE

.sp
.ne 2
.mk
.na
.B email
.I name
.ad
.sp .6
.RS 4n
Use this command to define the email address for the FTP Server
administrator. This string will be printed every time the
.B %E
magic
cookie is used in message files.
.RE

.sp
.ne 2
.mk
.na
.B hostname
.I some.host.name
.ad
.sp .6
.RS 4n
Defines the default host name of the FTP Server. This string will be
printed on the greeting message and every time the
.B %L
magic cookie is
used. The host name for virtual servers overrides this value. If no host
name is specified, the default host name for the local machine is used.
.RE

.sp
.ne 2
.mk
.na
\fBmessage\fR \fIpath\fR [\fIwhen\fR [\fIclass\fR.\|.\|.]]\fR
.ad
.sp .6
.RS 4n
Define a file with
.I path
such that the FTP Server will display the
contents of the file to the user at login time or upon using the change
working directory command. The
.I when
parameter may be
.B LOGIN
or
\fBCWD=\fIdirglob\fR. If \fIwhen\fRis \fBCWD=\fIdirglob\fR,
.I dirglob
specifies the new default directory that will trigger the
notification. A \fIdirglob\fR of "\fB*\fR" matches all directories.
.sp
The optional
.I class
specification allows the message to be displayed
only to members of a particular class. More than one class may be
specified.
.sp
"Magic cookies" can be present in \fIpath\fR that cause the FTP Server to
replace the cookie with a specified text string:
.sp
.ne 2
.mk
.na
.B %T
.ad
.RS 6n
.rt
Local time. For example,
.BR "Thu Nov 15 17:12:42 1990" .
.RE

.sp
.ne 2
.mk
.na
.B %F
.ad
.RS 6n
.rt
Free space in partition of CWD, in Kbytes.
.RE

.sp
.ne 2
.mk
.na
.B %C
.ad
.RS 6n
.rt
Current working directory.
.RE

.sp
.ne 2
.mk
.na
.B %E
.ad
.RS 6n
.rt
The email address for the FTP Server administrator.
.RE

.sp
.ne 2
.mk
.na
.B %R
.ad
.RS 6n
.rt
Remote host name.
.RE

.sp
.ne 2
.mk
.na
.B %L
.ad
.RS 6n
.rt
Local host name.
.RE

.sp
.ne 2
.mk
.na
.B %U
.ad
.RS 6n
.rt
Username given at login time.
.RE

.sp
.ne 2
.mk
.na
.B %u
.ad
.RS 6n
.rt
Username as defined by means of
.I "RFC 931"
authentication.
.RE

.sp
.ne 2
.mk
.na
.B %M
.ad
.RS 6n
.rt
Maximum allowed number of users in this class.
.RE

.sp
.ne 2
.mk
.na
.B %N
.ad
.RS 6n
.rt
Current number of users in this class.
.RE

The following quota magic cookies are also supported but not always set
(see the
.B quota-info
capability):
.sp
.ne 2
.mk
.na
.B %B
.ad
.RS 6n
.rt
absolute limit on disk blocks allocated
.RE

.sp
.ne 2
.mk
.na
.B %b
.ad
.RS 6n
.rt
preferred limit on disk blocks
.RE

.sp
.ne 2
.mk
.na
.B %Q
.ad
.RS 6n
.rt
current block count
.RE

.sp
.ne 2
.mk
.na
.B %I
.ad
.RS 6n
.rt
maximum number of allocated inodes (+1)
.RE

.sp
.ne 2
.mk
.na
.B %i
.ad
.RS 6n
.rt
preferred inode limit
.RE

.sp
.ne 2
.mk
.na
.B %q
.ad
.RS 6n
.rt
current number of allocated inodes
.RE

.sp
.ne 2
.mk
.na
.B %H
.ad
.RS 6n
.rt
time limit for excessive disk use
.RE

.sp
.ne 2
.mk
.na
.B %h
.ad
.RS 6n
.rt
time limit for excessive files
.RE

The message is displayed only once to avoid annoying the user. Remember
that when messages are triggered by an anonymous or guest FTP user, they
must be relative to the base of the anonymous or guest FTP directory tree.
.RE

.sp
.ne 2
.mk
.na
\fBquota-info\fR \fIuid-range\fR [\fIuid-range\fR.\|.\|.]\fR
.ad
.sp .6
.RS 4n
Enable retrieval of quota information for users matching
.IR uid-range .
This sets the quota magic cookies. Retrieving quota information might cause
a significant delay when logging into the server.
.sp
.I uid-range
can be a username, single UID, or a UID range. Place a
percent sign(\fB%\fR) before a number. An asterisk means "all users."
.RE

.sp
.ne 2
.mk
.na
\fBreadme\fR \fIpathglob\fR [\fIwhen\fR [\fIclass\fR.\|.\|.]]\fR
.ad
.sp .6
.RS 4n
Define a file with
.I pathglob
such that the FTP Server will notify the
user at login time or upon using the change working directory command that
the file exists and the date that it was modified. The
.I when
parameter
may be \fBLOGIN\fR or \fBCWD=\fIdirglob\fR. If \fIwhen\fR is
\fBCWD=\fIdirglob\fR, \fIdirglob\fR specifies the new default directory
that will trigger the notification. A \fIdirglob\fR of "\fB*\fR" matches all
directories. The message will only be displayed once, to avoid bothering
users. Remember that when README messages are triggered by an anonymous or
guest FTP user, the
.I pathglob
must be relative to the base of the
anonymous or guest FTP directory tree.
.sp
The optional
.I class
specification allows the message to be displayed
only to members of a particular class. You can specify more than one
class.
.RE

.SS "Logging Capabilities"
.sp
.LP
The following logging capabilities are supported:
.sp
.ne 2
.mk
.na
.B log commands
.I typelist
.ad
.sp .6
.RS 4n
Enables logging of the individual FTP commands sent by users.
.I typelist
is a comma-separated list of any of the keywords
.BR anonymous ,
.BR guest ,
and
.BR real .
Command logging information is
written to the system log.
.RE

.sp
.ne 2
.mk
.na
.B log transfers
.I typelist directions
.ad
.sp .6
.RS 4n
Log file transfers made by FTP users to the
.BR xferlog (4)
file. Logging
of incoming transfers to the server can be enabled separately from outbound
transfers from the server.
.I directions
is a comma-separated list of any
of the two keywords
.B inbound
and
.BR outbound ,
and will respectively
cause transfers to be logged for files sent to and from the server.
.RE

.sp
.ne 2
.mk
.na
.B log security
.I typelist
.ad
.sp .6
.RS 4n
Enables logging of violations of security rules to the system log,
including for example,
.B noretrieve
and
.BR \&.notar .
.RE

.sp
.ne 2
.mk
.na
.B log syslog
.ad
.br
.na
.B log syslog+xferlog
.ad
.sp .6
.RS 4n
Redirect the logging messages for incoming and outgoing transfers to
.BR syslog .
Without this option the messages are written to
.BR xferlog .
When you specify
.BR syslog+xferlog ,
the transfer log messages are sent to
both the system log file and the
.B xferlog
file.
.RE

.sp
.ne 2
.mk
.na
.B xferlog
format \fIformatstring\fR
.ad
.sp .6
.RS 4n
Customize the format of the transfer log entry written. \fIformatstring\fR
can be any string, which might include magic cookies. Strings of whitespace
characters are converted into a single space.
.sp
The following transfer-specific magic cookies are recognized only
immediately after a transfer has been completed:
.sp
.ne 2
.mk
.na
.B %Xt
.ad
.RS 7n
.rt
transfer-time
.RE

.sp
.ne 2
.mk
.na
.B %Xn
.ad
.RS 7n
.rt
bytes-transferred
.RE

.sp
.ne 2
.mk
.na
.B %XP
.ad
.RS 7n
.rt
filename
.RE

.sp
.ne 2
.mk
.na
.B %Xp
.ad
.RS 7n
.rt
chroot-filename
.RE

.sp
.ne 2
.mk
.na
.B %Xy
.ad
.RS 7n
.rt
transfer-type
.RE

.sp
.ne 2
.mk
.na
.B %Xf
.ad
.RS 7n
.rt
special-action-flag
.RE

.sp
.ne 2
.mk
.na
.B %Xd
.ad
.RS 7n
.rt
direction
.RE

.sp
.ne 2
.mk
.na
.B %Xm
.ad
.RS 7n
.rt
access-mode
.RE

.sp
.ne 2
.mk
.na
.B %Xa
.ad
.RS 7n
.rt
authentication-method
.RE

.sp
.ne 2
.mk
.na
.B %Xc
.ad
.RS 7n
.rt
completion-status
.RE

.sp
.ne 2
.mk
.na
.B %Xs
.ad
.RS 7n
.rt
file-size
.RE

.sp
.ne 2
.mk
.na
.B %Xr
.ad
.RS 7n
.rt
restart-offset
.RE

.BR xferlog (4)
includes a description of these fields. If no
.B xferlog
format entry is present, the default is:
.sp
.in +2
.nf
xferlog format %T %Xt %R %Xn %XP %Xy %Xf %Xd %Xm %U ftp %Xa %u %Xc
.fi
.in -2
.sp

.RE

.SS "Miscellaneous Capabilities"
.sp
.LP
The following miscellaneous capabilities are supported:
.sp
.ne 2
.mk
.na
\fBalias\fI string\fR \fIdir\fR
.ad
.sp .6
.RS 4n
Define an alias,
.IR " string" ,
for a directory. Use this command to add
the concept of logical directories. For example: \fBalias rfc:
/pub/doc/rfc\fR would allow the user to access \fB/pub/doc/rfc\fR from any
directory by the command "\fBcd rfc:\fR". Aliases only apply to the \fBcd\fR
command.
.RE

.sp
.ne 2
.mk
.na
.B cdpath
.I dir
.ad
.sp .6
.RS 4n
Define an entry in the
.BR cdpath .
This command defines a search path
that is used when changing directories. For example:
.sp
.in +2
.nf
cdpath /pub/packages
cdpath /.aliases
.fi
.in -2
.sp

would allow the user to move into any directory directly under either the
.B /pub/packages
or the
.B /.aliases
directories. The search path is
defined by the order in which the lines appear in the
.B ftpaccess
file.
If the user were to give the command
.B "ftp> cd foo"
the directory will be
searched for in the following order:
.RS +4
.TP
.ie t \(bu
.el o
\fB\&./foo\fR
.RE
.RS +4
.TP
.ie t \(bu
.el o
an alias called foo
.RE
.RS +4
.TP
.ie t \(bu
.el o
.B /pub/packages/foo
.RE
.RS +4
.TP
.ie t \(bu
.el o
.B /.aliases/foo
.RE
The
.B cdpath
is only available with the
.B cd
command. If you have a
large number of aliases, you might want to set up an aliases directory with
links to all of the areas you wish to make available to users.
.RE

.sp
.ne 2
.mk
.na
\fBcompress yes\fR|\fBno\fR \fIclassglob\fR
[\fIclassglob\fR.\|.\|.]\fR
.ad
.br
.na
\fBtar yes\fR|\fBno\fR \fIclassglob\fR [\fIclassglob\fR.\|.\|.]\fR
.ad
.sp .6
.RS 4n
Enable the use of conversions marked with the
.BR O_COMPRESS ,
.BR O_UNCOMPRESS ,
and
.B O_TAR
options in
.BR /etc/ftpd/ftpconversions .
See \fBftpconversions\fR(4).
.RE

.sp
.ne 2
.mk
.na
.B shutdown
.I path
.ad
.sp .6
.RS 4n
If the file pointed to by
.I path
exists, the server will check the file
regularly to see if the server is going to be shut down. If a shutdown is
planned, the user is notified. New connections are denied after a specified
time before shutdown. Current connections are dropped at a specified time
before shutdown.
.sp
The format of the file specified by
.I path
is:
.sp
.in +2
.nf
\fIyear\fR \fImonth\fR \fIday\fR \fIhour\fR \fIminute\fR \fIdeny_offset\fR \fIdisc_offset\fR \fItext\fR
.fi
.in -2

.sp
.ne 2
.mk
.na
.I year
.ad
.RS 15n
.rt
A value of 1970 or greater.
.RE

.sp
.ne 2
.mk
.na
.I month
.ad
.RS 15n
.rt
A value of 0 to 11.
.RE

.sp
.ne 2
.mk
.na
.I day
.ad
.RS 15n
.rt
A value of 1 to 31.
.RE

.sp
.ne 2
.mk
.na
.I hour
.ad
.RS 15n
.rt
A value of 0 to 23.
.RE

.sp
.ne 2
.mk
.na
.I minute
.ad
.RS 15n
.rt
A value of 0 to 59.
.RE

.sp
.ne 2
.mk
.na
.I deny_offset
.ad
.br
.na
.I disc_offset
.ad
.RS 15n
.rt
The offsets in HHMM format that new connections will be denied and existing
connections will be disconnected before the shutdown time.
.RE

.sp
.ne 2
.mk
.na
.I text
.ad
.RS 15n
.rt
Follows the normal rules for any
.IR message .
The following additional
magic cookies are available:
.sp
.ne 2
.mk
.na
.B %s
.ad
.RS 6n
.rt
The time at which the system is going to shut down.
.RE

.sp
.ne 2
.mk
.na
.B %r
.ad
.RS 6n
.rt
The time at which new connections will be denied.
.RE

.sp
.ne 2
.mk
.na
.B %d
.ad
.RS 6n
.rt
The time at which current connections will be dropped.
.RE

.RE

All times are in the form:
.BR "ddd MMM DD hh:mm:ss YYYY" .
Only one
.B shutdown
command can be present in the configuration file. You can use
the external program \fBftpshut\fR(1M) to automate generation of this
file.
.RE

.sp
.ne 2
.mk
.na
.B daemonaddress
.I address
.ad
.sp .6
.RS 4n
Listen only on the IP address specified. If the value is not set, then the
FTP Server will listen for connections on every IP address. This applies
only when the FTP Server is run in standalone mode.
.RE

.sp
.ne 2
.mk
.na
\fBvirtual\fR \fIaddress\fR \fBroot\fR|\fBbanner\fR|\fBlogfile\fR
.I path
.ad
.sp .6
.RS 4n
Enable the FTP Server limited virtual hosting capabilities. The
.I address
is the IP address of the virtual server. The second argument
specifies that the
.I path
is either the path to the
.B root
of the
filesystem for this virtual server, the
.B banner
presented to the user
when connecting to this virtual server, or the
.B logfile
where transfers
are recorded for this virtual server. If the
.B logfile
is not specified
the default log file will be used. All other message files and permissions
as well as any other settings in this file apply to all virtual servers. The
.I address
may also be specified as a hostname rather than as an IP
number. This is strongly discouraged since, if DNS is not available at the
time the FTP session begins, the hostname will not be matched.
.RE

.sp
.ne 2
.mk
.na
\fBroot\fR|\fBlogfile\fR \fIpath\fR
.ad
.sp .6
.RS 4n
In contrast to limited virtual hosting, complete virtual hosting allows
separate configuration files to be virtual host specific. See
.BR ftpservers (4).
The only additions that are necessary in a virtual
host's
.B ftpaccess
file is the
.B root
directive that ensures the
correct root directory is used for the virtual host. This only works with
complete virtual hosting, which in contrast to limited virtual hosting,
allows separate configuration files to be specified for each virtual host.
.sp
.I path
is either the root of the filesystem for this virtual server or
the logfile where transfers for this virtual server are recorded. root and
logfile may only be specified when not preceded by
.BR virtual
.I address
in a virtual hosts's
.B ftpaccess
file.
.RE

.sp
.ne 2
.mk
.na
\fBvirtual\fR \fIaddress\fR \fBhostname\fR|\fBemail\fR \fIstring\fR
.ad
.sp .6
.RS 4n
Set the hostname shown in the greeting message and status command, or the
email address used in message files and on the HELP command, to the given
.IR string .
.RE

.sp
.ne 2
.mk
.na
.B virtual
.I address
.B allow
.I username
[\fIusername\fR.\|.\|.]\fR
.ad
.br
.na
.B virtual
.I address
.B deny
.I username
[\fIusername\fR.\|.\|.]\fR
.ad
.sp .6
.RS 4n
By default, real and guest users are not allowed to log in on the virtual
server, unless they are guests that are chroot'd to the virtual root. The
users listed on the
.B "virtual allow"
line(s) are granted access. You can
grant access to all users by giving '*' as the
.IR username .
The
.B virtual deny
clauses are processed after the
.BR "virtual allow"
clauses. Thus specific users can be denied access although all users were
allowed in an earlier clause.
.RE

.sp
.ne 2
.mk
.na
.B virtual
.I address
.B private
.ad
.sp .6
.RS 4n
Deny log in access to anonymous users on the virtual server. Anonymous
users are generally allowed to log in on the virtual server if this option
is not specified.
.RE

.sp
.ne 2
.mk
.na
.B virtual
.I address
.B passwd
.I file
.ad
.sp .6
.RS 4n
Use a different
.B passwd
file for the virtual host.
.RE

.sp
.ne 2
.mk
.na
.B virtual
.I address
.B shadow
.I file
.ad
.sp .6
.RS 4n
Use a different
.B shadow
file for the virtual host.
.RE

.sp
.ne 2
.mk
.na
\fBdefaultserver deny\fR \fIusername\fR [\fIusername\fR.\|.\|.]\fR
.ad
.br
.na
.B defaultserver allow
.I username
[\fIusername\fR.\|.\|.]
\fR
.ad
.sp .6
.RS 4n
By default, all users are allowed access to the non-virtual FTP Server. Use
.B defaultserver deny
to revoke access for specific real and guest
users. Specify '*' to deny access to all users, except anonymous users.
Specific real and guest users can then be allowed access by using
\fBdefaultserver allow\fR.
.RE

.sp
.ne 2
.mk
.na
.B defaultserver private
.ad
.sp .6
.RS 4n
By default, all users are allowed access to the non-virtual FTP Server. Use
.B defaultserver private
to revoke access for anonymous users.
.sp
The
.B virtual
and
.BR "defaultserver allow" ,
.B deny
and
.B private
clauses provide a means to control which users are allowed
access to which FTP Servers.
.RE

.sp
.ne 2
.mk
.na
.B passive address
.I externalip cidr
.ad
.sp .6
.RS 4n
Allow control of the address reported in response to a
.BR passive
command. When any control connection matching
.I cidr
requests a passive
data connection (PASV), the
.I externalip
address is reported. This does
not change the address that the daemon actually listens on, only the address
reported to the client. This feature allows the daemon to operate correctly
behind IP renumbering firewalls. For example:
.sp
.in +2
.nf
passive address 10.0.1.15   10.0.0.0/8
passive address 192.168.1.5 0.0.0.0/0
.fi
.in -2

Clients connecting from the class-A network 10 will be told the passive
connection is listening on IP address 10.0.1.15 while all others will be
told the connection is listening on 192.168.1.5. Multiple passive addresses
may be specified to handle complex, or multi-gatewayed, networks.
.RE

.sp
.ne 2
.mk
.na
.B "passive ports"
.I "cidr min"
.I max
.ad
.sp .6
.RS 4n
Allows control of the TCP port numbers which may be used for a passive data
connection. If the control connection matches the
.IR cidr ,
a port in the
range
.I min
to
.I max
will be randomly selected for the daemon to
listen on. This feature allows firewalls to limit the ports that remote
clients may use to connect into the protected network.
.sp
.I cidr
is shorthand for an IP address followed by a slash and the
number of left-most bits that represent the network address, as opposed to
the machine address. For example, if you are using the reserved class-A
network 10, instead of a netmask of 255.0.0.0, use a CIDR of /8, as in
10.0.0.0/8, to represent your network.
.sp
When
.I min
and
.I max
are both 0, the kernel rather than the FTP
server selects the TCP port to listen on. Kernel port selection is usually
not desirable if the kernel allocates TCP ports sequentially. If in doubt,
let the FTP server do the port selection.
.RE

.sp
.ne 2
.mk
.na
\fBpasv-allow\fR \fIclass\fR [\fIaddrglob\fR.\|.\|.]\fR
.ad
.br
.na
\fBport-allow\fR \fIclass\fR [\fIaddrglob\fR.\|.\|.]\fR
.ad
.sp .6
.RS 4n
Normally, the FTP Server does not allow a
.B PORT
command to specify an
address different than that of the control connection. Nor does it allow a
.B PASV
connection from another address.
.sp
The
.B port-allow
clause provides a list of addresses that the specified
class of user may give on a
.B PORT
command. These addresses will be
allowed even if they do not match the IP address of the client-side of the
control connection.
.sp
The
.B pasv-allow
clause provides a list of addresses that the specified
class of user may make data connections from. These addresses will be
allowed even if they do not match the IP address of the client-side of the
control connection.
.RE

.sp
.ne 2
.mk
.na
\fBlslong\fI command\fR [\fIoptions\fR.\|.\|.]\fR
.ad
.br
.na
\fBlsshort\fI command\fR [\fIoptions\fR.\|.\|.]\fR
.ad
.br
.na
\fBlsplain\fI command\fR [\fIoptions\fR.\|.\|.]\fR
.ad
.sp .6
.RS 4n
Use the
.BR lslong ,
.BR lsshort ,
and
.B lsplain
clauses to specify
the commands and options to use to generate directory listings. The options
cannot contain spaces, and the default values for these clauses are
generally correct. Use
.BR lslong ,
.BR lsshort ,
or
.B lsplain
only if
absolutely necessary.
.RE

.sp
.ne 2
.mk
.na
.B mailserver
.I hostname
.ad
.sp .6
.RS 4n
Specify the name of a mail server that will accept upload notifications for
the FTP Server. Multiple mail servers may be listed. The FTP Server will
attempt to deliver the upload notification to each, in order, until one
accepts the message. If no mail servers are specified,
.B localhost
is
used. This option is only meaningful if anyone is to be notified of
anonymous uploads. See
.BR incmail .
.RE

.sp
.ne 2
.mk
.na
.B incmail
.I emailaddress
.ad
.br
.na
.B virtual
.I address
.B incmail
.I emailaddress
.ad
.br
.na
.B defaultserver incmail
.I emailaddress
.ad
.sp .6
.RS 4n
Specify email addresses to be notified of anonymous uploads. Multiple
addresses can be specified. Each will receive a notification. If no
addresses are specified, no notifications are sent.
.sp
If addresses are specified for a virtual host, only those addresses will be
sent notification of anonymous uploads on that host. Otherwise,
notifications will be sent to the global addresses.
.sp
.B defaultserver
addresses only apply when the FTP session is not using
one of the virtual hosts. In this way, you can receive notifications for
your default anonymous area, but not see notifications to virtual hosts that
do not have their own notifications.
.RE

.sp
.ne 2
.mk
.na
.B mailfrom
.I emailaddress
.ad
.br
.na
.B virtual
.I address
.B mailfrom
.I emailaddress
.ad
.br
.na
.B defaultserver mailfrom
.I emailaddress
.ad
.sp .6
.RS 4n
Specify the sender's email address for anonymous upload notifications. Only
one address may be specified. If no
.B mailfrom
applies, email is sent
from the default mailbox name
.BR wu-ftpd .
To avoid problems if the
recipient attempts to reply to a notification, or if downstream mail
problems generate bounces, you should ensure the
.B mailfrom
address is
deliverable.
.RE

.sp
.ne 2
.mk
.na
\fBsendbuf\fR \fIsize\fR [\fItypelist\fR]\fR
.ad
.br
.na
\fBrecvbuf\fR \fIsize\fR [\fItypelist\fR]\fR
.ad
.sp .6
.RS 4n
Set the send or receive buffer sizes used for binary transfers. They have
no effect on ASCII transfers.
.RE

.sp
.ne 2
.mk
.na
.B rhostlookup
yes|no [\fIaddrglob\fR .\|.\|.]\fR
.ad
.sp .6
.RS 4n
Allows or disallows the lookup of the remote host's name. Name lookups can
be slow, but skipping them means that places where an
.I addrglob
is
matched (for example, in the class capability) will match only an IP
address, not a name. Also
.B "deny !nameserved"
and \fBdns
refuse_no_reverse\fR or \fBrefuse_mismatch\fR will deny access when a name
lookup is not done. The default is to lookup the remote host's name.
.sp
Only IP addresses, not names, are matched in
.IR addrglob .
.RE

.sp
.ne 2
.mk
.na
\fBflush-wait\fR yes|no [\fItypelist\fR]\fR
.ad
.sp .6
.RS 4n
Controls the behavior at the end of a download or directory listing. If
.BR yes ,
shutdown the data connection for sending and wait for the client
to close its end before sending a transfer complete reply on the control
connection. This is the default behavior. If
.BR no ,
close the data
connection and send the transfer complete reply without waiting for the
client. With this behavior, data loss can go undetected.
.sp
If a client hangs at the end of a directory listing, or the system has many
sockets in the
.B FIN_WAIT_2
state, try setting to
.B no
as a
workaround for broken client behavior.
.RE

.SS "Permission Capabilities"
.sp
.LP
The following permission capabilities are supported:
.sp
.ne 2
.mk
.na
\fBchmod yes\fR|\fBno\fR \fItypelist\fR
.ad
.br
.na
\fBdelete yes\fR|\fBno\fR \fItypelist\fR
.ad
.br
.na
\fBoverwrite yes\fR|\fBno\fR \fItypelist\fR
.ad
.br
.na
\fBrename yes\fR|\fBno\fR \fItypelist\fR
.ad
.br
.na
\fBumask yes\fR|\fBno\fR \fItypelist\fR
.ad
.sp .6
.RS 4n
Allows or disallows the ability to perform the specified function. By
default, all real and guest users are allowed. Anonymous users are only
allowed
.B overwrite
and
.BR umask .
.sp
.I typelist
is a comma-separated list of any of the keywords
.BR anonymous ,
.BR guest ,
.B real
and
.BR class= .
When
.BR class=
appears, it must be followed by a classname. If any
.B class=
appears,
the
.I typelist
restriction applies only to users in that class.
.RE

.sp
.ne 2
.mk
.na
\fBpasswd-check none\fR|\fBtrivial\fR|\fBrfc822\fR
[\fBenforce\fR|\fBwarn\fR]\fR
.ad
.sp .6
.RS 4n
Define the level and enforcement of password checking done by the FTP
Server for anonymous FTP.
.sp
.ne 2
.mk
.na
.B none
.ad
.RS 11n
.rt
No password checking is performed.
.RE

.sp
.ne 2
.mk
.na
.B trivial
.ad
.RS 11n
.rt
The password must contain an '@'.
.RE

.sp
.ne 2
.mk
.na
.B rfc822
.ad
.RS 11n
.rt
The password must be
.I "RFC 822"
compliant.
.RE

.sp
.ne 2
.mk
.na
.B warn
.ad
.RS 11n
.rt
Warn, but permit the login.
.RE

.sp
.ne 2
.mk
.na
.B enforce
.ad
.RS 11n
.rt
Notify and deny the login.
.RE

.RE

.sp
.ne 2
.mk
.na
.B deny-email
.I case-insensitive-emailaddress
.ad
.sp .6
.RS 4n
Consider the email address given as an argument as invalid. If
.B passwd-check
is set to
.BR enforce ,
anonymous users giving this
address as a password cannot log in. That way, you can stop users from
having stupid WWW browsers use fake addresses like IE?0User@ or mozilla@.
(by using this, you are not shutting out users using a WWW browser for ftp -
you just make them configure their browser correctly.) Only one address is
allowed per line, but you can have as many
.B deny-email
addresses as you
like.
.RE

.sp
.ne 2
.mk
.na
.B path-filter
.I typelist message
.I allowed_regexp
\fR
.ad
.br
.na
\fB[\fIdisallowed_regexp\fR.\|.\|.]\fR
.ad
.sp .6
.RS 4n
For users in
.IR typelist ,
.B path-filter
defines regular expressions
that control what characters can be used in the filename of an uploaded file
or created directory. There may be multiple disallowed regular expressions.
If a filename is invalid due to failure to match the regular expression
criteria,
.I message
will be displayed to the user. For example:
.sp
.in +2
.nf
path-filter anonymous /etc/pathmsg ^[-A-Za-z0-9._]*$ ^\. ^-
.fi
.in -2

specifies that all upload filenames for anonymous users must be made of
only the characters A-Z, a-z, 0-9, and "._-" and may not begin with a "." or
a "-". If the filename is invalid, \fB/etc/pathmsg\fR will be displayed to
the user.
.RE

.sp
.ne 2
.mk
.na
\fBupload\fR [\fBabsolute\fR|\fBrelative\fR]
[\fBclass=\fIclassname\fR].\|.\|. [\fB-\fR]\fR
.ad
.br
.na
\fIroot-dir dirglob\fR \fByes\fR|\fBno\fR \fIowner group\fR
.I mode
.ad
.br
.na
\fB[dirs\fR|\fBnodirs\fR] [\fId_mode\fR]\fR
.ad
.sp .6
.RS 4n
Define a directory with
.I dirglob
that permits or denies uploads. If it
does permit uploads, all newly created files will be owned by \fIowner\fR
and
.I group
and will have their permissions set according to
.IR mode .
Existing files that are overwritten will retain their original ownership and
permissions. Directories are matched on a best-match basis. For example:
.sp
.in +2
.nf
upload /var/ftp  *  no
upload /var/ftp /incoming yes ftp daemon 0666
upload /var/ftp /incoming/gifs yes jlc guest 0600 nodirs
.fi
.in -2

would only allow uploads into
.B /incoming
and
.BR /incoming/gifs .
Files that were uploaded to
.B /incoming
are owned by \fBftp/daemon\fR
and have permissions of 0666. Files uploaded to
.B /incoming/gifs
are
owned by
.B jlc/guest
and have permissions of 0600. The optional
"\fBdirs\fR" and "\fBnodirs\fR" keywords can be specified to allow or
disallow the creation of new subdirectories using the
.B mkdir
command.
If the
.B upload
command is used, directory creation is allowed by
default. To turn it off by default, you must specify a user, group and mode
followed by the "nodirs" keyword as the first line where the \fBupload\fR
command is used in this file. If directories are permitted, the optional
.I d_mode
determines the permissions for a newly created directory. If
.I d_mode
is omitted, the permissions are inferred from
.IR mode .
The
permissions are 0777 if
.I mode
is also omitted. The
.B upload
keyword
only applies to users who have a home directory of
.IR root-dir .
\fIroot-dir\fR may be specified as "*" to match any home directory. The
\fIowner\fR or \fIgroup\fR may each be specified as "*", in which case any
uploaded files or directories will be created with the ownership of the
directory in which they are created. The optional first parameter selects
whether
.I root-dir
names are interpreted as absolute or relative to the
current
.B chroot'd
environment. The default is to interpret
.B <root-dir>
names as absolute. You can specify any number of
\fBclass=\fIclassname\fR restrictions. If any are specified, this upload
clause only takes effect if the current user is a member of one of the
classes.
.sp
In the absence of any matching
.B upload
clause, real and guest users
can upload files and make directories, but anonymous users cannot. The mode
of uploaded files is 0666. For created directories, the mode is 0777. Both
modes are modified by the current umask setting.
.RE

.sp
.ne 2
.mk
.na
.B throughput
.I "root-dir subdir-glob"
.I file-glob-list
\fR
.ad
.br
.na
.I bytes-per-second bytes-per-second-multiply
.I remote-glob-list
.ad
.sp .6
.RS 4n
Define files by means of a comma-separated
.I file-glob-list
in
.B subdir
matched by
.I subdir-glob
under
.I root-dir
that have
restricted transfer throughput of
.I bytes-per-second
on download when
the remote hostname or remote IP address matches the comma-separated
.IR remote-glob-list .
Entries are matched on a best-match basis. For
example:
.sp
.in +2
.nf
throughput /e/ftp *    *      oo   -   *
throughput /e/ftp /sw* *      1024 0.5 *
throughput /e/ftp /sw* README oo   -   *
throughput /e/ftp /sw* *      oo   -   *.foo.com
.fi
.in -2

would set maximum throughput per default, but restrict download to 1024
bytes per second for any files under
.B /e/ftp/sw/
that are not named
README. The only exceptions are remote hosts from within the domain
.B foo.com
which always get maximum throughput. Every time a remote
client has retrieved a file under
.B /e/ftp/sw/
the bytes per seconds of
the matched entry line are internally multiplied by a factor, here 0.5. When
the remote client retrieves its second file, it is served with 512 bytes per
second, the third time with only 256 bytes per second, the fourth time with
only 128 bytes per second, and so on. The string "oo" for the bytes per
second field means no throughput restriction. A multiply factor of 1.0 or
"-" means no change of the throughput after every successful transfer. The
.I root-dir
here must match the home directory specified in the password
database . The
.B throughput
keyword only applies to users who have a
home directory of
.IR root-dir .
.RE

.sp
.ne 2
.mk
.na
\fBanonymous-root\fR \fIroot-dir\fR [\fIclass\fR.\|.\|.]\fR
.ad
.sp .6
.RS 4n
.I root-dir
specifies the
.B chroot()
path for anonymous users. If no
anonymous-root is matched, the old method of parsing the home directory for
the FTP user is used. If no
.I class
is specified, this is the root
directory for anonymous users who do not match any other anonymous-root
specification. Multiple classes may be specified on this line. If an
anonymous-root is chosen for the user, the FTP user's home directory in the
\fIroot-dir\fR/etc/passwd\fR file is used to determine the initial
directory and the FTP user's home directory in the system-wide
.B /etc/passwd
is not used. For example:
.sp
.in +2
.nf
anonymous-root /home/ftp
anonymous-root /home/localftp localnet
.fi
.in -2

causes all anonymous users to be
.B chroot'd
to the directory
.BR /home/ftp .
If the FTP user exists in
.BR /home/ftp/etc/passwd ,
their
initial
.B CWD
is that home directory. Anonymous users in the class
.BR localnet ,
however, are
.B chroot'd
to the directory
.B /home/localftp
and their initial
.B CWD
is taken from the FTP
user's home directory in
.BR /home/localftp/etc/passwd .
.RE

.sp
.ne 2
.mk
.na
\fBguest-root\fR \fIroot-dir\fR [\fIuid-range\fR.\|.\|.]\fR
.ad
.sp .6
.RS 4n
.I root-dir
specifies the
.B chroot()
path for guest users. If no
guest-root is matched, the old method of parsing the user's home directory
is used. If no
.I uid-range
is specified, this is the root directory for
guestusers who do not match any other guest-root specification. Multiple UID
ranges may be given on this line. If a guest-root is chosen for the user,
the user's home directory in the \fIroot-dir\fR/etc/passwd\fR file is
used to determine the initial directory and the home directory in the
system-wide
.B /etc/passwd
is not used.
.I uid-range
specifies names
or numeric UID values. To use numbers, put a percent sign (\fB%\fR) symbol
before it or before the range. Ranges are specified by giving the lower and
upper bounds (inclusive), separated by a dash. If the lower bound is
omitted, it means
.BR "all up to" .
If the upper bound is omitted, it means
.BR "all starting from" .
For example:
.sp
.in +2
.nf
guest-root /home/users
guest-root /home/staff %100-999 sally
guest-root /home/users/owner/ftp frank
.fi
.in -2

causes all guest users to
.B chroot()
to
.B /home/users
then starts
each user in the user's home directory, as specifiedin
.BR /home/users/etc/passwd .
Users in the range 100 through 999, inclusive,
and user sally, will be
.B chroot'd
to
.B /home/staff
and the
.B CWD
will be taken from their entries in \fB/home/staff/etc/passwd\fR.
The single user frank will be
.B chroot'd
to \fB/home/users/owner/ftp\fR
and the
.B CWD
will be from his entry in
.BR /home/users/owner/ftp/etc/passwd .
.sp
The order is important for both anonymous-root and guest-root. If a user
would match multiple clauses, only the first applies; with the exception of
the clause which has no
.I class
or
.IR uid-range ,
which applies only
if no other clause matches.
.RE

.sp
.ne 2
.mk
.na
\fBdeny-uid\fR \fIuid-range\fR [\fIuid-range\fR.\|.\|.]\fR
.ad
.br
.na
\fBdeny-gid\fR \fIgid-range\fR [\fIgid-range\fR.\|.\|.]\fR
.ad
.br
.na
\fBallow-uid\fR \fIuid-range\fR  [\fIuid-range\fR.\|.\|.]\fR
.ad
.br
.na
\fBallow-gid\fR \fIgid-range\fR [\fIgid-range\fR.\|.\|.]\fR
.ad
.sp .6
.RS 4n
Use these clauses to specify UID and GID values that will be denied access
to the FTP Server. The
.B allow-uid
and
.B allow-gid
clauses may be
used to allow access for UID and GID values which would otherwise be denied.
These checks occur before all others.
.B deny
is checked before
.BR allow .
The default is to allow access. These clauses do not apply to
anonymous users. Use
.B "defaultserver private"
to deny access to
anonymous users. In most cases, these clauses obviate the need for an
.BR ftpusers (4)
file. For example, the following clauses deny FTP Server
access to all privileged or special users and groups, except the guest1 user
or group.
.sp
.in +2
.nf
deny-gid %-99 nobody noaccess nogroup
deny-uid %-99 nobody noaccess nobody4
allow-gid guest1
allow-uid guest1
.fi
.in -2

Support for the
.B ftpusers
file still exists, so it may be used when
changing the
.B ftpaccess
file is not desired. In any place a single UID
or GID is allowed throughout the
.B ftpaccess
file, either names or
numbers also may be used. To use a number, put a percent sign (\fB%\fR)
symbol before it. In places where a range is allowed, put the percent sign
before the range. A "\fB*\fR" matches all UIDs or GIDs.
.RE

.sp
.ne 2
.mk
.na
\fBrestricted-uid\fR \fIuid-range\fR [\fIuid-range\fR.\|.\|.]\fR
.ad
.br
.na
\fBrestricted-gid\fR \fIgid-range\fR [\fIgid-range\fR.\|.\|.]\fR
.ad
.br
.na
\fBunrestricted-uid\fR \fIuid-range\fR [\fIuid-range\fR.\|.\|.]\fR
.ad
.br
.na
\fBunrestricted-gid\fR \fIgid-range\fR [\fIgid-range\fR.\|.\|.]\fR
.ad
.sp .6
.RS 4n
These clauses control whether or not real or guest users will be allowed
access to areas on the FTP site outside their home directories. These
clauses are not meant to replace the use of
.B guestgroup
and
.BR guestuser .
Instead, use these clauses to supplement the operation of
guests. The
.B unrestricted-uid
and
.B unrestricted-gid
clauses may be
used to allow users outside their home directories who would otherwise be
restricted.
.sp
The following example shows the intended use for these clauses. Assume user
.B dick
has a home directory
.B /home/dick
and
.B jane
has a home
directory
.BR /home/jane :
.sp
.in +2
.nf
guest-root /home dick jane
restricted-uid dick jane
.fi
.in -2

While both
.B dick
and
.B jane
are
.B chroot'd
to
.BR /home ,
they cannot access each other's files because they are restricted to their
home directories. However, you should not rely solely upon the FTP
restrictions to control access. As with all other FTP access rules, you
should also use directory and file permissions to support the operation of
the
.B ftpaccess
configuration.
.RE

.sp
.ne 2
.mk
.na
\fBsite-exec-max-lines\fR \fInumber\fR [\fIclass\fR.\|.\|.]\fR
.ad
.sp .6
.RS 4n
The
.B "SITE EXEC"
feature traditionally limits the number of lines of
output that may be sent to the remote client. Use this clause to set this
limit. If this clause is omitted, the limit is 20 lines. A limit of 0 (zero)
implies no limit. Be very careful if you choose to remove the limit. If a
clause is found matching the remote user's class, that limit is used.
Otherwise, the clause with class '*', or no class given, is used. For
example:
.sp
.in +2
.nf
site-exec-max-lines 200 remote
site-exec-max-lines 0 local
site-exec-max-lines 25
.fi
.in -2

limits output from
.B "SITE EXEC"
(and therefore
.BR "SITE INDEX" )
to 200
lines for remote users, specifies there is no limit at all for local users,
and sets a limit of 25 lines for all other users.
.RE

.sp
.ne 2
.mk
.na
\fBdns refuse_mismatch\fR \fIfilename\fR [\fBoverride\fR]\fR
.ad
.sp .6
.RS 4n
Refuse FTP sessions when the forward and reverse lookups for the remote
site do not match. Lookups are done using the system's name service as
configured in
.BR nsswitch.conf (4).
Display the named file, like a message
file, admonishing the user. If the optional override is specified, allow the
connection after complaining.
.RE

.sp
.ne 2
.mk
.na
\fBdns refuse_no_reverse\fR \fIfilename\fR [\fBoverride\fR]\fR
.ad
.sp .6
.RS 4n
Refuse FTP sessions when the remote host's IP address has no associated
name. Lookups are done using the system's name service as configured in
.BR nsswitch.conf (4).
Display the named file, such as a message file,
admonishing the user. If the optional override is specified, allow the
connection after complaining.
.RE

.sp
.ne 2
.mk
.na
\fBdns resolveroptions\fR [\fBoptions\fR]\fR
.ad
.sp .6
.RS 4n
Modify certain internal resolver variables. This only has an effect when
DNS is used as the system's name service. The line takes a series of options
which are used to set the RES_OPTIONS environment variable, see
resolv.conf(4) for details. For example:
.sp
.in +2
.nf
dns resolveroptions rotate attempts:1
.fi
.in -2

turns on querying name servers round-robin and selects querying each name
server only once.
.RE

.sp
.LP
Lines that begin with a
.B #
sign are treated as comment lines and are
ignored.
.SH FILES
.sp
.ne 2
.mk
.na
.B  /etc/ftpd/ftpaccess
.ad
.RS 24n
.rt

.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWftpr
_
Interface StabilityExternal
.TE

.SH SEE ALSO
.sp
.LP
.BR compress (1),
.BR ls (1),
.BR tar (1),
.BR ftpaddhost (1M),
.BR ftpconfig (1M),
.BR ftpshut (1M),
.BR in.ftpd (1M),
.BR chroot (2),
.BR nice (2),
.BR umask (2),
.BR getgrnam (3C),
.BR resolver (3RESOLV),
.BR ftpconversions (4),
.BR ftpgroups (4),
.BR ftpservers (4),
.BR ftpusers (4),
.BR nsswitch.conf (4),
.BR resolv.conf (4),
.BR timezone (4),
.BR xferlog (4),
.BR attributes (5),
.BR fnmatch (5)
.sp
.LP
Crocker, David H. \fIRFC 822, Standard For The Format Of ARPA Internet Text
Messages\fR. Network Information Center. August 1982.
.sp
.LP
St. Johns, Michael.
.IR "RFC 931, Authentication Server" .
Network Working
Group. January 1985.
