usr/src/man/man4/ftpconversions.4
'\" te
.\" Copyright (C) 2001, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ftpconversions 4 "1 May 2003" "SunOS 5.11" "File Formats"
.SH NAME
ftpconversions \- FTP Server conversions database
.SH SYNOPSIS
.LP
.nf
\fB/etc/ftpd/ftpconversions\fR
.fi

.SH DESCRIPTION
.sp
.LP
When the FTP Server,
.BR in.ftpd (1M),
receives the retrieve (\fBRETR\fR)
command, if the specified file does not exist, it looks for a conversion to
change an existing file or directory of the same base name into the format
requested, subject to the
.BR ftpaccess (4)
.B compress
and
.BR tar
capabilities.
.sp
.LP
The conversions  and their attributes known by
.BR in.ftpd (1M)
are stored
in an
.B ASCII
file of the following format. Each line in the file
provides a description for a single conversion. The fields in this file are
separated by colons (:).
.sp
.in +2
.nf
%s:%s:%s:%s:%s:%s:%s:%s
 1  2  3  4  5  6  7  8
.fi
.in -2
.sp

.sp
.LP
The fields are described as follows:
.sp
.ne 2
.mk
.na
.B 1
.ad
.RS 5n
.rt
\fBStrip prefix\fR.
.RE

.sp
.ne 2
.mk
.na
.B 2
.ad
.RS 5n
.rt
\fBStrip postfix\fR.
.RE

.sp
.ne 2
.mk
.na
.B 3
.ad
.RS 5n
.rt
\fBAddon prefix\fR.
.RE

.sp
.ne 2
.mk
.na
.B 4
.ad
.RS 5n
.rt
\fBAddon postfix\fR.
.RE

.sp
.ne 2
.mk
.na
.B 5
.ad
.RS 5n
.rt
.BR "External command" .
.RE

.sp
.ne 2
.mk
.na
.B 6
.ad
.RS 5n
.rt
.BR Types .
.RE

.sp
.ne 2
.mk
.na
.B 7
.ad
.RS 5n
.rt
.BR Options .
.RE

.sp
.ne 2
.mk
.na
.B 8
.ad
.RS 5n
.rt
.BR Description .
.RE

.sp
.LP
The
.BR "Strip prefix" " and "
.B Addon prefix
fields are not currently
supported.
.sp
.LP
The
.BR "Strip postfix" " and "
.B addon postfix
fields are extensions to be
added to or removed from the requested
.B filename
in attempting to
produce the name of an existing file or directory. When the attempt
succeeds, the FTP Server runs the external command associated with the
conversion. The magic cookie
.B %s
in the argument is passed to the
command, replaced with the name of the existing file or directory.
.sp
.LP
.B External command
is the absolute pathname of a command to run
followed by the appropriate options to carry out the conversion. The
standard output of the command is sent back in response to the
.BR RETR
(retrieve) command. For anonymous and guest users to be able to execute the
command, it must be present in their
.B chroot'd
hierarchy along with any
necessary dynamic libraries.
.sp
.LP
.B Types
specifies the conversion type. The following values are
recognized:
.sp
.ne 2
.mk
.na
.B T_ASCII
.ad
.RS 11n
.rt
ASCII transfers are allowed of a file produced by the conversion.
.RE

.sp
.ne 2
.mk
.na
.B T_DIR
.ad
.RS 11n
.rt
Directories can be converted.
.RE

.sp
.ne 2
.mk
.na
.B T_REG
.ad
.RS 11n
.rt
Regular files can be converted.
.RE

.sp
.LP
.B Options
are checked against the
.BR ftpaccess (4)
.B compress
and
.B tar
capabilities and are recorded in the
.B special-action-flag
field that is written to the FTP Server logfile. See
.BR xferlog (4).
The
following options are supported:
.sp
.ne 2
.mk
.na
.B O_COMPRESS
.ad
.RS 16n
.rt
conversion compresses
.RE

.sp
.ne 2
.mk
.na
.B O_TAR
.ad
.RS 16n
.rt
conversion archives
.RE

.sp
.ne 2
.mk
.na
.B O_UNCOMPRESS
.ad
.RS 16n
.rt
conversion uncompresses
.RE

.sp
.LP
You can specify more than one option by using "\fB|\fR" to separate
options. For example,
.B O_TAR|O_COMPRESS
specifies that the conversion
archives and compresses.
.sp
.LP
 \fBDescription\fR is a one word description of the conversion that is used in
error messages returned to the FTP client.
.sp
.LP
Lines that begin with a
.B #
sign are treated as comment lines and are
ignored.
.SH EXAMPLES
.LP
.B Example 1
Compressing a Regular File for Transfer
.sp
.LP
The following example specifies a conversion which generates
.B filename.Z
by compressing an existing file
.BR filename .
The
conversion can only be applied to regular files, not directories, and the
absence of
.B T_ASCII
prevents the resulting file from being transferred
in ASCII mode.

.sp
.in +2
.nf
: : :.Z:/usr/bin/compress -c %s:T_REG:O_COMPRESS:COMPRESS
.fi
.in -2

.LP
.B Example 2
Uncompressing and Transferring in ASCII Mode
.sp
.LP
The following example specifies a conversion that takes
.B filename.Z
and uncompresses it to produce
.BR filename ,
which then can be transferred
in ASCII mode.

.sp
.in +2
.nf
:.Z: : :/usr/bin/compress -cd %s:T_REG|T_ASCII:O_UNCOMPRESS:UNCOMPRESS
.fi
.in -2

.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/ftpd/ftpconversions
.ad
.RS 28n
.rt

.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWftpr
.TE

.SH SEE ALSO
.sp
.LP
.BR ldd (1),
.BR in.ftpd (1M),
.BR ftpaccess (4),
.BR xferlog (4),
.BR attributes (5)
