usr/src/man/man4/ftpgroups.4
'\" te
.\" Copyright (C) 2003, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ftpgroups 4 "1 May 2003" "SunOS 5.11" "File Formats"
.SH NAME
ftpgroups \- FTP Server enhanced group access file
.SH SYNOPSIS
.LP
.nf
\fB/etc/ftpd/ftpgroups\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B ftpgroups
file contains the enhanced group access information.
.sp
.LP
After login, if the
.BR ftpaccess (4)
file includes
.IR private
.IR yes ,
the user may use the
.B "SITE GROUP"
and
.BR "SITE GPASS"
commands to specify an enhanced access group and a password for that group.
If the access group name and password are valid, the FTP Server executes
.BR setuid (2)
to make the user a member of the real group listed in the
.B ftpgroups
file.
.sp
.LP
The format for the
.B ftpgroups
file is:
.sp
.in +2
.nf
accessgroup:encrypted_password:real_group_name
.fi
.in -2

.sp
.LP
The fields are defined as follows:
.sp
.ne 2
.mk
.na
.I accessgroup
.ad
.RS 22n
.rt
An arbitrary string of alphanumeric and punctuation characters.
.RE

.sp
.ne 2
.mk
.na
.I encrypted_password
.ad
.RS 22n
.rt
The group password encrypted exactly like in
.BR /etc/shadow .
.RE

.sp
.ne 2
.mk
.na
.I real_group_name
.ad
.RS 22n
.rt
The name of a valid group returned by
.BR getgrnam (3C).
.RE

.sp
.LP
The
.B privatepw
utility is an administrative tool to add, delete and
list enhanced access group information in the
.B ftpgroups
file. See
.BR privatepw (1M).
Lines that begin with a
.B #
sign are treated as
comment lines and are ignored.
.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/ftpd/ftpgroups
.ad
.RS 23n
.rt

.RE

.sp
.ne 2
.mk
.na
.B /etc/ftpd/ftpaccess
.ad
.RS 23n
.rt

.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWftpr
_
Interface StabilityExternal
.TE

.SH SEE ALSO
.sp
.LP
.BR in.ftpd (1M),
.BR privatepw (1M),
.BR setuid (2),
.BR getgrnam (3C),
.BR ftpaccess (4),
.BR group (4),
.BR shadow (4),
.BR attributes (5)
