usr/src/man/man4/ftpgroups.4
'\" te
.\" Copyright (C) 2003, Sun Microsystems, Inc. All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ftpgroups 4 "1 May 2003" "SunOS 5.11" "File Formats"
.SH NAME
ftpgroups \- FTP Server enhanced group access file
.SH SYNOPSIS
.LP
.nf
\fB/etc/ftpd/ftpgroups\fR
.fi

.SH DESCRIPTION
.sp
.LP
The \fBftpgroups\fR file contains the enhanced group access information.
.sp
.LP
After login, if the \fBftpaccess\fR(4) file includes \fIprivate\fR
\fIyes\fR, the user may use the \fBSITE GROUP\fR and \fBSITE GPASS\fR
commands to specify an enhanced access group and a password for that group.
If the access group name and password are valid, the FTP Server executes
\fBsetuid\fR(2) to make the user a member of the real group listed in the
\fBftpgroups\fR file.
.sp
.LP
The format for the \fBftpgroups\fR file is:
.sp
.in +2
.nf
accessgroup:encrypted_password:real_group_name
.fi
.in -2

.sp
.LP
The fields are defined as follows:
.sp
.ne 2
.mk
.na
\fIaccessgroup\fR
.ad
.RS 22n
.rt
An arbitrary string of alphanumeric and punctuation characters.
.RE

.sp
.ne 2
.mk
.na
\fIencrypted_password\fR
.ad
.RS 22n
.rt
The group password encrypted exactly like in \fB/etc/shadow\fR.
.RE

.sp
.ne 2
.mk
.na
\fIreal_group_name\fR
.ad
.RS 22n
.rt
The name of a valid group returned by \fBgetgrnam\fR(3C).
.RE

.sp
.LP
The \fBprivatepw\fR utility is an administrative tool to add, delete and
list enhanced access group information in the \fBftpgroups\fR file. See
\fBprivatepw\fR(1M). Lines that begin with a \fB#\fR sign are treated as
comment lines and are ignored.
.SH FILES
.sp
.ne 2
.mk
.na
\fB/etc/ftpd/ftpgroups\fR
.ad
.RS 23n
.rt

.RE

.sp
.ne 2
.mk
.na
\fB/etc/ftpd/ftpaccess\fR
.ad
.RS 23n
.rt

.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWftpr
_
Interface StabilityExternal
.TE

.SH SEE ALSO
.sp
.LP
\fBin.ftpd\fR(1M), \fBprivatepw\fR(1M), \fBsetuid\fR(2),
\fBgetgrnam\fR(3C), \fBftpaccess\fR(4), \fBgroup\fR(4), \fBshadow\fR(4),
\fBattributes\fR(5)
