usr/src/man/man4/ftpusers.4
'\" te
.\" Copyright (C) 2003, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ftpusers 4 "1 May 2003" "SunOS 5.11" "File Formats"
.SH NAME
ftpusers \- file listing users to be disallowed ftp login privileges
.SH SYNOPSIS
.LP
.nf
\fB/etc/ftpd/ftpusers\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.BR ftpusers " file lists users for whom "
.B ftp
login privileges are
disallowed. Each
.B ftpuser
entry is a single line of the form:
.sp
.in +2
.nf
name
.fi
.in -2

.sp
.LP
where
.B name
is the user's login name.
.sp
.LP
The FTP Server,
.BR in.ftpd (1M),
reads the \fBftpusers\fR file. If the
login name of the user matches one of the entries listed, it rejects the
login attempt.
.sp
.LP
The
.B ftpusers
file has the following default configuration entries:
.sp
.in +2
.nf
root
daemon
bin
sys
adm
lp
uccp
nuucp
smmsp
listen
nobody
noaccess
nobody4
.fi
.in -2

.sp
.LP
These entries match the default instantiated entries from
.BR passwd (4).
The list of default entries typically contains the superuser
.B root
and
other administrative and system application identities.
.sp
.LP
The root entry is included in the
.B ftpusers
file as a security measure
since the default policy is to disallow remote logins for this identity.
This policy is also set in the default value of the
.B CONSOLE
entry in
the
.B /etc/default/login
file. See
.BR login (1).
If you allow
.B root
login privileges by deleting the root entry in
.BR ftpusers ,
you should also modify the security policy in
.B /etc/default/login
to
reflect the site security policy for remote login access by
.BR root .
.sp
.LP
Other default entries are administrative identities that are typically
assumed by system applications but never used for local or remote login, for
example
.B sys
and
.BR nobody .
Since these entries do not have a valid
password field instantiated in
.BR shadow (4),
no login can be performed.
.sp
.LP
If a site adds similar administrative or system application identities in
.BR passwd (4)
and
.BR shadow (4),
for example,
.BR majordomo ,
the site
should consider including them in the
.B ftpusers
file for a consistent
security policy.
.sp
.LP
Lines that begin with
.B #
are treated as comment lines and are
ignored.
.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/ftpd/ftpusers
.ad
.RS 22n
.rt
A file that lists users for whom
.B ftp
login privileges are
disallowed.
.RE

.sp
.ne 2
.mk
.na
.B /etc/ftpusers
.ad
.RS 22n
.rt
See
.BR /etc/ftpd/ftpusers .
This file is deprecated, although its use is
still supported.
.RE

.sp
.ne 2
.mk
.na
.B /etc/default/login
.ad
.RS 22n
.rt

.RE

.sp
.ne 2
.mk
.na
.B /etc/passwd
.ad
.RS 22n
.rt
password file
.RE

.sp
.ne 2
.mk
.na
.B /etc/shadow
.ad
.RS 22n
.rt
shadow password file
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWftpr
_
Interface StabilitySee below.
.TE

.sp
.LP
The interface stability for
.B /etc/ftpd/ftpusers
is Volatile. The
interface stability for
.B /etc/ftpusers
is (Obsolete).
.SH SEE ALSO
.sp
.LP
.BR login (1),
.BR in.ftpd (1M),
.BR ftpaccess (4),
.BR ftphosts (4),
.BR passwd (4),
.BR shadow (4),
.BR attributes (5),
.BR environ (5)
