usr/src/man/man4/group.4
'\" te
.\" Copyright (c) 2008, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" Copyright 1989 AT&T
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH group 4 "27 Aug 2008" "SunOS 5.11" "File Formats"
.SH NAME
group \- group file
.SH DESCRIPTION
.sp
.LP
The
.B group
file is a local source of group information. The
.B group
file can be used in conjunction with other group sources, including the
.B NIS
maps
.B group.byname
and
.BR group.bygid ,
the
.B NIS+
table
.BR group ,
or group information stored on an LDAP server. Programs use the
.BR getgrnam (3C)
routines to access this information.
.sp
.LP
The
.B group
file contains a one-line entry for each group recognized by
the system, of the form:
.sp
.LP
\fIgroupname\fR:\fIpassword\fR: \fIgid\fR:\fIuser-list\fR
.sp
.LP
where
.sp
.ne 2
.mk
.na
.I groupname
.ad
.RS 13n
.rt
The name of the group. A string consisting of lower case alphabetic
characters and numeric characters. Neither a colon
.RB ( : )
nor a NEWLINE
can be part of a
.IR groupname .
The string must be less than
.BR MAXGLEN-1 ,
usually
.BR 8 ,
characters long.
.RE

.sp
.ne 2
.mk
.na
.I gid
.ad
.RS 13n
.rt
The group's unique numerical ID (GID) within the system.
.RE

.sp
.ne 2
.mk
.na
.I user-list
.ad
.RS 13n
.rt
A comma-separated list of users allowed in the group.
.RE

.sp
.LP
The maximum value of the
.I gid
field is 2147483647. To maximize
interoperability and compatibility, administrators are recommended to assign
groups using the range of GIDs below 60000 where possible.
.sp
.LP
If the password field is empty, no password is demanded. During user
identification and authentication, the supplementary group access list is
initialized sequentially from information in this file. If a user is in more
groups than the system is configured for,
.BR {NGROUPS_MAX} ,
a warning will
be given and subsequent group specifications will be ignored.
.sp
.LP
Malformed entries cause routines that read this file to halt, in which case
group assignments specified further along are never made. To prevent this
from happening, use
.BR grpck (1B)
to check the
.B /etc/group
database
from time to time.
.sp
.LP
If the number of characters in an entry exceeds 2047, group maintenance
commands, such as
.BR groupdel (1M)
and \fBgroupmod\fR(1M), fail.
.sp
.LP
Previous releases used a group entry beginning with a
.RB ` + '
(plus sign)
or `\fB\(mi\fR\&' (minus sign) to selectively incorporate entries from a
naming service source (for example, an NIS map or data from an LDAP server)
for group. If still required, this is supported by specifying
.B group:compat
in
.BR nsswitch.conf (4).
The
.B compat
source may not
be supported in future releases. Possible sources are
.B files
followed by
.B ldap
or
.BR nisplus .
This has the effect of incorporating information
from an LDAP server or the entire contents of the
.BR "NIS+ group"
table after the
.B group
file.
.SH EXAMPLES
.LP
.B Example 1
Example
.B group
File.
.sp
.LP
The following is an example of a
.B group
file:

.sp
.in +2
.nf
\fBroot::0:root
stooges:q.mJzTnu8icF.:10:larry,moe,curly\fR
.fi
.in -2
.sp

.sp
.LP
and the sample group entry from
.BR nsswitch.conf :

.sp
.in +2
.nf
\fBgroup: files ldap\fR
.fi
.in -2
.sp

.sp
.LP
With these entries, the group
.B stooges
will have members
.BR larry ,
.BR moe ,
and
.BR curly ,
and all groups listed on the LDAP server are
effectively incorporated after the entry for
.BR stooges .

.sp
.LP
If the
.B group
file was:

.sp
.in +2
.nf
root::0:root
stooges:q.mJzTnu8icF.:10:larry,moe,curly
+:
.fi
.in -2
.sp

.sp
.LP
and the group entry from
.BR nsswitch.conf :

.sp
.in +2
.nf
\fBgroup: compat\fR
.fi
.in -2
.sp

.sp
.LP
all the groups listed in the
.B "NIS group.bygid"
and
.B group.byname
maps would be effectively incorporated after the entry for
stooges.

.SH SEE ALSO
.sp
.LP
.BR groups (1),
.BR grpck (1B),
.BR newgrp (1),
.BR groupadd (1M),
.BR groupdel (1M),
.BR groupmod (1M),
.BR getgrnam (3C),
.BR initgroups (3C),
.BR nsswitch.conf (4),
.BR unistd.h (3HEAD)
.sp
.LP
.I System Administration Guide: Basic Administration
