usr/src/man/man4/gsscred.conf.4
'\" te
.\" Copyright (c) 2004, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH gsscred.conf 4 "17 Mar 2004" "SunOS 5.11" "File Formats"
.SH NAME
gsscred.conf \- Generic Security Services credential configuration file
.SH SYNOPSIS
.LP
.nf
\fB/etc/gss/gsscred.conf\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B gsscred.conf
file contains GSS credential information including
options that can be set by the system administrator.
.sp
.LP
The options that are in this file include:
.sp
.in +2
.nf
SYSLOG_UID_MAPPING=yes
.fi
.in -2

.sp
.LP
If this option is set to
.BR yes ,
GSS cred to Unix cred mapping results
will be logged to
.BR syslog "(3C) at level"
.BR auth.debug .
.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/gss/gsscred.conf
.ad
.RS 25n
.rt
Contains GSS credential information.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityEvolving
.TE

.SH SEE ALSO
.sp
.LP
.BR gsscred (1M),
.BR gssd (1M),
.BR syslog (3C),
.BR krb5.conf (4),
.BR attributes (5),
.BR kerberos (5)
