usr/src/man/man4/hba.conf.4
'\" te
.\" Copyright (c) 2003, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH hba.conf 4 "4 Sep 2003" "SunOS 5.11" "File Formats"
.SH NAME
hba.conf \- configuration file for the HBAAPI library
.SH DESCRIPTION
.sp
.LP
The
.B /etc/hba.conf
file is used to specify the Vendor-Specific
Libraries that are installed on the system. This file is used by the Common
Library to load the individual VSLs when
.BR HBA_LoadLibrary "(3HBAAPI) is"
called. If changes are made to the file while the library is in use, the
library should be freed and reloaded. A version 1 VSL is compatible only
with a version 1 Common Library. A version 2 VSL is compatible with both a
version 1 and a version 2 Common Library.
.sp
.LP
Each VSL entry is a single line of the form:
.sp
.in +2
.nf
"name"	    "library path"
.fi
.in -2

.sp
.LP
where:
.sp
.ne 2
.mk
.na
.I name
.ad
.RS 16n
.rt
is the description of library. The library name should be prepended with
the domain of the manufacturer of the library.
.RE

.sp
.ne 2
.mk
.na
.I library path
.ad
.RS 16n
.rt
is the absolute path to the shared object library file.
.RE

.SH EXAMPLES
.LP
.B Example 1
Contents of \fB/etc/hba.conf\fR
.sp
.in +2
.nf
#
# This file contains names and references to HBA libraries
#
# Format:
#
# <library name>  <library pathname>
#
# The library name should be prepended with the domain of
# the manufacturer or driver author.
com.sun.fchba32		/usr/lib/libsun_fc.so.1
com.sun.fchba64		/usr/lib/sparcv9/libsun_fc.so.1
.fi
.in -2

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityStandard: FC-MI 1.92 (API version 1)
_
T{
Standard: FC-HBA Version 4 (API version 2)
T}
.TE

.SH SEE ALSO
.sp
.LP
.BR HBA_LoadLibrary (3HBAAPI),
.BR libhbaapi (3LIB),
.BR attributes (5)
.SH BUGS
.sp
.LP
The HBAAPI is provided in both 32- and 64-bit versions, but only one
configuration file is specified. As a result, both 32- and 64-bit VSL
libraries must be specified within the same file. When using the 32-bit
Common Library, the 64-bit VSLs will fail to load. When using the 64-bit
Common Library, the 32-bit VSLs will fail to load. These failures are
silently ignored by the Common Library during normal usage, but can result
in warning messages when running client applications in a debugger.
