usr/src/man/man4/inetd.conf.4
'\" te
.\" Copyright 1989 AT&T Copyright (c) 1985 Regents of the University of California. All rights reserved.
.\" The Berkeley software License Agreement specifies the terms and conditions for redistribution.
.\" Copyright (C) 2004, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.TH inetd.conf 4 "17 Dec 2004" "SunOS 5.11" "File Formats"
.SH NAME
inetd.conf \- Internet servers database
.SH SYNOPSIS
.LP
.nf
\fB/etc/inet/inetd.conf\fR
.fi

.LP
.nf
\fB/etc/inetd.conf\fR
.fi

.SH DESCRIPTION
.sp
.LP
In the current release of the Solaris operating system, the \fBinetd.conf\fR
file is no longer directly used to configure
.BR inetd .
The Solaris services
which were formerly configured using this file are now configured in the Service
Management Facility (see
.BR smf (5))
using
.BR inetadm "(1M). Any records"
remaining in this file after installation or upgrade, or later created by
installing additional software, must be converted to
.BR smf (5)
services and
imported into the SMF repository using
.BR inetconv "(1M), otherwise the service"
will not be available.
.sp
.LP
For Solaris operating system releases prior to the current release (such as
Solaris 9), the
.B inetd.conf
file contains the list of servers that
.BR inetd (1M)
invokes when it receives an Internet request over a socket. Each
server entry is composed of a single line of the form:
.sp
.in +2
.nf
\fIservice-name\fR \fIendpoint-type\fR \fIprotocol \fIwait-status\fR \fIuid\fR \fIserver-program\fR \e
\fIserver-arguments\fR
.fi
.in -2
.sp

.sp
.LP
Fields are separated by either SPACE or TAB characters. A `\fB#\fR' (number
sign) indicates the beginning of a comment; characters up to the end of the line
are not interpreted by routines that search this file.
.sp
.ne 2
.mk
.na
.I service-name
.ad
.RS 20n
.rt
The name of a valid service listed in the
.B services
file. For \fBRPC\fR
services, the value of the
.I service-name
field consists of the
.BR RPC
service name or program number, followed by a '\fB/\fR' (slash) and either a
version number or a range of version numbers, for example,
.BR rstatd/2-4 .
.RE

.sp
.ne 2
.mk
.na
.I endpoint-type
.ad
.RS 20n
.rt
Can be one of:
.sp
.ne 2
.mk
.na
.B stream
.ad
.RS 13n
.rt
for a stream socket
.RE

.sp
.ne 2
.mk
.na
.B dgram
.ad
.RS 13n
.rt
for a datagram socket
.RE

.sp
.ne 2
.mk
.na
.B raw
.ad
.RS 13n
.rt
for a raw socket
.RE

.sp
.ne 2
.mk
.na
.B seqpacket
.ad
.RS 13n
.rt
for a sequenced packet socket
.RE

.sp
.ne 2
.mk
.na
.B tli
.ad
.RS 13n
.rt
for all
.B TLI
endpoints
.RE

.RE

.sp
.ne 2
.mk
.na
.I protocol
.ad
.RS 20n
.rt
A recognized protocol listed in the file
.BR /etc/inet/protocols .
For servers
capable of supporting
.B TCP
and
.B UDP
over IPv6, the following protocol
types are also recognized:
.RS +4
.TP
.ie t \(bu
.el o
.B tcp6
.RE
.RS +4
.TP
.ie t \(bu
.el o
.B udp6
.RE
.B tcp6
and
.B udp6
are not official protocols; accordingly, they
are not listed in the
.B /etc/inet/protocols
file.
.sp
Here the
.B inetd
program uses an
.B AF_INET6
type socket endpoint. These
servers can also handle incoming IPv4 client requests in addition to IPv6 client
requests.
.sp
For
.B RPC
services, the field consists of the string
.B rpc
followed by
a '/' (slash) and either a '*' (asterisk), one or more nettypes, one or more
netids, or a combination of nettypes and netids. Whatever the value, it is first
treated as a nettype. If it is not a valid nettype, then it is treated as a
netid. For example,
.B rpc/*
for an
.B RPC
service using all the
transports supported by the system (the list can be found in the
.B /etc/netconfig
file), equivalent to saying \fBrpc/visible rpc/ticots\fR
for an
.B RPC
service using the Connection-Oriented Transport Service.
.RE

.sp
.ne 2
.mk
.na
.I wait-status
.ad
.RS 20n
.rt
This field has values
.B wait
or
.BR nowait .
This entry specifies whether
the server that is invoked by
.B inetd
will take over the listening socket
associated with the service, and whether once launched,
.B inetd
will
.B wait
for that server to exit, if ever, before it resumes listening for new
service requests. The
.I wait-status
for datagram servers must be set to
.BR wait ,
as they are always invoked with the orginal datagram socket that
will participate in delivering the service bound to the specified service. They
do not have separate "listening" and "accepting" sockets. Accordingly, do not
configure
.B UDP
services as
.BR nowait .
This causes a race condition by
which the
.B inetd
program selects on the socket and the server program reads
from the socket. Many server programs will be forked, and performance will be
severely compromised. Connection-oriented services such as
.B TCP
stream
services can be designed to be either
.B wait
or
.B nowait
status.
.RE

.sp
.ne 2
.mk
.na
.I uid
.ad
.RS 20n
.rt
The user
.B ID
under which the server should run. This allows servers to run
with access privileges other than those for root.
.RE

.sp
.ne 2
.mk
.na
.I server-program
.ad
.RS 20n
.rt
Either the pathname of a server program to be invoked by
.B inetd
to perform
the requested service, or the value
.B internal
if
.B inetd
itself
provides the service.
.RE

.sp
.ne 2
.mk
.na
.I server-arguments
.ad
.RS 20n
.rt
If a server must be invoked with command line arguments, the entire command
line (including argument 0) must appear in this field (which consists of all
remaining words in the entry). If the server expects
.B inetd
to pass it the
address of its peer, for compatibility with 4.2BSD executable daemons, then the
first argument to the command should be specified as
.BR %A .
No more than 20
arguments are allowed in this field. The
.B %A
argument is implemented only
for services whose
.I wait-status
value is
.BR nowait .
.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/netconfig
.ad
.RS 23n
.rt
network configuration file
.RE

.sp
.ne 2
.mk
.na
.B /etc/inet/protocols
.ad
.RS 23n
.rt
Internet protocols
.RE

.sp
.ne 2
.mk
.na
.B /etc/inet/services
.ad
.RS 23n
.rt
Internet network services
.RE

.SH SEE ALSO
.sp
.LP
.BR rlogin (1),
.BR rsh (1),
.BR in.tftpd (1M),
.BR inetadm (1M),
.BR inetconv (1M),
.BR inetd (1M),
.BR services (4),
.BR smf (5)
.SH NOTES
.sp
.LP
.B /etc/inet/inetd.conf
is the official SVR4 name of the \fBinetd.conf\fR
file. The symbolic link \fB/etc/inetd.conf\fR exists for \fBBSD\fR
compatibility.
.sp
.LP
This man page describes
.B inetd.conf
as it was supported in Solaris
operating system releases prior to the current release. The services that were
configured by means of
.B inetd.conf
are now configured in the Service
Management Facility (see
.BR smf (5))
using
.BR inetadm (1M).
