usr/src/man/man4/init.d.4
'\" te
.\" Copyright (c) 2000, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH init.d 4 "17 Aug 2005" "SunOS 5.11" "File Formats"
.SH NAME
init.d \- initialization and termination scripts for changing init states
.SH SYNOPSIS
.LP
.nf
\fB/etc/init.d\fR
.fi

.SH DESCRIPTION
.sp
.LP
.B /etc/init.d
is a directory containing initialization and termination
scripts for changing init states. These scripts are linked when appropriate to
files in the
.B rc?.d
directories, where `\fB?\fR' is a single character
corresponding to the init state. See \fBinit\fR(1M) for definitions of the
states.
.sp
.LP
The service management facility (see
.BR smf (5))
is the preferred mechanism
for service initiation and termination. The
.B init.d
and
.BR rc?.d
directories are obsolete, and are provided for compatibility purposes only.
Applications launched from these directories by
.BR svc.startd "(1M) are"
incomplete services, and will not be restarted on failure.
.sp
.LP
File names in \fBrc?.d\fR directories are of the form \fB[SK]nn\fI<init.d
filename>\fR, where
.B S
means start this job,
.B K
means kill this
job, and
.B nn
is the relative sequence number for killing or starting the
job.
.sp
.LP
When entering a state (init S,0,2,3,etc.) the
.B rc[S0-6]
script executes
those scripts in
.B /etc/rc[S0-6].d
that are prefixed with
.B K
followed
by those scripts prefixed with
.BR S .
When executing each script in one of the
.B /etc/rc[S0-6] directories, the /sbin/rc[S0-6]
script passes a single
argument. It passes the argument 'stop' for scripts prefixed with
.B K
and
the argument 'start' for scripts prefixed with
.BR S .
There is no harm in
applying the same sequence number to multiple scripts. In this case the order of
execution is deterministic but unspecified.
.sp
.LP
Guidelines for selecting sequence numbers are provided in
.B README
files
located in the directory associated with that target state. For example,
.BR /etc/rc[S0-6].d/README .
Absence of a
.B README
file indicates that
there are currently no established guidelines.
.sp
.LP
Do not put
.B /etc/init.d
in your
.BR $PATH .
Having this directory in your
.B $PATH
can cause unexpected behavior. The programs in
.B /etc/init.d
are
associated with
.B init
state changes and, under normal circumstances, are
not intended to be invoked from a command line.
.SH EXAMPLES
.LP
.B Example 1
Example of
.BR /sbin/rc2 .
.sp
.LP
When changing to init state 2 (multi-user mode, network resources not
exported),
.B /sbin/rc2
is initiated by the
.BR svc.startd "(1M) process. The"
following steps are performed by
.BR /sbin/rc2 .

.RS +4
.TP
1.
In the directory
.B /etc/rc2.d
are files used to stop processes that should
not be running in state 2. The filenames are prefixed with
.BR K .
Each
.BR K
file in the directory is executed (by
.BR /sbin/rc2 )
in alphanumeric order
when the system enters init state 2. See example below.
.RE
.RS +4
.TP
2.
Also in the
.B rc2.d
directory are files used to start processes that should
be running in state 2. As in Step 1, each
.B S
file is executed.
.RE
.sp
.LP
Assume the file
.B /etc/init.d/netdaemon
is a script that will initiate
networking daemons when given the argument 'start', and will terminate the
daemons if given the argument 'stop'. It is linked to
.BR /etc/rc2.d/S68netdaemon ,
and to
.BR /etc/rc0.d/K67netdaemon .
The file is
executed by
.B "/etc/rc2.d/S68netdaemon start"
when init state 2 is entered and
by
.B "/etc/rc0.d/K67netdaemon stop"
when shutting the system down.

.SH SEE ALSO
.sp
.LP
.BR svcs (1),
.BR init (1M),
.BR svc.startd (1M),
.BR svccfg (1M),
.BR smf (5)
.SH NOTES
.sp
.LP
Solaris now provides an expanded mechanism, which includes automated restart,
for applications historically started via the init script mechanism. The Service
Management Facility (introduced in
.BR smf (5))
is the preferred delivery
mechanism for persistently running applications. Existing
.B init.d
scripts
will, however, continue to be executed according to the rules in this manual
page. The details of execution in relation to managed services are available in
.BR svc.startd (1M).
.sp
.LP
On earlier Solaris releases, a script named with a suffix of '.sh' would be
sourced, allowing scripts to modify the environment of other scripts executed
later. This behavior is no longer supported; for altering the environment in
which services are run, see the
.B setenv
subcommand in \fBsvccfg\fR(1M).
.sp
.LP
.B /sbin/rc2
has references to the obsolescent
.B rc.d
directory. These
references are for compatibility with old
.B INSTALL
scripts. New
.B INSTALL
scripts should use the
.B init.d
directory for related
executables. The same is true for the
.B shutdown.d
directory.
