usr/src/man/man4/ipaddrsel.conf.4
'\" te
.\" Copyright (C) 2003, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ipaddrsel.conf 4 "6 Mar 2003" "SunOS 5.11" "File Formats"
.SH NAME
ipaddrsel.conf \- IPv6 default address selection policy
.SH SYNOPSIS
.LP
.nf
\fB/etc/inet/ipaddrsel.conf\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B ipaddrsel.conf
file contains the IPv6 default address selection
policy table used for IPv6 source address selection and the sorting of
.B AF_INET6
addresses returned from name to address resolution. The
mechanism for loading the file, the file format, and the meaning of the
contents are described in
.BR ipaddrsel (1M).
.SH EXAMPLES
.LP
.B Example 1
Default
.B /etc/inet/ipaddrsel.conf
File
.sp
.LP
The following is the default
.B /etc/inet/ipaddrsel.conf
file:

.sp
.in +2
.nf
#
#ident	"@(#)ipv6das.conf	1.1	02/07/28 SMI"
#
# Copyright 2002 Sun Microsystems, Inc.  All rights reserved.
# Use is subject to license terms.
#
# Prefix                  Precedence Label
::1/128                           50     0
::/0                              40     1
2002::/16                         30     2
::/96                             20     3
::ffff:0.0.0.0/96                 10     4
.fi
.in -2

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsr
_
Interface StabilityEvolving
.TE

.SH SEE ALSO
.sp
.LP
.BR ipaddrsel (1M),
.BR attributes (5)
