usr/src/man/man4/ipnodes.4
'\" te
.\" Copyright (c) 2004, Sun Microsystems, Inc.  All Rights Reserved.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ipnodes 4 "15 Aug 2006" "SunOS 5.11" "File Formats"
.SH NAME
ipnodes \- symbolic link to hosts database
.SH SYNOPSIS
.LP
.nf
\fB/etc/inet/ipnodes\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B ipnodes
file is now a symbolic link to the
.B /etc/hosts
file. See
.BR hosts (4).
In prior releases of the Solaris operating system, \fBipnodes\fR
was a local database distinct from
.BR hosts .
The man page for a given Solaris
release describes the
.B ipnodes
file for that release.
.SH SEE ALSO
.sp
.LP
.BR hosts (4)
