usr/src/man/man4/ipnodes.4
'\" te
.\" Copyright (c) 2004, Sun Microsystems, Inc.  All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ipnodes 4 "15 Aug 2006" "SunOS 5.11" "File Formats"
.SH NAME
ipnodes \- symbolic link to hosts database
.SH SYNOPSIS
.LP
.nf
\fB/etc/inet/ipnodes\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B ipnodes
file is now a symbolic link to the
.B /etc/hosts
file. See
.BR hosts (4).
In prior releases of the Solaris operating system,
.B ipnodes
was a local database distinct from
.BR hosts .
The man page for a given Solaris
release describes the
.B ipnodes
file for that release.
.SH SEE ALSO
.sp
.LP
.BR hosts (4)
