usr/src/man/man4/issue.4
'\" te
.\" Copyright 1989 AT&T, Copyright (c) 2002, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH issue 4 "2 Jan 2002" "SunOS 5.11" "File Formats"
.SH NAME
issue \- issue identification file
.SH DESCRIPTION
.sp
.LP
The file
.B /etc/issue
contains the issue or project identification to
be printed as a login prompt.
.B issue
is an ASCII file that is read by
program
.B ttymon
and then written to any terminal spawned or respawned,
prior to the normal prompt.
.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/issue
.ad
.RS 14n
.rt

.RE

.SH SEE ALSO
.sp
.LP
.BR login (1),
.BR ttymon (1M)
