usr/src/man/man4/kadm5.acl.4
'\" te
.\" Copyright (c) 2006 Sun Microsystems, Inc. All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH kadm5.acl 4 "26 Apr 2004" "SunOS 5.11" "File Formats"
.SH NAME
kadm5.acl \- Kerberos access control list (ACL) file
.SH SYNOPSIS
.LP
.nf
\fB/etc/krb5/kadm5.acl\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B ACL
file is used by the
.BR kadmind "(1M) command to determine"
which principals are allowed to perform Kerberos administration actions. For
operations that affect principals, the
.B ACL
file also controls which
principals can operate on which other principals. The location of the
.B ACL
file is determined by the
.B acl_file
configuration variable in
the
.BR kdc.conf (4)
file. The default location is
.BR /etc/krb5/kadm5.acl .
.sp
.LP
For incremental propagation, see \fBkadmind\fR(1M). The ACL file must
contain the
.B kiprop
service principal with propagation privileges in
order for the slave KDC to pull updates from the master's principal
database. Refer to the EXAMPLES section for this case.
.sp
.LP
The
.B ACL
file can contain comment lines, null lines, or lines that
contain
.B ACL
entries. Comment lines start with the pound sign (\fB#\fR)
and continue until the end of the line.
.sp
.LP
The order of entries is significant. The first matching entry specifies the
principal on which the control access applies, whether it is on just the
principal or on the principal when it operates on a target principal.
.sp
.LP
Lines containing
.B ACL
entries must have the following format:
.sp
.in +2
.nf
\fIprincipal\fR \fIoperation-mask\fR [\fIoperation-target\fR]
.fi
.in -2
.sp

.sp
.ne 2
.mk
.na
.I principal
.ad
.RS 20n
.rt
Specifies the principal on which the
.I operation-mask
applies. Can
specify either a partially or fully qualified Kerberos principal name. Each
component of the name can be substituted with a wildcard, using the asterisk
(
.B *
) character.
.RE

.sp
.ne 2
.mk
.na
.I operation-mask
.ad
.RS 20n
.rt
Specifies what operations can or cannot be performed by a principal
matching a particular entry. Specify
.I operation-mask
as one or more
.IR privilege s.
.sp
A
.I privilege
is a string of one or more of the following characters:
.BR a ,
.BR A ,
.BR c ,
.BR C ,
.BR d ,
.BR D ,
.BR i ,
.BR I ,
.BR l ,
.BR L ,
.BR m ,
.BR M ,
.BR p ,
.BR P ,
.BR u ,
.BR U ,
.BR x ,
or
.BR * .
Generally, if the character is lowercase, the privilege
is allowed and if the character is uppercase, the operation is disallowed.
The
.B x
and
.B *
characters are exceptions to the uppercase
convention.
.sp
The following
.IR privilege "s are supported:"
.sp
.ne 2
.mk
.na
.B a
.ad
.RS 5n
.rt
Allows the addition of principals or policies in the database.
.RE

.sp
.ne 2
.mk
.na
.B A
.ad
.RS 5n
.rt
Disallows the addition of principals or policies in the database.
.RE

.sp
.ne 2
.mk
.na
.B c
.ad
.RS 5n
.rt
Allows the changing of passwords for principals in the database.
.RE

.sp
.ne 2
.mk
.na
.B C
.ad
.RS 5n
.rt
Disallows the changing of passwords for principals in the database.
.RE

.sp
.ne 2
.mk
.na
.B d
.ad
.RS 5n
.rt
Allows the deletion of principals or policies in the database.
.RE

.sp
.ne 2
.mk
.na
.B D
.ad
.RS 5n
.rt
Disallows the deletion of principals or policies in the database.
.RE

.sp
.ne 2
.mk
.na
.B i
.ad
.RS 5n
.rt
Allows inquiries to the database.
.RE

.sp
.ne 2
.mk
.na
.B I
.ad
.RS 5n
.rt
Disallows inquiries to the database.
.RE

.sp
.ne 2
.mk
.na
.B l
.ad
.RS 5n
.rt
Allows the listing of principals or policies in the database.
.RE

.sp
.ne 2
.mk
.na
.B L
.ad
.RS 5n
.rt
Disallows the listing of principals or policies in the database.
.RE

.sp
.ne 2
.mk
.na
.B m
.ad
.RS 5n
.rt
Allows the modification of principals or policies in the database.
.RE

.sp
.ne 2
.mk
.na
.B M
.ad
.RS 5n
.rt
Disallows the modification of principals or policies in the database.
.RE

.sp
.ne 2
.mk
.na
.B p
.ad
.RS 5n
.rt
Allow the propagation of the principal database.
.RE

.sp
.ne 2
.mk
.na
.B P
.ad
.RS 5n
.rt
Disallow the propagation of the principal database.
.RE

.sp
.ne 2
.mk
.na
.B u
.ad
.RS 5n
.rt
Allows the creation of one-component user principals whose password can be
validated with PAM.
.RE

.sp
.ne 2
.mk
.na
.B U
.ad
.RS 5n
.rt
Negates the
.B u
privilege.
.RE

.sp
.ne 2
.mk
.na
.B x
.ad
.RS 5n
.rt
Short for specifying privileges \fBa\fR, \fBd\fR,\fBm\fR,\fBc\fR,\fBi\fR,
and
.BR l .
The same as
.BR * .
.RE

.sp
.ne 2
.mk
.na
.B *
.ad
.RS 5n
.rt
Short for specifying privileges \fBa\fR, \fBd\fR,\fBm\fR,\fBc\fR,\fBi\fR,
and
.BR l .
The same as
.BR x .
.RE

.RE

.sp
.ne 2
.mk
.na
.I operation-target
.ad
.RS 20n
.rt
Optional. When specified, the
.I privileges
apply to the
.IR principal
when it operates on the
.IR operation-target .
For the
.IR operation-target ,
you can specify a partially or fully qualified
Kerberos principal name. Each component of the name can be substituted by a
wildcard, using the asterisk (
.B *
) character.
.RE

.SH EXAMPLES
.LP
.B Example 1
Specifying a Standard, Fully Qualified Name
.sp
.LP
The following ACL entry specifies a standard, fully qualified name:

.sp
.in +2
.nf
user/instance@realm adm
.fi
.in -2
.sp

.sp
.LP
The
.I operation-mask
applies only to the
.BR user/instance@realm
principal and specifies that the principal can add, delete, or modify
principals and policies, but it cannot change passwords.

.LP
.B Example 2
Specifying a Standard Fully Qualified Name and Target
.sp
.LP
The following ACL entry specifies a standard, fully qualified name:

.sp
.in +2
.nf
user/instance@realm cim service/instance@realm
.fi
.in -2
.sp

.sp
.LP
The
.I operation-mask
applies only to the
.BR user/instance@realm
principal operating on the
.B service/instance@realm
target, and
specifies that the principal can change the target's password, request
information about the target, and modify it.

.LP
.B Example 3
Specifying a Name Using a Wildcard
.sp
.LP
The following ACL entry specifies a name using a wildcard:

.sp
.in +2
.nf
user/*@realm ac
.fi
.in -2
.sp

.sp
.LP
The
.I operation-mask
applies to all principals in realm
.BR realm
whose first component is
.B user
and specifies that the principals can
add principals and change passwords.

.LP
.B Example 4
Specifying a Name Using a Wildcard and a Target
.sp
.LP
The following ACL entry specifies a name using a wildcard and a target:

.sp
.in +2
.nf
user/*@realm i */instance@realm
.fi
.in -2
.sp

.sp
.LP
The
.I operation-mask
applies to all principals in realm
.BR realm
whose first component is
.B user
and specifies that the principals can
perform inquiries on principals whose second component is
.B instance
and
realm is
.BR realm .

.LP
.B Example 5
Specifying Incremental Propagation Privileges
.sp
.LP
The following ACL entry specifies propagation privileges for the
.B kiprop
service principal:

.sp
.in +2
.nf
kiprop/slavehost@realm p
.fi
.in -2

.sp
.LP
The operation-mask applies to the
.B kiprop
service principal for the
specified slave host
.B slavehost
in realm
.BR realm .
This specifies
that the associated
.B kiprop
service principal can receive incremental
principal updates.

.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/krb5/kdc.conf
.ad
.RS 22n
.rt
KDC configuration information.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWkdcu
_
Interface StabilityEvolving
.TE

.SH SEE ALSO
.sp
.LP
.BR kpasswd (1),
.BR gkadmin (1M),
.BR kadmind (1M),
.BR kadmin.local (1M),
.BR kdb5_util (1M),
.BR kdc.conf (4),
.BR attributes (5),
.BR kerberos (5),
.BR pam_krb5_migrate (5)
