usr/src/man/man4/kdc.conf.4
'\" te
.\" Copyright (c) 2007 Sun Microsystems, Inc. All Rights Reserved.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH kdc.conf 4 "12 Nov 2008" "SunOS 5.11" "File Formats"
.SH NAME
kdc.conf \- Key Distribution Center (KDC) configuration file
.SH SYNOPSIS
.LP
.nf
\fB/etc/krb5/kdc.conf\fR
.fi

.SH DESCRIPTION
.sp
.LP
The \fBkdc.conf\fR file contains \fBKDC\fR configuration information,
including defaults used when issuing Kerberos tickets. This file must reside
on all
.B KDC
servers. After you make any changes to the \fBkdc.conf\fR
file, stop and restart the
.B krb5kdc
daemon on the
.B KDC
for the
changes to take effect.
.sp
.LP
The format of the \fBkdc.conf\fR consists of section headings in square
brackets (\fB[]\fR). Each section contains zero or more configuration
variables (called relations), of the form of:
.sp
.in +2
.nf
\fIrelation\fR = \fIrelation-value\fR
.fi
.in -2
.sp

.sp
.LP
or
.sp
.in +2
.nf
\fIrelation-subsection\fR = {
     \fIrelation\fR = \fIrelation-value\fR
     \fIrelation\fR = \fIrelation-value\fR
     }
.fi
.in -2
.sp

.sp
.LP
The \fBkdc.conf\fR file contains one of more of the following three
sections:
.sp
.ne 2
.mk
.na
\fBkdcdefaults\fR
.ad
.sp .6
.RS 4n
Contains default values for overall behavior of the
.BR KDC .
.RE

.sp
.ne 2
.mk
.na
.B realms
.ad
.sp .6
.RS 4n
Contains subsections for Kerberos realms, where \fIrelation-subsection\fR
is the name of a realm. Each subsection contains relations that define
\fBKDC\fR properties for that particular realm, including where to find the
Kerberos servers for that realm.
.RE

.sp
.ne 2
.mk
.na
.B logging
.ad
.sp .6
.RS 4n
Contains relations that determine how Kerberos programs perform logging.
.RE

.SS "The \fBkdcdefaults\fR Section"
.sp
.LP
The following relation can be defined in the \fB[kdcdefaults]\fR section:
.sp
.ne 2
.mk
.na
.B kdc_ports
.ad
.sp .6
.RS 4n
This relation lists the UDP ports on which the Kerberos server should
listen by default. This list is a comma-separated list of integers. If the
assigned value is 0, the Kerberos server does not listen on any UDP port. If
this relation is not specified, the Kerberos server listens on port
\fB750\fR and port
.BR 88 .
.RE

.sp
.ne 2
.mk
.na
.B kdc_tcp_ports
.ad
.sp .6
.RS 4n
This relation lists the TCP ports on which the Kerberos server should
listen by default. This list is a comma-separated list of integers. If the
assigned value is 0, the Kerberos server does not listen on any TCP port. If
this relation is not specified, the Kerberos server listens on the \fBkdc\fR
TCP port specified in
.BR /etc/services .
If this port is not found in
\fB/etc/services\fR the Kerberos server defaults to listen on TCP port 88.
.RE

.sp
.ne 2
.mk
.na
.B kdc_max_tcp_connections
.ad
.sp .6
.RS 4n
This relation controls the maximum number of TCP connections the KDC
allows. The minimum value is 10. If this relation is not specified, the
Kerberos server allows a maximum of 30 TCP connections.
.RE

.SS "The \fBrealms\fR Section"
.sp
.LP
This section contains subsections for Kerberos realms, where
\fIrelation-subsection\fR is the name of a realm. Each subsection contains
relations that define
.B KDC
properties for that particular realm.
.sp
.LP
The following relations can be specified in each subsection:
.sp
.ne 2
.mk
.na
\fBacl_file\fR
.ad
.sp .6
.RS 4n
(string) Location of the Kerberos V5 access control list (\fBACL\fR) file
that
.B kadmin
uses to determine the privileges allowed to each principal
on the database. The default location is
.BR /etc/krb5/kadm5.acl .
.RE

.sp
.ne 2
.mk
.na
.B admin_keytab
.ad
.sp .6
.RS 4n
(string) Location of the
.B keytab
file that
.B kadmin
uses to
authenticate to the database. The default location is
.BR /etc/krb5/kadm5.keytab .
.RE

.sp
.ne 2
.mk
.na
.B database_name
.ad
.sp .6
.RS 4n
(string) Location of the Kerberos database for this realm. The default
location is
.BR /var/krb5/principal .
.RE

.sp
.ne 2
.mk
.na
\fBdefault_principal_expiration\fR
.ad
.sp .6
.RS 4n
(absolute time string) The default expiration date of principals created in
this realm. See the
.B "Time Format"
section in
.BR kinit (1)
for the
valid absolute time formats you can use for
.BR default_principal_expiration .
.RE

.sp
.ne 2
.mk
.na
\fBdefault_principal_flags\fR
.ad
.sp .6
.RS 4n
(flag string) The default attributes of principals created in this realm.
Some of these flags are better to set on an individual principal basis
through the use of the attribute modifiers when using the
.BR kadmin
command to create and modify principals. However, some of these options can
be applied to all principals in the realm by adding them to the list of
flags associated with this relation.
.sp
A "flag string" is a list of one or more of the flags listed below preceded
by a minus (\fB-\fR) or a plus (\fB+\fR) character, indicating that the
option that follows should be enabled or disabled.
.sp
Flags below marked with an asterisk (\fB*\fR) are flags that are best
applied on an individual principal basis through the
.B kadmin
or
\fBgkadmin\fR interface rather than as a blanket attribute to be applied to
all principals.
.sp
.ne 2
.mk
.na
.B postdateable
.ad
.sp .6
.RS 4n
Create postdatable tickets.
.RE

.sp
.ne 2
.mk
.na
\fBforwardable\fR
.ad
.sp .6
.RS 4n
Create forwardable tickets.
.RE

.sp
.ne 2
.mk
.na
.B tgt-based
.ad
.sp .6
.RS 4n
Allow TGT-based requests.
.RE

.sp
.ne 2
.mk
.na
.B renewable
.ad
.sp .6
.RS 4n
Create Renewable tickets.
.RE

.sp
.ne 2
.mk
.na
.B proxiable
.ad
.sp .6
.RS 4n
Create Proxiable tickets.
.RE

.sp
.ne 2
.mk
.na
.B dup-skey
.ad
.sp .6
.RS 4n
Allow DUP_SKEY requests, this enables user-to-user authentication.
.RE

.sp
.ne 2
.mk
.na
.B preauth
.ad
.sp .6
.RS 4n
Require the use of pre-authentication data whenever principals request
TGTs.
.RE

.sp
.ne 2
.mk
.na
.B hwauth
.ad
.sp .6
.RS 4n
Require the use of hardware-based pre-authentication data whenever
principals request TGTs.
.RE

.sp
.ne 2
.mk
.na
.B * allow-tickets
.ad
.sp .6
.RS 4n
Allow tickets to be issued for all principals.
.RE

.sp
.ne 2
.mk
.na
.B * pwdchange
.ad
.sp .6
.RS 4n
Require principal's to change their password.
.RE

.sp
.ne 2
.mk
.na
.B * service
.ad
.sp .6
.RS 4n
Enable or disable a service.
.RE

.sp
.ne 2
.mk
.na
.B * pwservice
.ad
.sp .6
.RS 4n
Mark principals as password changing principals.
.RE

An example of \fBdefault_principal_flags\fR is shown in EXAMPLES, below.
.RE

.sp
.ne 2
.mk
.na
\fBdict_file\fR
.ad
.sp .6
.RS 4n
(string) Location of the dictionary file containing strings that are not
allowed as passwords. A principal with any password policy is not allowed to
select a password in the dictionary. The default location is
.BR /var/krb5/kadm5.dict .
.RE

.sp
.ne 2
.mk
.na
.B kadmind_port
.ad
.sp .6
.RS 4n
(port number) The port that the
.B kadmind
daemon is to listen on for
this realm. The assigned port for
.B kadmind
is 749.
.RE

.sp
.ne 2
.mk
.na
\fBkey_stash_file\fR
.ad
.sp .6
.RS 4n
(string) Location where the master key has been stored (by \fBkdb5_util
stash\fR). The default location is \fB/var/krb5/.k5.\fIrealm\fR, where
\fIrealm\fR is the Kerberos realm.
.RE

.sp
.ne 2
.mk
.na
.B kdc_ports
.ad
.sp .6
.RS 4n
(string) The list of UDP ports that the
.B KDC
listens on for this
realm. By default, the value of
.B kdc_ports
as specified in the
\fB[kdcdefaults]\fR section is used.
.RE

.sp
.ne 2
.mk
.na
.B kdc_tcp_ports
.ad
.sp .6
.RS 4n
(string) The list of TCP ports that the KDC listens on (in addition to the
UDP ports specified by
.BR kdc_ports )
for this realm. By default, the
value of \fBkdc_tcp_ports\fR as specified in the \fB[kdcdefaults]\fR section
is used.
.RE

.sp
.ne 2
.mk
.na
.B master_key_name
.ad
.sp .6
.RS 4n
(string) The name of the master key.
.RE

.sp
.ne 2
.mk
.na
.B master_key_type
.ad
.sp .6
.RS 4n
(key type string) The master key's key type. This is used to determine the
type of encryption that encrypts the entries in the principal db.
.BR des-cbc-crc ,
.BR des3-cbc-md5 ,
.BR des3-cbc-sha1-kd ,
\fBarcfour-hmac-md5\fR, \fBarcfour-hmac-md5-exp\fR,
.BR aes128-cts-hmac-sha1-96 ,
and
.B aes256-cts-hmac-sha1-96
are
supported at this time (\fBdes-cbc-crc\fR is the default). If you set this
to
.B des3-cbc-sha1-kd
all systems that receive copies of the principal
db, such as those running slave KDC's, must support
.BR des3-cbc-sha1-kd .
.RE

.sp
.ne 2
.mk
.na
\fBmax_life\fR
.ad
.sp .6
.RS 4n
(delta time string) The maximum time period for which a ticket is valid in
this realm. See the
.B "Time Format"
section in
.BR kinit (1)
for
the valid time duration formats you can use for
.BR max_life .
.RE

.sp
.ne 2
.mk
.na
\fBmax_renewable_life\fR
.ad
.sp .6
.RS 4n
(delta time string) The maximum time period during which a valid ticket can
be renewed in this realm. See the
.B "Time Format"
section in
.BR kinit (1)
for the valid time duration formats you can use for
.BR max_renewable_life .
.RE

.sp
.ne 2
.mk
.na
\fBsunw_dbprop_enable = [true | false]\fR
.ad
.sp .6
.RS 4n
Enable or disable incremental database propagation. Default is
.BR false .
.RE

.sp
.ne 2
.mk
.na
.B sunw_dbprop_master_ulogsize = N
.ad
.sp .6
.RS 4n
Specifies the maximum number of log entries available for incremental
propagation to the slave KDC servers. The maximum value that this can be is
2500 entries. Default value is 1000 entries.
.RE

.sp
.ne 2
.mk
.na
\fBsunw_dbprop_slave_poll = N[s, m, h]\fR
.ad
.sp .6
.RS 4n
Specifies how often the slave KDC polls for new updates that the master
might have. Default is
.B 2m
(two minutes).
.RE

.sp
.ne 2
.mk
.na
.B supported_enctypes
.ad
.sp .6
.RS 4n
List of \fBkey\fR/\fBsalt\fR strings. The default \fBkey\fR/\fBsalt\fR
combinations of principals for this realm. The
.B key
is separated from
the
.B salt
by a colon (\fB:\fR) or period (\fB\&.\fR). Multiple
\fBkey\fR/\fBsalt\fR strings can be used by separating each string with a
space. The
.B salt
is additional information encoded within the key that
tells what kind of key it is. Only the
.B "normal salt"
is supported
at this time, for example,
.BR des-cbc-crc:normal .
If this relation is not
specified, the default setting is:
.sp
.in +2
.nf
aes256-cts-hmac-sha1-96:normal \e \fI(see note below)\fR
aes128-cts-hmac-sha1-96:normal \e
des3-cbc-sha1-kd:normal \e
arcfour-hmac-md5:normal \e
des-cbc-md5:normal
.fi
.in -2

.LP
Note -
.sp
.RS 2
The unbundled Strong Cryptographic packages must be installed for the
\fBaes256-cts-hmac-sha1-96:normal enctype\fR to be available for
Kerberos.
.RE
.RE

.sp
.ne 2
.mk
.na
.B reject_bad_transit
.ad
.sp .6
.RS 4n
This boolean specifies whether the list of transited realms for cross-realm
tickets should be checked against the transit path computed from the realm
names and the
.B [capaths]
section of its
.BR krb5.conf (4)
file.
.sp
The default for
.B reject_bad_transit
is
.BR true .
.RE

.SS "The \fBlogging\fR Section"
.sp
.LP
This section indicates how Kerberos programs perform logging. The same
relation can be repeated if you want to assign it multiple logging methods.
The following relations can be defined in the
.B [logging]
section:
.sp
.ne 2
.mk
.na
.B kdc
.ad
.sp .6
.RS 4n
Specifies how the
.B KDC
is to perform its logging. The default is
.BR FILE:/var/krb5/kdc.log .
.RE

.sp
.ne 2
.mk
.na
.B admin_server
.ad
.sp .6
.RS 4n
Specifies how the administration server is to perform its logging. The
default is
.BR FILE:/var/krb5/kadmin.log .
.RE

.sp
.ne 2
.mk
.na
\fBdefault\fR
.ad
.sp .6
.RS 4n
Specifies how to perform logging in the absence of explicit
specifications.
.RE

.sp
.LP
The
.B [logging]
relations can have the following values:
.sp
.LP
\fBFILE:\fIfilename\fR
.sp
.LP
or
.sp
.ne 2
.mk
.na
\fBFILE=\fIfilename\fR
.ad
.sp .6
.RS 4n
This value causes the entity's logging messages to go to the specified
file. If the `=' form is used, the file is overwritten. If the `:' form is
used, the file is appended to.
.RE

.sp
.ne 2
.mk
.na
.B STDERR
.ad
.sp .6
.RS 4n
This value sends the entity's logging messages to its standard error
stream.
.RE

.sp
.ne 2
.mk
.na
.B CONSOLE
.ad
.sp .6
.RS 4n
This value sends the entity's logging messages to the console, if the
system supports it.
.RE

.sp
.ne 2
.mk
.na
\fBDEVICE=\fIdevicename\fR
.ad
.sp .6
.RS 4n
This sends the entity's logging messages to the specified device.
.RE

.sp
.ne 2
.mk
.na
\fBSYSLOG[:\fIseverity\fB[:\fIfacility\fB]]\fR
.ad
.sp .6
.RS 4n
This sends the entity's logging messages to the system log.
.sp
The
.I severity
argument specifies the default severity of system log
messages. This default can be any of the following severities supported by
the \fBsyslog\fR(3C) call, minus the \fBLOG_\fR prefix:
.BR LOG_EMERG ,
.BR LOG_ALERT ,
.BR LOG_CRIT ,
.BR LOG_ERR ,
.BR LOG_WARNING ,
.BR LOG_NOTICE ,
.BR LOG_INFO ,
and
.BR LOG_DEBUG .
For example, a value
of
.B CRIT
would specify
.B LOG_CRIT
severity.
.sp
The \fIfacility\fR argument specifies the facility under which the messages
are logged. This can be any of the following facilities supported by the
.BR syslog (3C)
call minus the
.B LOG_
prefix:
.BR LOG_KERN ,
.BR LOG_USER ,
.BR LOG_MAIL ,
.BR LOG_DAEMON ,
.BR LOG_AUTH ,
.BR LOG_LPR ,
.BR LOG_NEWS ,
.BR LOG_UUCP ,
.BR LOG_CRON ,
and
\fBLOG_LOCAL0\fR through
.BR LOG_LOCAL7 .
.sp
If no severity is specified, the default is
.BR ERR .
If no facility is
specified, the default is
.BR AUTH .
.sp
In the following example, the logging messages from the
.B KDC
go to the
console and to the system log under the facility
.B LOG_DAEMON
with
default severity of
.BR LOG_INFO ;
the logging messages from the
administration server are appended to the
.B /var/krb5/kadmin.log
file
and sent to the
.B /dev/tty04
device.
.sp
.in +2
.nf
[logging]
kdc = CONSOLE
kdc = SYSLOG:INFO:DAEMON
admin_server = FILE:/export/logging/kadmin.log
admin_server = DEVICE=/dev/tty04
.fi
.in -2
.sp

.RE

.SS "PKINIT-specific Options"
.sp
.LP
The following are \fBpkinit-specific\fR options. These values can be
specified in \fB[kdcdefaults]\fR as global defaults, or within a
realm-specific subsection of
.BR [realms] .
A realm-specific value
overrides, does not add to, a generic \fB[kdcdefaults]\fR specification. The
search order is
.RS +4
.TP
1.
realm-specific subsection of \fB[realms]\fR
.sp
.ne 2
.mk
.na
\fB[realms]\fR
.ad
.RS 12n
.rt
.sp
.in +2
.nf
[realms]
    EXAMPLE.COM = {
         pkinit_anchors = FILE:/usr/local/example.com.crt
    }
.fi
.in -2

.RE

.RE
.RS +4
.TP
2.
generic value in the \fB[kdcdefaults]\fR section
.sp
.in +2
.nf
[kdcdefaults]
    pkinit_anchors = DIR:/usr/local/generic_trusted_cas/
.fi
.in -2

.RE
.sp
.ne 2
.mk
.na
\fBpkinit_identity =\fR \fIURI\fR
.ad
.RS 25n
.rt
Specifies the location of the KDC's X.509 identity information. This option
is required if
.B pkinit
is supported by the KDC. Valid
.I URI
types
are
.BR FILE ,
.BR DIR ,
.BR PKCS11 ,
.BR PKCS12 ,
and
.BR ENV .
See
the
.B "PKINIT URI Types"
section for more details.
.RE

.sp
.ne 2
.mk
.na
\fBpkinit_anchors =\fR \fIURI\fR
.ad
.RS 25n
.rt
Specifies the location of trusted anchor (root) certificates which the KDC
trusts to sign client certificates. This option is required if \fBpkinit\fR
is supported by the KDC. This option can be specified multiple times. Valid
\fIURI\fR types are \fBFILE\fR and
.BR DIR .
See the
.BR "PKINIT URI Types"
section for details.
.RE

.sp
.ne 2
.mk
.na
.B pkinit_pool
.ad
.RS 25n
.rt
Specifies the location of intermediate certificates which can be used by
the KDC to complete the trust chain between a client's certificate and a
trusted anchor. This option can be specified multiple times. Valid \fIURI\fR
types are
.B FILE
and
.BR DIR .
See the
.B "PKINIT URI Types"
section
for more details.
.RE

.sp
.ne 2
.mk
.na
.B pkinit_revoke
.ad
.RS 25n
.rt
Specifies the location of Certificate Revocation List (CRL) information to
be used by the KDC when verifying the validity of client certificates. This
option can be specified multiple times. The default certificate verification
process always checks the available revocation information to see if a
certificate has been revoked. If a match is found for the certificate in a
CRL, verification fails. If the certificate being verified is not listed in
a CRL, or there is no CRL present for its issuing CA, and
\fBpkinit_require_crl_checking\fR is
.BR false ,
then verification
succeeds. The only valid
.I URI
types is
.BR DIR .
See the \fBPKINIT URI
Types\fR section for more details. If
.B pkinit_require_crl_checking
is
\fBtrue\fR and there is no CRL information available for the issuing CA,
verification fails.
.B pkinit_require_crl_checking
should be set to
\fBtrue\fR if the policy is such that up-to-date CRLs must be present for
every CA.
.RE

.sp
.ne 2
.mk
.na
.B pkinit_dh_min_bits
.ad
.RS 25n
.rt
Specifies the minimum number of bits the KDC is willing to accept for a
client's Diffie-Hellman key.
.RE

.sp
.ne 2
.mk
.na
.B pkinit_allow_upn
.ad
.RS 25n
.rt
Specifies that the KDC is willing to accept client certificates with the
Microsoft UserPrincipalName (UPN) Subject Alternative Name (SAN). This means
the KDC accepts the binding of the UPN in the certificate to the Kerberos
principal name.
.sp
The default is
.BR false .
.sp
Without this option, the KDC only accepts certificates with the
\fBid-pkinit-san\fR as defined in RFC4556. There is currently no option to
disable SAN checking in the KDC.
.RE

.sp
.ne 2
.mk
.na
.B pkinit_eku_checking
.ad
.RS 25n
.rt
This option specifies what Extended Key Usage (EKU) values the KDC is
willing to accept in client certificates. The values recognized in the
\fBkdc.conf\fR file are:
.sp
.ne 2
.mk
.na
.B kpClientAuth
.ad
.RS 16n
.rt
This is the default value and specifies that client certificates must have
the
.B "id-pkinit-KPClientAuth EKU"
as defined in RFC4556.
.RE

.sp
.ne 2
.mk
.na
.B scLogin
.ad
.RS 16n
.rt
If
.B scLogin
is specified, client certificates with the Microsoft Smart
Card Login EKU (\fBid-ms-kp-sc-logon\fR) is accepted.
.RE

.RE

.SS "PKINIT URI Types"
.sp
.ne 2
.mk
.na
\fBFILE:\fIfile-name\fR[\fI,key-file-name\fR]\fR
.ad
.sp .6
.RS 4n
This option has context-specific behavior.
.sp
.ne 2
.mk
.na
.B pkinit_identity
.ad
.RS 19n
.rt
\fIfile-name\fR specifies the name of a PEM-format file containing the
user's certificate. If \fIkey-file-name\fR is not specified, the user's
private key is expected to be in \fIfile-name\fR as well. Otherwise,
\fIkey-file-name\fR is the name of the file containing the private key.
.RE

.sp
.ne 2
.mk
.na
.B pkinit_anchors
.ad
.br
.na
.B pkinit_pool
.ad
.RS 19n
.rt
\fIfile-name\fR is assumed to be the name of an OpenSSL-style ca-bundle
file. The
.I ca-bundle
file should be base-64 encoded.
.RE

.RE

.sp
.ne 2
.mk
.na
\fBDIR:\fIdirectory-name\fR
.ad
.sp .6
.RS 4n
This option has context-specific behavior.
.sp
.ne 2
.mk
.na
.B pkinit_identity
.ad
.RS 19n
.rt
\fIdirectory-name\fR specifies a directory with files named \fB*.crt\fR and
.BR *.key ,
where the first part of the file name is the same for matching
pairs of certificate and private key files. When a file with a name ending
with \fB\&.crt\fR is found, a matching file ending with .\fBkey\fR is
assumed to contain the private key. If no such file is found, then the
certificate in the \fB\&.crt\fR is not used.
.RE

.sp
.ne 2
.mk
.na
.B pkinit_anchors
.ad
.br
.na
.B pkinit_pool
.ad
.RS 19n
.rt
\fIdirectory-name\fR is assumed to be an OpenSSL-style hashed CA directory
where each CA cert is stored in a file named \fBhash-of-ca-cert.\fI#\fR.
This infrastructure is encouraged, but all files in the directory is
examined and if they contain certificates (in PEM format), they are used.
.RE

.sp
.ne 2
.mk
.na
.B pkinit_revoke
.ad
.RS 19n
.rt
\fIdirectory-name\fR is assumed to be an OpenSSL-style hashed CA directory
where each revocation list is stored in a file named
\fBhash-of-ca-cert.r\fI#\fR. This infrastructure is encouraged, but all
files in the directory is examined and if they contain a revocation list (in
PEM format), they are used.
.RE

.RE

.sp
.ne 2
.mk
.na
\fBPKCS12:pkcs12-file-name\fR
.ad
.sp .6
.RS 4n
\fBpkcs12-file-name\fR is the name of a PKCS #12 format file, containing
the user's certificate and private key.
.RE

.sp
.ne 2
.mk
.na
\fBPKCS11:[slotid=\fIslot-id\fR][:token=\fItoken-label\fR][:certid=\fIcert-id\fR][:certlabel=\fIcert-label\fR]\fR
.ad
.sp .6
.RS 4n
All keyword/values are optional. PKCS11 modules (for example,
.BR opensc-pkcs11.so )
must be installed as a crypto provider under
.BR libpkcs11 (3LIB).
\fBslotid=\fR and/or \fBtoken=\fR can be specified to
force the use of a particular smard card reader or token if there is more
than one available.
.B certid=
and/or
.B certlabel=
can be specified
to force the selection of a particular certificate on the device. See the
\fBpkinit_cert_match\fR configuration option for more ways to select a
particular certificate to use for
.BR pkinit .
.RE

.sp
.ne 2
.mk
.na
\fBENV:\fIenvironment-variable-name\fR
.ad
.sp .6
.RS 4n
\fIenvironment-variable-name\fR specifies the name of an environment
variable which has been set to a value conforming to one of the previous
values. For example,
.BR ENV:X509_PROXY ,
where environment variable
\fBX509_PROXY\fR has been set to
.BR FILE:/tmp/my_proxy.pem .
.RE

.SH EXAMPLES
.LP
\fBExample 1\fR Sample \fBkdc.conf\fR File
.sp
.LP
The following is an example of a \fBkdc.conf\fR file:

.sp
.in +2
.nf
[kdcdefaults]
   kdc_ports = 88

[realms]
   ATHENA.MIT.EDU = {
      kadmind_port = 749
      max_life = 10h 0m 0s
      max_renewable_life = 7d 0h 0m 0s
      default_principal_flags = +preauth,+forwardable,-postdateable
      master_key_type = des-cbc-crc
      supported_enctypes = des-cbc-crc:normal
   }

[logging]
   kdc = FILE:/export/logging/kdc.log
   admin_server = FILE:/export/logging/kadmin.log
.fi
.in -2

.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/krb5/kadm5.acl
.ad
.sp .6
.RS 4n
List of principals and their
.B kadmin
administrative privileges.
.RE

.sp
.ne 2
.mk
.na
.B /etc/krb5/kadm5.keytab
.ad
.sp .6
.RS 4n
Keytab for \fBkadmind\fR principals: \fBkadmin\fR/\fIfqdn\fR,
\fBchangepw\fR/\fIfqdn\fR, and \fBkadmin\fR/\fBchangepw\fR.
.RE

.sp
.ne 2
.mk
.na
.B /var/krb5/principal
.ad
.sp .6
.RS 4n
Kerberos principal database.
.RE

.sp
.ne 2
.mk
.na
.B /var/krb5/principal.ulog
.ad
.sp .6
.RS 4n
The update log file for incremental propagation.
.RE

.sp
.ne 2
.mk
.na
.B /var/krb5/kadm5.dict
.ad
.sp .6
.RS 4n
Dictionary of strings explicitly disallowed as passwords.
.RE

.sp
.ne 2
.mk
.na
.B /var/krb5/kdc.log
.ad
.sp .6
.RS 4n
\fBKDC\fR logging file.
.RE

.sp
.ne 2
.mk
.na
.B /var/krb5/kadmin.log
.ad
.sp .6
.RS 4n
Kerberos administration server logging file.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWkdcu
_
Interface StabilitySee below.
.TE

.sp
.LP
All of the keywords, except for the
.B PKINIT
keywords are Committed.
The
.B PKINIT
keywords are Volatile.
.SH SEE ALSO
.sp
.LP
.BR kpasswd (1),
.BR gkadmin (1M),
.BR kadmind (1M),
.BR kadmin.local (1M),
.BR kdb5_util (1M),
.BR kpropd (1M),
.BR libpkcs11 (3LIB),
.BR syslog (3C),
.BR kadm5.acl (4),
.BR krb5.conf (4),
.BR attributes (5),
.BR kerberos (5)
