usr/src/man/man4/ldaptemplates.conf.4
'\" te
.\" Copyright (C) 1990, Regents of the University of Michigan.  All Rights Reserved.
.\" Portions Copyright (C) 1997, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ldaptemplates.conf 4 "9 Jul 2003" "SunOS 5.11" "File Formats"
.SH NAME
ldaptemplates.conf \- configuration file for LDAP display template
routines
.SH SYNOPSIS
.LP
.nf
\fB/etc/opt/SUNWconn/ldap/current/ldaptemplates.conf\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B ldaptemplates.conf
file contains information used by the LDAP
display routines.
.sp
.LP
Blank lines and lines that start with a hash character ('#') are treated as
comments and ignored. Non-comment lines contain one or more tokens. Tokens
are separated by white space, and double quotes can be used to include white
space inside a token.
.sp
.LP
The first non-commment line specifies the version of the template
information and must contain the token
.B Version
followed by an integer
version number. For example,
.sp
.in +2
.nf
Version 1
.fi
.in -2
.sp

.sp
.LP
The current version is
.IR 1 ,
so the above example is always the correct
first line.
.sp
.LP
The remainder of the file consists of one or more display templates. The
first two lines of the display template each contain a single token that
specifies singular and plural names for the template in a user-friendly
format. For example,
.sp
.in +2
.nf
"Person"
"People"
.fi
.in -2
.sp

.sp
.LP
specifies appropriate names for a template designed to display person
information.
.sp
.LP
The next line specifies the name of the icon or similar element that is
associated with this template. For example,
.sp
.in +2
.nf
"person icon"
.fi
.in -2
.sp

.sp
.LP
The next line is a blank-separated list of template options. "" can be used
if no options are desired. Available options are:
.B addable
(it is
appropriate to allow entries of this type to be added),
.B modrdn
(it is
appropriate to offer the
.B "modify rdn"
operation),
.B altview
(this
template is an alternate view of another template). For example,
.sp
.in +2
.nf
"addable" "modrdn"
.fi
.in -2
.sp

.sp
.LP
The next portion of the template is a list of X.500 object classes that is
used to determine whether the template should be used to display a given
entry. The object class information consists of one or more lines, followed
by a terminating line that contains the single token
.BR END .
Each line
contains one or more object class names, all of which must be present in a
directory entry. Multiple lines can be used to associate more than one set
of object classes with a given template. For example,
.sp
.in +2
.nf
emailPerson
orgPerson
END
.fi
.in -2
.sp

.sp
.LP
means that the template is appropriate for display of
.BR emailPerson
entries or
.B orgPerson
entries.
.sp
.LP
The next line after the object class list is the name of the attribute to
authenticate as to make changes (use "" if it is appropriate to authenticate
as the entry itself). For example,
.sp
.in +2
.nf
"owner"
.fi
.in -2
.sp

.sp
.LP
The next line is the default attribute to use when naming a new entry, for
example,
.sp
.in +2
.nf
"cn"
.fi
.in -2
.sp

.sp
.LP
The next line is the distinguished name of the default location under which
new entries are created. For example,
.sp
.in +2
.nf
"o=XYZ, c=US"
.fi
.in -2
.sp

.sp
.LP
The next section is a list of rules used to assign default values to new
entries. The list should be terminated with a line that contains the single
token
.BR END .
Each line in this section should either begin with the
token
.B constant
and be followed by the name of the attribute and a
.RB "constant value to assign, or the line should begin with" " addersdn"
followed by the name of an attribute whose value will be the DN of the
person who has authenticated to add the entry. For example,
.sp
.in +2
.nf
constant	associatedDomain	XYZ.us
addersdn	seeAlso
END
.fi
.in -2
.sp

.sp
.LP
The last portion of the template is a list of items to display. It consists
of one or more lines, followed by a terminating line that contains the
single token
.BR END .
Each line is must begin with the token
.BR samerow
or the token
.BR item
.sp
.LP
It is assumed that each item appears on a row by itself unless it was
preceded by a
.B samerow
line (in which case it should be displayed on
the same line as the previous item, if possible). Lines that begin with
.B samerow
should not have any other tokens on them.
.sp
.LP
Lines that begin with
.B item
must have at least three more tokens on
them: an item type, a label, and an attribute name. Any extra tokens are
taken as extra arguments.
.sp
.LP
The item type token must be one of the following strings:
.sp
.ne 2
.mk
.na
.B cis
.ad
.RS 14n
.rt
case-ignore string attributes
.RE

.sp
.ne 2
.mk
.na
.B mls
.ad
.RS 14n
.rt
multiline string attributes
.RE

.sp
.ne 2
.mk
.na
.B mail
.ad
.RS 14n
.rt
RFC-822 conformant mail address attributes
.RE

.sp
.ne 2
.mk
.na
.B dn
.ad
.RS 14n
.rt
distinguished name pointer attributes
.RE

.sp
.ne 2
.mk
.na
.B bool
.ad
.RS 14n
.rt
Boolean attributes
.RE

.sp
.ne 2
.mk
.na
.B jpeg
.ad
.RS 14n
.rt
JPEG photo attributes
.RE

.sp
.ne 2
.mk
.na
.B jpegbtn
.ad
.RS 14n
.rt
a button that will retrieve and show a JPEG photo attribute
.RE

.sp
.ne 2
.mk
.na
.B fax
.ad
.RS 14n
.rt
FAX T.4 format image attributes
.RE

.sp
.ne 2
.mk
.na
.B faxbtn
.ad
.RS 14n
.rt
a button that will retrieve and show a FAX photo attribute
.RE

.sp
.ne 2
.mk
.na
.B audiobtn
.ad
.RS 14n
.rt
audio attributes
.RE

.sp
.ne 2
.mk
.na
.B time
.ad
.RS 14n
.rt
UTC time attributes
.RE

.sp
.ne 2
.mk
.na
.B date
.ad
.RS 14n
.rt
UTC time attributes where only the date portion should be shown
.RE

.sp
.ne 2
.mk
.na
.B url
.ad
.RS 14n
.rt
labeled Uniform Resource Locator attributes
.RE

.sp
.ne 2
.mk
.na
.B searchact
.ad
.RS 14n
.rt
define an action that will do a directory search for other entries
.RE

.sp
.ne 2
.mk
.na
.B linkact
.ad
.RS 14n
.rt
define an action which is a link to another display template
.RE

.sp
.ne 2
.mk
.na
.B protected
.ad
.RS 14n
.rt
for an encrypted attribute, with values displayed as asterisks
.RE

.sp
.LP
An example of an item line for the drink attribute (displayed with label
"Work Phone"):
.sp
.in +2
.nf
item cis	"Work Phone"	telephoneNumber
.fi
.in -2
.sp

.SH EXAMPLES
.LP
.B Example 1
A Sample Configuration File Containing a Template that
Displays People Entries
.sp
.LP
The following template configuration file contains a templates for display
of people entries.

.sp
.in +2
.nf
    #
    # LDAP display templates
    #
    # Version must be 1 for now
    #
    Version 1
    #
    # Person template
    "Person"
    "People"

    # name of the icon that is associated with this template
    "person icon"

    # blank-separated list of template options ("" for none)
    "addable"

    #
    # objectclass list
    person
    END

    #
    # name of attribute to authenticate as ("" means auth as this entry)
    ""

    #
    # default attribute name to use when forming RDN of a new entry
    #
    "cn"

    #
    # default location when adding new entries (DN; "" means no default)
    "o=XYZ, c=US"

    #
    # rules used to define default values for new entries
    END

    #
    # list of items for display
    item jpegbtn	"View Photo"		jpegPhoto	"Next Photo"
    item audiobtn	"Play Sound"		audio
    item cis	"Also Known As"		cn
    item cis	"Title"			title
    item mls	"Work Address"		postalAddress
    item cis	"Work Phone"		telephoneNumber
    item cis	"Fax Number"		facsimileTelephoneNumber
    item mls	"Home Address"		homePostalAddress
    item cis	"Home Phone"		homePhone
    item cis	"User ID"		uid
    item mail	"E-Mail Address"	mail
    item cis	"Description"		description
    item dn		"See Also"		seeAlso
    END
.fi
.in -2
.sp

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for a description of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWlldap
Stability LevelEvolving
.TE

.SH SEE ALSO
.sp
.LP
.BR ldap_disptmpl (3LDAP),
.BR ldap_entry2text (3LDAP),
.BR attributes (5)
