usr/src/man/man4/logadm.conf.4
'\" te
.\" Copyright (c) 2007, Sun Microsystems, Inc. All Rights Reserved.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH logadm.conf 4 "23 May 2007" "SunOS 5.11" "File Formats"
.SH NAME
logadm.conf \- configuration file for logadm command
.SH SYNOPSIS
.LP
.nf
\fB/etc/logadm.conf\fR
.fi

.SH DESCRIPTION
.sp
.LP
\fB/etc/logadm.conf\fR is the default configuration file for the log
management tool
.BR logadm "(1M). Comments are allowed using the pound"
character (\fB#\fR) and extend to the end of line. Each non-comment line has
the form:
.sp
.in +2
.nf
\fIlogname\fR \fIoptions\fR
.fi
.in -2

.sp
.LP
where
.I logname
is the name of the entry and
.I options
are the
default command line options for the
.B logadm
command. The name of the
entry may be the same as the name of the log file, or a log file name may be
given in the options section of the entry. Long lines may be folded using a
backslash followed by a newline to continue an entry on the next line.
Single or double quotes may be used to protect spaces or alternate-style
quotes in strings.
.sp
.LP
The preferred method for changing \fB/etc/logadm.conf\fR is to use the
.BR -V ,
.BR -w ,
and
.B -r
options to the
.BR logadm "(1M) command,"
which allow you to lookup an entry, write an entry, or remove an entry from
.BR /etc/logadm.conf .
.sp
.LP
A full description of how and when \fB/etc/logadm.conf\fR is used and
sample entries are found in
.BR logadm (1M).
.sp
.LP
By default,
.BR logadm (1M)
works in
.BR GMT .
Therefore, all entries in
\fB/etc/logadm.conf\fR will have a \fBGMT\fR timestamp. Users can use the
\fB-l\fR option to set \fBlogadm\fR to local time.
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsr
_
Interface StabilityEvolving
.TE

.SH SEE ALSO
.sp
.LP
.BR logadm (1M),
.BR attributes (5)
