usr/src/man/man4/loginlog.4
'\" te
.\" Copyright 1989 AT&T
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH loginlog 4 "3 Jul 1990" "SunOS 5.11" "File Formats"
.SH NAME
loginlog \- log of failed login attempts
.SH DESCRIPTION
.sp
.LP
After five unsuccessful login attempts, all the attempts are logged in the
file
.BR /var/adm/loginlog .
This file contains one record for each failed
attempt. Each record contains the login name, tty specification, and time.
.sp
.LP
This is an
.B ASCII
file. Each field within each entry is separated from
the next by a colon. Each entry is separated from the next by a new-line.
.sp
.LP
By default,
.B loginlog
does not exist, so no logging is done. To enable
logging, the log file must be created with read and write permission for
owner only. Owner must be
.B root
and group must be
.BR sys .
.SH FILES
.sp
.ne 2
.mk
.na
.B /var/adm/loginlog
.ad
.RS 21n
.rt

.RE

.SH SEE ALSO
.sp
.LP
.BR login (1),
.BR passwd (1)
