usr/src/man/man4/loginlog.4
'\" te
.\" Copyright 1989 AT&T
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH loginlog 4 "3 Jul 1990" "SunOS 5.11" "File Formats"
.SH NAME
loginlog \- log of failed login attempts
.SH DESCRIPTION
.sp
.LP
After five unsuccessful login attempts, all the attempts are logged in the
file
.BR /var/adm/loginlog .
This file contains one record for each failed
attempt. Each record contains the login name, tty specification, and time.
.sp
.LP
This is an
.B ASCII
file. Each field within each entry is separated from
the next by a colon. Each entry is separated from the next by a new-line.
.sp
.LP
By default,
.B loginlog
does not exist, so no logging is done. To enable
logging, the log file must be created with read and write permission for
owner only. Owner must be
.B root
and group must be
.BR sys .
.SH FILES
.sp
.ne 2
.mk
.na
.B /var/adm/loginlog
.ad
.RS 21n
.rt

.RE

.SH SEE ALSO
.sp
.LP
.BR login (1),
.BR passwd (1)
