usr/src/man/man4/mech.4
'\" te
.\" Copyright 2003 Sun Microsystems, Inc.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH mech 4 "6 Sep 2006" "SunOS 5.11" "File Formats"
.SH NAME
mech, qop \- mechanism and QOP files
.SH SYNOPSIS
.LP
.nf
\fB/etc/gss/mech\fR
\fB/etc/gss/qop\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B /etc/gss/mech
and
.B /etc/gss/qop
files contain tables showing
installed security mechanisms and the Quality of Protection (\fBQOP\fR)
associated with them, respectively. As security mechanisms are installed on
the system, entries are added to these two files. Contents of these files
may be accessed either manually or programmatically. For example, manually
with
.BR cat (1)
or
.BR more (1),
or programmatically with either
.BR rpc_gss_get_mechanisms (3NSL)
or
.BR rpc_gss_get_mech_info (3NSL).
.sp
.LP
The order of entries in the
.B /etc/gss/mech
file is significant: the
order should be from the most preferred to the least preferred mechanisms.
.sp
.LP
The
.B /etc/gss/mech
file contains five fields:
.sp
.ne 2
.mk
.na
.I mechanism name
.ad
.sp .6
.RS 4n
.B ASCII
string representing the mechanism.
.RE

.sp
.ne 2
.mk
.na
.I object identifier
.ad
.sp .6
.RS 4n
.B RPC OID
for this mechanism.
.RE

.sp
.ne 2
.mk
.na
.I shared library
.ad
.sp .6
.RS 4n
Shared library which implements the services provided by this mechanism.
.RE

.sp
.ne 2
.mk
.na
.I kernel module
.ad
.sp .6
.RS 4n
Kernel module which implements the services provided by this mechanism.
.RE

.sp
.ne 2
.mk
.na
.I library options
(optional field)\fR
.ad
.sp .6
.RS 4n
Optional parameters that are interpreted by the individual mechanism with
which they are associated. Specific supported options are described in the
documentation for the individual mechanism, if any. Not all mechanisms have
support for optional parameters.
.I "library options"
must be enclosed in
brackets (\fB[ ]\fR) so they may be differentiated from the optional kernel
module entries.
.RE

.sp
.LP
The
.B /etc/gss/qop
file contains three fields:
.sp
.ne 2
.mk
.na
.I QOP string
.ad
.RS 19n
.rt
Name, in
.BR ASCII ,
of this Quality of Protection.
.RE

.sp
.ne 2
.mk
.na
.I QOP value
.ad
.RS 19n
.rt
Numeric value by which
.B RPC
identifies this
.BR QOP .
.RE

.sp
.ne 2
.mk
.na
.I mechanism name
.ad
.RS 19n
.rt
.B ASCII
string representing the mechanism with which this
.B QOP
is
associated.
.RE

.SH EXAMPLES
.LP
.B Example 1
A Typical Entry in
.BR /etc/gss/mech
.sp
.LP
This is a typical entry in a
.B /etc/gss/mech
file:

.sp
.in +2
.nf
kerberosv5	1.2.840.113554.1.2.2	mech_krb5.so	kmech_krb5
.fi
.in -2
.sp

.LP
.B Example 2
A Typical Entry in
.BR /etc/gss/qop
.sp
.LP
This is a typical entry in a
.B /etc/gss/qop
file:

.sp
.in +2
.nf
GSS_KRB5_CONF_C_QOP_DES	0	kerberosv5
.fi
.in -2
.sp

.SH SEE ALSO
.sp
.LP
.BR rpc (3NSL),
.BR rpc_gss_get_mechanisms (3NSL),
.BR rpc_gss_get_mech_info (3NSL),
.BR rpcsec_gss (3NSL)
.sp
.LP
\fIONC+ Developer\&'s Guide\fR
