usr/src/man/man4/meddb.4
'\" te
.\" Copyright (c) 2001, Sun Microsystems, Inc.  All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH meddb 4 "20 September 2000" "SunOS 5.11" "File Formats"
.SH NAME
meddb \- mediator data file
.SH SYNOPSIS
.LP
.nf
\fB/etc/lvm/meddb\fR
.fi

.SH DESCRIPTION
.sp
.LP
The file
.B /etc/lvm/meddb
is a data file used by
.BR rpc.metamedd (1M)
to store the mediator data used in 2-string HA configurations.
.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/lvm/meddb
.ad
.RS 19n
.rt

.RE

.SH SEE ALSO
.sp
.LP
.BR rpc.metamedd (1M)
.sp
.LP
.I Sun Cluster 3.0 Collection
.sp
.LP
.I Solaris Volume Manager Administration Guide
