usr/src/man/man4/mnttab.4
'\" te
.\" Copyright (c) 2003 Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright 1989 AT&T
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH mnttab 4 "20 Dec 2003" "SunOS 5.11" "File Formats"
.SH NAME
mnttab \- mounted file system table
.SH DESCRIPTION
.sp
.LP
The file
.B /etc/mnttab
is really a file system that provides read-only
access to the table of mounted file systems for the current host.
\fB/etc/mnttab\fR is read by programs using the routines described in
.BR getmntent (3C).
Mounting a file system adds an entry to this table.
Unmounting removes an entry from this table. Remounting a file system causes
the information in the mounted file system table to be updated to reflect
any changes caused by the remount. The list is maintained by the kernel in
order of mount time. That is, the first mounted file system is first in the
list and the most recently mounted file system is last. When mounted on a
mount point the file system appears as a regular file containing the current
\fBmnttab\fR information.
.sp
.LP
Each entry is a line of fields separated by TABs in the form:
.sp
.in +2
.nf
\fIspecial   mount_point   fstype   options   time\fR
.fi
.in -2

.sp
.LP
where:
.sp
.ne 2
.mk
.na
.I special
.ad
.RS 15n
.rt
The name of the resource that has been mounted.
.RE

.sp
.ne 2
.mk
.na
.I mount_point
.ad
.RS 15n
.rt
The pathname of the directory on which the filesystem is mounted.
.RE

.sp
.ne 2
.mk
.na
\fIfstype\fR
.ad
.RS 15n
.rt
The file system type of the mounted file system.
.RE

.sp
.ne 2
.mk
.na
.I options
.ad
.RS 15n
.rt
The mount options. See respective mount file system man page in the See
Also section below.
.RE

.sp
.ne 2
.mk
.na
.I time
.ad
.RS 15n
.rt
The time at which the file system was mounted.
.RE

.sp
.LP
Examples of entries for the
.I special
field include the pathname of a
block-special device, the name of a remote file system in the form of
.IR host:pathname ,
or the name of a
.BR "swap file" ,
for example, a file
made with \fBmkfile\fR(1M).
.SH IOCTLS
.sp
.LP
The following
.BR ioctl (2)
calls are supported:
.sp
.ne 2
.mk
.na
.B MNTIOC_NMNTS
.ad
.RS 21n
.rt
Returns the count of mounted resources in the current snapshot in the
\fBuint32_t\fR pointed to by \fIarg\fR.
.RE

.sp
.ne 2
.mk
.na
.B MNTIOC_GETDEVLIST
.ad
.RS 21n
.rt
Returns an array of
.BR uint32_t "'s that is twice as long as the length"
returned by
.BR MNTIOC_NMNTS .
Each pair of numbers is the major and minor
device number for the file system at the corresponding  line in the current
\fB/etc/mnttab\fR snapshot. \fIarg\fR points to the memory buffer to receive
the device number information.
.RE

.sp
.ne 2
.mk
.na
.B MNTIOC_SETTAG
.ad
.RS 21n
.rt
Sets a tag word into the options list for a mounted file system. A tag is a
notation that will appear in the options string of a mounted file system but
it is not recognized or interpreted by the file system code. \fIarg\fR
points to a filled in
.B mnttagdesc
structure, as shown in the following
example:
.sp
.in +2
.nf
uint_t  mtd_major;  /* major number for mounted fs */
uint_t  mtd_minor;  /* minor number for mounted fs */
char    *mtd_mntpt; /* mount point of file system */
char    *mtd_tag;   /* tag to set/clear */
.fi
.in -2

If the tag already exists then it is marked as set but not re-added. Tags
can be at most
.B MAX_MNTOPT_TAG
long.
.sp
Use of this ioctl is restricted to processes with the
\fB{PRIV_SYS_MOUNT}\fR privilege.
.RE

.sp
.ne 2
.mk
.na
.B MNTIOC_CLRTAG
.ad
.RS 21n
.rt
Marks a tag in the options list for a mounted file system as not set.
\fIarg\fR points to the same structure as
.BR MNTIOC_SETTAG ,
which
identifies the file system and tag to be cleared.
.sp
Use of this ioctl is restricted to processes with the
\fB{PRIV_SYS_MOUNT}\fR privilege.
.RE

.SH ERRORS
.sp
.ne 2
.mk
.na
.B EFAULT
.ad
.RS 16n
.rt
The arg pointer in an
.B "MNTIOC_ ioctl"
call pointed to an inaccessible
memory location or a character pointer in a
.B mnttagdesc
structure
pointed to an inaccessible memory location.
.RE

.sp
.ne 2
.mk
.na
.B EINVAL
.ad
.RS 16n
.rt
The tag specified in a
.B MNTIOC_SETTAG
call already exists as a file
system option, or the tag specified in a
.B MNTIOC_CLRTAG
call does not
exist.
.RE

.sp
.ne 2
.mk
.na
.B ENAMETOOLONG
.ad
.RS 16n
.rt
The tag specified in a
.B MNTIOC_SETTAG
call is too long or the tag
would make the total length of the option string for the mounted file system
too long.
.RE

.sp
.ne 2
.mk
.na
.B EPERM
.ad
.RS 16n
.rt
The calling process does not have
.B {PRIV_SYS_MOUNT}
privilege and
either a
.B MNTIOC_SETTAG
or
.B MNTIOC_CLRTAG
call was made.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/mnttab
.ad
.RS 28n
.rt
Usual mount point for
.B mnttab
file system
.RE

.sp
.ne 2
.mk
.na
.B /usr/include/sys/mntio.h
.ad
.RS 28n
.rt
Header file that contains
.B IOCTL
definitions
.RE

.SH SEE ALSO
.sp
.LP
\fBmkfile\fR(1M), \fBmount_cachefs\fR(1M), \fBmount_hsfs\fR(1M),
\fBmount_nfs\fR(1M), \fBmount_pcfs\fR(1M), \fBmount_ufs\fR(1M),
.BR mount (1M),
.BR ioctl (2),
.BR read (2),
.BR poll (2),
.BR stat (2),
.BR getmntent (3C)
.SH WARNINGS
.sp
.LP
The
.B mnttab
file system provides the previously undocumented
\fBdev=\fIxxx\fR option in the option string for each mounted file
system. This is provided for legacy applications that might have been using
the \fBdev=information\fR option.
.sp
.LP
Using \fBdev=\fIoption\fR in applications is strongly discouraged. The
device number string represents a 32-bit quantity and might not contain
correct information in 64-bit environments.
.sp
.LP
Applications requiring device number information for mounted file systems
should use the \fBgetextmntent\fR(3C) interface, which functions properly in
either 32- or 64-bit environments.
.SH NOTES
.sp
.LP
The snapshot of the
.B mnttab
information is taken any time a
.BR read (2)
is performed at offset
.B 0
(the beginning) of the
\fBmnttab\fR file. The file modification time returned by
.BR stat (2)
for
the
.B mnttab
file is the time of the last change to mounted file system
information. A
.BR poll (2)
system call requesting a
.B POLLRDBAND
event
can be used to block and wait for the system's mounted file system
information to be different from the most recent snapshot since the
\fBmnttab\fR file was opened.
