usr/src/man/man4/mpapi.conf.4
'\" te
.\" Copyright (c) 2004-2006 Storage Networking Industry Association. All Rights Reserved.
.\" Portions Copyright (c) 2007, Sun Microsystems, Inc. All Rights Reserved.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH mpapi.conf 4 "15 Mar 2006" "SunOS 5.11" "File Formats"
.SH NAME
mpapi.conf \- configuration file for libMPAPI
.SH SYNOPSIS
.LP
.nf
/etc/mpapi.conf
.fi

.SH DESCRIPTION
.sp
.LP
The \fB/etc/mpapi.conf\fR file is used to specify the vendor-provided
plugin library that is installed on the system. This file is used by the
.BR libMPAPI (3LIB)
common library to load the individual plugin library
when its interface is called. If changes are made to the file while the
library is in use, the library should be unloaded and reloaded. Addition and
removal of the plugin library should be handled through
.BR MP_RegisterPlugin (3MPAPI)
and
.BR MP_DeregisterPlugin (3MPAPI).
.sp
.LP
Each plugin library entry is a single line of the form:
.sp
.in +2
.nf
"id"        "library file name"
.fi
.in -2
.sp

.sp
.LP
where
.sp
.ne 2
.mk
.na
.B id
.ad
.RS 21n
.rt
The identification of library.  It is the resersed domain name of the
vendor followed by \fB\&.\fR followed by the vendor specific name of the
plugin that uniquiely identifies the plugin library.
.RE

.sp
.ne 2
.mk
.na
\fBlibrary file name\fR
.ad
.RS 21n
.rt
The  shared  object library file in the absolute path format.
.RE

.SH EXAMPLES
.LP
\fBExample 1\fR Example of an \fB/etc/mpapi.conf\fR file
.sp
.in +2
.nf
# This file contains names and references to MP API plugin libraries
#
#  Do NOT manually edit this file
#
# Format:
#
# <library ID>  <library file name>
#
com.sun.mpapi32         /lib/libmpscsi_vhci.so
com.sun.mpapi64         /lib/64/libmpscsi_vhci.so
.fi
.in -2

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWmpapir
_
Interface StabilityT{
Standard: ANSI INCITS 412 Multipath Management API
T}
.TE

.SH SEE ALSO
.sp
.LP
.BR libMPAPI (3LIB),
.BR MP_DeregisterPlugin (3MPAPI),
.BR MP_RegisterPlugin (3MPAPI),
.BR attributes (5)
