usr/src/man/man4/nca.if.4
'\" te
.\" Copyright (C) 2003, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH nca.if 4 "18 Feb 2003" "SunOS 5.11" "File Formats"
.SH NAME
nca.if \- the NCA configuration file that specifies physical interfaces
.SH SYNOPSIS
.LP
.nf
\fB/etc/nca/nca.if\fR
.fi

.SH DESCRIPTION
.sp
.LP
Specify the physical interfaces for which the Solaris Network Cache and
Accelerator ("\fBNCA\fR") feature will be configured in the \fBnca.if\fR
configuration file. List the physical interfaces in the file, one per line.
To configure
.B NCA
to listen on all physical interfaces present on the
system backed by a
.BR hostname.{interface_name} ,
then list only an
asterik ("\fB*\fR") in \fBnca.if\fR.
.sp
.LP
When the
.BR ncakmod (1)
initialization script is invoked during system
boot, it will attempt to configure each physical interface specified in the
.B nca.if
file by using
.BR ncaconfd (1M).
Note that there must be an
accompanying
.B hostname.{interface_name}
file and an entry in
.B /etc/hosts
for the contents of
.BR hostname.{interface_name} .
.sp
.LP
You must reboot in order to implement changes to the
.B nca.if
file.
.SH EXAMPLES
.SS "x86"
.LP
.B Example 1 nca.if
on x86
.sp
.LP
The following is an example of an
.B nca.if
file that would be used on
an x86 system:

.sp
.in +2
.nf
iprb1
iprb6
iprb8
.fi
.in -2

.SS "SPARC"
.LP
.B Example 2 nca.if
on SPARC
.sp
.LP
The following is an example of an
.B nca.if
file that would be used on a
SPARC system:

.sp
.in +2
.nf
hme2
hme3
hme4
.fi
.in -2

.SS "All Platforms"
.LP
.B Example 3
Configuring NCA to Listen on All Physical Interfaces
.sp
.LP
The following example shows the contents of an
.B nca.if
file that would
be used to configure either platform to listen on all physical interfaces
present on the system:

.sp
.in +2
.nf
*
.fi
.in -2

.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/nca/nca.if
.ad
.RS 25n
.rt
Lists the physical interfaces on which
.B NCA
will run.
.RE

.sp
.ne 2
.mk
.na
.B /etc/hostname.{}{0-9}
.ad
.RS 25n
.rt
Lists all physical interfaces configured on the server.
.RE

.sp
.ne 2
.mk
.na
.B /etc/hosts
.ad
.RS 25n
.rt
Lists all host names associated with the server. Entries in this file must
match with entries in
.B /etc/hostname.{}{0-9}
for
.B NCA
to
function.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWncar
_
Interface StabilityEvolving
.TE

.SH SEE ALSO
.sp
.LP
.BR nca (1),
.BR ncab2clf (1),
.BR ncakmod (1),
.BR ifconfig (1M),
.BR ncakmod.conf (4),
.BR ncalogd.conf (4),
.BR attributes (5)
.sp
.LP
.I System Administration Guide: IP Services
