usr/src/man/man4/ncad_addr.4
'\" te
.\" Copyright (C) 2003, Sun Microsystems, Inc. All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ncad_addr 4 "18 Feb 2003" "SunOS 5.11" "File Formats"
.SH NAME
ncad_addr \- name of the Solaris Network Cache and Accelerator (NCA) socket
utility library
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/ncad_addr.so\fR
.fi

.SH DESCRIPTION
.sp
.LP
.B ncad_addr.so
is the Solaris Network Cache and Accelerator (\fBNCA\fR)
socket utility library. Use this library with a web server to avoid support
for the
.B PF_NCA
family type socket. The web server can take advantage
of NCA functionality.
.sp
.LP
Interpose the
.B ncad_addr
interfaces before the interfaces in
.B libsocket
by setting the environment variable
.B LD_PRELOAD
to
.B ncad_addr.so
so that it is preloaded before
.BR libsocket.so.1 .
The
.B ncad_addr.so
interfaces will be interposed only if NCA is enabled. See
.BR ncakmod (1).
.SH EXAMPLES
.LP
.B Example 1
Interposing
.BR ncad_addr
.sp
.LP
Using Bourne shell syntax as an example, set
.B LD_PRELOAD
as shown
below to interpose the
.B ncad_addr
socket utility libary:

.sp
.in +2
.nf
LD_PRELOAD=/usr/lib/ncad_addr.so /usr/bin/httpd
.fi
.in -2

.SH FILES
.sp
.ne 2
.mk
.na
.B /usr/lib/ncad_addr.so
.ad
.RS 25n
.rt
.B ncad_addr
socket utility library shared object
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWncar (32-bit)
_
SUNWncarx (64-bit)
_
Interface StabilityUnstable
.TE

.SH SEE ALSO
.sp
.LP
.BR nca (1),
.BR ncab2clf (1),
.BR ncakmod (1),
.BR socket (3SOCKET),
.BR nca.if (4),
.BR ncakmod.conf (4),
.BR attributes (5)
.SH NOTES
.sp
.LP
Only applications that use the
.B NCA
feature, for example, web servers,
should interpose this library.
