usr/src/man/man4/ncakmod.conf.4
'\" te
.\" Copyright (C) 2001, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ncakmod.conf 4 "28 Sep 2001" "SunOS 5.11" "File Formats"
.SH NAME
ncakmod.conf \- ncakmod configuration file
.SH SYNOPSIS
.LP
.nf
\fB/etc/nca/ncakmod.conf\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B ncakmod.conf
file is used to configure the Solaris Network Cache
and Accelerator ("\fBNCA\fR") kernel module. The file contains two fields,
.B key
and
.BR value .
.sp
.LP
The
.B status
key is used to indicate if the user wants to have
.B NCA
turned on as a feature.  If the value of
.B status
key is
.BR enabled ,
then the
.B NCA
kernel module will be pushed on to the
specified interfaces. If the value of the
.B status
key is
.BR disabled ,
then the
.B NCA
kernel module will not be pushed on to
any interfaces . The default is
.BR disabled .
.sp
.LP
The
.B httpd_door_path
key specifies the path name of the Solaris Door
.B RPC
mechanism that will be used to communicate with the
.BR http
daemon. The default value is
.BR /var/run/nca_httpd_1.door .
.sp
.LP
Use the
.B nca_active
key to indicate whether to allow NCA to actively
open outgoing TCP connections. The default value for
.B nca_active
is
.BR disabled .
If set to
.BR enabled ,
.B ncaconfd
sets up NCA for each
interface and then operates as a daemon, allowing NCA to make outgoing TCP
connections. This functionality is possible only by using the doors
interface to NCA. A web server that uses the sockets interface with
.B PF_NCA
or
.B ncad_addr.so
cannot connect by means of
.BR nca_active .
.sp
.LP
NCA supports the logging of in-kernel cache hits. See
.BR ncalogd.conf (4).
NCA stores logs in a binary format. Use the
.BR ncab2clf (1)
utility to convert the log from a binary format to the
Common Log File format.
.sp
.LP
In order to implement changes to the
.B ncakmod.conf
file, you will need
to reboot.
.SH EXAMPLES
.LP
.B Example 1
A Sample
.B ncakmod.conf
File
.sp
.LP
The following is a sample
.B ncakmod.conf
file:

.sp
.in +2
.nf
#
# NCA Kernel Module Configuration File
#
status=disabled
httpd_door_path=/var/run/nca_httpd_1.door
nca_active=disabled
.fi
.in -2

.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/nca/ncakmod.conf
.ad
.RS 25n
.rt
The NCA kernel module configuration file.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWncar
_
Interface StabilityEvolving
.TE

.SH SEE ALSO
.sp
.LP
.BR nca (1),
.BR ncab2clf (1),
.BR ncakmod (1),
.BR door_create (3C),
.BR nca.if (4),
.BR ncad_addr (4),
.BR ncalogd.conf (4),
.BR attributes (5)
.sp
.LP
.I System Administration Guide: IP Services
