usr/src/man/man4/ncalogd.conf.4
'\" te
.\" Copyright (C) 2002, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ncalogd.conf 4 "22 Jan 2002" "SunOS 5.11" "File Formats"
.SH NAME
ncalogd.conf \- NCA logging configuration file
.SH SYNOPSIS
.LP
.nf
\fB/etc/nca/ncalogd.conf\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B ncalogd.conf
is used to configure Solaris Network Cache and
Accelerator ("\fBNCA\fR") logging. The file contains two fields, \fBkey\fR
and
.BR value .
.sp
.LP
The
.B status
key is used to indicate if the user wants to have
.B NCA
logging turned on. If the value of
.B status
key is
.BR enabled ,
then
.B NCA
logging will be turned on. If the value of the
.B status
key is
.BR disabled ,
then
.B NCA
logging will not be
invoked. The default value is
.BR disabled .
.sp
.LP
The
.B logd_path_name
key specifies the absolute pathname of the log
file. The log file must be a raw device without a filesystem or a file on a
local file system. The default value is
.BR /var/nca/log .
.B logd_path_name
can also contain a whitespace-delimited list of values
for multiple log files to a maximum of 16. If you specify multiple log
files, you must enclose the list in quotation marks ("). With multiple
files,
.B NCA
logging moves to the next file on the list once the file
size specified by
.B logd_file_size
has been reached. When the last file
is full,
.B NCA
logging rotates back to the first file in the list. A
pointer to the current log file is stored in
.BR /var/nca/current .
.sp
.LP
The
.B logd_file_size
key specifies the value of the file size, in
bytes, allowed for each log file specified in by the \fBlogd_path_name\fR
key. The default value is 1000000 bytes.
.sp
.LP
In order to implement changes to the
.B ncalogd.conf
file, you will need
to stop and start NCA logging or reboot.
.sp
.LP
NCA stores logs in a binary format. Use the
.BR ncab2clf (1)
utility to
convert the log from a binary format to the Common Log File format.
.SH EXAMPLES
.LP
.B Example 1
A Sample
.B ncalogd.conf
File
.sp
.LP
The following is a sample
.B ncalogd.conf
file that specifies three log
files:

.sp
.in +2
.nf
#
# NCA Log Daemon Configuration File
#

status=enabled
logd_path_name="/var/nca/log1 /var/nca/log2 /var/nca/log3"
logd_file_size=1000000
.fi
.in -2

.sp
.LP
Note that there is no NCA logging daemon. Logging is performed as one of
the functions of the NCA software.

.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/nca/ncalogd.conf
.ad
.RS 25n
.rt
Lists configuration parameters for
.BR NCA logging.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWncar
_
Interface StabilityEvolving
.TE

.SH SEE ALSO
.sp
.LP
.BR nca (1),
.BR ncab2clf (1),
.BR ncakmod (1),
.BR dd (1M),
.BR door_create (3C),
.BR nca.if (4),
.BR ncakmod.conf (4),
.BR attributes (5)
.sp
.LP
.I System Administration Guide: IP Services
