usr/src/man/man4/ncaport.conf.4
'\" te
.\" Copyright (c) 2001, Sun Microsystems, Inc. All Rights Reserved.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ncaport.conf 4 "30 Jul 2001" "SunOS 5.11" "File Formats"
.SH NAME
ncaport.conf \- ncaport configuration file
.SH SYNOPSIS
.LP
.nf
\fB/etc/nca/ncaport.conf\fR
.fi

.SH DESCRIPTION
.sp
.LP
The \fBncaport.conf\fR file is used to configure the IP addresses and ports
that the Solaris Network Cache and Acceleration (NCA) kernel module
services. The file contains two fields, key and value, in the format of
\fBncaport=\fIipaddress\fR/\fIport\fR. IPv4 addresses must be in the dot
notation \fId\fR.\fId\fR.\fId\fR.\fId\fR. IPv6 addresses must be in one of
the three conventional forms (see \fBinet_pton\fR(3SOCKET)). If an asterisk
(\fB*\fR) is used for an IP address, it is interpreted as \fBINADDR_ANY\fR,
which matches any IP address.
.sp
.LP
A web server uses the environment variable
.B LD_PRELOAD
and the
\fBncaport.conf\fR configuration file to convert an \fBAF_INET\fR socket to
an
.B AF_NCA
socket.
.B LD_PRELOAD
enables the NCA socket utility
library to be loaded before
.BR libsocket.so.1 .
See the
.BR ncad_addr (4)
for details. When a web server issues the
.BR bind (3SOCKET)
system call,
it is intercepted by the interposition library
.BR ncad_addr.so .
If the
bind address is in the \fBncaport.conf\fR file, the
.B AF_INET
socket is
converted to a
.B AF_NCA
socket.
.SH EXAMPLES
.LP
\fBExample 1\fR Sample \fBncaport.conf\fR File
.sp
.LP
The following is a sample \fBncaport.conf\fR file:

.sp
.in +2
.nf
#
# NCA Kernel Module Port Configuration File
#
ncaport=1080:0:0:0:8:800:200C:417A/100
ncaport=192.168.84.71/80
ncaport=*/9000
.fi
.in -2
.sp

.SH SEE ALSO
.sp
.LP
.BR nca (1),
.BR bind (3SOCKET),
.BR inet_pton (3SOCKET),
.BR ncad_addr (4),
.BR attributes (5)
.SH NOTES
.sp
.LP
For those web servers that use
.B AF_NCA
sockets, the NCA port
configuration described here has no effect.
.sp
.LP
NCA does not currently support IPv6. Any IPv6 addresses in the file
\fBncaport.conf\fR are ignored.
