usr/src/man/man4/ndmp.4
'\" te
.\" Copyright (C) 2009, Sun Microsystems, Inc. All Rights Reserved.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ndmp 4 "3 Mar 2009" "SunOS 5.11" "File Formats"
.SH NAME
ndmp \- configuration properties for Solaris Network Data Management
Protocol (NDMP) server
.SH DESCRIPTION
.sp
.LP
The behavior of the Solaris NDMP server is specified by property values
that are stored in the Service Management Facility, \fBsmf\fR(5).
.sp
.LP
An authorized user can use the
.BR ndmpadm "(1M) command to set global"
values for these properties in SMF.
.sp
.LP
You can set the following properties by using the
.BR "ndmpadm set"
command:
.sp
.ne 2
.mk
.na
.B backup-quarantine
.ad
.RS 24n
.rt
Backup the files marked as quarantined by AV. Acceptable values are
\fByes\fR or
.BR no .
The default is
.BR no .
.RE

.sp
.ne 2
.mk
.na
.B dar-support
.ad
.RS 24n
.rt
Set the Direct Access Recovery mode. Acceptable values are
.B yes
or
.BR no .
The default is
.BR no .
.RE

.sp
.ne 2
.mk
.na
.B debug-level
.ad
.RS 24n
.rt
Set the debug level. The debug-level can be set to either
.B 0
(off) or
\fB1\fR (on). The default is \fB0\fR.
.RE

.sp
.ne 2
.mk
.na
.B debug-path
.ad
.RS 24n
.rt
The path to which to save the debug log. The default is \fB/var/ndmp\fR.
.RE

.sp
.ne 2
.mk
.na
.B dump-pathnode
.ad
.RS 24n
.rt
Enable or disable backing up the directories containing modified files or
directories in
.BR dump (1)
backup format. Acceptable values are yes or no.
The default is no.
.RE

.sp
.ne 2
.mk
.na
.B ignore-ctime
.ad
.RS 24n
.rt
Determines whether the change timestamp (\fBctime\fR) of files and
directories is used to determine whether a file should be backed up in level
backup. If this parameter is set to
.BR yes ,
only the modification time
(\fBmtime\fR) of the file or directory determines whether it should be
backed up. Acceptable values are
.B yes
or
.BR no .
The default value is
.BR no .
.RE

.sp
.ne 2
.mk
.na
.B overwrite-quarantine
.ad
.RS 24n
.rt
Restore quarantined files on top of current files if they already exist.
Acceptable values are
.B yes
or
.BR no .
The default value is
.BR no .
.RE

.sp
.ne 2
.mk
.na
.B restore-quarantine
.ad
.RS 24n
.rt
Restore the files that had been marked as quarantined by AV and are backed
up. Acceptable values are yes or no. The default value is no.
.RE

.sp
.ne 2
.mk
.na
.B tar-pathnode
.ad
.RS 24n
.rt
Enable or disable backing up the directories containing modified files or
directories in
.BR tar (1)
backup format. Acceptable values are \fByes\fR
or
.BR no .
The default value is
.BR no .
.RE

.sp
.ne 2
.mk
.na
.B token-maxseq
.ad
.RS 24n
.rt
Set the maximum sequence number for subsequent token-based incremental
backup in NDMP-V4. The default value is
.BR 9 .
There are two limits for
this value: soft-limit, which is
.BR 59 ,
and hard-limit, equal to
.BR 64 .
If the token sequence number, passed by the DMA, is between the
soft and hard limits, a warning message is issued to the DMA. The token
sequence number can never exceed the hard-limit value.
.RE

.sp
.ne 2
.mk
.na
.B version
.ad
.RS 24n
.rt
Set the maximum active NDMP protocol version. Valid values are currently
.BR 2 ,
.BR 3 ,
and
.BR 4 .
The default is
.BR 4 .
.RE

.sp
.LP
The following property can only be set when using the
.BR "ndmpadm enable"
or
.B "ndmpadm disable"
command:
.sp
.ne 2
.mk
.na
.B auth-type
.ad
.RS 13n
.rt
Sets the password encryption type for the authentication of local users.
Valid values are
.B cram-md5
or
.BR cleartext .
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWndmpu, SUNWndmpr
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
.BR dump (1),
.BR tar (1),
.BR ndmpadm (1M),
.BR ndmpd (1M),
.BR attributes (5),
\fBsmf\fR(5)
