usr/src/man/man4/netgroup.4
'\" te
.\" Copyright (C) 2003, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH netgroup 4 "22 Jul 2004" "SunOS 5.11" "File Formats"
.SH NAME
netgroup \- list of network groups
.SH SYNOPSIS
.LP
.nf
\fB/etc/netgroup\fR
.fi

.SH DESCRIPTION
.sp
.LP
A
.B netgroup
defines a network-wide group of hosts and users. Use a
.B netgroup
to restrict access to shared
.B NFS
filesystems and to
restrict remote login and shell access.
.sp
.LP
Network groups are stored in a network information services, such as
.BR LDAP ,
.BR NIS ,
or NIS+, not in a local file.
.sp
.LP
This manual page describes the format for a file that is used to supply
input to a program such as \fBldapaddent\fR(1M) for LDAP,
.BR makedbm (1M)
for NIS, or \fBnisaddent\fR(1M) for NIS+. These programs build maps or
tables used by their corresponding network information services.
.sp
.LP
Each line of the file defines the name and membership of a network group.
The line should have the format:
.sp
.in +2
.nf
\fIgroupname     member\fR...
.fi
.in -2
.sp

.sp
.LP
The items on a line can be separated by a combination of one or more spaces
or tabs.
.sp
.LP
The
.I groupname
is the name of the group being defined. This is
followed by a list of members of the group. Each
.I member
is either
another group name, all of whose members are to be included in the group
being defined, or a triple of the form:
.sp
.in +2
.nf
\fI(hostname,username,domainname)\fR
.fi
.in -2
.sp

.sp
.LP
In each triple, any of the three fields
.IR hostname ,
.IR username ,
and
.IR domainname ,
can be empty. An empty field signifies a wildcard that
matches any value in that field. Thus:
.sp
.in +2
.nf
everything (\|,\|,this.domain)
.fi
.in -2
.sp

.sp
.LP
defines a group named "everything" for the domain "this.domain" to which
every host and user belongs.
.sp
.LP
The
.I domainname
field refers to the domain in which the triple is
valid, not the domain containing the host or user. In fact, applications
using
.B netgroup
generally do not check the
.IR domainname .
Therefore,
using
.sp
.in +2
.nf
(,,domain)
.fi
.in -2
.sp

.sp
.LP
is equivalent to
.sp
.in +2
.nf
(,,)
.fi
.in -2
.sp

.sp
.LP
You can also use netgroups to control
.B NFS
mount access (see
.BR share_nfs (1M))
and to control remote login and shell access (see
.BR hosts.equiv (4)).
You can also use them to control local login access
(see
.BR passwd (4),
.BR shadow (4),
and
.B compat
in
.BR nsswitch.conf (4)).
.sp
.LP
When used for these purposes, a host is considered a member of a
.B netgroup
if the
.B netgroup
contains any triple in which the
.B hostname
field matches the name of the host requesting access and the
.B domainname
field matches the domain of the host controlling access.
.sp
.LP
Similarly, a user is considered a member of a
.B netgroup
if the
.B netgroup
contains any triple in which the
.I username
field matches
the name of the
.B user
requesting access and the
.I domainname
field
matches the domain of the host controlling access.
.sp
.LP
Note that when netgroups are used to control NFS mount access, access is
granted depending only on whether the requesting host is a member of the
.BR netgroup .
Remote login and shell access can be controlled both on the
basis of host and user membership in separate netgroups.
.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/netgroup
.ad
.RS 17n
.rt
Used by a network information service's utility to construct a map or table
that contains
.B netgroup
information. For example,
.BR ldapaddent (1M)
uses
.B /etc/netgroup
to construct an LDAP container.
.RE

.sp
.LP
Note that the netgroup information must always be stored in a network
information service, such as
.BR LDAP ,
.BR NIS ,
or NIS+. The local file
is only used to construct a map or table for the network information
service. It is never consulted directly.
.SH SEE ALSO
.sp
.LP
.BR NIS+ (1),
.BR ldapaddent (1M),
.BR makedbm (1M),
.BR nisaddent (1M),
.BR share_nfs (1M),
.BR innetgr (3C),
.BR hosts (4),
.BR hosts.equiv (4),
.BR nsswitch.conf (4),
.BR passwd (4),
.BR shadow (4)
.SH NOTES
.sp
.LP
.B netgroup
requires a network information service such as
.BR LDAP ,
.BR NIS ,
or NIS+.
.sp
.LP
Applications may make general membership tests using the
.BR innetgr()
function. See
.BR innetgr (3C).
.sp
.LP
Because the "-" character will not match any specific username or hostname,
it is commonly used as a placeholder that will match only wildcarded
membership queries. So, for example:
.sp
.in +2
.nf
onlyhosts	(host1,-,our.domain) (host2,-,our.domain)
onlyusers	(-,john,our.domain) (-,linda,our.domain)
.fi
.in -2
.sp

.sp
.LP
effectively define netgroups containing only hosts and only users,
respectively. Any other string that is guaranteed not to be a legal username
or hostname will also suffice for this purpose.
.sp
.LP
Use of placeholders will improve search performance.
.sp
.LP
When a machine with multiple interfaces and multiple names is defined as a
member of a
.BR netgroup ,
one must list all of the names. See
.BR hosts (4).
A manageable way to do this is to define a
.BR netgroup
containing all of the machine names. For example, for a host "gateway" that
has names "gateway-subnet1" and "gateway-subnet2" one may define the
.BR netgroup :
.sp
.in +2
.nf
gateway (gateway-subnet1,\|,our.domain) (gateway-subnet2,\|,our.domain)
.fi
.in -2
.sp

.sp
.LP
and use this \fBnetgroup\fR "\fBgateway\fR" whenever the host is to be
included in another
.BR netgroup .
