usr/src/man/man4/netid.4
'\" te
.\" Copyright (c) 1994, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" Copyright 1989 AT&T
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH netid 4 "23 May 1994" "SunOS 5.11" "File Formats"
.SH NAME
netid \- netname database
.SH SYNOPSIS
.LP
.nf
\fB/etc/netid\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B netid
file is a local source of information on mappings between
netnames (see
.BR secure_rpc (3NSL))
and user ids or hostnames in the local
domain. The
.B netid
file can be used in conjunction with, or instead of, the
network source:
.B NIS
or
.B NIS+.
The
.B publickey
entry in the
.B nsswitch.conf
(see
.BR nsswitch.conf (4))
file determines which of these
sources will be queried by the system to translate netnames to local user ids
or
hostnames.
.sp
.LP
Each entry in the
.B netid
file is a single line of the form:
.sp
.in +2
.nf
\fInetname uid\fB:\fIgid, gid, gid\|.\|.\|.\fR
.fi
.in -2
.sp

.sp
.LP
or
.sp
.in +2
.nf
\fInetname\fR \fB      0:\fBhostname\fR
.fi
.in -2
.sp

.sp
.LP
The first entry associates a local user id with a netname. The second entry
associates a hostname with a netname.
.sp
.LP
The
.B netid
file field descriptions are as follows:
.sp
.ne 2
.mk
.na
.I netname
.ad
.RS 12n
.rt
The operating system independent network name for the user or host.
.I netname
has one of two formats.  The format used to specify a host is of
the form:
.sp
.BI unix.hostname@ domain
.sp
where
.B hostname
is the name of the host and
.I domain
is the network
domain name.
.sp
The format used to specify a user id is of the form:
.sp
\fBunix.\fIuid\fB@\fIdomain\fR
.sp
where
.I uid
is the numerical id of the user and
.I domain
is the network
domain name.
.RE

.sp
.ne 2
.mk
.na
.I uid
.ad
.RS 12n
.rt
The numerical id of the user (see
.BR passwd (4)).
When specifying a host
name,
.I uid
is always zero.
.RE

.sp
.ne 2
.mk
.na
.I group
.ad
.RS 12n
.rt
The numerical id of the group the user belongs to (see
.BR group (4)).
Several
groups, separated by commas, may be listed for a single
.IR uid .
.RE

.sp
.ne 2
.mk
.na
.B hostname
.ad
.RS 12n
.rt
The local hostname (see
.BR hosts (4)).
.RE

.sp
.LP
Blank lines are ignored.  Any part of a line to the right of a
.RB ` # '
symbol
is treated as a comment.
.SH EXAMPLES
.LP
.B Example 1
A sample
.B netid
file.
.sp
.LP
Here is a sample
.B netid
file:

.sp
.in +2
.nf
unix.789@West.Sun.COM	789:30,65
unix.123@Bldg_xy.Sun.COM	123:20,1521
unix.candlestick@campus1.bayarea.EDU	0:candlestick
.fi
.in -2
.sp

.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/group
.ad
.RS 18n
.rt
groups file
.RE

.sp
.ne 2
.mk
.na
.B /etc/hosts
.ad
.RS 18n
.rt
hosts database
.RE

.sp
.ne 2
.mk
.na
.B /etc/netid
.ad
.RS 18n
.rt
netname database
.RE

.sp
.ne 2
.mk
.na
.B /etc/passwd
.ad
.RS 18n
.rt
password file
.RE

.sp
.ne 2
.mk
.na
.B /etc/publickey
.ad
.RS 18n
.rt
public key database
.RE

.SH SEE ALSO
.sp
.LP
.BR netname2user (3NSL),
.BR secure_rpc (3NSL),
.BR group (4),
.BR hosts (4),
.BR nsswitch.conf (4),
.BR passwd (4),
.BR publickey (4)
