usr/src/man/man4/netrc.4
'\" te
.\" Copyright (c) 2006 Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" Copyright 1989 AT&T
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH netrc 4 "25 Aug 2006" "SunOS 5.11" "File Formats"
.SH NAME
netrc \- file for ftp remote login data
.SH DESCRIPTION
.sp
.LP
The
.B \&.netrc
file contains data for logging in to a remote host over
the network for file transfers by
.BR ftp (1).
This file resides in the
user's home directory on the machine initiating the file transfer. Its
permissions should be set to disallow read access by group and others. See
.BR chmod (1).
.sp
.LP
Tokens can be separated by
.BR SPACE ,
.BR TAB ,
or
.BR NEWLINE
characters. The following tokens are supported:
.sp
.ne 2
.mk
.na
.B account
.I string
.ad
.RS 19n
.rt
Supply an additional account password. If this token is present, the
auto-login process supplies the specified string if the remote server
requires an additional account password. If the remote server does not
require an additional account password, the auto-login process initiates an
.B ACCT
command.
.RE

.sp
.ne 2
.mk
.na
.B default
.ad
.RS 19n
.rt
Same as
.BR machine
.IR name ,
except that default matches any name.
There can be only one
.B default
token, and it must be after all
.B machine
tokens. The
.B default
token is normally used as follows:
.sp
.in +2
.nf
default login anonymous password \fIuser\fR@\fIsite\fR
.fi
.in -2
.sp

Such an entry gives the user automatic anonymous
.B ftp
login to
machines not specified in
.BR \&.netrc .
.RE

.sp
.ne 2
.mk
.na
.B login
.I name
.ad
.RS 19n
.rt
Identify a user on the remote machine. If this token is present, the
auto-login process initiates a login using the specified name.
.RE

.sp
.ne 2
.mk
.na
.B machine
.I name
.ad
.RS 19n
.rt
Identify a remote machine name. The auto-login process searches the
\fB\&.netrc\fR file for a
.B machine
token that matches the remote
machine specified on the
.B ftp
command line or as an
.B open
command
argument. Once a match is made, the subsequent \fB\&.netrc\fR tokens are
processed, stopping when the
.B EOF
is reached or another
.BR machine
token is encountered.
.RE

.sp
.ne 2
.mk
.na
.B macdef
.I name
.ad
.RS 19n
.rt
Define a macro. This token functions the same as
.BR "ftp macdef" .
A
macro is defined with the specified name; its contents begin with the next
\fB\&.netrc\fR line and continue until a null line (consecutive
.B NEWLINE
characters) is encountered. If a macro named
.B init
is
defined, it is automatically executed as the last step in the auto-login
process.
.RE

.sp
.ne 2
.mk
.na
.B password
.I string
.ad
.RS 19n
.rt
Supply a password. If this token is present, the auto-login process
supplies the specified string if the remote server requires a password as
part of the login process. If this token is present in the \fB\&.netrc\fR
file,
.B ftp
aborts the auto-login process if the \fB\&.netrc\fR is
readable by anyone besides the user.
.RE

.sp
.ne 2
.mk
.na
.B skipsyst
.ad
.RS 19n
.rt
Skip the
.B SYST
command that is sent by default to all remote servers
upon connection. The system command is what enables the automatic use of
binary mode rather than the protocol default ascii mode.
.sp
As some older servers cannot handle the
.B ftp
command, this directive
is provided to allow inter-operability with these servers.
.RE

.SH EXAMPLES
.LP
.B Example 1
A Sample \fB\&.netrc\fR File
.sp
.LP
A \fB\&.netrc\fR file containing the following line:

.sp
.in +2
.nf
machine ray login demo password mypassword
.fi
.in -2

.sp
.LP
allows an autologin to the machine
.B ray
using the login name
.B demo
with password
.BR mypassword .

.SH FILES
.sp
.ne 2
.mk
.na
.B ~/.netrc
.ad
.RS 12n
.rt

.RE

.SH SEE ALSO
.sp
.LP
.BR chmod (1),
.BR ftp (1),
.BR in.ftpd (1M)
