usr/src/man/man4/netrc.4
'\" te
.\" Copyright (c) 2006 Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright 1989 AT&T
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH netrc 4 "25 Aug 2006" "SunOS 5.11" "File Formats"
.SH NAME
netrc \- file for ftp remote login data
.SH DESCRIPTION
.sp
.LP
The \fB\&.netrc\fR file contains data for logging in to a remote host over
the network for file transfers by
.BR ftp (1).
This file resides in the
user's home directory on the machine initiating the file transfer. Its
permissions should be set to disallow read access by group and others. See
.BR chmod (1).
.sp
.LP
Tokens can be separated by
.BR SPACE ,
.BR TAB ,
or
.BR NEWLINE
characters. The following tokens are supported:
.sp
.ne 2
.mk
.na
\fBaccount\fR \fIstring\fR
.ad
.RS 19n
.rt
Supply an additional account password. If this token is present, the
auto-login process supplies the specified string if the remote server
requires an additional account password. If the remote server does not
require an additional account password, the auto-login process initiates an
\fBACCT\fR command.
.RE

.sp
.ne 2
.mk
.na
\fBdefault\fR
.ad
.RS 19n
.rt
Same as
.BR machine
.IR name ,
except that default matches any name.
There can be only one \fBdefault\fR token, and it must be after all
\fBmachine\fR tokens. The \fBdefault\fR token is normally used as follows:
.sp
.in +2
.nf
default login anonymous password \fIuser\fR@\fIsite\fR
.fi
.in -2
.sp

Such an entry gives the user automatic anonymous \fBftp\fR login to
machines not specified in
.BR \&.netrc .
.RE

.sp
.ne 2
.mk
.na
\fBlogin\fR \fIname\fR
.ad
.RS 19n
.rt
Identify a user on the remote machine. If this token is present, the
auto-login process initiates a login using the specified name.
.RE

.sp
.ne 2
.mk
.na
\fBmachine\fR \fIname\fR
.ad
.RS 19n
.rt
Identify a remote machine name. The auto-login process searches the
\fB\&.netrc\fR file for a \fBmachine\fR token that matches the remote
machine specified on the \fBftp\fR command line or as an
.B open
command
argument. Once a match is made, the subsequent \fB\&.netrc\fR tokens are
processed, stopping when the
.B EOF
is reached or another
.BR machine
token is encountered.
.RE

.sp
.ne 2
.mk
.na
\fBmacdef\fR \fIname\fR
.ad
.RS 19n
.rt
Define a macro. This token functions the same as
.BR "ftp macdef" .
A
macro is defined with the specified name; its contents begin with the next
\fB\&.netrc\fR line and continue until a null line (consecutive
\fBNEWLINE\fR characters) is encountered. If a macro named \fBinit\fR is
defined, it is automatically executed as the last step in the auto-login
process.
.RE

.sp
.ne 2
.mk
.na
\fBpassword\fR \fIstring\fR
.ad
.RS 19n
.rt
Supply a password. If this token is present, the auto-login process
supplies the specified string if the remote server requires a password as
part of the login process. If this token is present in the \fB\&.netrc\fR
file, \fBftp\fR aborts the auto-login process if the \fB\&.netrc\fR is
readable by anyone besides the user.
.RE

.sp
.ne 2
.mk
.na
.B skipsyst
.ad
.RS 19n
.rt
Skip the
.B SYST
command that is sent by default to all remote servers
upon connection. The system command is what enables the automatic use of
binary mode rather than the protocol default ascii mode.
.sp
As some older servers cannot handle the \fBftp\fR command, this directive
is provided to allow inter-operability with these servers.
.RE

.SH EXAMPLES
.LP
\fBExample 1\fR A Sample \fB\&.netrc\fR File
.sp
.LP
A \fB\&.netrc\fR file containing the following line:

.sp
.in +2
.nf
machine ray login demo password mypassword
.fi
.in -2

.sp
.LP
allows an autologin to the machine
.B ray
using the login name
\fBdemo\fR with password \fBmypassword\fR.

.SH FILES
.sp
.ne 2
.mk
.na
.B ~/.netrc
.ad
.RS 12n
.rt

.RE

.SH SEE ALSO
.sp
.LP
.BR chmod (1),
\fBftp\fR(1), \fBin.ftpd\fR(1M)
