usr/src/man/man4/networks.4
'\" te
.\" Copyright 1989 AT&T
.\" Copyright (C) 2002, Sun Microsystems, Inc. All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH networks 4 "17 Jan 2002" "SunOS 5.11" "File Formats"
.SH NAME
networks \- network name database
.SH SYNOPSIS
.LP
.nf
\fB/etc/inet/networks\fR
.fi

.LP
.nf
\fB/etc/networks\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B networks
file is a local source of information regarding the
networks which comprise the Internet. The networks  file can be used in
conjunction with, or instead of, other networks sources, including the NIS
maps
.B networks.byname
and
.B networks.byaddr
and the NIS+ table
.BR networks .
Programs use the
.BR getnetbyname "(3SOCKET) routines to"
access this information.
.sp
.LP
The network file has a single line for each network, with the following
information:
.sp
.in +2
.nf
\fIofficial-network-name network-number aliases\fR
.fi
.in -2

.sp
.LP
Items are separated by any number of
.B SPACE
or
.B TAB
characters. A
`\fB#\fR' indicates the beginning of a comment. Characters up to the end of
the line are not interpreted by routines which search the file. This file is
normally created from the official network database maintained at the Network
Information Control Center (NIC), though local changes may be required to
bring it up to date regarding unofficial aliases and/or unknown networks.
.sp
.LP
Network numbers may be specified in the conventional dot (`\fB\&.\fR')
notation using the
.B inet_network
routine from the Internet address
manipulation library,
.BR inet (7P).
Network names may contain any printable
character other than a field delimiter,
.BR NEWLINE ,
or comment
character.
.SH SEE ALSO
.sp
.LP
.BR getnetbyaddr (3SOCKET),
.BR getnetbyname (3SOCKET),
.BR inet (3SOCKET),
.BR nsswitch.conf (4),
.BR inet (7P)
.SH NOTES
.sp
.LP
The official SVR4 name of the
.B networks
file is
.BR /etc/inet/networks .
The symbolic link
.B /etc/networks
exists for
\fBBSD\fR compatibility.
.sp
.LP
The network number in
.B networks
database is the host address shifted to
the right by the number of 0 bits in the address mask. For example, for the
address
.B 24.132.47.86
that has a mask of
.BR fffffe00 ,
its network
number is
.BR 803351 .
This is obtained when the address is shifted right by
9 bits. The address maps to
.BR 12.66.23 .
The trailing 0 bits should not be
specified. The network number here is different from that described in
.BR netmasks (4).
For this example, the entry in
.B netmasks
would be
.BR 24.132.46.0	fffffe00 .
