usr/src/man/man4/nfssec.conf.4
'\" te
.\" Copyright (c) 2001 Sun Microsystems, Inc.  All rights reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH nfssec.conf 4 "12 Nov 2001" "SunOS 5.11" "File Formats"
.SH NAME
nfssec.conf \- list NFS security modes
.SH SYNOPSIS
.LP
.nf
\fB/etc/nfssec.conf\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B nfssec.conf
file lists the NFS security modes supported on a
system. These modes are defined in
.BR nfssec (5).
.sp
.LP
The
.B nfssec.conf
file should not be edited by a user.
.SH SEE ALSO
.sp
.LP
.BR nfssec (5)
