usr/src/man/man4/nisfiles.4
'\" te
.\" Copyright (C) 2001, Sun Microsystems, Inc. All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH nisfiles 4 "18 Dec 2001" "SunOS 5.11" "File Formats"
.SH NAME
nisfiles \- NIS+ database files and directory structure
.SH SYNOPSIS
.LP
.nf
\fB/var/nis\fR
.fi

.SH DESCRIPTION
.sp
.LP
The Network Information Service Plus (NIS+) uses a memory based, replicated
database. This database uses a set of files in the
.B /var/nis
directory
for checkpointing to table storage and for maintaining a transaction log.
Additionally, the NIS+ server and client use files in this directory to
store binding and state information.
.sp
.LP
The NIS+ service implements an authentication and authorization system that
is built upon Secure RPC. In this implementation, the service uses a table
named \fBcred.org_dir.\fIdomain-name\fR to store the public and private
keys of principals that are authorized to access the NIS+ namespace. It
stores group access information in the subdomain
\fBgroups_dir.\fIdomain-name\fR as \fIgroup\fR objects. These two tables
appear as files in the
.B /var/nis/data
directory on the NIS+ server.
.sp
.LP
Unlike the previous versions of the network information service, in NIS+,
the information in the tables is initially loaded into the service from the
\fBASCII\fR files on the server and then updated using NIS+ utilities. See
.BR nistbladm (1).
Some sites may wish to periodically regenerate the
\fBASCII\fR files for archival purposes. To do this, a script should be
added in the
.BR crontab (1)
of the server that lists these tables and
creates the
.B " ASCII"
file from the result.
.sp
.LP
Note that except for the
.B NIS_COLDSTART
and
.BR NIS_SHARED_DIRCACHE
file, no other files should be manipulated by commands such as \fBcp\fR(1),
.BR mv (1)
or
.BR rm (1).
The transaction log file keeps logs of all
changes made, and hence the files cannot be manipulated independently.
.sp
.LP
The files described below are stored in the
.B /var/nis
directory:
.sp
.ne 2
.mk
.na
.B NIS_COLDSTART
.ad
.RS 23n
.rt
Contains NIS+ directory objects that are to be preloaded into the NIS+
cache at startup time. This file is usually created at NIS+ installation
time. See \fBnisinit\fR(1M) or \fBnisclient\fR(1M).
.RE

.sp
.ne 2
.mk
.na
.B NIS_SHARED_DIRCACHE
.ad
.RS 23n
.rt
Contains the current cache of NIS+ bindings being maintained by the cache
manager. The contents can be viewed with \fBnisshowcache\fR(1M).
.RE

.sp
.ne 2
.mk
.na
\fBclient_info\fR
.ad
.RS 23n
.rt
Contains configuration information, for example, preferred servers,
options, and the like, for
.BR nis_cachemgr (1M)
and potentially other NIS+
clients on the system. It is manipulated by the \fBnisprefadm\fR(1M)
command.
.RE

.sp
.ne 2
.mk
.na
\fB\&.pref_servers\fR
.ad
.RS 23n
.rt
A cached copy of preferred server information. It is maintained by
.BR nis_cachemgr .
Do not edit this file manually.
.RE

.sp
.ne 2
.mk
.na
.B trans.log
.ad
.RS 23n
.rt
Contains a transaction log that is maintained by the NIS+ service. It can
be viewed using the \fBnislog\fR(1M) command. This file contains holes. Its
apparent size may be a lot higher than its actual size. There is only one
transaction log per server.
.RE

.sp
.ne 2
.mk
.na
.B data.dict
.ad
.RS 23n
.rt
A dictionary that is used by the NIS+ database to locate its files. It is
created by the default NIS+ database package.
.RE

.sp
.ne 2
.mk
.na
.B data.dict.log
.ad
.RS 23n
.rt
The log file for the database dictionary. When the server is checkpointed,
this file will be deleted. See the discussion of the
.B -C
option of
.BR nisping (1M).
.RE

.sp
.ne 2
.mk
.na
.B data
.ad
.RS 23n
.rt
Contains databases that the server uses.
.RE

.sp
.ne 2
.mk
.na
.B data/root.object
.ad
.RS 23n
.rt
On root servers, this file contains a directory object that describes the
root of the name space.
.RE

.sp
.ne 2
.mk
.na
.B data/parent.object
.ad
.RS 23n
.rt
On root servers, this file contains a directory object that describes the
parent namespace. This file is created by the
.BR nisinit (1M)
command.
.RE

.sp
.ne 2
.mk
.na
\fBdata/\fItable_name\fR
.ad
.RS 23n
.rt
For each table in the directory there is a file with the same name that
stores the information about that table. If there are subdirectories within
this directory, the database for the table is stored in the file,
\fItable_name\fR.\fIsubdirectory\fR.
.RE

.sp
.ne 2
.mk
.na
\fBdata/\fItable_name.log\fR
.ad
.RS 23n
.rt
Contains the database log for the table
.IR table_name .
The log file
maintains the state of individual transactions to each database. When a
database has been checkpointed, that is, all changes have been made to the
data/\fItable_name\fR stable storage, this log file will be deleted.
.sp
Currently, NIS+ does not automatically do checkpointing. The system
administrator may want to do \fBnisping\fB-C\fR operations periodically,
perhaps once a day, to checkpoint the log file. This can be done either
through a
.BR cron "(1M) job, or manually."
.RE

.sp
.ne 2
.mk
.na
.B data/root_dir
.ad
.RS 23n
.rt
On root servers, this file stores the database associated with the root
directory. It is similar to other table databases. The corresponding log
file is called
.BR root_dir.log .
.RE

.sp
.ne 2
.mk
.na
.B data/cred.org_dir
.ad
.RS 23n
.rt
Table containing the credentials of principals in this NIS+ domain.
.RE

.sp
.ne 2
.mk
.na
.B data/groups_dir
.ad
.RS 23n
.rt
Table containing the group authorization objects needed by NIS+ to
authorize group access.
.RE

.sp
.ne 2
.mk
.na
.B data/serving_list
.ad
.RS 23n
.rt
Contains a list of all NIS+ directories that are being served by the NIS+
server on this server. When this server is added or deleted from any NIS+
directory object, this file is updated by the server.
.RE

.SH SEE ALSO
.sp
.LP
.BR cp (1),
.BR crontab (1),
.BR mv (1),
.BR nis (1),
.BR nis_cachemgr (1M),
.BR niscat (1),
.BR nismatch (1),
.BR nistbladm (1),
.BR rm (1),
.BR cron (1M),
.BR nisclient (1M),
.BR nisinit (1M),
.BR nislog (1M),
.BR nisping (1M),
\fBnisprefadm\fR(1M), \fBnisshowcache\fR(1M), \fBnis_objects\fR(3NSL)
.SH NOTES
.sp
.LP
NIS+ might not be supported in future releases of the Solaris Operating
system. Tools to aid the migration from NIS+ to LDAP are available in the
current Solaris release. For more information, visit
http://www.sun.com/directory/nisplus/transition.html.
