usr/src/man/man4/nodename.4
'\" te
.\" Copyright (c) 2004, Sun Microsystems, Inc. All Rights Reserved.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH nodename 4 "9 Feb 2004" "SunOS 5.11" "File Formats"
.SH NAME
nodename \- local source for system name
.SH SYNOPSIS
.LP
.nf
\fB/etc/nodename\fR
.fi

.SH DESCRIPTION
.sp
.LP
When a machine is standalone or its IP address is configured locally, the
\fB/etc/nodename\fR file contains the system name. By convention, the system
name is the same as the hostname associated with the IP address of the
primary network interface, for example, \fBhostname.hme0\fR.
.sp
.LP
If the machine's network configuration is delivered by the RPC bootparams
protocol, the
.B /etc/nodename
file is not used, as the system name is
delivered by the remote service.
.sp
.LP
Given a system name value, regardless of source, the
.B uname
utility
invoked with the
.B -S
option is used to set the system name of the
running system.
.sp
.LP
If the machine's network configuration is delivered by the DHCP protocol,
the
.B /etc/nodename
file is used only if the DHCP server does not
provide a value for the Hostname option (DHCP standard option code 12).
.sp
.LP
A system name configured in
.B /etc/nodename
should be unique within the
system's name service domain in order to ensure that any network services
provided by the system will operate correctly.
.sp
.LP
Given a system name value, regardless of source, the
.B uname
utility
invoked with the
.B -S
option is used to set the system name of the
running system.
.SH EXAMPLES
.LP
\fBExample 1\fR Syntax
.sp
.LP
The syntax for
.B nodename
consists of a single line containing the
system's name. For example, for a system named \fBmyhost\fR:

.sp
.in +2
.nf
myhost
.fi
.in -2

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
.TE

.SH SEE ALSO
.sp
.LP
.BR NIS+ (1),
.BR uname (1),
.BR named (1M),
.BR ypbind (1M),
.BR attributes (5)
.SH NOTES
.sp
.LP
The
.B nodename
file is modified by Solaris installation and
de-installation scripts.
