usr/src/man/man4/nologin.4
'\" te
.\" Copyright (c) 1995 Sun Microsystems, Inc.  All Rights Reserved.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH nologin 4 "21 Dec 1995" "SunOS 5.11" "File Formats"
.SH NAME
nologin \- message displayed to users attempting to log on in the process of
a system shutdown
.SH SYNOPSIS
.LP
.nf
\fB/etc/nologin\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B /etc/nologin
file contains the message displayed to users
attempting to log on to a  machine in the process of being shutdown.  After
displaying the contents of the
.B nologin
file,  the  \fBlogin\fR
procedure terminates, preventing the user from logging onto the machine.
.sp
.LP
This procedure is preferable to terminating a user's session by
.B shutdown
shortly after the user has logged on.
.sp
.LP
Logins by  super-user are not affected by this procedure.
.sp
.LP
The message contained in the
.B nologin
file is editable by super-user. A
typical
.B nologin
file contains a message similar to:
.sp
.LP
.B "NO LOGINS: System going down in 10 minutes.
.SH SEE ALSO
.sp
.LP
.BR login (1),
.BR rlogin (1),
.BR telnet (1),
.BR shutdown (1M)
