usr/src/man/man4/notrouter.4
'\" te
.\" Copyright (c) 2004, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH notrouter 4 "10 Sep 2004" "SunOS 5.11" "File Formats"
.SH NAME
notrouter \- flag to turn off IPv4 routing
.SH SYNOPSIS
.LP
.nf
\fB/etc/notrouter\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B /etc/notrouter
file is no longer used as of the current release
of the Solaris operating system. IPv4 forwarding is disabled by default and
can be enabled using
.BR routeadm (1M).
.SH SEE ALSO
.sp
.LP
.BR routeadm (1M)
