usr/src/man/man4/nscd.conf.4
'\" te
.\" Copyright (c) 2004 Sun Microsystems, Inc. All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH nscd.conf 4 "21 Aug 2006" "SunOS 5.11" "File Formats"
.SH NAME
nscd.conf \- name service cache daemon configuration
.SH SYNOPSIS
.LP
.nf
\fB/etc/nscd.conf\fR
.fi

.SH DESCRIPTION
.sp
.LP
The \fBnscd.conf\fR file contains the configuration information for
.BR nscd (1M).
Each line specifies either an
.I attribute
and a
.IR value ,
or an
.IR attribute ,
.IR cachename ,
and a
.IR value .
Fields are separated either by SPACE or TAB characters. A `\fB#\fR' (number
sign) indicates the beginning of a comment; characters up to the end of the
line are not interpreted by
.BR nscd .
.sp
.LP
\fIcachename\fR is represented by
.BR hosts ,
.BR ipnodes ,
.BR passwd ,
.BR group ,
.BR exec_attr ,
\fBprof_attr\fR, \fBuser_attr\fR,
.BR ethers ,
.BR rpc ,
.BR protocols ,
.BR networks ,
.BR bootparams ,
.BR audit_user ,
.BR auth_attr ,
.BR services ,
.BR netmasks ,
.BR printers ,
or
.BR project .
.sp
.LP
The
.I attribute
field supports the following:
.sp
.ne 2
.mk
.na
\fBcheck-files\fR \fIcachename value\fR
.ad
.sp .6
.RS 4n
Enables or disables checking the file belonging to the specified
\fIcachename\fR for changes. If enabled (which is the default), changes in
the corresponding file cause the cache to be invalidated within 10 seconds.
Can be disabled if files are never modified for a slight performance boost,
particularly over
.BR NFS .
\fIvalue\fR may be either \fByes\fR or
.BR no .
.RE

.sp
.ne 2
.mk
.na
\fBdebug-level\fR \fIvalue\fR
.ad
.sp .6
.RS 4n
Sets the debug level desired.
.I value
may range from
.B 0
(the
default) to
.BR 10 .
Use of this option causes
.BR nscd "(1M) to run in the"
foreground and not become a daemon. Note that the output of the debugging
command is not likely to remain the same from release-to-release; scripts
should
.I not
rely on its format.
.RE

.sp
.ne 2
.mk
.na
\fBenable-cache\fR \fIcachename value\fR
.ad
.sp .6
.RS 4n
Enables or disables the specified cache.
.I value
may be either
\fByes\fR or \fBno\fR.
.RE

.sp
.ne 2
.mk
.na
\fBenable-per-user-lookup\fR \fIvalue\fR
.ad
.sp .6
.RS 4n
Enables or disables the ability of
.B nscd
to create a per-user
.BR nscd .
A per-user
.B nscd
performs per-user lookups and manages the
per-user cache. The per-user lookups might not be possible if the
corresponding name service switch backends do not support it or are not
configured to do so. The value of this attribute can be either
.B yes
or
.BR no .
.RE

.sp
.ne 2
.mk
.na
\fBkeep-hot-count\fR \fIcachename value\fR
.ad
.sp .6
.RS 4n
This attribute allows the administrator to set the number of entries
.BR nscd (1M)
is to keep current in the specified cache.
.I value
is an
integer number which should approximate the number of entries frequently
used during the day.
.RE

.sp
.ne 2
.mk
.na
\fBlogfile\fR \fIdebug-file-name\fR
.ad
.sp .6
.RS 4n
Specifies name of the file to which debug info should be written. Use
\fB/dev/tty\fR for standard output.
.RE

.sp
.ne 2
.mk
.na
\fBmaximum-per-user-nscd\fR \fIvalue\fR
.ad
.sp .6
.RS 4n
Sets the maximum number of per-user \fBnscd\fRs that can be created and
managed by the main
.B nscd
daemon. The value is an integer.
.RE

.sp
.ne 2
.mk
.na
\fBnegative-time-to-live\fR \fIcachename value\fR
.ad
.sp .6
.RS 4n
Sets the time-to-live for negative entries (unsuccessful queries) in the
specified cache.
.I value
is in integer seconds. Can result in
significant performance improvements if there are several files owned by
uids (user IDs) not in system databases; should be kept small to reduce
cache coherency problems.
.RE

.sp
.ne 2
.mk
.na
\fBper-user-nscd-time-to-live\fR \fIvalue\fR
.ad
.sp .6
.RS 4n
Sets the time-to-live value for a per-user
.B nscd
based on the last
time the per-user
.B nscd
was active. The value is an integer that
specifies a number of seconds.
.RE

.sp
.ne 2
.mk
.na
\fBpositive-time-to-live\fR \fIcachename value\fR
.ad
.sp .6
.RS 4n
Sets the time-to-live for positive entries (successful queries) in the
specified cache.
.I value
is in integer seconds. Larger values increase
cache hit rates and reduce mean response times, but increase problems with
cache coherence. Note that sites that push (update) NIS maps nightly can set
the value to be the equivalent of 12 hours or more with very good
performance implications.
.RE

.sp
.ne 2
.mk
.na
\fBsuggested-size\fR \fIcachename value\fR
.ad
.sp .6
.RS 4n
Sets the suggested number of hash buckets in the specified cache. This
parameter should be changed only if the number of entries in the cache
exceeds the suggested size by more than a factor of four or five. Since this
is the internal hash table size,
.I value
should remain a prime number
for optimum efficiency.
.sp
This attribute is obsolete and will be silently ignored.
.B nscd
now
automatically adjusts the hash table size.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailibilitySUNWcsu
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
.BR nscd (1M),
.BR audit_user (4),
.BR auth_attr (4),
.BR bootparams (4),
.BR ethers (4),
.BR exec_attr (4),
.BR group (4),
.BR hosts (4),
.BR netmasks (4),
.BR networks (4),
.BR passwd (4),
.BR printers (4),
.BR prof_attr (4),
.BR project (4),
.BR protocols (4),
.BR rpc (4),
.BR services (4),
.BR user_attr (4),
.BR attributes (5)
