usr/src/man/man4/nsmbrc.4
'\" te
.\" Copyright (c) 2008, Sun Microsystems, Inc. All Rights Reserved.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH nsmbrc 4 "Dec 8 2008" "SunOS 5.11" "File Formats"
.SH NAME
nsmbrc \- configuration file for Solaris CIFS client requests
.SH SYNOPSIS
.LP
.nf
\fB$HOME/.nsmbrc\fR
.fi

.SH DESCRIPTION
.sp
.LP
Global behavior of the Solaris CIFS client is defined by property values
that are stored in the Service Management Facility (SMF). The \fB\&.nsmbrc\fR
file can be used to customize the behavior of the Solaris CIFS client on a
per-user basis. Settings in the
.B $HOME/.nsmbrc
file are used unless they
have security implications.
.sp
.LP
An authorized user can use the
.B sharectl
command to set global values
for these properties in SMF. See \fBsharectl\fR(1M).
.sp
.LP
A regular user can change the global values when granted the "SMBFS
Management" rights profile in the \fB/user_attr\fR file. See
.BR user_attr (4)
and
.BR rbac (5).
.sp
.LP
The SMBFS library first reads from SMF and then the
.B $HOME/.nsmbrc
file
when determining which policy to apply to a particular server, user, or
share.
.B $HOME/.nsmbrc
entries take precedence with the exception of the
\fBminauth\fR property value. For
.BR minauth ,
the strongest authentication
level specified is used. Sections are applied so that more specific sections
override less specific sections. Not all keywords are valid in all
sections.
.sp
.LP
The configuration file is comprised of these four section types. Each
section can include zero or more properties and associated values. The
sections also have a hierarchical relationship with each other, as shown by
the order of the following list:
.RS +4
.TP
.ie t \(bu
.el o
\fBDefault section.\fR Specifies the default property values to be used by
all other sections unless specifically overridden.
.sp
The section name appears in the \fB\&.nsmbrc\fR file as \fB[default]\fR.
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBServer section.\fR Specifies the property values to be used by sections
that are related to the named server. These property values can be
specifically overridden by a related user section or share section.
.sp
The section name appears in the \fB\&.nsmbrc\fR file as
\fB[\fIserver-name\fR]\fR. \fIserver-name\fR must use uppercase characters to
match.
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBUser section.\fR Specifies the property values to be used by sections
that are related to the named server and user. These property values can be
specifically overridden by a related share section.
.sp
The section name appears in the \fB\&.nsmbrc\fR as
\fB[\fIserver-name\fR:\fIusername\fR]\fR. Both \fIserver-name\fR and
\fIusername\fR must use uppercase characters to match.
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBShare section.\fR Specifies the property values to be used by sections
that are related to the named server, user, and share.
.sp
The section name appears in the \fB\&.nsmbrc\fR as
\fB[\fIserver-name\fR:\fIusername\fR:\fIshare-name\fR]\fR. Both
\fIserver-name\fR and \fIusername\fR must use uppercase characters to
match.
.RE
.sp
.LP
The end of each section is marked either by the start of a new section or by
an end of file (EOF).
.sp
.LP
The following list describes the properties and states in which sections
they can be set:
.sp
.ne 2
.mk
.na
.B addr
.ad
.sp .6
.RS 4n
Specifies the DNS name or IP address of the CIFS server. This property can
only be set in a server section. If this property is specified, it must
specify a value as there is no default.
.RE

.sp
.ne 2
.mk
.na
.B domain
.ad
.sp .6
.RS 4n
Specifies the Windows domain name to use when authenticating with a server.
The default value is
.BR WORKGROUP .
This property can only be set in the
default and server sections.
.RE

.sp
.ne 2
.mk
.na
.B minauth
.ad
.sp .6
.RS 4n
Is the minimum authentication level required, which can be one of
.BR kerberos ,
.BR ntlmv2 ,
.BR ntlm ,
.BR lm ,
or
.BR none .
If
\fBminauth\fR is set globally and in a user's \fB\&.nsmbrc\fR file, the
stronger authentication setting are used whether set by the user or globally.
This property can only be set in the default and server sections. The default
value is
.BR ntlm .
.RE

.sp
.ne 2
.mk
.na
.B nbns
.ad
.sp .6
.RS 4n
Specifies the DNS name or IP address of the NetBIOS/WINS name server. This
property can
.B only
be set by an administrator by using the
\fBsharectl\fR command. This property can only be set in the default section.
The default value is empty, \fBnbns=""\fR.
.RE

.sp
.ne 2
.mk
.na
.B nbns_broadcast
.ad
.sp .6
.RS 4n
Specifies whether to perform NetBIOS/WINS broadcast lookups. Broadcast
lookups are less secure than unicast lookups. To prevent broadcast lookups,
set the value to
.BR no .
This property has no effect if the
\fBnbns_enable\fR property is set to \fBno\fR or
.BR false .
This property
can
.B only
be set by an administrator by using the
.BR sharectl
command. This property can only be set in the default section. Valid values
are
.BR yes ,
.BR true ,
.BR no ,
and
.BR false .
The default value is
.BR yes .
.RE

.sp
.ne 2
.mk
.na
.B nbns_enable
.ad
.sp .6
.RS 4n
Specifies whether to perform NetBIOS/WINS name lookups. To force all lookups
to be done through the name service switch (see
.BR nsswitch.conf (4)),
set
the value to
.BR no .
This property can
.B only
be set by an
administrator by using the
.B sharectl
command. This property can only be
set in the default section. Valid values are
.BR yes ,
.BR true ,
.BR no ,
and
.BR false .
The default value is
.BR yes .
.RE

.sp
.ne 2
.mk
.na
.B password
.ad
.sp .6
.RS 4n
Specifies the password to use when authenticating a server. The
\fBpassword\fR property value is used as long as the \fB\&.nsmbrc\fR file can
\fBonly\fR be read and written by the owner. This property can be set in the
default, server, user, and share sections.
.sp
If you assign the hashed password from the
.B "smbutil crypt"
command to
the
.B password
property, be sure to escape the special characters in the
password.
.RE

.sp
.ne 2
.mk
.na
.B signing
.ad
.sp .6
.RS 4n
Specifies whether communications are digitally signed by SMB security
signatures for the Solaris CIFS client. This property can only be set in the
default and server sections. Valid values are
.BR disabled ,
.BR enabled ,
and
.BR required .
The default value is
.BR disabled .
.sp
When set to
.BR disabled ,
the client permits the use of SMB security
signatures only if the server requires signing. In such an instance, the
Solaris CIFS client ignores local property values.
.sp
When set to
.BR enabled ,
the client permits, but does not require, the use
of SMB security signatures.
.sp
When set to
.BR required ,
the client requires the use of SMB security
signatures. So, if SMB security signatures are disabled on a CIFS server and
a client has signing required, the client cannot connect to that server.
.RE

.sp
.ne 2
.mk
.na
.B timeout
.ad
.sp .6
.RS 4n
Specifies the CIFS request timeout. By default, the timeout is 15 seconds.
This property can only be set in the default, server, and share sections.
.RE

.sp
.ne 2
.mk
.na
.B user
.ad
.sp .6
.RS 4n
Specifies the user name to use when authenticating a server. The default
value is the Solaris account name of the user performing the authentication.
This property can only be set in the default and server sections.
.RE

.sp
.ne 2
.mk
.na
.B workgroup
.ad
.sp .6
.RS 4n
Is supported for compatibility purposes and is a synonym for the
\fBdomain\fR property. Use the \fBdomain\fR property instead.
.RE

.SH EXAMPLES
.sp
.LP
The examples in this section show how to use the \fB\&.nsmbrc\fR file and
the
.B smbutil
command to configure the
.B ex.com
environment.
.sp
.LP
The
.B ex.com
environment is described by means of these sections and
settings:
.RS +4
.TP
.ie t \(bu
.el o
The \fBdefault\fR section describes the default domain, which is called
.BR MYDOMAIN ,
and sets a default user of
.BR MYUSER .
These default
settings are inherited by other sections unless property values are
overridden.
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBFSERVER\fR is a server section that defines a server called
\fBfserv.ex.com\fR. It is part of the \fBSALES\fR domain.
.RE
.RS +4
.TP
.ie t \(bu
.el o
\fBRSERVER\fR is a server section that defines a server called
\fBrserv.ex.com\fR that belongs to a new domain called \fBREMGROUP\fR.
.RE
.LP
\fBExample 1\fR Using the \fB$HOME/.nsmbrc\fR Configuration File
.sp
.LP
The following example shows how a user can configure the
.BR ex.com
environment by creating the \fB\&.nsmbrc\fR file.

.sp
.LP
All lines that begin with the
.B #
character are comments and are not
parsed.

.sp
.in +2
.nf
# Configuration file for ex.com
# Specify the Windows account name to use everywhere.
[default]
domain=MYDOMAIN
user=MYUSER

# The 'FSERVER' is server in our domain.
[FSERVER]
addr=fserv.ex.com

# The 'RSERVER' is a server in another domain.
[RSERVER]
domain=REMGROUP
addr=rserv.ex.com
.fi
.in -2

.LP
\fBExample 2\fR Using the \fBsharectl\fR Command
.sp
.LP
The following example shows how an authorized user can use
.BR sharectl
commands to configure global settings for the
.B ex.com
environment in
SMF.

.sp
.in +2
.nf
# \fBsharectl set -p section=default -p domain=MYDOMAIN \e
-p user=MYUSER smbfs\fR
# \fBsharectl set -p section=FSERVER -p addr=fserv.ex.com smbfs\fR
# \fBsharectl set -p section=RSERVER -p domain=REMGROUP \e
-p addr=rserv.ex.com smbfs\fR
.fi
.in -2
.sp

.LP
\fBExample 3\fR Using the \fBsharectl\fR Command to Show Current Settings
.sp
.LP
The following example shows how an authorized user can use the \fBsharectl
get\fR command to view the global settings for \fBsmbfs\fR in SMF. The values
shown are those set by the previous example.

.sp
.in +2
.nf
# \fBsharectl get smbfs\fR
[default]
  domain=MYDOMAIN
  user=MYUSER
[FSERVER]
  addr=fserv.ex.com
[RSERVER]
  domain=REMGROUP
  addr=rserv.ex.com
.fi
.in -2
.sp

.SH FILES
.sp
.ne 2
.mk
.na
.B $HOME/.nsmbrc
.ad
.sp .6
.RS 4n
User-settable mount point configuration file to store the description for
each connection.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWsmbfscu
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
.BR smbutil (1),
\fBmount_smbfs\fR(1M), \fBsharectl\fR(1M),
\fBnsswitch.conf\fR(4),
.BR user_attr (4),
.BR attributes (5),
.BR rbac (5),
\fBsmbfs\fR(7FS)
.SH NOTES
.sp
.LP
By default, passwords stored in the \fB\&.nsmbrc\fR file are ignored unless
\fBonly\fR the file owner has read and write permission.
