usr/src/man/man4/nss.4
'\" te
.\" Copyright (c) 2003, Sun Microsystems, Inc.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" All Rights Reserved.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH nss 4 "20 Nov 2003" "SunOS 5.11" "File Formats"
.SH NAME
nss \- configuration file for initgroups
.SH SYNOPSIS
.LP
.nf
\fB/etc/default/nss\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B /etc/default/nss
configuration file provides methods for
.BR initgroups (3C)
lookup method. The file also provides a method to
disable address sorting by name lookup functions. The file controls the
behavior of the name service switch routines outside of the source database
mappings provided by the
.B /etc/nsswitch.conf
file.
.sp
.LP
.B /etc/default/nss
supports the following options:
.sp
.ne 2
.mk
.na
.B NETID_AUTHORITATIVE
.ad
.RS 23n
.rt
Changes the behavior of the name service lookups to use the
.BR netid
table in response to the
.B initgroups()
call. The
.B netid
table is
provided by the
.B LOCAL
entries of the NIS+
.B cred.org_dir
table. By
default,
.B initgroups()
uses the
.B group
table. When
.B NETID_AUTHORITATIVE
is set to TRUE,
.B initgroups()
uses
.B netid
as the source for supplementary groups rather than the
.B group
table.
.sp
The name service administrator must ensure that the
.B netid
table
contains valid supplementary group information for users. Not all name
services can automatically keep the members listed in the
.B group
table
in sync with the
.B netid
table.
.RE

.sp
.ne 2
.mk
.na
.B SORT_ADDRS
.ad
.RS 23n
.rt
If this option is set to FALSE, the sorting of addresses is disabled on
addresses that are returned by name lookup functions such as
.BR initgroups() ,
.BR gethostbyname (3NSL),
.BR netdir_getbyname (3NSL),
.BR getaddrinfo (3SOCKET),
and
.BR getipnodebyname "(3SOCKET). Setting this"
option to FALSE is useful when the order of addresses returned by the
nameserver needs to be maintained. To use the DNS round robin feature, for
example, address sorting by name lookup functions should be disabled.
.sp
By default, address sorting is enabled.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsr
_
Interface StabilityEvolving
.TE

.SH SEE ALSO
.sp
.LP
.BR getaddrinfo (3SOCKET),
.BR gethostbyname (3NSL),
.BR getipnodebyname (3SOCKET),
.BR initgroups (3C),
.BR netdir_getbyname (3NSL),
.BR nsswitch.conf (4),
.BR attributes (5)
