usr/src/man/man4/nsswitch.conf.4
'\" te
.\" Copyright (c) 2008, Sun Microsystems, Inc. All Rights Reserved.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH nsswitch.conf 4 "6 Nov 2008" "SunOS 5.11" "File Formats"
.SH NAME
nsswitch.conf \- configuration file for the name service switch
.SH SYNOPSIS
.LP
.nf
\fB/etc/nsswitch.conf\fR
.fi

.SH DESCRIPTION
.sp
.LP
The operating system uses a number of databases of information about hosts,
ipnodes, users (\fBpasswd\fR(4),
.BR shadow (4),
and
.BR user_attr (4)),
and
groups. Data for these can come from a variety of sources: hostnames and host
addresses, for example, can be found in
.BR /etc/hosts ,
.BR NIS ,
.BR NIS+ ,
.BR LDAP ,
\fBDNS\fR or Multicast
.BR DNS .
Zero or more sources
can be used for each database; the sources and their lookup order are specified
in the \fB/etc/nsswitch.conf\fR file.
.sp
.LP
The following databases use the
.B switch
file:
.sp

.sp
.TS
tab();
cw(2.18i) cw(3.32i)
lw(2.18i) lw(3.32i)
.
DatabaseUsed By
\fBaliases\fR\fBsendmail\fR(1M)
\fBauth_attr\fR\fBgetauthnam\fR(3SECDB)
\fBautomount\fR\fBautomount\fR(1M)
\fBbootparams\fR\fBrpc.bootparamd\fR(1M)
\fBethers\fR\fBethers\fR(3SOCKET)
\fBgroup\fR\fBgetgrnam\fR(3C)
\fBhosts\fRT{
\fBgethostbyname\fR(3NSL), \fBgetaddrinfo\fR(3SOCKET). See \fBInteraction with netconfig\fR.
T}
\fBipnodes\fRSame as \fBhosts\fR.
\fBnetgroup\fR\fBinnetgr\fR(3C)
\fBnetmasks\fR\fBifconfig\fR(1M)
\fBnetworks\fR\fBgetnetbyname\fR(3SOCKET)
\fBpasswd\fRT{
\fBgetpwnam\fR(3C), \fBgetspnam\fR(3C), \fBgetauusernam\fR(3BSM), \fBgetusernam\fR(3SECDB)
T}
\fBprinters\fRT{
\fBlp\fR(1), \fBlpstat\fR(1), \fBcancel\fR(1), \fBlpr\fR(1B), \fBlpq\fR(1B), \fBlprm\fR(1B), \fBin.lpd\fR(1M), \fBlpadmin\fR(1M), \fBlpget\fR(1M), \fBlpset\fR(1M)
T}
\fBprof_attr\fR\fBgetprofnam\fR(3SECDB), \fBgetexecprof\fR(3SECDB)
\fBproject\fRT{
\fBgetprojent\fR(3PROJECT), \fBgetdefaultproj\fR(3PROJECT), \fBinproj\fR(3PROJECT), \fBnewtask\fR(1), \fBsetproject\fR(3PROJECT)
T}
\fBprotocols\fR\fBgetprotobyname\fR(3SOCKET)
\fBpublickey\fR\fBgetpublickey\fR(3NSL), \fBsecure_rpc\fR(3NSL)
\fBrpc\fR\fBgetrpcbyname\fR(3NSL)
\fBservices\fR\fBgetservbyname\fR(3SOCKET).
See \fBInteraction with netconfig\fR.
\fBuser_attr\fR\fBgetuserattr\fR(3SECDB)
.TE

.sp
.LP
The following sources can be used:
.sp

.sp
.TS
tab();
cw(2.18i) cw(3.32i)
lw(2.18i) lw(3.32i)
.
SourceUses
\fBfiles\fRT{
\fB/etc/hosts\fR, \fB/etc/passwd\fR, \fB/etc/inet/ipnodes\fR, \fB/etc/shadow\fR, \fB/etc/security/auth_attr\fR, \fB/etc/user_attr\fR
T}
\fBnis\fR\fBNIS\fR(\fBYP\fR)
\fBnisplus\fR\fBNIS+\fR
\fBldap\fR\fBLDAP\fR
\fBad\fRActive Directory
\fBdns\fRT{
Valid only for hosts and ipnodes. Uses the Internet Domain Name Service.
T}
\fBmdns\fRT{
Valid only for hosts and ipnodes. Uses the Multicast Domain Name Service.
T}
\fBcompat\fRT{
Valid only for \fBpasswd\fR and \fBgroup\fR. Implements \fB+\fR and \fB-.\fR See \fBInteraction with +/- syntax\fR.
T}
\fBuser\fRT{
Valid only for printers. Implements support for \fB${HOME}/.printers\fR.
T}
.TE

.sp
.LP
Note that
.B /etc/inet/ipnodes
is a symbolic link to
.BR /etc/hosts .
.sp
.LP
There is an entry in \fB/etc/nsswitch.conf\fR for each database. Typically
these entries are simple, such as \fBprotocols: files\fR or \fBnetworks: files
nisplus\fR. However, when multiple sources are specified, it is sometimes
necessary to define precisely the circumstances under which each source is
tried. A source can return one of the following codes:
.sp

.sp
.TS
tab();
cw(2.18i) cw(3.32i)
lw(2.18i) lw(3.32i)
.
StatusMeaning
\fBSUCCESS\fRRequested database entry was found.
\fBUNAVAIL\fRT{
Source is not configured on this system or internal failure.
T}
\fBNOTFOUND\fRSource responded "\fBno such entry\fR"
\fBTRYAGAIN\fRT{
Source is busy or not responding, might respond to retries.
T}
.TE

.sp
.LP
For each status code, two actions are possible:
.sp

.sp
.TS
tab();
cw(2.18i) cw(3.32i)
lw(2.18i) lw(3.32i)
.
ActionMeaning
\fBcontinue\fRTry the next source in the list.
\fBreturn\fRReturn now.
.TE

.sp
.LP
Additionally, for
.B TRYAGAIN
only, the following actions are possible:
.sp

.sp
.TS
tab();
cw(2.18i) cw(3.32i)
lw(2.18i) lw(3.32i)
.
ActionMeaning
\fBforever\fRRetry the current source forever.
\fIn\fRT{
Retry the current source \fIn\fR more times, where \fIn\fR is an integer between \fB0\fR and \fBMAX_INT\fR (that is, 2.14 billion). After \fIn\fR retries has been exhausted, the \fBTRYAGAIN\fR action transitions to \fBcontinue\fR, until a future request receives a response, at which time \fBTRYAGAIN\fR=\fIn\fR is restored.
T}
.TE

.sp
.LP
The complete syntax of an entry is:
.sp
.in +2
.nf
<entry>     ::= <database> ":" [<source> [<criteria>]]*
<criteria>  ::= "[" <criterion>+ "]"
<criterion> ::= <status> "=" <action>
<status>    ::= "success" | "notfound" | "unavail" | "tryagain"
.fi
.in -2

.sp
.LP
For every status except
.BR TRYAGAIN ,
the action syntax is:
.sp
.in +2
.nf
<action>    ::= "return"  | "continue"
.fi
.in -2

.sp
.LP
For the
.B TRYAGAIN
status, the action syntax is:
.sp
.in +2
.nf
<action>    ::= "return"  | "continue" | "forever" | <n>
<n>         ::= 0.\|.\|.MAX_INT
.fi
.in -2

.sp
.LP
Each entry occupies a single line in the file. Lines that are blank, or that
start with white space, are ignored. Everything on a line following a \fB#\fR
character is also ignored; the
.B #
character can begin anywhere in a line,
to be used to begin comments. The <database> and <source> names are
case-sensitive, but <action> and <status> names are case-insensitive.
.sp
.LP
The library functions contain compiled-in default entries that are used if the
appropriate entry in \fBnsswitch.conf\fR is absent or syntactically
incorrect.
.sp
.LP
The default criteria for \fBDNS\fR and the \fBNIS\fR server in "DNS-forwarding
mode" is [\fBSUCCESS\fR=return \fBNOTFOUND\fR=continue \fBUNAVAIL\fR=continue
.BR TRYAGAIN =3].
.sp
.LP
The default criteria for all other sources is [\fBSUCCESS\fR=return
\fBNOTFOUND\fR=continue \fBUNAVAIL\fR=continue \fBTRYAGAIN\fR=forever].
.sp
.LP
The default, or explicitly specified, criteria are meaningless following the
last source in an entry; and they are ignored, since the action is always to
return to the caller irrespective of the status code the source returns.
.SS "Interaction with \fBnetconfig\fR"
.sp
.LP
In order to ensure that they all return consistent results,
.BR gethostbyname (3NSL),
.BR getaddrinfo (3SOCKET),
.BR getservbyname (3SOCKET),
and \fBnetdir_getbyname\fR(3NSL) functions are
all implemented in terms of the same internal library function. This function
obtains the system-wide source lookup policy for
.BR hosts ,
.BR ipnodes ,
and
.B services
based on the
.B inet
family entries in
.BR netconfig (4)
and uses the switch entries only if the \fBnetconfig\fR entries have a \fB-\fR
(hyphen) in the last column for
.B nametoaddr
libraries. See the Notes
section in \fBgethostbyname\fR(3NSL) and \fBgetservbyname\fR(3SOCKET) for
details.
.SS "YP-compatibility Mode"
.sp
.LP
The
.B NIS+
server can be run in YP-compatibility mode, where it handles
\fBNIS (YP)\fR requests as well as \fBNIS+\fR requests. In this case, the
clients get much the same results (except for \fBgetspnam\fR(3C)) from the
\fBnis\fR source as from
.BR nisplus ;
however,
.B nisplus
is recommended
instead of
.BR nis .
.SS "Interaction with server in DNS-forwarding Mode"
.sp
.LP
The
.B NIS
(\fBYP\fR) server can be run in DNS-forwarding mode, where it
forwards lookup requests to
.B DNS
for host-names and -addresses that do not
exist in its database. In this case, specifying
.B nis
as a source for
\fBhosts\fR is sufficient to get \fBDNS\fR lookups; \fBdns\fR need not be
specified explicitly as a source.
.sp
.LP
In SunOS 5.3 (Solaris 2.3) and compatible versions, the
.B NIS+
server in
NIS/YP-compatibility mode can also be run in DNS-forwarding mode (see
.BR rpc.nisd (1M)).
Forwarding is effective only for requests originating from
its YP clients;
.B hosts
policy on these clients should be configured
appropriately.
.SS "Interaction with Password Aging"
.sp
.LP
When password aging is turned on, only a limited set of possible name services
are permitted for the
.BR passwd :
database in the \fB/etc/nsswitch.conf\fR
file:
.sp
.ne 2
.mk
.na
.B passwd:
.ad
.RS 18n
.rt
files
.RE

.sp
.ne 2
.mk
.na
.B passwd:
.ad
.RS 18n
.rt
files nis
.RE

.sp
.ne 2
.mk
.na
.B passwd:
.ad
.RS 18n
.rt
files nisplus
.RE

.sp
.ne 2
.mk
.na
.B passwd:
.ad
.RS 18n
.rt
files ldap
.RE

.sp
.ne 2
.mk
.na
.B passwd:
.ad
.RS 18n
.rt
compat
.RE

.sp
.ne 2
.mk
.na
.B passwd_compat:
.ad
.RS 18n
.rt
nisplus
.RE

.sp
.ne 2
.mk
.na
.B passwd_compat:
.ad
.RS 18n
.rt
ldap
.RE

.sp
.LP
You can add the
.B ad
keyword to any of the
.B passwd
configurations
listed above. However, you cannot use the
.B passwd
command to change the
password of an Active Directory (AD) user. If the
.B ad
keyword is found in
the
.B passwd
entry during a password update operation, it is ignored. To
update the password of an AD user, use the
.BR kpasswd (1)
command.
.sp
.LP
Any other settings causes the
.BR passwd (1)
command to fail when it attempts
to change the password after expiration and prevents the user from logging in.
These are the
.B only
permitted settings when password aging has been turned
on. Otherwise, you can work around incorrect
.BR passwd :
lines by using the
\fB-r repository\fR argument to the
.BR passwd (1)
command and using \fBpasswd
-r repository\fR to override the \fBnsswitch.conf\fR settings and specify in
which name service you want to modify your password.
.SS "Interaction with +/- syntax"
.sp
.LP
Releases prior to SunOS 5.0 did not have the name service switch but did allow
the user some policy control. In
.B /etc/passwd
one could have entries of
the form
.I +user
(include the specified user from
.B NIS
passwd.byname),
\fI-user\fR (exclude the specified user) and \fB+\fR (include everything,
except excluded users, from
.B NIS
passwd.byname). The desired behavior was
often
.BR "everything in the file followed by everything in NIS" ,
expressed by
a solitary
.B +
at the end of
.BR /etc/passwd .
The switch provides an
alternative for this case (\fBpasswd: files nis\fR) that does not require
\fB+\fR entries in \fB/etc/passwd\fR and \fB/etc/shadow\fR (the latter is a new
addition to SunOS 5.0, see
.BR shadow (4)).
.sp
.LP
If this is not sufficient, the
.B NIS/YP
compatibility source provides full
+/- semantics. It reads
.B /etc/passwd
for \fBgetpwnam\fR(3C) functions and
\fB/etc/shadow\fR for \fBgetspnam\fR(3C) functions and, if it finds +/-
entries, invokes an appropriate source. By default, the source is
.BR nis ,
but this can be overridden by specifying
.B nisplus
or
.B ldap
as the
source for the pseudo-database
.BR passwd_compat .
.sp
.LP
Note that in compat mode, for every
.B /etc/passwd
entry, there must be a
corresponding entry in the
.B /etc/shadow
file.
.sp
.LP
The NIS/YP compatibility source also provides full +/- semantics for
.BR group ;
the relevant pseudo-database is
.BR group_compat .
.SS "Useful Configurations"
.sp
.LP
The compiled-in default entries for all databases use
.B "NIS (YP)"
as the
enterprise level name service and are identical to those in the default
configuration of this file:
.sp
.ne 2
.mk
.na
.B passwd:
.ad
.RS 15n
.rt
files nis
.RE

.sp
.ne 2
.mk
.na
.B group:
.ad
.RS 15n
.rt
files nis
.RE

.sp
.ne 2
.mk
.na
.B hosts:
.ad
.RS 15n
.rt
nis [NOTFOUND=return] files
.RE

.sp
.ne 2
.mk
.na
.B ipnodes:
.ad
.RS 15n
.rt
nis [NOTFOUND=return] files
.RE

.sp
.ne 2
.mk
.na
.B networks:
.ad
.RS 15n
.rt
nis [NOTFOUND=return] files
.RE

.sp
.ne 2
.mk
.na
.B protocols:
.ad
.RS 15n
.rt
nis [NOTFOUND=return] files
.RE

.sp
.ne 2
.mk
.na
.B rpc:
.ad
.RS 15n
.rt
nis [NOTFOUND=return] files
.RE

.sp
.ne 2
.mk
.na
.B ethers:
.ad
.RS 15n
.rt
nis [NOTFOUND=return] files
.RE

.sp
.ne 2
.mk
.na
.B netmasks:
.ad
.RS 15n
.rt
nis [NOTFOUND=return] files
.RE

.sp
.ne 2
.mk
.na
.B bootparams:
.ad
.RS 15n
.rt
nis [NOTFOUND=return] files
.RE

.sp
.ne 2
.mk
.na
.B publickey:
.ad
.RS 15n
.rt
nis [NOTFOUND=return] files
.RE

.sp
.ne 2
.mk
.na
.B netgroup:
.ad
.RS 15n
.rt
nis
.RE

.sp
.ne 2
.mk
.na
.B automount:
.ad
.RS 15n
.rt
files nis
.RE

.sp
.ne 2
.mk
.na
.B aliases:
.ad
.RS 15n
.rt
files nis
.RE

.sp
.ne 2
.mk
.na
.B services:
.ad
.RS 15n
.rt
files nis
.RE

.sp
.ne 2
.mk
.na
.B printers:
.ad
.RS 15n
.rt
user files nis nisplus
.RE

.sp
.ne 2
.mk
.na
.B auth_attr
.ad
.RS 15n
.rt
files nis
.RE

.sp
.ne 2
.mk
.na
\fBprof_attr\fR
.ad
.RS 15n
.rt
files nis
.RE

.sp
.ne 2
.mk
.na
.B project
.ad
.RS 15n
.rt
files nis
.RE

.sp
.LP
Note that the \fBfiles\fR source for the \fBipnodes\fR and \fBhosts\fR
databases is identical, as
.B /etc/inet/ipnodes
is a symbolic link to
.BR /etc/hosts .
Because other sources for the
.B ipnodes
and
.BR hosts
databases are different, do not remove the
.B ipnodes
line from the
\fB/etc/nsswitch.conf\fR file.
.sp
.LP
The policy \fBnis [NOTFOUND=return] files\fR implies: if
.B nis
is
.BR UNAVAIL ,
continue on to
.BR files ,
and if
.B nis
returns
.BR NOTFOUND ,
return to the caller. In other words, treat
.B nis
as the
authoritative source of information and try \fBfiles\fR only if
.B nis
is
down. This, and other policies listed in the default configuration above, are
identical to the hard-wired policies in SunOS releases prior to 5.0.
.sp
.LP
If compatibility with the +/- syntax for
.B passwd
and
.B group
is
required, simply modify the entries for
.B passwd
and
.B group
to:
.sp
.ne 2
.mk
.na
.B passwd:
.ad
.RS 11n
.rt
compat
.RE

.sp
.ne 2
.mk
.na
.B group:
.ad
.RS 11n
.rt
compat
.RE

.sp
.LP
If
.B NIS+
is the enterprise level name service, the default configuration
should be modified to use
.B nisplus
instead of
.B nis
for every database
on client machines. The file
.B /etc/nsswitch.nisplus
contains a sample
configuration that can be copied to \fB/etc/nsswitch.conf\fR to set this
policy.
.sp
.LP
If
.B LDAP
is the enterprise level name service, the default configuration
should be modified to use
.B ldap
instead of
.B nis
for every database on
client machines. The file
.B /etc/nsswitch.ldap
contains a sample
configuration that can be copied to \fB/etc/nsswitch.conf\fR to set this
policy.
.sp
.LP
When using Active Directory,
.B dns
is required to perform hosts
resolution.
.sp
.LP
If the use of +/- syntax is desired in conjunction with
.BR nisplus ,
use the
following four entries:
.sp
.ne 2
.mk
.na
.B passwd:
.ad
.RS 18n
.rt
compat
.RE

.sp
.ne 2
.mk
.na
.B passwd_compat:
.ad
.RS 18n
.rt
nisplus OR ldap
.RE

.sp
.ne 2
.mk
.na
.B group:
.ad
.RS 18n
.rt
compat
.RE

.sp
.ne 2
.mk
.na
.B group_compat:
.ad
.RS 18n
.rt
nisplus OR ldap
.RE

.sp
.LP
In order to get information from the Internet Domain Name Service for hosts
that are not listed in the enterprise level name service,
.B NIS+
or
.BR LDAP ,
use the following configuration and set up the
\fB/etc/resolv.conf\fR file (see
.BR resolv.conf (4)
for more details):
.sp
.ne 2
.mk
.na
.B hosts:
.ad
.RS 10n
.rt
nisplus dns [NOTFOUND=return] files
.RE

.sp
.LP
or
.sp
.ne 2
.mk
.na
.B hosts:
.ad
.RS 10n
.rt
ldap dns [NOTFOUND=return] files
.RE

.SS "Enumeration - \fBgetXXXent()\fR"
.sp
.LP
Many of the databases have enumeration functions:
.B passwd
has
.BR getpwent() ,
\fBhosts\fR has
.BR gethostent() ,
and so on. These were
reasonable when the only source was \fBfiles\fR but often make little sense for
hierarchically structured sources that contain large numbers of entries, much
less for multiple sources. The interfaces are still provided and the
implementations strive to provide reasonable results, but the data returned can
be incomplete (enumeration for
.B hosts
is simply not supported by the
\fBdns\fR source), inconsistent (if multiple sources are used), formatted in an
unexpected fashion (for a host with a canonical name and three aliases, the
\fBnisplus\fR source returns four hostents, and they might not be consecutive),
or very expensive (enumerating a
.B passwd
database of 5,000 users is
probably a bad idea). Furthermore, multiple threads in the same process using
the same reentrant enumeration function (\fBgetXXXent_r()\fR are supported
beginning with SunOS 5.3) share the same enumeration position; if they
interleave calls, they enumerate disjoint subsets of the same database.
.sp
.LP
In general, the use of the enumeration functions is deprecated. In the case of
.BR passwd ,
.BR shadow ,
and
.BR group ,
it might sometimes be appropriate
to use
.BR fgetgrent() ,
\fBfgetpwent()\fR, and \fBfgetspent()\fR (see
.BR getgrnam (3C),
.BR getpwnam (3C),
and
.BR getspnam "(3C), respectively),"
which use only the \fBfiles\fR source.
.SH FILES
.sp
.LP
A source named SSS is implemented by a shared object named
.BR nss_SSS.so.1
that resides in
.BR /usr/lib .
.sp
.ne 2
.mk
.na
\fB/etc/nsswitch.conf\fR
.ad
.RS 29n
.rt
Configuration file.
.RE

.sp
.ne 2
.mk
.na
.B /usr/lib/nss_compat.so.1
.ad
.RS 29n
.rt
Implements
.B compat
source.
.RE

.sp
.ne 2
.mk
.na
.B /usr/lib/nss_dns.so.1
.ad
.RS 29n
.rt
Implements
.B dns
source.
.RE

.sp
.ne 2
.mk
.na
\fB/usr/lib/nss_files.so.1\fR
.ad
.RS 29n
.rt
Implements \fBfiles\fR source.
.RE

.sp
.ne 2
.mk
.na
.B /usr/lib/nss_mdns.so.1
.ad
.RS 29n
.rt
Implements
.B mdns
source.
.RE

.sp
.ne 2
.mk
.na
.B /usr/lib/nss_nis.so.1
.ad
.RS 29n
.rt
Implements
.B nis
source.
.RE

.sp
.ne 2
.mk
.na
.B /usr/lib/nss_nisplus.so.1
.ad
.RS 29n
.rt
Implements
.B nisplus
source.
.RE

.sp
.ne 2
.mk
.na
.B /usr/lib/nss_ldap.so.1
.ad
.RS 29n
.rt
Implements
.B ldap
source.
.RE

.sp
.ne 2
.mk
.na
.B /usr/lib/nss_ad.so.1
.ad
.RS 29n
.rt
Implements ad source.
.RE

.sp
.ne 2
.mk
.na
.B /usr/lib/nss_user.so.1
.ad
.RS 29n
.rt
Implements
.B user
source.
.RE

.sp
.ne 2
.mk
.na
\fB/etc/netconfig\fR
.ad
.RS 29n
.rt
Configuration file for \fBnetdir\fR(3NSL) functions that redirects
hosts/devices policy to the switch.
.RE

.sp
.ne 2
.mk
.na
\fB/etc/nsswitch.files\fR
.ad
.RS 29n
.rt
Sample configuration file that uses \fBfiles\fR only.
.RE

.sp
.ne 2
.mk
.na
.B /etc/nsswitch.nis
.ad
.RS 29n
.rt
Sample configuration file that uses \fBfiles\fR and
.BR nis .
.RE

.sp
.ne 2
.mk
.na
.B /etc/nsswitch.nisplus
.ad
.RS 29n
.rt
Sample configuration file that uses \fBfiles\fR and
.BR nisplus .
.RE

.sp
.ne 2
.mk
.na
.B /etc/nsswitch.ldap
.ad
.RS 29n
.rt
Sample configuration file that uses \fBfiles\fR and
.BR ldap .
.RE

.sp
.ne 2
.mk
.na
.B /etc/nsswitch.ad
.ad
.RS 29n
.rt
Sample configuration file that uses \fBfiles\fR and
.BR ad .
.RE

.sp
.ne 2
.mk
.na
.B /etc/nsswitch.dns
.ad
.RS 29n
.rt
Sample configuration file that uses
.BR files ,
\fBdns\fR and \fBmdns\fR
(\fBdns\fR and \fBmdns\fR only for hosts).
.RE

.SH SEE ALSO
.sp
.LP
.BR kpasswd (1),
.BR ldap (1),
.BR newtask (1),
.BR NIS+ (1),
.BR passwd (1),
.BR automount (1M),
.BR ifconfig (1M),
.BR mdnsd (1M),
.BR rpc.bootparamd (1M),
.BR rpc.nisd (1M),
.BR sendmail (1M),
.BR getauusernam (3BSM),
.BR getgrnam (3C),
.BR getnetgrent (3C),
.BR getpwnam (3C),
.BR getspnam (3C),
.BR gethostbyname (3NSL),
.BR getpublickey (3NSL),
.BR getrpcbyname (3NSL),
.BR netdir (3NSL),
.BR secure_rpc (3NSL),
.BR getprojent (3PROJECT),
.BR getdefaultproj (3PROJECT),
.BR inproj (3PROJECT),
.BR setproject (3PROJECT),
.BR getauthnam (3SECDB),
\fBgetexecprof\fR(3SECDB), \fBgetprofnam\fR(3SECDB),
.BR getuserattr (3SECDB),
.BR getusernam (3SECDB),
.BR ethers (3SOCKET),
.BR getaddrinfo (3SOCKET),
.BR getnetbyname (3SOCKET),
.BR getprotobyname (3SOCKET),
.BR getservbyname (3SOCKET),
.BR auth_attr (4),
.BR hosts (4),
.BR netconfig (4),
.BR project (4),
.BR resolv.conf (4),
.BR user_attr (4),
.BR ypfiles (4),
.BR ad (5)
.SH NOTES
.sp
.LP
Within each process that uses
.BR nsswitch.conf ,
the entire file is read
only once; if the file is later changed, the process continues using the old
configuration.
.sp
.LP
The use of both
.B nis
and
.B nisplus
as sources for the same database
is strongly discouraged since both the name services are expected to store
similar information and the lookups on the database can yield different results
depending on which name service is operational at the time of the request. The
same applies for using
.B ldap
along with
.B nis
or
.BR nisplus .
.sp
.LP
Do not use the
.B ldap
and
.B ad
keywords together when the Solaris LDAP
client uses schema mapping to talk to Active Directory.
.sp
.LP
Misspelled names of sources and databases are treated as legitimate names of
(most likely nonexistent) sources and databases.
.sp
.LP
The following functions do
.B not
use the switch: \fBfgetgrent\fR(3C),
\fBfgetprojent\fR(3PROJECT), \fBfgetpwent\fR(3C), \fBfgetspent\fR(3C),
.BR getpw (3C),
.BR putpwent (3C),
.BR shadow (4).
