usr/src/man/man4/order.4
'\" te
.\" Copyright (c) 1992 SunSoft, Inc. - All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH order 4 "24 Feb 1993" "SunOS 5.11" "File Formats"
.SH NAME
order \- package installation order description file
.SH DESCRIPTION
.sp
.LP
The package installation order file,
.BR \&.order ,
is an
.B ASCII
file
specifying the order in which packages must be installed  based on their
prerequisite dependencies.  Any  package with prerequisite dependencies must
be installed
.I after
any packages it lists as a prerequisite dependency
in its
.B depend
file.
.sp
.LP
A
.B
\&.order \c
file is required for the OS product. The
.B
\&.order
file must reside in the top-level directory containing the product.
.sp
.LP
The ordering is specified as a list of package identifiers, from the first
package to be installed to the last, one package identifier per line.
.SH NOTES
.sp
.LP
The
.B depend
file supports
.I incompatible
and
.IR reverse
.RB "dependencies. These dependency types are not recognized in the" " order"
file.
.SH SEE ALSO
.sp
.LP
.BR cdtoc (4),
.BR clustertoc (4),
.BR depend (4),
.BR packagetoc (4),
.BR pkginfo (4)
