usr/src/man/man4/order.4
'\" te
.\" Copyright (c) 1992 SunSoft, Inc. - All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH order 4 "24 Feb 1993" "SunOS 5.11" "File Formats"
.SH NAME
order \- package installation order description file
.SH DESCRIPTION
.sp
.LP
The package installation order file, \fB\&.order\fR, is an \fBASCII\fR file
specifying the order in which packages must be installed  based on their
prerequisite dependencies.  Any  package with prerequisite dependencies must
be installed  \fIafter\fR any packages it lists as a prerequisite dependency
in its
.B depend
file.
.sp
.LP
A \fB\&.order\fR file is required for the OS product. The \fB\&.order\fR
file must reside in the top-level directory containing the product.
.sp
.LP
The ordering is specified as a list of package identifiers, from the first
package to be installed to the last, one package identifier per line.
.SH NOTES
.sp
.LP
The
.B depend
file supports
.I incompatible
and
.IR reverse
.RB "dependencies. These dependency types are not recognized in the" " order"
file.
.SH SEE ALSO
.sp
.LP
.BR cdtoc (4),
.BR clustertoc (4),
.BR depend (4),
.BR packagetoc (4),
\fBpkginfo\fR(4)
