usr/src/man/man4/ott.4
'\" te
.\" Copyright 1989 AT&T
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ott 4 "3 Jul 1990" "SunOS 5.11" "File Formats"
.SH NAME
ott \- FACE object architecture information
.SH DESCRIPTION
.sp
.LP
The
.B FACE
object architecture stores information about object-types in an
.B ASCII
file named
.B \&.ott
(object type table) that is contained in
each directory. This file describes all of the objects in that directory. Each
line of the
.B \&.ott
file contains information about one object in
pipe-separated fields. The fields are (in order):
.sp
.ne 2
.mk
.na
.I name
.ad
.RS 22n
.rt
the name of the actual system file.
.RE

.sp
.ne 2
.mk
.na
.I dname
.ad
.RS 22n
.rt
the name that should be displayed to the user, or a dot if it is the same as
the name of the file.
.RE

.sp
.ne 2
.mk
.na
.I description
.ad
.RS 22n
.rt
the description of the object, or a dot if the description is the default (the
same as object-type).
.RE

.sp
.ne 2
.mk
.na
.I object-type
.ad
.RS 22n
.rt
the
.B FACE
internal object type name.
.RE

.sp
.ne 2
.mk
.na
.I flags
.ad
.RS 22n
.rt
object specific flags.
.RE

.sp
.ne 2
.mk
.na
.I mod time
.ad
.RS 22n
.rt
the time that
.B FACE
last modified the object. The time is given as number
of seconds since 1/1/1970, and is in hexadecimal notation.
.RE

.sp
.ne 2
.mk
.na
.I object information
.ad
.RS 22n
.rt
an optional field, contains a set of semi-colon separated
\fIname\fB=\fIvalue\fR fields that can be used by
.B FACE
to store any
other information necessary to describe this object.
.RE

.SH FILES
.sp
.LP
\fB\&.ott\fR is created in any directory opened by FACE.
