usr/src/man/man4/ott.4
'\" te
.\" Copyright 1989 AT&T
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ott 4 "3 Jul 1990" "SunOS 5.11" "File Formats"
.SH NAME
ott \- FACE object architecture information
.SH DESCRIPTION
.sp
.LP
The \fBFACE\fR object architecture stores information about object-types in an
\fBASCII\fR file named \fB\&.ott\fR (object type table) that is contained in
each directory. This file describes all of the objects in that directory. Each
line of the \fB\&.ott\fR file contains information about one object in
pipe-separated fields. The fields are (in order):
.sp
.ne 2
.mk
.na
\fIname\fR
.ad
.RS 22n
.rt
the name of the actual system file.
.RE

.sp
.ne 2
.mk
.na
\fIdname\fR
.ad
.RS 22n
.rt
the name that should be displayed to the user, or a dot if it is the same as
the name of the file.
.RE

.sp
.ne 2
.mk
.na
\fIdescription\fR
.ad
.RS 22n
.rt
the description of the object, or a dot if the description is the default (the
same as object-type).
.RE

.sp
.ne 2
.mk
.na
\fIobject-type\fR
.ad
.RS 22n
.rt
the \fBFACE\fR internal object type name.
.RE

.sp
.ne 2
.mk
.na
\fIflags\fR
.ad
.RS 22n
.rt
object specific flags.
.RE

.sp
.ne 2
.mk
.na
\fImod time\fR
.ad
.RS 22n
.rt
the time that \fBFACE\fR last modified the object. The time is given as number
of seconds since 1/1/1970, and is in hexadecimal notation.
.RE

.sp
.ne 2
.mk
.na
\fIobject information\fR
.ad
.RS 22n
.rt
an optional field, contains a set of semi-colon separated
\fIname\fB=\fIvalue\fR fields that can be used by \fBFACE\fR to store any
other information necessary to describe this object.
.RE

.SH FILES
.sp
.LP
\fB\&.ott\fR is created in any directory opened by FACE.
