usr/src/man/man4/pam.conf.4
'\" te
.\" Copyright (C) 2006, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH pam.conf 4 "19 June 2006" "SunOS 5.11" "File Formats"
.SH NAME
pam.conf \- configuration file for pluggable authentication modules
.SH SYNOPSIS
.LP
.nf
\fB/etc/pam.conf\fR
.fi

.SH DESCRIPTION
.sp
.LP
.B pam.conf
is the configuration file for the Pluggable Authentication
Module architecture, or
.BR PAM .
A
.B PAM
module provides functionality
for one or more of four possible services: authentication, account
management, session management, and password management.
.sp
.ne 2
.mk
.na
.B authentication service module
.ad
.sp .6
.RS 4n
Provides functionality to authenticate a user and set up user credentials.

.RE

.sp
.ne 2
.mk
.na
.B account management module
.ad
.sp .6
.RS 4n
Provides functionality to determine if the current user's account is valid.
This includes checking for password and account expiration, as well as
verifying access hour restrictions.
.RE

.sp
.ne 2
.mk
.na
.B session management module
.ad
.sp .6
.RS 4n
Provides functionality to set up and terminate login sessions.
.RE

.sp
.ne 2
.mk
.na
.B password management module
.ad
.sp .6
.RS 4n
Provides functionality to change a user's authentication token or
password.
.RE

.sp
.LP
Each of the four service modules can be implemented as a shared library
object which can be referenced in the
.B pam.conf
configuration file.
.SS "Simplified pam.conf Configuration File"
.sp
.LP
The
.B pam.conf
file contains a listing of services. Each service is
paired with a corresponding service module. When a service is requested, its
associated module is invoked. Each entry may be a maximum of 256 characters,
including the end of line, and has the following format:
.sp
.in +2
.nf
\fIservice_name module_type control_flag module_path options\fR
.fi
.in -2
.sp

.sp
.LP
The following is an example of a
.B pam.conf
configuration file with
support for authentication, account management, session management and
password management modules (See the
.B pam.conf
file that is shipped
with your system for the contents of this file):
.sp
.in +2
.nf
login   auth requisite          pam_authtok_get.so.1
login   auth required           pam_dhkeys.so.1
login   auth required           pam_unix_auth.so.1
login   auth required           pam_dial_auth.so.1

other   account requisite       pam_roles.so.1
other   account required        pam_unix_account.so.1

other   session required        pam_unix_session.so.1

other   password required       pam_dhkeys.so.1
other   password requisite      pam_authtok_get.so.1
other   password requisite      pam_authtok_check.so.1
other   password required       pam_authtok_store.so.1
.fi
.in -2

.sp
.LP
.I service_name
denotes the service (for example,
.BR login ,
.BR dtlogin ,
or
.BR rlogin ).
.sp
.LP
The keyword, "\fBother\fR," indicates the module that all other
applications which have not been specified should use. The "\fBother\fR"
keyword can also be used if all services of the same
.I module_type
have
the same requirements.
.sp
.LP
In the example, since all of the services use the same session module, they
could have been replaced by a single
.B other
line.
.sp
.LP
.I module_type
denotes the service module type: authentication
.RB ( auth ),
account management
.RB ( account ),
session management
.RB ( session ),
or password management
.RB ( password ).
.sp
.LP
The
.I control_flag
field determines the behavior of stacking.
.sp
.LP
The
.I module_path
field specifies the relative pathname to a shared
library object, or an included
.B PAM
configuration file, which
implements the service functionality. If the pathname is not absolute,
shared library objects are assumed to be relative to
.BR /usr/lib/security/$ISA/ ,
and included
.B PAM
configuration files
are assumed to be relative to
.BR /usr/lib/security/ .
.sp
.LP
The
.B ISA
token is replaced by an implementation defined directory name
which defines the path relative to the calling program's instruction set
architecture.
.sp
.LP
The
.I options
field is used by the
.B PAM
framework layer to pass
module specific options to the modules. It is up to the module to parse and
interpret the options.
.sp
.LP
This field can be used by the modules to turn on debugging or to pass any
module specific parameters such as a
.B TIMEOUT
value. The options
supported by the modules are documented in their respective manual pages.
.SS "Integrating Multiple Authentication Services With Stacking"
.sp
.LP
When a
.I service_name
of the same
.I module_type
is defined more
than once, the service is said to be stacked. Each module referenced in the
.I module_path
for that service is then processed in the order that it
occurs in the configuration file. The
.I control_flag
field specifies the
continuation and failure semantics of the modules, and can contain one of
the following values:
.sp
.ne 2
.mk
.na
.B binding
.ad
.RS 14n
.rt
If the service module returns success and no preceding
.BR required
modules returned failures, immediately return success without calling any
subsequent modules. If a failure is returned, treat the failure as a
.B required
module failure, and continue to process the
.B PAM
stack.
.RE

.sp
.ne 2
.mk
.na
.B include
.ad
.RS 14n
.rt
Process the  lines from the
.B PAM
configuration file that is specified
in the
.I module_path
at this point in the
.B PAM
stack. The
.RB `` other ''
keyword is used if the specified service_name is not found.
32 levels of included
.B PAM
configuration files are supported. Any
options are ignored.
.RE

.sp
.ne 2
.mk
.na
.B optional
.ad
.RS 14n
.rt
If the service module returns success, record the success, and continue to
process the
.B PAM
stack. If a failure is returned, and it is the first
.B optional
module failure, save the failure code as an
.B optional
failure. Continue to process the
.B PAM
stack.
.RE

.sp
.ne 2
.mk
.na
.B required
.ad
.RS 14n
.rt
If the service module returns success, record the success, and continue to
process the
.B PAM
stack. If a failure is returned, and it is the first
.B required
failure, save the failure code as a
.B required
failure.
Continue to process the
.B PAM
stack.
.RE

.sp
.ne 2
.mk
.na
.B requisite
.ad
.RS 14n
.rt
If the service module returns success, record the success, and continue to
process the
.B PAM
stack. If a failure is returned, immediately return
the first non-optional failure value recorded without calling any subsequent
modules. That is, return this failure unless a previous required service
module failed. If a previous required service module failed, then return the
first of those values.
.RE

.sp
.ne 2
.mk
.na
.B sufficient
.ad
.RS 14n
.rt
If the service module return success and no preceding required modules
returned failures, immediately return success without calling any subsequent
modules. If a failure is returned, treat the failure as an optional module
failure, and continue to process the
.B PAM
stack.
.RE

.sp
.LP
If the
.B PAM
stack runs to completion, that is, neither a
.B requisite
module failed, nor a
.B binding
or
.B sufficient
module success stops it, success is returned if no required modules failed
and at least one required, requisite, optional module succeeded. If no
module succeeded and a required or binding module failed, the first of those
errors is returned. If no required or binding module failed and an optional
module failed, the first of the option module errors is returned. If no
module in the stack succeeded or failed, that is, all modules returned an
ignore status, a default error based on module type, for example, "User
account expired," is returned.
.sp
.LP
All errors in
.B pam.conf
entries are logged to
.B syslog
as
.B LOG_AUTH
|
.B LOG_ERR
errors. The use of a service with an error
noted in the
.B pam.conf
entry for that service will fail. The system
administrator will need to correct the noted errors before that service may
be used. If no services are available or the
.B pam.conf
file is missing,
the system administrator may enter system maintenance mode to correct or
restore the file.
.sp
.LP
The following is a sample configuration file that stacks the
.BR su ,
.BR login ,
and
.B rlogin
services.
.sp
.in +2
.nf
su     auth required       pam_inhouse.so.1
su     auth requisite      pam_authtok_get.so.1
su     auth required       pam_dhkeys.so.1
su     auth required       pam_unix_auth.so.1

login   auth requisite     pam_authtok_get.so.1
login   auth required      pam_dhkeys.so.1
login   auth required      pam_unix_auth.so.1
login   auth required      pam_dial_auth.so.1
login   auth optional      pam_inhouse.so.1

rlogin  auth sufficient    pam_rhosts_auth.so.1
rlogin  auth requisite     pam_authtok_get.so.1
rlogin  auth required      pam_dhkeys.so.1
rlogin  auth required      pam_unix_auth.so.1
.fi
.in -2

.sp
.LP
In the case of
.BR su ,
the user is authenticated by the
.B inhouse
and
.BR authtok_get ,
.BR dhkeys ,
and
.B unix_auth
authentication modules.
Because the
.B inhouse
and the other authentication modules are
.B required
and
.BR requisite ,
respectively, an error is returned back
to the application if any module fails. In addition, if the
.B requisite
authentication (\fBpam_authtok_get\fR authentication) fails, the other
authentication modules are never invoked, and the error is returned
immediately back to the application.
.sp
.LP
In the case of
.BR login ,
the
.B required
keyword for
.I control_flag
requires that the user be allowed to login only if the
user is authenticated by all the service modules. If
.B pam_unix_auth
authentication fails, control continues to proceed down the stack, and the
.B inhouse
authentication module is invoked.
.B inhouse
authentication
is optional by virtue of the optional keyword in the
.I control_flag
field. The user can still log in even if
.B inhouse
authentication fails,
assuming the modules stacked above succeeded.
.sp
.LP
In the case of
.BR rlogin ,
the
.B sufficient
keyword for
.I control_flag
specifies that if the
.B rhosts
authentication check
succeeds, then
.B PAM
should return success to
.B rlogin
and
.B rlogin
should not prompt the user for a password. The other
authentication modules, which are in the stack, will only be invoked if the
.B rhosts
check fails. This gives the system administrator the
flexibility to determine if
.B rhosts
alone is sufficient enough to
authenticate a remote user.
.sp
.LP
Some modules return
.B PAM_IGNORE
in certain situations. In these cases
the
.B PAM
framework ignores the entire entry in
.B pam.conf
regardless of whether or not it is
.BR binding ,
.BR requisite ,
.BR required ,
.BR optional ,
or
.BR sufficient .
.SS "Utilities and Files"
.sp
.LP
The specific service names and module types for each service should be
documented in the man page for that service. For instance, the
.BR sshd (1M)
man page lists all of the
.B PAM
service names and module
types for the
.B sshd
command.
.sp
.LP
The
.B PAM
configuration file does not dictate either the name or the
location of the service specific modules. The convention, however, is the
following:
.sp
.ne 2
.mk
.na
.B pam_module_name.so.x
.ad
.RS 29n
.rt
File that implements various function of specific authentication services.
As the relative pathname specified,
.B /usr/lib/security/$ISA
is
prepended to it.
.RE

.sp
.ne 2
.mk
.na
.B /etc/pam.conf
.ad
.RS 29n
.rt
Configuration file
.RE

.sp
.ne 2
.mk
.na
.B /usr/lib/$ISA/libpam.so.1
.ad
.RS 29n
.rt
File that implements the
.B PAM
framework library
.RE

.SH EXAMPLES
.LP
.B Example 1
Using the include control flag
.sp
.LP
The following example collects the common Unix modules into a single file
to be included as needed in the example of a
.B pam.conf
file. The common
Unix module file is named
.B unix_common
and consists of:

.sp
.in +2
.nf
OTHER   auth requisite          pam_authtok_get.so.1
OTHER   auth required           pam_dhkeys.so.1
OTHER   auth required           pam_unix_auth.so.1
OTHER   auth required           pam_unix_cred.so.1
OTHER   account requisite       pam_roles.so.1
OTHER   account required        pam_unix_account.so.1
OTHER   session required        pam_unix_session.so.1
OTHER   password required       pam_dhkeys.so.1
OTHER   password requisite      pam_authtok_get.so.1
OTHER   password requisite      pam_authtok_check.so.1
OTHER   password required       pam_authtok_store.so.1
.fi
.in -2
.sp

.sp
.LP
The
.B pam.conf
file and consists of:

.sp
.in +2
.nf
# Authentication management
#
# login service (explicit because of pam_dial_auth)
#
login   auth include            unix_common
login   auth required           pam_dial_auth.so.1
#
# rlogin service (explicit because of pam_rhost_auth)
#
rlogin  auth sufficient         pam_rhosts_auth.so.1
rlogin  auth include            unix_common
#
# Default definitions for Authentication management
# Used when service name is not explicitly mentioned
#
OTHER   auth include            unix_common
#
# Default definition for Account management
# Used when service name is not explicitly mentioned
#
OTHER   account include	     unix_common
#
# Default definition for Session management
# Used when service name is not explicitly mentioned
#
OTHER   session include         unix_common
#
# Default definition for  Password management
# Used when service name is not explicitly mentioned
#
OTHER   password include        unix_common
.fi
.in -2
.sp

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilitySee Below.
.TE

.sp
.LP
The format is Stable. The contents has no stability attributes.
.SH SEE ALSO
.sp
.LP
.BR login (1),
.BR passwd (1),
.BR in.ftpd (1M),
.BR in.rlogind (1M),
.BR in.rshd (1M),
.BR in.telnetd (1M),
.BR in.uucpd (1M),
.BR init (1M),
.BR rpc.rexd (1M),
.BR sac (1M),
.BR ttymon (1M),
.BR su (1M),
.BR pam (3PAM),
.BR syslog (3C),
.BR libpam (3LIB),
.BR attributes (5),
.BR environ (5),
.BR pam_authtok_check (5),
.BR pam_authtok_get (5),
.BR pam_authtok_store (5),
.BR pam_dhkeys (5),
.BR pam_krb5 (5),
.BR pam_passwd_auth (5),
.BR pam_unix_account (5),
.BR pam_unix_auth (5),
.BR pam_unix_session (5)
.SH NOTES
.sp
.LP
The
.B pam_unix
module is no longer supported. Similar functionality is
provided by
.BR pam_authtok_check (5),
.BR pam_authtok_get (5),
.BR pam_authtok_store (5),
.BR pam_dhkeys (5),
.BR pam_passwd_auth (5),
.BR pam_unix_account (5),
.BR pam_unix_auth (5),
and
.BR pam_unix_session (5).
.sp
.LP
With the removal of the
.B pam_unix
module, the SunOS delivered PAM
service modules no longer need or support the "\fBuse_first_pass\fR" or
"\fBtry_first_pass\fR" options. This functionality is provided by stacking
.BR pam_authtok_get (5)
above a module that requires a password.
