usr/src/man/man4/passwd.4
'\" te
.\" Copyright (c) 2004, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright 1989 AT&T
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH passwd 4 "28 Jul 2004" "SunOS 5.11" "File Formats"
.SH NAME
passwd \- password file
.SH SYNOPSIS
.LP
.nf
\fB/etc/passwd\fR
.fi

.SH DESCRIPTION
.sp
.LP
The file
.B /etc/passwd
is a local source of information about users'
accounts. The password file can be used in conjunction with other naming
sources, such as the
.B NIS
maps
.B passwd.byname
and
.BR passwd.bygid ,
data from the
.B "NIS+ passwd"
table, or password
data stored on an LDAP server. Programs use the
.BR getpwnam (3C)
routines
to access this information.
.sp
.LP
Each
.B passwd
entry is a single line of the form:
.sp
.in +2
.nf
\fIusername\fB:\fIpassword\fB:\fIuid\fB:\fR
\fIgid\fB:\fIgcos-field\fB:\fIhome-dir\fB:\fR
\fIlogin-shell\fR
.fi
.in -2
.sp

.sp
.LP
where
.sp
.ne 2
.mk
.na
.I username
.ad
.RS 15n
.rt
is the user's login name.
.sp
The login (\fBlogin\fR) and role (\fBrole\fR) fields accept a string of no
more than eight bytes consisting of characters from the set of alphabetic
characters, numeric characters, period (\fB\&.\fR), underscore
.RB ( _ ),
and
hyphen
.RB ( - ).
The first character should be alphabetic and the field
should contain at least one lower case alphabetic character. A warning
message is displayed if these restrictions are not met.
.sp
The
.B login
and
.B role
fields must contain at least one character
and must not contain a colon (\fB:\fR) or a newline (\fB\en\fR).
.RE

.sp
.ne 2
.mk
.na
.I password
.ad
.RS 15n
.rt
is an empty field. The encrypted password for the user is in the
corresponding entry in the
.B /etc/shadow
file.
.BR pwconv (1M)
relies on
a special value of '\fBx\fR' in the password field of
.BR /etc/passwd .
If
this value of '\fBx\fR' exists in the password field of \fB/etc/passwd\fR,
this indicates that the password for the user is already in
.BR /etc/shadow
and should not be modified.
.RE

.sp
.ne 2
.mk
.na
.I uid
.ad
.RS 15n
.rt
is the user's unique numerical
.B ID
for the system.
.RE

.sp
.ne 2
.mk
.na
.I gid
.ad
.RS 15n
.rt
is the unique numerical
.B ID
of the group that the user belongs to.
.RE

.sp
.ne 2
.mk
.na
\fIgcos-field\fR
.ad
.RS 15n
.rt
is the user's real name, along with information to pass along in a
mail-message heading. (It is called the gcos-field for historical reasons.)
An ``\fB&\fR\&'' (ampersand) in this field stands for the login name (in
cases where the login name appears in a user's real name).
.RE

.sp
.ne 2
.mk
.na
.I home-dir
.ad
.RS 15n
.rt
is the pathname to the directory in which the user is initially positioned
upon logging in.
.RE

.sp
.ne 2
.mk
.na
.I login-shell
.ad
.RS 15n
.rt
is the user's initial shell program. If this field is empty, the default
shell is
.BR /usr/bin/sh .
.RE

.sp
.LP
The maximum value of the
.I uid
and
.I gid
fields is
.BR 2147483647 .
To maximize interoperability and compatibility, administrators are
recommended to assign users a range of \fBUID\fRs and \fBGID\fRs below
\fB60000\fR where possible. (\fBUID\fRs from \fB0\fR-\fB99\fR inclusive are
reserved by the operating system vendor for use in future applications. Their
use by end system users or vendors of layered products is not supported and
may cause security related issues with future applications.)
.sp
.LP
The password file is an
.B ASCII
file that resides in the
.BR /etc
directory. Because the encrypted passwords on a secure system are always kept
in the
.B shadow
file,
.B /etc/passwd
has general read permission on
all systems and can be used by routines that map between numerical user
\fBID\fRs and user names.
.sp
.LP
Blank lines are treated as malformed entries in the
.B passwd
file and
cause consumers of the file , such as \fBgetpwnam\fR(3C), to fail.
.sp
.LP
The password file can contain entries beginning with a `+' (plus sign) or
\&'-' (minus sign) to selectively incorporate entries from another naming
service source, such as NIS, NIS+, or LDAP.
.sp
.LP
A line beginning with a '+' means to incorporate entries from the naming
service source. There are three styles of the '+' entries in this file. A
single + means to insert all the entries from the alternate naming service
source at that point, while a +\fIname\fR means to insert the specific entry,
if one exists, from the naming service source. A +@\fInetgroup\fR means to
insert the entries for all members of the network group
.I netgroup
from
the alternate naming service. If a +\fIname\fR entry has a non-null
.BR password ,
.IR gcos ,
.IR home-dir ,
or
.I login-shell
field, the
value of that field overrides what is contained in the alternate naming
service. The
.I uid
and
.I gid
fields cannot be overridden.
.sp
.LP
A line beginning with a `\(mi' means to disallow entries from the alternate
naming service. There are two styles of `-` entries in this file. -\fIname\fR
means to disallow any subsequent entries (if any) for
.I name
(in this
file or in a naming service), and -@\fInetgroup\fR means to disallow any
subsequent entries for all members of the network group
.IR netgroup .
.sp
.LP
This is also supported by specifying ``passwd : compat'' in
\fBnsswitch.conf\fR(4). The "compat" source might not be supported in future
releases. The preferred sources are \fBfiles\fR followed by the identifier of
a name service, such as
.B nis
or
.BR ldap .
This has the effect of
incorporating the entire contents of the naming service's \fBpasswd\fR
database or password-related information after the
.B passwd
file.
.sp
.LP
Note that in compat mode, for every
.B /etc/passwd
entry, there must be a
corresponding entry in the
.B /etc/shadow
file.
.sp
.LP
Appropriate precautions must be taken to lock the
.B /etc/passwd
file
against simultaneous changes if it is to be edited with a text editor;
.BR vipw (1B)
does the necessary locking.
.SH EXAMPLES
.LP
\fBExample 1\fR Sample \fBpasswd\fR File
.sp
.LP
The following is a sample
.B passwd
file:

.sp
.in +2
.nf
root:x:0:1:Super-User:/:/sbin/sh
fred:6k/7KCFRPNVXg:508:10:& Fredericks:/usr2/fred:/bin/csh
.fi
.in -2
.sp

.sp
.LP
and the sample password entry from \fBnsswitch.conf\fR:

.sp
.in +2
.nf
passwd: files ldap
.fi
.in -2
.sp

.sp
.LP
In this example, there are specific entries for users
.B root
and
\fBfred\fR to assure that they can login even when the system is running
single-user. In addition, anyone whose password information is stored on an
LDAP server will be able to login with their usual password, shell, and home
directory.

.sp
.LP
If the password file is:

.sp
.in +2
.nf
root:x:0:1:Super-User:/:/sbin/sh
fred:6k/7KCFRPNVXg:508:10:& Fredericks:/usr2/fred:/bin/csh
+
.fi
.in -2
.sp

.sp
.LP
and the password entry in \fBnsswitch.conf\fR is:

.sp
.in +2
.nf
passwd: compat
.fi
.in -2
.sp

.sp
.LP
then all the entries listed in the
.B "NIS passwd.byuid"
and
\fBpasswd.byname\fR maps will be effectively incorporated after the entries
for
.B root
and
.BR fred .
If the password entry in \fBnsswitch.conf\fR
is:

.sp
.in +2
.nf
passwd_compat: ldap
passwd: compat
.fi
.in -2

.sp
.LP
then all password-related entries stored on the LDAP server will be
incorporated after the entries for
.B root
and \fBfred\fR.

.sp
.LP
The following is a sample
.B passwd
file when
.B shadow
does not
exist:

.sp
.in +2
.nf
root:q.mJzTnu8icf.:0:1:Super-User:/:/sbin/sh
fred:6k/7KCFRPNVXg:508:10:& Fredericks:/usr2/fred:/bin/csh
+john:
+@documentation:no-login:
+::::Guest
.fi
.in -2
.sp

.sp
.LP
The following is a sample
.B passwd
file when
.B shadow
does exist:

.sp
.in +2
.nf
root:##root:0:1:Super-User:/:/sbin/sh
fred:##fred:508:10:& Fredericks:/usr2/fred:/bin/csh
+john:
+@documentation:no-login:
+::::Guest
.fi
.in -2
.sp

.sp
.LP
In this example, there are specific entries for users
.B root
and
\fBfred\fR, to assure that they can log in even when the system is running
standalone. The user
.B john
will have his password entry in the naming
service source incorporated without change, anyone in the netgroup
\fBdocumentation\fR will have their password field disabled, and anyone else
will be able to log in with their usual password, shell, and home directory,
but with a
.I gcos
field of
.BR Guest

.SH FILES
.sp
.ne 2
.mk
.na
\fB/etc/nsswitch.conf\fR
.ad
.RS 22n
.rt

.RE

.sp
.ne 2
.mk
.na
.B /etc/passwd
.ad
.RS 22n
.rt

.RE

.sp
.ne 2
.mk
.na
.B /etc/shadow
.ad
.RS 22n
.rt

.RE

.SH SEE ALSO
.sp
.LP
.BR chgrp (1),
.BR chown (1),
\fBfinger\fR(1), \fBgroups\fR(1),
.BR login (1),
.BR newgrp (1),
.BR nispasswd (1),
.BR passwd (1),
.BR sh (1),
.BR sort (1),
.BR domainname (1M),
.BR getent (1M),
\fBin.ftpd\fR(1M), \fBpassmgmt\fR(1M), \fBpwck\fR(1M), \fBpwconv\fR(1M),
.BR su (1M),
.BR useradd (1M),
.BR userdel (1M),
.BR usermod (1M),
.BR a64l (3C),
.BR crypt (3C),
.BR getpw (3C),
.BR getpwnam (3C),
.BR getspnam (3C),
.BR putpwent (3C),
.BR group (4),
.BR hosts.equiv (4),
\fBnsswitch.conf\fR(4),
.BR shadow (4),
.BR environ (5),
.BR unistd.h (3HEAD)
.sp
.LP
.I System Administration Guide: Basic Administration
