usr/src/man/man4/path_to_inst.4
'\" te
.\" Copyright 1992 Sun Microsystems Inc.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH path_to_inst 4 "18 May 2007" "SunOS 5.11" "File Formats"
.SH NAME
path_to_inst \- device instance number file
.SH SYNOPSIS
.LP
.nf
\fB/etc/path_to_inst\fR
.fi

.SH DESCRIPTION
.sp
.LP
.B /etc/path_to_inst
records mappings of physical device names to
instance numbers.
.sp
.LP
The instance number of a device is encoded in its minor number, and is the
way that a device driver determines which of the possible devices that it
may drive is referred to by a given special file.
.sp
.LP
In order to keep instance numbers persistent across reboots, the system
records them in
.BR /etc/path_to_inst .
.sp
.LP
This file is read only at boot time, and is updated by
.BR add_drv (1M)
and
.BR devfsadm (1M).
.sp
.LP
Note that it is generally not necessary for the system administrator to
change this file, as the system will maintain it.
.sp
.LP
The system administrator can change the assignment of instance numbers by
editing this file and doing a reconfiguration reboot. However, any changes
made in this file will be lost if
.BR add_drv (1M)
or
.BR devfsadm (1M)
is
run before the system is rebooted.
.sp
.LP
Each instance entry is a single line of the form:
.sp
.in +2
.nf
\fB"\fIphysical name\fB"\fR \fIinstance\fR \fInumber\fR \fB"\fIdriver binding name\fB"\fR
.fi
.in -2

.sp
.LP
where
.sp
.ne 2
.mk
.na
.I physical name
.ad
.RS 23n
.rt
is the absolute physical pathname of a device. This pathname must be
enclosed in double quotes.
.RE

.sp
.ne 2
.mk
.na
.I instance number
.ad
.RS 23n
.rt
is a decimal or hexadecimal number.
.RE

.sp
.ne 2
.mk
.na
.I driver binding name
.ad
.RS 23n
.rt
is the name used to determine the driver for the device. This name may be a
driver alias or a driver name. The driver binding name must be enclosed in
double quotes.
.RE

.SH EXAMPLES
.LP
.B Example 1
Sample
.B path_to_inst
Entries
.sp
.LP
Here are some sample
.B path_to_inst
entries:

.sp
.in +2
.nf
"/iommu@f,e0000000" 0 "iommu"
"/iommu@f,e0000000/sbus@f,e0001000" 0 "sbus"
"/iommu@f,e0000000/sbus@f,e0001000/sbusmem@e,0" 14 "sbusmem"
"/iommu@f,e0000000/sbus@f,e0001000/sbusmem@f,0" 15 "sbusmem"
"/iommu@f,e0000000/sbus@f,e0001000/ledma@f,400010" 0 "ledma"
"/obio/serial@0,100000" 0 "zs"
"/SUNW,sx@f,80000000" 0 "SUNW,sx"
.fi
.in -2
.sp

.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/path_to_inst
.ad
.RS 21n
.rt
Mapping of physical device names to instance numbers.
.RE

.SH SEE ALSO
.sp
.LP
.BR add_drv (1M),
.BR boot (1M),
.BR devfsadm (1M),
.BR mknod (1M)
.SH WARNINGS
.sp
.LP
If the file is removed the system may not be bootable (as it may rely on
information found in this file to find the root, usr or swap device). If it
does successfully boot, it will regenerate the file, but after rebooting
devices may end up having different minor numbers than they did before, and
special files created via
.BR mknod (1M)
may refer to different devices
than expected.
.sp
.LP
For the same reasons, changes should not be made to this file without
careful consideration.
.SH NOTES
.sp
.LP
This document does not constitute an API.
.B path_to_inst
may not exist
or may have a different content or interpretation in a future release. The
existence of this notice does not imply that any other documentation that
lacks this notice constitutes an API.
