usr/src/man/man4/phones.4
'\" te
.\" Copyright (c) 1992, Sun Microsystems, Inc.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH phones 4 "14 Jan 1992" "SunOS 5.11" "File Formats"
.SH NAME
phones \- remote host phone number database
.SH SYNOPSIS
.LP
.nf
\fB/etc/phones\fR
.fi

.SH DESCRIPTION
.sp
.LP
The file
.B /etc/phones
contains the system-wide private phone numbers
for the
.BR tip (1)
program.
.B /etc/phones
is normally unreadable, and
so may contain privileged information.  The format of
.B /etc/phones
is a
series of lines of the form:
.sp
.in +2
.nf
\fB<\fIsystem-name\fB>[ \et]*<\fIphone-number\fB>.\fR
.fi
.in -2

.sp
.LP
The system name is one of those defined in the
.BR remote (4)
file and the
phone number is constructed from \fB[0123456789\(mi=*%]\fR. The `\fB=\fR'
and `\fB*\fR' characters are indicators to the auto call units to pause and
wait for a second dial tone (when going through an exchange).  The `\fB=\fR'
is required by the
.B DF02-AC
and the `\fB*\fR' is required by the
.B BIZCOMP
1030.
.sp
.LP
Comment lines are lines containing a `\fB#\fR' sign in the first column of
the line.
.sp
.LP
Only one phone number per line is permitted. However, if more than one line
in the file contains the same system name
.BR tip (1)
will attempt to dial
each one in turn, until it establishes a connection.
.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/phones
.ad
.RS 15n
.rt

.RE

.SH SEE ALSO
.sp
.LP
.BR tip (1),
.BR remote (4)
