usr/src/man/man4/policy.conf.4
'\" te
.\" Copyright (c) 2008, Sun Microsystems, Inc. All Rights Reserved.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH policy.conf 4 "25 Feb 2008" "SunOS 5.11" "File Formats"
.SH NAME
policy.conf \- configuration file for security policy
.SH SYNOPSIS
.LP
.nf
/etc/security/policy.conf
.fi

.SH DESCRIPTION
.sp
.LP
The
.B policy.conf
file provides the security policy configuration for
user-level attributes. Each entry consists of a key/value pair in the
form:
.sp
.LP
key=value
.sp
.LP
The following keys are defined:
.sp
.ne 2
.mk
.na
.B AUTHS_GRANTED
.ad
.sp .6
.RS 4n
Specify the default set of authorizations granted to all users. This entry
is interpreted by
.BR chkauthattr "(3SECDB). The value is zero or more"
comma-separated authorizations defined in
.BR auth_attr (4).
.RE

.sp
.ne 2
.mk
.na
.B PROFS_GRANTED
.ad
.sp .6
.RS 4n
Specify the default set of profiles granted to all users. This entry is
interpreted by
.BR chkauthattr "(3SECDB) and"
.BR getexecuser (3SECDB).
The
value is zero or more comma-separated profiles defined in
.BR prof_attr (4).
.RE

.sp
.ne 2
.mk
.na
.B CONSOLE_USER
.ad
.sp .6
.RS 4n
Specify an additional default set of profiles granted to the \fIconsole
user\fR user. This entry is interpreted by
.BR chkauthattr (3SECDB)
and
.BR getexecuser (3SECDB).
The value is zero or more comma-separated
profiles defined in
.BR prof_attr (4).
.RE

.sp
.ne 2
.mk
.na
.B PRIV_DEFAULT
and
.BR PRIV_LIMIT
.ad
.sp .6
.RS 4n
Settings for these keys determine the default privileges that users have.
(See
.BR privileges (5).)
If these keys are not set, the default privileges
are taken from the inherited set.
.B PRIV_DEFAULT
determines the default
set on login.
.B PRIV_LIMIT
defines the limit set on login. Users can
have privileges assigned or taken away through use of
.BR user_attr (4).
Privileges can also be assigned to profiles, in which case users who have
those profiles can exercise the assigned privileges through
.BR pfexec (1).
.sp
For maximum future compatibility, the privilege specifications should
always include
.B basic
or
.BR all .
Privileges should then be removed
using negation. See EXAMPLES. By assigning privileges in this way, you avoid
a situation where, following an addition of a currently unprivileged
operation to the basic privilege set, a user unexpectedly does not have the
privileges he needs to perform that now-privileged operation.
.sp
Note that removing privileges from the limit set requires
.BR extreme
care, as any set-uid root program might suddenly fail because it lacks
certain privilege(s). Note also that dropping
.B basic
privileges from
the default privilege set can cause unexpected failure modes in
applications.
.RE

.sp
.ne 2
.mk
.na
.B LOCK_AFTER_RETRIES=YES|NO
.ad
.sp .6
.RS 4n
Specifies whether a local account is locked after the count of failed
logins for a user equals or exceeds the allowed number of retries as defined
by
.B RETRIES
in
.BR /etc/default/login .
The default value for users is
.BR NO .
Individual account overrides are provided by
.BR user_attr (4).
.RE

.sp
.ne 2
.mk
.na
.B CRYPT_ALGORITHMS_ALLOW
.ad
.sp .6
.RS 4n
Specify the algorithms that are allowed for new passwords and is enforced
only in
.BR crypt_gensalt (3C).
.RE

.sp
.ne 2
.mk
.na
.B CRYPT_ALGORITHMS_DEPRECATE
.ad
.sp .6
.RS 4n
Specify the algorithm for new passwords that is to be deprecated. For
example, to deprecate use of the traditional UNIX algorithm, specify
.B CRYPT_ALGORITHMS_DEPRECATE=__unix__
and change
.B CRYPT_DEFAULT=
to
another algorithm, such as
.B CRYPT_DEFAULT=1
for BSD and Linux MD5.
.RE

.sp
.ne 2
.mk
.na
.B CRYPT_DEFAULT
.ad
.sp .6
.RS 4n
Specify the default algorithm for new passwords. The Solaris default is the
traditional UNIX algorithm. This is not listed in
.BR crypt.conf (4)
since
it is internal to
.BR libc .
The reserved name
.B __unix__
is used to
refer to it.
.RE

.sp
.LP
The key/value pair must appear on a single line, and the key must start the
line. Lines starting with
.B #
are taken as comments and ignored. Option
name comparisons are case-insensitive.
.sp
.LP
Only one
.B CRYPT_ALGORITHMS_ALLOW
or
.BR CRYPT_ALGORITHMS_DEPRECATE
value can be specified. Whichever is listed first in the file takes
precedence. The algorithm specified for
.B CRYPT_DEFAULT
must either be
specified for
.B CRYPT_ALGORITHMS_ALLOW
or not be specified for
.BR CRYPT_ALGORITHMS_DEPRECATE .
If
.B CRYPT_DEFAULT
is not specified,
the default is
.BR __unix__ .
.SH EXAMPLES
.LP
.B Example 1
Defining a Key/Value Pair
.sp
.in +2
.nf
\fBAUTHS_GRANTED=solaris.date\fR
.fi
.in -2
.sp

.LP
.B Example 2
Specifying Privileges
.sp
.LP
As noted above, you should specify privileges through negation, specifying
.B all
for
.B PRIV_LIMIT
and
.B basic
for
.BR PRIV_DEFAULT ,
then
subtracting privileges, as shown below.

.sp
.in +2
.nf
PRIV_LIMIT=all,!sys_linkdir
PRIV_DEFAULT=basic,!file_link_any
.fi
.in -2

.sp
.LP
The first line, above, takes away only the
.B sys_linkdir
privilege. The
second line takes away only the
.B file_link
privilege. These privilege
specifications are unaffected by any future addition of privileges that
might occur.

.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/user_attr
.ad
.RS 29n
.rt
Defines extended user attributes.
.RE

.sp
.ne 2
.mk
.na
.B /etc/security/auth_attr
.ad
.RS 29n
.rt
Defines authorizations.
.RE

.sp
.ne 2
.mk
.na
.B /etc/security/prof_attr
.ad
.RS 29n
.rt
Defines profiles.
.RE

.sp
.ne 2
.mk
.na
.B /etc/security/policy.conf
.ad
.RS 29n
.rt
Defines policy for the system.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWcsu
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
.BR login (1),
.BR pfexec (1),
.BR chkauthattr (3SECDB),
.BR getexecuser (3SECDB),
.BR auth_attr (4),
.BR crypt.conf (4),
.BR prof_attr (4),
.BR user_attr (4),
.BR attributes (5),
.BR privileges (5)
.SH NOTES
.sp
.LP
The
.I "console user"
is defined as the owner of
.BR /dev/console .
