usr/src/man/man4/power.conf.4
'\" te
.\" Copyright (C) 2009, Sun Microsystems, Inc. All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH power.conf 4 "27 Feb 2009" "SunOS 5.11" "File Formats"
.SH NAME
power.conf \- Power Management configuration information file
.SH SYNOPSIS
.LP
.nf
\fB/etc/power.conf\fR
.fi

.SH DESCRIPTION
.sp
.LP
The \fBpower.conf\fR file is used by the Power Management configuration
program \fBpmconfig\fR(1M), to initialize the settings for Power Management.
If you make changes to this file, you must run \fBpmconfig\fR(1M) manually
for the changes to take effect.
.sp
.LP
The \fBdtpower\fR(1M) GUI allows the configuration of a subset of
parameters allowed by this file. For ease-of-use, it is recommended that you
use \fBdtpower\fR(1M) to configure the parameters. See the \fBEXAMPLES\fR
section for information on disabling Power Management.
.sp
.LP
Power Management addresses two specific management scenarios: management of
individual devices and management of the whole system. An individual device
is power managed if the device supports multiple power levels and if the
device driver uses Power Management interfaces provided by the kernel to
save device power when the device is idle.
.sp
.LP
All entries in the \fBpower.conf\fR file are processed in the order that
they occur in the file.
.SS "Automatic Device Power Management"
.sp
.LP
Devices with drivers that use the automatic device Power Management
interfaces are automatically power managed if the
.B autopm
entry is
enabled. The
.B autopm
entry is described near the end of this section.
The
.B pm-components
property describes the Power Management model of a
device driver to the Power Management framework. See \fBpm-components\fR(9P)
for more information.
.sp
.LP
When a component has been idle at a given power level for its threshold
time, the power level of the component is reduced to the next lower power
level of that component, if any. For devices which implement multiple
components, each component is power-managed independently.
.sp
.LP
Default thresholds for components of automatically power managed devices
are computed by the Power Management framework based on the system idleness
threshold. By default, all components of the device are powered off if they
have all been idle for the system's idleness threshold. The default system
idleness threshold is determined by the applicable United States
Environmental Protection Agency's (EPA) \fIEnergy Star Memorandum of
Understanding\fR. See the \fBNOTES\fR section of this manual page for more
information.
.sp
.LP
To set the system idleness
.IR threshold ,
use one of the following
entries:
.sp
.in +2
.nf
system-threshold \fIthreshold\fR
.fi
.in -2

.sp
.in +2
.nf
system-threshold \fBalways-on\fR
.fi
.in -2

.sp
.LP
where
.I threshold
is the value of the system idleness threshold in
hours, minutes or seconds as indicated by a trailing
.BR h ,
\fBm\fR or
\fBs\fR (defaulting to seconds if only a number is given). If
\fBalways-on\fR is specified, then by default, all devices are left at full
power.
.sp
.LP
The
.B system-threshold
entry is applicable to CPU Power Management only
when CPU Power Management has been configured to operate in poll-mode, which
is expressed through the
.B cpupm
keyword.
.sp
.LP
If a system has power manageable CPUs, these can be managed independently
of the system idleness threshold by using one of the following entries:
.sp
.in +2
.nf
cpu-threshold \fIthreshold\fR
.fi
.in -2

.sp
.in +2
.nf
cpu-threshold \fBalways-on\fR
.fi
.in -2

.sp
.LP
where
.I threshold
is the value of the CPU idleness threshold in hours,
minutes or seconds as indicated by a trailing
.BR h ,
\fBm\fR or \fBs\fR
(defaulting to seconds if only a number is given). If
.B always-on
is
specified, then by default, all CPUs are left at full power.
.sp
.LP
The
.B cpu-threshold
keyword is used only when CPU Power Management has
been configured to operate in poll-mode, which is expressed through the
\fBcpupm\fR keyword.
.sp
.LP
If no
.B cpu-threshold
entry is specified, then the system idleness
threshold is used.
.sp
.LP
To override the default device component thresholds assigned by the Power
Management framework, a
.B device-thresholds
entry can be used. A
\fBdevice-thresholds\fR entry sets thresholds for a specific automatically
power-managed device or disables automatic Power Management for the specific
device.
.sp
.LP
A
.B device-thresholds
entry has the form:
.sp
.in +2
.nf
device-thresholds \fIphys_path\fR \fI(threshold .\|.\|.) .\|.\|.\fR
.fi
.in -2

.sp
.LP
or
.sp
.in +2
.nf
device-thresholds \fIphys_path\fR \fIthreshold\fR
.fi
.in -2

.sp
.LP
or
.sp
.in +2
.nf
device-thresholds \fIphys_path\fR \fBalways-on\fR
.fi
.in -2

.sp
.LP
where
.I phys_path
specifies the physical path (\fBlibdevinfo\fR(3LIB))
of a specific device. For example,
\fB/pci@8,600000/scsi@4/ssd@w210000203700c3ee,0\fR specifies the physical
path of a disk. A symbolic link into the
.B /devices
tree, for example
.BR /dev/dsk/c1t1d0s0 ,
is also accepted. The thresholds apply (or keeping
the device always on applies) to the specific device only.
.sp
.LP
In the first form above, each
.I threshold
value represents the number
of hours, minutes or seconds, depending on a trailing
.BR h ,
\fBm\fR or
\fBs\fR with a default to seconds, to spend idle at the corresponding power
level before power is reduced to the next lower level of that component.
Parentheses are used to group thresholds per component, with the first
(leftmost) group being applied to component
.BR 0 ,
the next to component
.BR 1 ,
and the like. Within a group, the last (rightmost) number
represents the time to be idle in the highest power level of the component
before going to the next-to-highest level, while the first (leftmost) number
represents the time to be idle in the next-to-lowest power level before
going to the lowest power level.
.sp
.LP
If the number of groups does not match the number of components exported by
the device (by means of \fBpm-components\fR(9P) property), or the number of
thresholds in a group is not one less than the number of power levels the
corresponding component supports, then an error message is printed and the
entry is ignored.
.sp
.LP
For example, assume a device called \fBxfb\fR exports the components
\fBFrame Buffer\fR and
.BR Monitor .
Component \fBFrame Buffer\fR has two
power levels: \fBOff\fR and
.BR On .
Component
.B Monitor
has four power
levels: \fBOff\fR,
.BR "Suspend, Standby" ,
and
.BR On .
.sp
.LP
The following
.B device-thresholds
entry:
.sp
.in +2
.nf
device-thresholds \fI/pci@f0000/xfb@0 (0) (3m 5m 15m)\fR
.fi
.in -2

.sp
.LP
would set the
.I threshold
time for the
.B Monitor
component of the
specific \fBxfb\fR card to go from
.B On
to
.B "Standby in"
15 minutes,
the
.I threshold
for
.B Monitor
to go from
.B Standby
to
\fBSuspend\fRin 5 minutes, and the \fIthreshold\fR for \fBMonitor\fR to go
from
.B Suspend
to \fBOff\fR in 3 minutes. The threshold for \fBFrame
Buffer\fR to go from \fBOn\fR to \fBOff\fR is 0 seconds.
.sp
.LP
In the second form above, where a single threshold value is specified
without parentheses, the threshold value represents a maximum overall time
within which the entire device should be powered down if it is idle. Because
the system does not know about any internal dependencies there can be among
a device's components, the device can actually be powered down sooner than
the specified
.IR threshold ,
but does take longer than the specified
.IR threshold ,
provided that all device components are idle.
.sp
.LP
In the third form above, all components of the device are left at full
power. 
.sp
.LP
Device Power Management entries are only effective if there is no user
process controlling the device directly. For example, X Windows systems
directly control frame buffers. The entries in the \fBpower.conf\fR file are
effective only when X Windows is not running.
.sp
.LP
Dependencies among devices can also be defined. A device depends upon
another if none of its components might have their power levels reduced
unless all components of the other device are powered off. A dependency can
be indicated by an entry of the form:
.sp
.in +2
.nf
device-dependency \fIdependent_phys_path phys_path [ phys_path .\|.\|. ]\fR
.fi
.in -2

.sp
.LP
where
.I dependent_phys_path
is the path name (as above) of the device
that is kept up by the others, and the
.I phys_path
entries specify the
devices that keep it up. A symbolic link into the
.B /devices
tree, such
as
.BR /dev/fb ,
is also accepted. This entry is needed only for logical
dependents for the device. A logical dependent is a device that is not
physically connected to the power managed device (for example, the display
and the keyboard). Physical dependents are automatically considered and need
not be included.
.sp
.LP
In addition to listing dependents by physical path, an arbitrary group of
devices can be made dependent upon another device by specifying a property
dependency using the following syntax:
.sp
.in +2
.nf
device-dependency-property \fIproperty\fR \fIphys_path\fR [\fIphys_path\fR .\|.\|.]
.fi
.in -2
.sp

.sp
.LP
where each device that exports the property
.I property
is kept up by
the devices named by
.IR phys_path "(s). A symbolic link into the"
\fB/devices\fR tree (such as
.BR /dev/fb )
is accepted as well as a
pathname for
.IR phys_path .
.sp
.LP
For example, the following entry ensures that every device that exports the
boolean property named
.B removable-media
is kept up when the console
framebuffer is up. See \fBremovable-media\fR(9P).
.sp
.in +2
.nf
# This entry keeps removable media from being powered down unless the
# console framebuffer and monitor are powered down
# (See removable-media(9P))
#
device-dependency-property removable-media /dev/fb
.fi
.in -2

.sp
.LP
An
.B autopm
entry can be used to enable or disable automatic device
Power Management on a system-wide basis. The format of the \fBautopm\fR
entry is:
.sp
.in +2
.nf
autopm \fIbehavior\fR
.fi
.in -2

.sp
.LP
Acceptable behavior values are described as follows:
.sp
.ne 2
.mk
.na
\fBdefault\fR
.ad
.RS 11n
.rt
The behavior of the system depends upon its model. Desktop models that fall
under the United States Environmental Protection Agency's \fIEnergy Star
Memorandum of Understanding #3\fR have automatic device Power Management
enabled, and all others do not. See the
.B NOTES
section of this manual
page for more information.
.RE

.sp
.ne 2
.mk
.na
.B enable
.ad
.RS 11n
.rt
Automatic device Power Management is started when this entry is
encountered.
.RE

.sp
.ne 2
.mk
.na
.B disable
.ad
.RS 11n
.rt
Automatic device Power Management is stopped when this entry is
encountered.
.RE

.sp
.LP
A
.B cpupm
entry can be used to enable or disable Power Management of
CPUs on a system-wide basis, independent of
.BR autopm .
The format of the
\fBcpupm\fR entry is:
.sp
.in +2
.nf
cpupm \fIbehavior\fR
.fi
.in -2

.sp
.LP
Acceptable behavior values and their meanings are :
.sp
.ne 2
.mk
.na
.B enable
.ad
.RS 11n
.rt
CPU Power Management is started when this entry is encountered.
.sp
Where the behavior is
.BR enable ,
an optional
.I mode
argument can be
specified: 
.sp
.in +2
.nf
cpupm enable \fImode\fR
.fi
.in -2

Acceptable
.I mode
values and their meanings are:
.sp
.ne 2
.mk
.na
.B event-mode
.ad
.RS 14n
.rt
CPU power state transitions is driven by thread scheduler/dispatcher
events. The
.BR cpu-threshold ,
and
.B system-threshold
keywords are not
used for CPUs in this mode.
.RE

.sp
.ne 2
.mk
.na
.B poll-mode
.ad
.RS 14n
.rt
The Power Management framework polls the idleness of the system's CPUs, and
manages their power once idle for the period of time specified by either the
\fBsystem-threshold\fR or \fBcpu-threshold\fR.
.RE

.RE

.sp
.ne 2
.mk
.na
.B disable
.ad
.RS 11n
.rt
CPU Power Management is stopped when this entry is encountered.
.RE

.sp
.LP
If supported by the platform, a
.B cpu_deep_idle
entry can be used to
enable or disable automatic use of power saving cpu idle states. The format
of the
.B cpu_deep_idle
entry is:
.sp
.in +2
.nf
\fBcpu_deep_idle\fR \fIbehavior\fR
.fi
.in -2
.sp

.sp
.LP
Acceptable values for
.I behavior
are:
.sp
.ne 2
.mk
.na
\fBdefault\fR
.ad
.RS 11n
.rt
Advanced cpu idle power saving features are enabled on hardware which
supports it. On X86 systems this can translate to the use of ACPI C-States
beyond C1.
.RE

.sp
.ne 2
.mk
.na
.B enable
.ad
.RS 11n
.rt
Enables the system to automatically use idle cpu power saving features.
.RE

.sp
.ne 2
.mk
.na
.B disable
.ad
.RS 11n
.rt
The system does not automatically use idle cpu power saving features. This
option can be used when maximum performance is required at the expense of
power.
.RE

.sp
.ne 2
.mk
.na
.B absent
.ad
.RS 11n
.rt
It the
.B cpu_deep_idle
keyword is absent from \fBpower.conf\fR the
behavior is the same as the default case.
.RE

.sp
.LP
Once every device is at its lowest possible power state, additional power
savings can be obtained by putting the system into a sleep state (if the
platform hardware is capable of doing so).
.SS "S3 Support"
.sp
.LP
Because of reliability problems encountered in BIOS implementations of X86
systems not produced by Sun Microsystems, by default, only X86 workstation
products produced by Sun are considered to support S3 (suspend to RAM). To
override this default, an S3-support entry (of the format S3-support
.BR behavior )
can be used to indicate if the system supports S3.
.sp
.LP
Acceptable behavior values are:
.sp
.ne 2
.mk
.na
.B enable
.ad
.RS 11n
.rt
The system supports entry into S3 state. If the BIOS of a system enabled
using an
.B "S3-support enable"
entry does not support entry into S3, the
attempt fails and the system returns to normal operation. If support for S3
in the BIOS of a system enabled via an S3-support entry contains bugs, the
system can be unable to enter S3 or resume successfully, so use this entry
with caution.
.RE

.sp
.ne 2
.mk
.na
.B disable
.ad
.RS 11n
.rt
The system does not support entry into S3 state.
.RE

.SS "Automatic Entry Into S3"
.sp
.LP
If supported by your platform, an autoS3 entry can be used to enable or
disable automatic entry into the S3 state. When in the S3 state, the power
button, keyboard and mouse activity or network traffic (depending upon the
capabilities of the platform hardware) can wake the system, returning it to
the state it was in upon entry to the S3 state. If the platform doesn't
support S3, the entry has no effect.
.sp
.LP
The format of the autoS3 entry is autoS3
.BR behavior .
.sp
.LP
Acceptable behavior values are:
.sp
.ne 2
.mk
.na
\fBdefault\fR
.ad
.RS 11n
.rt
System behavior depends upon model. Sun X86 desktop and workstation models
that fall under the United States Environmental Protection Agency's
\fIEnergy Star Memorandum of Understanding #3\fR have automatic entry into
the S3 state enabled. Non-Sun systems do not. See
.B NOTES
for more
information.
.RE

.sp
.ne 2
.mk
.na
.B enable
.ad
.RS 11n
.rt
Enables the system to automatically enter the S3 state if autopm is enabled
and every device is at its lowest power state.
.RE

.sp
.ne 2
.mk
.na
.B disable
.ad
.RS 11n
.rt
The system does not automatically enter the S3 state.
.RE

.SS "System Power Management"
.sp
.LP
The system Power Management entries control Power Management of the entire
system using the suspend-resume feature. When the system is suspended, the
complete current state is saved on the disk before power is removed. On
reboot, the system automatically starts a resume operation and the system is
restored to the state it was in prior to suspend.
.sp
.LP
The system can be configured to do an automatic shutdown (autoshutdown)
using the suspend-resume feature by an entry of the following form:
.sp
.in +2
.nf
autoshutdown \fIidle_time\fR \fIstart_time\fR \fIfinish_time\fR \fIbehavior\fR
.fi
.in -2

.sp
.LP
\fIidle_time\fR specifies the time in minutes that system must have been
idle before it is automatically shutdown. System idleness is determined by
the inactivity of the system and can be configured as discussed below.
.sp
.LP
\fIstart_time\fR and \fIfinish_time\fR (each in
.BR hh:mm )
specify the
time period during which the system can be automatically shutdown. These
times are measured from the start of the day (12:00 a.m.). If the
\fIfinish_time\fR is less than or equal to the
.IR start_time ,
the period
span from midnight to the \fIfinish_time\fR and from the
.I start_time
to
the following midnight. To specify continuous operation, the
\fIfinish_time\fR can be set equal to the \fIstart_time\fR.
.sp
.LP
Acceptable behavior values are described as follows:
.sp
.ne 2
.mk
.na
.B shutdown
.ad
.RS 16n
.rt
The system is shut down automatically when it has been idle for the number
of minutes specified in the
.I idle_time
value and the time of day falls
between the
.I start_time
and \fIfinish_time\fR values.
.RE

.sp
.ne 2
.mk
.na
.B noshutdown
.ad
.RS 16n
.rt
The system is never shut down automatically.
.RE

.sp
.ne 2
.mk
.na
.B autowakeup
.ad
.RS 16n
.rt
If the hardware has the capability to do
.BR autowakeup ,
the system is
shut down as if the value were
.B shutdown
and the system is restarted
automatically the next time the time of day equals \fIfinish_time\fR.
.RE

.sp
.ne 2
.mk
.na
\fBdefault\fR
.ad
.RS 16n
.rt
The behavior of the system depends upon its model. Desktop models that fall
under the United States Environmental Protection Agency's \fIEnergy Star
Memorandum of Understanding #2\fR have automatic
.B shutdown
enabled, as
if
.I behavior
field were set to
.BR shutdown ,
and all others do not.
See
.BR NOTES .
.RE

.sp
.ne 2
.mk
.na
\fBunconfigured\fR
.ad
.RS 16n
.rt
The system does not be shut down automatically. If the system has just been
installed or upgraded, the value of this field is changed upon the next
reboot.
.RE

.sp
.LP
You can use the following format to configure the system's notion of
idleness:
.sp
.LP
\fBidleness_parameter\fR \fIvalue\fR
.sp
.LP
Where
.B idleness_parameter
can be:
.sp
.ne 2
.mk
.na
.B ttychars
.ad
.RS 15n
.rt
If the
.B idleness_parameter
is
.BR ttychars ,
the
.I value
field is
interpreted as the maximum number of tty characters that can pass through
the
.B ldterm
module while still allowing the system to be considered
idle. This value defaults to
.B 0
if no entry is provided.
.RE

.sp
.ne 2
.mk
.na
.B loadaverage
.ad
.RS 15n
.rt
If the
.B idleness_parameter
is
.BR loadaverage ,
the (floating point)
\fIvalue\fR field is interpreted as the maximum load average that can be
seen while still allowing the system to be considered idle. This value
defaults to
.B 0.04
if no entry is provided.
.RE

.sp
.ne 2
.mk
.na
.B diskreads
.ad
.RS 15n
.rt
If the
.B idleness_parameter
is
.BR diskreads ,
the
.I value
field
is interpreted as the maximum number of disk reads that can be perform by
the system while still allowing the system to be considered idle. This value
defaults to
.B 0
if no entry is provided.
.RE

.sp
.ne 2
.mk
.na
\fBnfsreqs\fR
.ad
.RS 15n
.rt
If the
.B idleness_parameter
is
.BR nfsreqs ,
the
.I value
field is
interpreted as the maximum number of NFS requests that can be sent or
received by the system while still allowing the system to be considered
idle. Null requests, access requests, and
.B getattr
requests are
excluded from this count. This value defaults to
.B 0
if no entry is
provided.
.RE

.sp
.ne 2
.mk
.na
.B idlecheck
.ad
.RS 15n
.rt
If the
.B idleness_parameter
is
.BR idlecheck ,
the
.I value
must be
pathname of a program to be executed to determine if the system is idle. If
\fBautoshutdown\fR is enabled and the console keyboard, mouse, tty, CPU (as
indicated by load average), network (as measured by NFS requests) and disk
(as measured by read activity) have been idle for the amount of time
specified in the
.B autoshutdown
entry specified above, and the time of
day falls between the start and finish times, then this program is executed
to check for other idleness criteria. The
.I value
of the idle time
specified in the above
.B autoshutdown
entry is passed to the program in
the environment variable
.BR PM_IDLETIME .
The process must terminate with
an exit code that represents the number of minutes that the process
considers the system to have been idle.
.sp
There is no default
.I idlecheck
entry.
.RE

.sp
.LP
When the system is suspended, the current system state is saved on the disk
in a statefile. An entry of following form can be used to change the
location of statefile:
.sp
.in +2
.nf
\fBstatefile\fR \fIpathname\fR
.fi
.in -2

.sp
.LP
where
.I pathname
identifies a block special file, for example,
.BR /dev/dsk/c1t0d0s2 ,
or is the absolute pathname of a local \fBufs\fR
file. If the pathname specifies a block special file, it can be a symbolic
link as long as it does not have a file system mounted on it. If pathname
specifies a local ufs file, it cannot be a symbolic link. If the file does
not exist, it is created during the
.B suspend
operation. All the
directory components of the path must already exist.
.sp
.LP
The actual size of statefile depends on a variety of factors, including the
size of system memory, the number of loadable drivers/modules in use, the
number and type of processes running, and the amount of user memory that has
been locked down. It is recommended that statefile be placed on a file
system with at least 10 Mbytes of free space. In case there is no statefile
entry at boot time, an appropriate new entry is automatically created by the
system.
.SH EXAMPLES
.LP
\fBExample 1\fR Disabling Automatic Device Power Management
.sp
.LP
To disable automatic device Power Management, change the following line in
the \fB/etc/power.conf\fR file

.sp
.in +2
.nf
autopm default
.fi
.in -2

.sp
.LP
to read:

.sp
.in +2
.nf
autopm disable
.fi
.in -2

.sp
.LP
Then run \fBpmconfig\fR or reboot. See \fBpmconfig\fR(1M) for more
information.

.sp
.LP
You can also use
.B dtpower
to disable automatic device Power
Management. See \fBdtpower\fR(1M) for more information.

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWpmr
_
Interface stability Committed
.TE

.SH SEE ALSO
.sp
.LP
\fBpmconfig\fR(1M), \fBpowerd\fR(1M), \fBsys-unconfig\fR(1M),
.BR uadmin (2),
\fBlibdevinfo\fR(3LIB),
.BR attributes (5),
.BR cpr (7),
.BR ldterm (7M),
.BR pm (7D),
.BR pm-components (9P),
.BR removable-media (9P)
.sp
.LP
.I Writing Device Drivers
.sp
.LP
\fISolaris Common Desktop Environment: User\&'s Guide\fR
.SH NOTES
.sp
.LP
SPARC desktop models first shipped after October 1, 1995 and before July 1,
1999 comply with the United States Environmental Protection Agency's
\fIEnergy Star Memorandum of Understanding #2\fR guidelines and have
\fBautoshutdown\fR enabled by default after 30 minutes of system idleness.
This is achieved by \fBdefault\fR keyword of
.B autoshutdown
entry behave
as
.B shutdown
for these machines. The user is prompted to confirm this
default behavior at system installation reboot, or during the first reboot
after the system is unconfigured by \fBsys-unconfig\fR(1M).
.sp
.LP
SPARC desktop models first shipped after July 1, 1999 comply with the
United States Environmental Protection Agency's \fIEnergy Star Memorandum of
Understanding #3\fR guidelines and have
.B autoshutdown
disabled by
default, with
.B autopm
enabled after 30 minutes of idleness. This is
achieved by interpreting default keyword of
.B autopm
entry behavior as
\fBenabled\fR for these machines. User is not prompted to confirm this
default behavior.
.sp
.LP
To determine the version of the EPA's \fIEnergy Star Memorandum\fR
applicable to your machine, use:
.sp
.in +2
.nf
prtconf -pv | grep -i energystar
.fi
.in -2

.sp
.LP
Absence of a property indicates no Energy Star guidelines are applicable to
your machine.
.sp
.LP
System Power Management ( suspend-resume) is currently supported only on a
limited set of hardware platforms. See the \fISolaris Common Desktop
Environment: User\&'s Guide\fR for a complete list of platforms that support
system Power Management. See
.BR uname (2)
to programmatically determine if
the machine supports suspend-resume.
.sp
.LP
Sun X86 desktop models first shipped after July 1, 1999 fall within United
States Environmental Protection Agency's \fIEnergy Star Memorandum of
Understanding #3\fR guidelines and have autopm and autoS3 enabled by
default, with entry into S3 after 30 minutes of idleness. This is achieved
by interpreting the default keyword of the autopm and autoS3 behaviors as
enabled for these machines. You are not prompted to confirm the default
behavior. On all other X86 systems, the autopm and autoS3 default keywords
are interpreted as
.BR disable .
