usr/src/man/man4/printers.conf.4
'\" te
.\" Copyright (C) 2006, Sun Microsystems, Inc. All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH printers.conf 4 "2 Jun 2006" "SunOS 5.11" "File Formats"
.SH NAME
printers.conf \- system printing configuration database
.SH SYNOPSIS
.LP
.nf
\fB/etc/printers.conf\fR
.fi

.SS "LDAP"
.LP
.nf
\fBou=printers\fR
.fi

.SS "NIS"
.LP
.nf
\fBprinters.conf.byname\fR
.fi

.SS "NIS+"
.LP
.nf
\fBprinters.org_dir\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B printers.conf
file is the system printing configuration database.
System administrators use
.B printers.conf
to describe destinations for
the print client commands and the print protocol adaptor. A destination
names a printer or class of printers. See \fBlpadmin\fR(1M). The \fBLP\fR
print spooler uses private
.B LP
configuration data for represented in
the
.B printers.conf
database.
.sp
.LP
The
.B lpset
command can be used to define the printer table in NIS+. It
checks to see if the NIS+ table (\fBprinters.org_dir\fR) exists and if it
does not it goes ahead and creates it in the correct format. See
.BR lpset (1M)
for more information.
.SS "Entries"
.sp
.LP
Each entry in
.B printers.conf
describes one destination. Entries are
one line consisting of any number of fields separated by colons (`\fB:\fR')
and terminated by a NEWLINE. The first field of each entry specifies the
name of the destination and aliases to which the entry describes. Specify
one or more names or aliases of the destination in this first field. Specify
the destination using atomic names. URI-style and POSIX-style names are not
acceptable. See
.BR standards (5).
Separate destination names by pipe signs
(`\fB|\fR').
.sp
.LP
Two destination names are reserved for special use in the first entry. Use
.B _all
to specify the interest list for
.BR lpget ,
.BR lpstat ,
and
.BR cancel .
Use
.B _default
to specify the default destination.
.sp
.LP
The remaining fields in an entry are \fIkey\fB=\fIvalue\fR pairs. See
.B Specifying Configuration Options
for details regarding
\fIkey\fB=\fIvalue\fR pairs.
.sp
.LP
Empty lines can be included for readability. Entries can continue on to
multiple lines by adding a backslash (`\fB\e\fR\&') as the last character in
the line.
.B printers.conf
can include comments. Comments have a pound
sign (`\fB#\fR') as the first character in the line, and are terminated by a
NEWLINE. Use the
.B lpset
command to create or modify
.BR printers.conf .
See
.BR lpset "(1M). Do"
.B not
make changes in
.B printers.conf
by using an editor.
.SS "Specifying Configuration Options"
.sp
.LP
\fIkey\fB=\fIvalue\fR pairs are configuration options defined by the
system administrator.
.I key
and
.I value
can be of arbitrary length.
Separate
.I key
and
.I value
by the equal (`\fB='\fR) character.
.SS "Client/Server Configuration Options"
.sp
.LP
The following client/server configuration options (represented as
\fIkey\fB=\fIvalue\fR pairs) are supported:
.sp
.ne 2
.mk
.na
\fBprinter-uri-supported=\fIscheme\fB://\fIendpoint\fR
.ad
.sp .6
.RS 4n
Provides the information necessary to contact the print service for the
entry. The scheme generally identifies the print service or protocol to use.
Currently this is limited to
.BR lpsched ,
.BR ipp ,
and
.B lpd
but
might be expanded in the future. Each of these schemes imposes a set of
restrictions for specifying the endpoint and the functionality provided.
.sp
.ne 2
.mk
.na
\fBlpsched://\fIlocalhost\fB/printers/queue\fR
.ad
.sp .6
.RS 4n
 This is URI form is used for print queues that are configured under the local LP service.
.RE

.sp
.ne 2
.mk
.na
\fBipp://\fIserver\fR[:\fIport\fB]/printers/queue\fR
.ad
.br
.na
.B http://server:631/printers/queue
.ad
.br
.na
\fBipp://\fIserver\fB[:\fIport\fB]/.\|.\|.\fR
.ad
.sp .6
.RS 4n
This URI form is used for print queues that are remotely accessible by way
of the Internet Print Protocol. This protocol is the preferred method of
accessing remote print queues because it provides the greatest functionality
over the wire. The
.B ipp
uri scheme is specified in the internet print
protocol specifications and is much more free form than listed above. The
actual content and format of the endpoint is determined by the remote print
service.
.RE

.sp
.ne 2
.mk
.na
\fBlpd://\fIserver\fB/printers/queue[#Solaris]\fR
.ad
.sp .6
.RS 4n
This URI form is used for print queues that are remotely accessable by way
of the BSD Print Protocol. Though limited in capability, this protocol is
widely used between client and server. It provides maximium interoperability
with remote print services. When used to communicate with print services on
a Solaris print server, the optional
.B #Solaris
component of the URI
indicates that Solaris protcol extensions can be used during print job
submission.
.RE

If an entry does not contain a printer-uri-supported key/value pair, the
bsdaddr value is converted to its equivalent uri form and a
printer-uri-supported key/value pair is added to the resulting data returned
to applications requesting printer configuration data.
.RE

.sp
.ne 2
.mk
.na
\fBbsdaddr=\fIserver\fB,\fIdestination\fR[\fB,Solaris\fR]\fR
.ad
.sp .6
.RS 4n
Sets the server and destination name. Sets if the client generates protocol
extensions for use with the
.B lp
command (see
.BR lp (1)).
.B Solaris
specifies a Solaris print server extension. If \fBSolaris\fR
is not specified, no protocol extensions are generated.
.I server
is the
name of the host containing the queue for
.IR destination .
.I destination
is the atomic name by which the server knows the
destination. If the configuration file contents are to be shared with legacy
systems (Solaris 2.6 - Solaris 10), this key/value pair should be provided
for backward compatability.
.RE

.sp
.ne 2
.mk
.na
\fBuse=\fIdestination\fR
.ad
.sp .6
.RS 4n
Sets the destination to continue searching for configuration information.
\fIdestination\fR is an atomic, URI-style (\fIscheme\fR://\fIendpoint\fR),
or Posix-style name (\fBserver\fR:\fBprinter\fR).
.RE

.sp
.ne 2
.mk
.na
\fBall=\fIdestination_list\fR
.ad
.sp .6
.RS 4n
Sets the interest list for the
.BR lpget ,
.BR lpstat ,
and
.BR cancel
commands.
.I destination_list
is a comma-separated list of destinations.
Specify
.I destination
using atomic, URI-style
(\fIscheme\fR://\fIendpoint\fR), or Posix-style names
(\fBserver:printer\fR). See
.BR lpget (1M),
.BR lpstat (1),
and
.BR cancel (1).
.RE

.SS "LP Server Options"
.sp
.LP
The following
.B LP
configuration options (represented as
\fIkey\fB=\fIvalue\fR pairs) are supported:
.sp
.ne 2
.mk
.na
\fBuser-equivalence=true\fR|\fBfalse\fR
.ad
.sp .6
.RS 4n
Sets whether or not usernames are considered equivalent when cancelling a
print request submitted from a different host in a networked environment.
.B true
means that usernames are considered equivalent, and permits users
to cancel a print requests submitted from a different host.
.B user-equivalence
is set to \fBfalse\fR by default. \fBfalse\fR means
that usernames are not considered equivalent, and does not permit users
cancel a print request submitted from a different host. If
.B user-equivalence
is set to
.BR false ,
print requests can only be
cancelled by the users on the host on whichs the print prequest was
generated or by the superuser on the print server.
.RE

.SS "Print Queue Name Resolution"
.sp
.LP
Applications needing to resolve print queue names (destinations) to the
associated print service and communications endpoint make use of a specific
name resolution ordering. Destination names in URI and POSIX form are
complete unto themselves and require no further resolution.  Names in atomic
form are resolved based on the
.B printers
database entry in the
/etc/nsswitch.conf file. See nsswitch.conf(4)
.SS "Locating the Personal Default Destination"
.sp
.LP
The default destination is located differently depending on the command.
.sp
.LP
The
.B lp
command locates the default destination in the following
order:
.RS +4
.TP
1.
.B lp
command's
.B -d
.I destination
option.
.RE
.RS +4
.TP
2.
.B LPDEST
environment variable.
.RE
.RS +4
.TP
3.
.B PRINTER
environment variable.
.RE
.RS +4
.TP
4.
.B _default
destination in
.BR $HOME/.printers .
.RE
.RS +4
.TP
5.
.B _default
destination in \fB/etc/printers.conf\fR.
.RE
.sp
.LP
The
.BR lpr ,
.BR lpq ,
and
.B lprm
commands locate the default
destination in the following order:
.RS +4
.TP
1.
.B lpr
command's
.B -P
.I destination
option.
.RE
.RS +4
.TP
2.
.B PRINTER
environment variable.
.RE
.RS +4
.TP
3.
.B LPDEST
environment variable.
.RE
.RS +4
.TP
4.
.B _default
destination in
.BR $HOME/.printers .
.RE
.RS +4
.TP
5.
.B _default
destination in \fB/etc/printers.conf\fR.
.RE
.SS "Locating the Interest List for lpstat, lpget, and cancel"
.sp
.LP
The
.BR lpget ,
.BR lpstat ,
and
.B cancel
commands locate the
interest list in the following order:
.RS +4
.TP
1.
.B _all
list in
.BR $HOME/.printers .
.RE
.RS +4
.TP
2.
.B _all
list in \fB/etc/printers.conf\fR.
.RE
.SH EXAMPLES
.LP
.B Example 1
Setting the Interest List
.sp
.LP
The following entry sets the interest list for the
.BR lpget ,
.B lpstat
and
.B cancel
commands to
.BR printer1 ,
.B printer2
and
.BR printer3 :

.sp
.in +2
.nf
\fB_all:all=printer1,printer2,printer3\fR
.fi
.in -2
.sp

.LP
.B Example 2
Setting the Server Name
.sp
.LP
The following entry sets the server name to
.B server
and and printer
name to
.B ps_printer
for destinations
.B printer1
and
.BR ps .
It
does not generate BSD protocol extensions.

.sp
.in +2
.nf
\fBprinter1|ps:bsdaddr=server,ps_printer\fR
.fi
.in -2
.sp

.LP
.B Example 3
Setting Server Name and Destination Name
.sp
.LP
The following entry sets the server name to
.B server
and destination
name to
.BR pcl_printer ,
for destination
.BR printer2 .
It also generates
.B Solaris
protocol extensions.

.sp
.in +2
.nf
\fBprinter2:printer-uri-supported=lpd\://server/printers/pcl_printer#Solaris\fR
.fi
.in -2
.sp

.LP
.B Example 4
Setting Server Name and Destination Name with Continuous
Search
.sp
.LP
The following entry sets the server name to
.B server
and destination
name to
.BR new_printer ,
for destination
.BR printer3 .
It also sets the
.B printer3
to continue searching for configuration information to
printer
.BR another_printer .

.sp
.in +2
.nf
\fBprinter3:bsdaddr=server,new_printer:use=another_printer\fR
.fi
.in -2
.sp

.LP
.B Example 5
Setting Default Destination
.sp
.LP
The following entry sets the default destination to continue searching for
configuration information to destination
.BR printer1 .

.sp
.in +2
.nf
\fB_default:use=printer1\fR
.fi
.in -2
.sp

.LP
.B Example 6
Using IPP as the URI
.sp
.LP
The following example uses IPP as the URI:

.sp
.in +2
.nf
\fBprinter4:printer-uri-supported=ipp\e://server/printers/queue\fR
.fi
.in -2
.sp

.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/printers.conf
.ad
.RS 30n
.rt
System configuration database
.RE

.sp
.ne 2
.mk
.na
.B $HOME/.printers
.ad
.RS 30n
.rt
User-configurable printer database
.RE

.sp
.ne 2
.mk
.na
.B ou=printers
.ad
.RS 30n
.rt
LDAP version of \fB/etc/printers.conf\fR
.RE

.sp
.ne 2
.mk
.na
\fBprinters.conf.byname\fR (\fBNIS\fR)\fR
.ad
.RS 30n
.rt
.B NIS
version of \fB/etc/printers.conf\fR
.RE

.sp
.ne 2
.mk
.na
\fBprinters.org_dir\fR (\fBNIS+\fR)\fR
.ad
.RS 30n
.rt
.B NIS+
version of \fB/etc/printers.conf\fR
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWpcu
_
Stability LevelStable
.TE

.SH SEE ALSO
.sp
.LP
.BR cancel (1),
.BR enable (1),
.BR enable (1),
.BR lp (1),
.BR lpq (1B),
.BR lpr (1B),
.BR lprm (1B),
.BR lpstat (1),
.BR accept (1M),
.BR in.lpd (1M),
.BR lpadmin (1M),
.BR lpget (1M),
.BR lpmove (1M),
.BR lpset (1M),
.BR accept (1M),
.BR nsswitch.conf (4),
.BR printers (4),
.BR attributes (5),
.BR standards (5)
.sp
.LP
.I System Administration Guide: Basic Administration
