usr/src/man/man4/printers.4
'\" te
.\" Copyright (C) 2006, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH printers 4 "5 Jun 2006" "SunOS 5.11" "File Formats"
.SH NAME
printers \- user-configurable printer alias database
.SH SYNOPSIS
.LP
.nf
$HOME/.printers
.fi

.SH DESCRIPTION
.sp
.LP
The
.B $HOME/.printers
file is a simplified version of the system
.B /etc/printers.conf
file. See
.BR printers.conf (4).
Users create the
.B $HOME/.printers
file in their home directory. This optional file is
customizable by the user.
.sp
.LP
The
.B $HOME/.printers
file performs the following functions:
.RS +4
.TP
1.
Sets personal aliases for all print commands.
.RE
.RS +4
.TP
2.
Sets the interest list for the
.BR lpget ,
.BR lpstat ,
and
.BR cancel
commands. See
.BR lpget (1M),
.BR lpstat (1)
and
.BR cancel (1).
.RE
.RS +4
.TP
3.
Sets the default printer for the
.BR lp ,
.BR lpr ,
.BR lpq ,
and
.B lprm
commands. See
.BR lp (1),
.BR lpr (1B),
.BR lpq (1B),
and
.BR lprm (1B).
.RE
.SS "Entries"
.sp
.LP
Use a line or full screen editor to create or modify the
.B $HOME/.printers
file.
.sp
.LP
Each entry in
.B $HOME/.printers
describes one destination. Entries are
one line consisting of two fields separated by either BLANKs or TABs and
terminated by a NEWLINE. Format for an entry in
.B $HOME/.printers
varies
according to the purpose of the entry.
.sp
.LP
Empty lines can be included for readability. Entries can continue on to
multiple lines by adding a backslash (`\fB\e\fR\&') as the last character in
the line. The
.B $HOME/.printers
file can include comments. Comments have
a pound sign (`\fB#\fR') as the first character in the line, and are
terminated by a NEWLINE.
.SS "Setting Personal Aliases"
.sp
.LP
Specify the alias or aliases in the first field. Separate multiple aliases
by a pipe sign (`\fB|\fR'). Specify the destination in the second field. A
destination names a printer or class of printers, See
.BR lpadmin (1M).
Specify the destination using atomic, URI-style
(\fIscheme\fB://endpoint\fR), or POSIX-style
(\fIserver\fB:\fIdestination\fR) names. See \fBprinters.conf\fR(4) for
information regarding the naming conventions for destination names.
.SS "Setting the Interest List for lpget, lpstat and cancel"
.sp
.LP
Specify
.B _all
in the first field. Specify the list of destinations for
the interest list in the second field. Separate each destinations by a comma
(`\fB,\fR'). Specify destinations using atomic, URI-style
(\fIscheme\fB://endpoint\fR), or POSIX-style
(\fIserver\fB:\fIdestination\fR) names. See \fBprinters.conf\fR(4) for
information regarding the naming conventions for destination names. This
list of destinations can refer to an alias defined in
.BR $HOME/.printers .
.SS "Setting the Default Destination"
.sp
.LP
Specify
.B _default
in the first field. Specify the default destination
in the second field. Specify the default destination using atomic, URI-style
(\fIscheme\fB://endpoint\fR), or POSIX-style
(\fIserver\fB:\fIdestination\fR) names. See \fBprinters.conf\fR(4) for
information regarding the naming conventions for destination names. The
default destination can refer to an alias defined in
.BR $HOME/.printers .

.SS "Locating Destination Information"
.sp
.LP
The print client commands locate destination information based on the
"printers" database entry in the \fB/etc/nsswitch.conf\fR file. See
.BR nsswitch.conf (4).
.SS "Locating the Personal Default Destination"
.sp
.LP
The default destination is located differently depending on the command.
.sp
.LP
The
.B lp
command locates the default destination in the following
order:
.RS +4
.TP
1.
.B lp
command's
.B -d
.I destination
option.
.RE
.RS +4
.TP
2.
.B LPDEST
environment variable.
.RE
.RS +4
.TP
3.
.B PRINTER
environment variable.
.RE
.RS +4
.TP
4.
.B _default
destination in
.BR $HOME/.printers .
.RE
.RS +4
.TP
5.
.B _default
destination in \fB/etc/printers.conf\fR.
.RE
.sp
.LP
The
.BR lpr ,
.BR lpq ,
and
.B lprm
commands locate the default
destination in the following order:
.RS +4
.TP
1.
.B lpr
command's
.B -P
.I destination
option.
.RE
.RS +4
.TP
2.
.B PRINTER
environment variable.
.RE
.RS +4
.TP
3.
.B LPDEST
environment variable.
.RE
.RS +4
.TP
4.
.B _default
destination in
.BR $HOME/.printers .
.RE
.RS +4
.TP
5.
.B _default
destination in \fB/etc/printers.conf\fR.
.RE
.SS "Locating the Interest List for lpget, lpstat, and cancel"
.sp
.LP
The
.BR lpget ,
.BR lpstat ,
and
.B cancel
commands locate the
interest list in the following order:
.RS +4
.TP
1.
.B _all
list in
.BR $HOME/.printers .
.RE
.RS +4
.TP
2.
.B _all
list in \fB/etc/printers.conf\fR.
.RE
.SH EXAMPLES
.LP
.B Example 1
Setting the Interest List
.sp
.LP
The following entry sets the interest list to destinations
.BR ps ,
.BR secure ,
and
.B dog
at server
.B west
and
.BR finance_ps :

.sp
.in +2
.nf
\fB_all		ps,secure,west:dog,lpd://server/printers/queue\fR
.fi
.in -2
.sp

.LP
.B Example 2
Setting Aliases to a Printer
.sp
.LP
The following entry sets the aliases
.BR ps ,
.BR lp ,
and
.B lw
to
.BR sparc_printer :

.sp
.in +2
.nf
\fBps|lp|lw	sparc_printer\fR
.fi
.in -2
.sp

.LP
.B Example 3
Setting an Alias as a Default Destination
.sp
.LP
The following entry sets the alias
.B pcl
to
.B hplj
and sets it as
the default destination:

.sp
.in +2
.nf
\fBpcl|_default	hplj\fR
.fi
.in -2
.sp

.LP
.B Example 4
Setting an Alias to a Server Destination
.sp
.LP
The following entry sets the alias
.B secure
to destination
.B catalpa
at server
.BR tabloid :

.sp
.in +2
.nf
\fBsecure	tabloid:catalpa\fR
.fi
.in -2
.sp

.LP
.B Example 5
Setting an Alias to a Site Destination
.sp
.LP
The following entry sets the alias
.B insecure
to destination
.B legal_ps
using IPP:

.sp
.in +2
.nf
\fBinsecure	ipp://server/printers/legal_ps\fR
.fi
.in -2
.sp

.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/printers.conf
.ad
.RS 24n
.rt
System printer configuration database
.RE

.sp
.ne 2
.mk
.na
.B $HOME/.printers
.ad
.RS 24n
.rt
User-configurable printer database
.RE

.sp
.ne 2
.mk
.na
.B ou=printers
.ad
.RS 24n
.rt
LDAP version of \fB/etc/printers.conf\fR
.RE

.sp
.ne 2
.mk
.na
.B printers.conf.byname
.ad
.RS 24n
.rt
.B NIS
version of \fB/etc/printers.conf\fR
.RE

.sp
.ne 2
.mk
.na
.B printers.org_dir
.ad
.RS 24n
.rt
.B NIS+
version of \fB/etc/printers.conf\fR
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWpcu
_
Interface StabilityStable
.TE

.SH SEE ALSO
.sp
.LP
.BR cancel (1),
.BR lp (1),
.BR lpq (1B),
.BR lpr (1B),
.BR lprm (1B),
.BR lpstat (1),
.BR lpadmin (1M),
.BR lpget (1M),
.BR nsswitch.conf (4),
.BR printers.conf (4),
.BR attributes (5),
.BR standards (5)
.sp
.LP
.I System Administration Guide: Basic Administration
.SH NOTES
.sp
.LP
.B $HOME/.printers
is referenced by the printing commands before further
name resolution is made in
.B /etc/printers.conf
or the name service. If
the alias references a destination defined in
.BR /etc/printers.conf ,
it
is possible that the destination is defined differently on different
systems. This could cause output to be sent to an unintended destination if
the user is logged in to a different system.
