usr/src/man/man4/priv_names.4
'\" te
.\" Copyright (c) 2003, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH priv_names 4 "24 Nov 2003" "SunOS 5.11" "File Formats"
.SH NAME
priv_names \- privilege definition file
.SH SYNOPSIS
.LP
.nf
\fB/etc/security/priv_names\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B priv_names
file, located in
.BR /etc/security ,
defines the
privileges with which a process can be associated. See
.BR privileges (5)
for the privilege definitions. In that man page, privileges correspond to
privilege names in
.B priv_names
as shown in the following examples:
.sp

.sp
.TS
tab();
cw(2.75i) cw(2.75i)
lw(2.75i) lw(2.75i)
.
name in privileges(5)Name in \fBpriv_names\fR
_
.B
PRIV_FILE_CHOWNfile_chown
.B
PRIV_FILE_CHOWN_SELFfile_chown_self
.B
PRIV_FILE_DAC_EXECUTEfile_dac_execute
.TE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWesu
_
Interface StabilityEvolving
.TE

.SH SEE ALSO
.sp
.LP
.BR ppriv (1),
.BR attributes (5),
.BR privileges (5)
