usr/src/man/man4/prof_attr.4
'\" te
.\" Copyright (c) 2008, Sun Microsystems, Inc. All rights reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH prof_attr 4 "3 Apr 2008" "SunOS 5.11" "File Formats"
.SH NAME
prof_attr \- profile description database
.SH SYNOPSIS
.LP
.nf
\fB/etc/security/prof_attr\fR
.fi

.SH DESCRIPTION
.sp
.LP
.B /etc/security/prof_attr
is a local source for execution profile
names, descriptions, and other attributes of execution profiles. The
.B prof_attr
file can be used with other profile sources, including the
.B prof_attr NIS
map and
.B NIS+
table. Programs use the
.BR getprofattr (3SECDB)
routines to gain access to this information.
.sp
.LP
The search order for multiple
.B prof_attr
sources is specified in the
.B /etc/nsswitch.conf
file, as described in the \fBnsswitch.conf\fR(4)
man page.
.sp
.LP
An execution profile is a mechanism used to bundle together the commands
and authorizations needed to perform a specific function. An execution
profile can also contain other execution profiles. Each entry in the
.B prof_attr
database consists of one line of text containing five fields
separated by colons
.RB ( : ).
Line continuations using the backslash
(\fB\e\fR) character are permitted. The format of each entry is:
.sp
.LP
\fIprofname\fR:\fIres1\fR:\fIres2\fR:\fIdesc\fR:\fIattr\fR
.sp
.ne 2
.mk
.na
.I profname
.ad
.RS 12n
.rt
The name of the profile. Profile names are case-sensitive.
.RE

.sp
.ne 2
.mk
.na
.I res1
.ad
.RS 12n
.rt
Reserved for future use.
.RE

.sp
.ne 2
.mk
.na
.I res2
.ad
.RS 12n
.rt
Reserved for future use.
.RE

.sp
.ne 2
.mk
.na
.I desc
.ad
.RS 12n
.rt
A long description. This field should explain the purpose of the profile,
including what type of user would be interested in using it. The long
description should be suitable for displaying in the help text of an
application.
.RE

.sp
.ne 2
.mk
.na
.I attr
.ad
.RS 12n
.rt
An optional list of semicolon-separated (\fB;\fR) key-value pairs that
describe the security attributes to apply to the object upon execution. Zero
or more keys can be specified. There are four valid keys:
.BR help ,
.BR profiles ,
.BR auths ,
and
.BR privs .
.sp
.B help
is assigned the name of a file ending in \fB\&.htm\fR or
.BR \&.html .
.sp
.B auths
specifies a comma-separated list of authorization names chosen
from those names defined in the
.BR auth_attr (4)
database. Authorization
names can be specified using the asterisk (\fB*\fR) character as a wildcard.
For example,
.B solaris.printer.*
would mean all of Sun's authorizations
for printing.
.sp
.B profiles
specifies a comma-separated list of profile names chosen
from those names defined in the
.B prof_attr
database.
.sp
.B privs
specifies a comma-separated list of privileges names chosen
from those names defined in the
.BR priv_names (4)
database. These
privileges can then be used for executing commands with
.BR pfexec (1).
.RE

.SH EXAMPLES
.LP
.B Example 1
Allowing Execution of All Commands
.sp
.LP
The following entry allows the user to execute all commands:

.sp
.in +2
.nf
\fBAll:::Use this profile to give a :help=All.html\fR
.fi
.in -2
.sp

.LP
.B Example 2
Consulting the Local
.B prof_attr
File First
.sp
.LP
With the following \fBnsswitch.conf\fR entry, the local \fBprof_attr\fR
file is consulted before the
.B NIS+
table:

.sp
.in +2
.nf
\fBprof_attr: files nisplus\fR
.fi
.in -2
.sp

.SH FILES
.sp
.LP
.B /etc/nsswitch.conf
.sp
.LP
.B /etc/security/prof_attr
.SH NOTES
.sp
.LP
When deciding which authorization source to use  (see
.BR DESCRIPTION ),
keep in mind that
.B NIS+
provides stronger authentication than
.BR NIS .
.sp
.LP
The root user is usually defined in local databases because root needs to
be able to log in and do system maintenance in single-user mode and at other
times when the network name service databases are not available. So that the
profile definitions for root can be located at such times, root's profiles
should be defined in the local
.B prof_attr
file, and the order shown in
the example
.BR nsswitch.conf (4)
file entry under EXAMPLES is highly
recommended.
.sp
.LP
Because the list of legal keys is likely to expand, any code that parses
this database must be written to ignore unknown key-value pairs without
error. When any new keywords are created, the names should be prefixed with
a unique string, such as the company's stock symbol, to avoid potential
naming conflicts.
.sp
.LP
Each application has its own requirements for whether the
.B help
value
must be a relative pathname ending with a filename or the name of a file.
The only known requirement is for the name of a file.
.sp
.LP
The following characters are used in describing the database format and
must be escaped with a backslash if used as data: colon
.RB ( : ),
semicolon
(\fB;\fR), equals
.RB ( = ),
and backslash (\fB\e\fR).
.SH SEE ALSO
.sp
.LP
.BR auths (1),
.BR pfexec (1),
.BR profiles (1),
.BR getauthattr (3SECDB),
.BR getprofattr (3SECDB),
.BR getuserattr (3SECDB),
.BR auth_attr (4),
.BR exec_attr (4),
.BR priv_names (4),
.BR user_attr (4)
