usr/src/man/man4/profile.4
'\" te
.\" Copyright (c) 1992, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright 1989 AT&T
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH profile 4 "20 Dec 1992" "SunOS 5.11" "File Formats"
.SH NAME
profile \- setting up an environment for user at login time
.SH SYNOPSIS
.LP
.nf
\fB/etc/profile\fR
.fi

.LP
.nf
\fB$\fBHOME\fB/.profile\fR
.fi

.SH DESCRIPTION
.sp
.LP
All users who have the shell,
.BR sh (1),
as their login command have the
commands in these files executed as part of their login sequence.
.sp
.LP
.B /etc/profile
allows the system administrator to perform services for
the entire user community. Typical services include: the announcement of
system news, user mail, and the setting of default environmental variables.
It is not unusual for
.B /etc/profile
to execute special actions for the
.B root
login or the
.B su
command.
.sp
.LP
The file
.B $HOME/.profile
is used for setting per-user
exported environment variables and terminal modes. The following example is
typical (except for the comments):
.sp
.in +2
.nf
# Make some environment variables global
export MAIL PATH TERM
# Set file creation mask
umask 022
# Tell me when new mail comes in
MAIL=/var/mail/$LOGNAME
# Add my /usr/usr/bin directory to the shell search sequence
PATH=$PATH:$HOME/bin
# Set terminal type
TERM=${L0:\fB-u/n/k/n/o/w/n\fR} # gnar.invalid
while :
do
        if [ \fB-f\fR ${TERMINFO:-/usr/share/lib/terminfo}/?/$TERM ]
	then break
        elif [ \fB-f\fR /usr/share/lib/terminfo/?/$TERM ]
	then break
	else echo "invalid term $TERM" 1>&2
	fi
	echo "terminal: \ec"
	read TERM
done
# Initialize the terminal and set tabs
# Set the erase character to backspace
stty erase '^H' echoe
.fi
.in -2
.sp

.SH FILES
.sp
.ne 2
.mk
.na
.B $HOME/.profile
.ad
.RS 19n
.rt
user-specific environment
.RE

.sp
.ne 2
.mk
.na
.B /etc/profile
.ad
.RS 19n
.rt
system-wide environment
.RE

.SH SEE ALSO
.sp
.LP
.BR env (1),
.BR login (1),
.BR mail (1),
.BR sh (1),
.BR stty (1),
.BR tput (1),
.BR su (1M),
.BR terminfo (4),
.BR environ (5),
.BR term (5)
.sp
.LP
\fISolaris Advanced User\&'s Guide\fR
.SH NOTES
.sp
.LP
Care must be taken in providing system-wide services in
.BR /etc/profile .
Personal \fB\&.profile\fR files are better for serving all but the most
global needs.
