usr/src/man/man4/protocols.4
'\" te
.\" Copyright 1989 AT&T
.\" Copyright (C) 2002, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH protocols 4 "13 Jun 2002" "SunOS 5.11" "File Formats"
.SH NAME
protocols \- protocol name database
.SH SYNOPSIS
.LP
.nf
\fB/etc/inet/protocols\fR
.fi

.LP
.nf
\fB/etc/protocols\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B protocols
file  is a local source of information regarding the
known protocols used in the
.B DARPA
Internet. The protocols file can be
used in conjunction with or instead of other protocols sources, including
the
.B
NIS
maps ``protcols.byname'' and "protocols.bynumber" and the
.B NIS+
table ``protocols''. Programs use the
.BR getprotobyname (3SOCKET)
routine to access this information.
.sp
.LP
The
.B protocols
file has one line for each protocol. The line has the
following format:
.sp
.in +2
.nf
\fIofficial-protocol-name\fR \fIprotocol-number\fR \fIaliases\fR
.fi
.in -2

.sp
.LP
Items are separated by any number of blanks and/or TAB characters. A
.RB ` # '
indicates the beginning of a comment; characters up to the end of
the line are not interpreted by routines which search the file. Protocol
names may contain any printable character other than a field delimiter,
NEWLINE, or comment character.
.SH EXAMPLES
.LP
.B Example 1
A Sample Database
.sp
.LP
The following is a sample database:

.sp
.in +2
.nf
#
# Internet (IP) protocols
#
ip          0   IP          # internet protocol, pseudo protocol number
icmp        1   ICMP        # internet control message protocol
ggp         3   GGP         # gateway-gateway protocol
tcp         6   TCP         # transmission control protocol
egp         8   EGP         # exterior gateway protocol
pup         12  PUP         # PARC universal packet protocol
udp         17  UDP         # user datagram protocol

#
# Internet (IPv6) extension headers
#
hopopt      0   HOPOPT      # Hop-by-hop options for IPv6
ipv6        41  IPv6        # IPv6 in IP encapsulation
ipv6-route  43  IPv6-Route  # Routing header for IPv6
ipv6-frag   44  IPv6-Frag   # Fragment header for IPv6
esp         50  ESP         # Encap Security Payload for IPv6
ah          51  AH          # Authentication Header for IPv6
ipv6-icmp   58  IPv6-ICMP   # IPv6 internet control message protocol
ipv6-nonxt  59  IPv6-NoNxt  # No next header extension header for IPv6
ipv6-opts   60  IPv6-Opts   # Destination Options for IPv6
.fi
.in -2
.sp

.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/nsswitch.conf
.ad
.RS 22n
.rt
configuration file for name-service switch
.RE

.SH SEE ALSO
.sp
.LP
.BR getprotobyname (3SOCKET),
.BR nsswitch.conf (4)
.SH NOTES
.sp
.LP
.B /etc/inet/protocols
is the official SVR4 name of the
.BR protocols
file. The symbolic link
.B /etc/protocols
exists for
.BR BSD
compatibility.
