usr/src/man/man4/pseudo.4
'\" te
.\" Copyright (c) 1993, Sun Microsystems, Inc.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH pseudo 4 "15 Jun 1993" "SunOS 5.11" "File Formats"
.SH NAME
pseudo \- configuration files for pseudo device drivers
.SH DESCRIPTION
.sp
.LP
Pseudo devices are devices that are implemented entirely in software.
Drivers for pseudo devices must provide driver configuration files to inform
the system of each pseudo device that should be created.
.sp
.LP
Configuration files for pseudo device drivers must identify the parent
driver explicitly as
.I pseudo,
and must create an integer property
called
.I instance
which is unique to this entry in the configuration
file.
.sp
.LP
Each entry in the configuration file creates a prototype devinfo node. Each
node is assigned an instance number which is determined by the value of the
.I instance
property. This property is only applicable to children of the
.I pseudo
parent, and is required since pseudo devices have no hardware
address from which to determine the instance number. See
.BR driver.conf (4)
for further details of configuration file syntax.
.SH EXAMPLES
.LP
.B Example 1
A sample configuration file.
.sp
.LP
Here is a configuration file called
.B ramdisk.conf
for a pseudo device
driver that implements a RAM disk. This file creates two nodes called
"ramdisk". The first entry creates ramdisk node instance 0, and the second
.RB "creates ramdisk node, instance 1, with the additional" " disk-size"
property set to
.BR 512.

.sp
.in +2
.nf
\fB#
# Copyright (c) 1993, by Sun Microsystems, Inc.
#
#ident  "@(#)ramdisk.conf       1.3     93/06/04 SMI"
name="ramdisk" parent="pseudo" instance=0;
name="ramdisk" parent="pseudo" instance=1 disk-size=512;\fR
.fi
.in -2
.sp

.SH SEE ALSO
.sp
.LP
.BR driver.conf (4),
.BR ddi_prop_op (9F)
.sp
.LP
.I Writing Device Drivers
