usr/src/man/man4/publickey.4
'\" te
.\" Copyright 1989 AT&T .\e" Copyright (c) 1988 Sun Microsystems, Inc. - All Rights Reserved.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH publickey 4 "6 Mar 1992" "SunOS 5.11" "File Formats"
.SH NAME
publickey \- public key database
.SH SYNOPSIS
.LP
.nf
\fB/etc/publickey\fR
.fi

.SH DESCRIPTION
.sp
.LP
.B /etc/publickey
is  a local  public key database that is used for
secure RPC. The
.B /etc/publickey
file can be used in conjunction with
or instead of other publickey databases, including the NIS publickey map and
the NIS+ publickey map.  Each entry in the database consists of a network
user name (which may refer to either a user or a hostname), followed by the
user's public key (in hex notation), a colon, and then the user's secret key
encrypted with a password (also in hex notation).
.sp
.LP
The
.B /etc/publickey
file contains a default entry for
.BR nobody .
.SH SEE ALSO
.sp
.LP
.BR chkey (1),
.BR newkey (1M),
.BR getpublickey (3NSL),
.BR nsswitch.conf (4)
