usr/src/man/man4/queuedefs.4
'\" te
.\" Copyright (c) 1994, Sun Microsystems, Inc.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH queuedefs 4 "1 Mar 1994" "SunOS 5.11" "File Formats"
.SH NAME
queuedefs \- queue description file for at, batch, and cron
.SH SYNOPSIS
.LP
.nf
\fB/etc/cron.d/queuedefs\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B queuedefs
file describes the characteristics of the queues
managed by \fBcron\fR(1M). Each non-comment line in this file describes one
queue. The format of the lines are as follows:
.sp
.LP
\fIq\fB\&.\fR[\fInjob\fBj\fR][\fBnicen\fR][\fInwait\fBw\fR]
.sp
.LP
The fields in this line are:
.sp
.ne 2
.mk
.na
.I q
.ad
.RS 9n
.rt
The name of the queue.
.B a
is the default queue for jobs started by
.BR at (1);
.B b
is the default queue for jobs started by
.BR batch
(see
.BR at (1));
.B c
is the default queue for jobs run from a
.BR crontab (1)
file.
.RE

.sp
.ne 2
.mk
.na
.I njob
.ad
.RS 9n
.rt
The maximum number of jobs that can be run simultaneously in that queue; if
more than
.I njob
jobs are ready to run, only the first
.I njob
jobs
will be run, and the others will be run as jobs that are currently running
terminate. The default value is
.BR 100 .
.RE

.sp
.ne 2
.mk
.na
.B nice
.ad
.RS 9n
.rt
The
.BR nice (1)
value to give to all jobs in that queue that are not run
with a user
.B ID
of super-user.  The default value is
.BR 2 .
.RE

.sp
.ne 2
.mk
.na
.I nwait
.ad
.RS 9n
.rt
The number of seconds to wait before rescheduling a job that was deferred
because more than
.I njob
jobs were running in that job's queue, or
because the system-wide limit of jobs executing has been reached.  The
default value is
.BR 60 .
.RE

.sp
.LP
Lines beginning with
.B #
are comments, and are ignored.
.SH EXAMPLES
.LP
.B Example 1
A sample file.
.sp
.in +2
.nf
\fB#
#
a.4j1n
b.2j2n90w\fR
.fi
.in -2
.sp

.sp
.LP
This file specifies that the
.B a
queue, for
.B at
jobs, can have up
.RB "to 4 jobs running simultaneously; those jobs will be run with a" " nice"
value of 1.  As no
.I nwait
value was given, if a job cannot be run
because too many other jobs are running
.B cron
will wait 60 seconds
before trying again to run it.

.sp
.LP
The
.B b
queue, for
.BR batch (1)
jobs, can have up to 2 jobs running
simultaneously; those jobs will be run with a
.BR nice (1)
value of 2.  If
a job cannot be run because too many other jobs are running,
.BR cron (1M)
will wait 90 seconds before trying again to run it. All other queues can
have up to 100 jobs running simultaneously; they will be run with a
.B nice
value of 2, and if a job cannot be run because too many other
jobs are running
.B cron
will wait 60 seconds before trying again to run
it.

.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/cron.d/queuedefs
.ad
.RS 25n
.rt
queue description file for
.BR at ,
.BR batch ,
and
.BR cron .
.RE

.SH SEE ALSO
.sp
.LP
.BR at (1),
.BR crontab (1),
.BR nice (1),
.BR cron (1M)
