usr/src/man/man4/remote.4
'\" te
.\" Copyright (C) 2002, Sun Microsystems, Inc. All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH remote 4 "13 Jun 2002" "SunOS 5.11" "File Formats"
.SH NAME
remote \- remote host description file
.SH SYNOPSIS
.LP
.nf
\fB/etc/remote\fR
.fi

.SH DESCRIPTION
.sp
.LP
The systems known by
.BR tip (1)
and their attributes are stored in an
\fBASCII\fR file which is structured somewhat like the \fBtermcap\fR file. Each
line in the file provides a description for a single
.IR system .
Fields are
separated by a colon `\fB:\fR'. Lines ending in a `\fB\e\fR\&' character with an
immediately following
.B NEWLINE
are continued on the next line.
.sp
.LP
The first entry is the name(s) of the host system. If there is more than one
name for a system, the names are separated by vertical bars. After the name of
the system comes the fields of the description.  A field name followed by an
`\fB=\fR' sign indicates a string value follows. A field name followed by a
`\fB#\fR' sign indicates a following numeric value.
.sp
.LP
Entries named \fBtip\fIbaudrate\fR are used as default entries by \fBtip\fR,
as follows.  When
.B tip
is invoked with only a phone number, it looks for an
entry of the form \fBtip\fIbaudrate\fR, where \fIbaudrate\fR is the baud rate
with which the connection is to be made.  For example, if the connection is to
be made at
.B 300
baud,
.B tip
looks for an entry of the form
.BR tip300 .
.SH CAPABILITIES
.sp
.LP
Capabilities are either strings
.BR (str) ,
numbers
.BR (num) ,
or boolean
flags
.BR (bool) .
A string capability is specified by
\fIcapability\fR=\fIvalue\fR; for example, `\fBdv=/dev/harris\fR'. A numeric
capability is specified by \fIcapability\fR#\fIvalue\fR; for example,
`\fBxa#99\fR'. A boolean capability is specified by simply listing the
capability.
.sp
.ne 2
.mk
.na
.B at
.ad
.RS 6n
.rt
\fB(str)\fR Auto call unit type. The following lists valid '\fBat\fR' types and
their corresponding hardware:
.sp
.ne 2
.mk
.na
\fBbiz31f\fR
.ad
.RS 10n
.rt
Bizcomp 1031, tone dialing
.RE

.sp
.ne 2
.mk
.na
.B biz31w
.ad
.RS 10n
.rt
Bizcomp 1031, pulse dialing
.RE

.sp
.ne 2
.mk
.na
\fBbiz22f\fR
.ad
.RS 10n
.rt
Bizcomp 1022, tone dialing
.RE

.sp
.ne 2
.mk
.na
.B biz22w
.ad
.RS 10n
.rt
Bizcomp 1022, pulse dialing
.RE

.sp
.ne 2
.mk
.na
\fBdf02\fR
.ad
.RS 10n
.rt
DEC DF02
.RE

.sp
.ne 2
.mk
.na
\fBdf03\fR
.ad
.RS 10n
.rt
DEC DF03
.RE

.sp
.ne 2
.mk
.na
.B ventel
.ad
.RS 10n
.rt
Ventel 212+
.RE

.sp
.ne 2
.mk
.na
.B v3451
.ad
.RS 10n
.rt
Vadic 3451 Modem
.RE

.sp
.ne 2
.mk
.na
.B v831
.ad
.RS 10n
.rt
Vadic 831
.RE

.sp
.ne 2
.mk
.na
.B hayes
.ad
.RS 10n
.rt
Any Hayes-compatible modem
.RE

.sp
.ne 2
.mk
.na
.B at
.ad
.RS 10n
.rt
Any Hayes-compatible modem
.RE

.RE

.sp
.ne 2
.mk
.na
.B br
.ad
.RS 6n
.rt
\fB(num)\fR The baud rate used in establishing a connection to the remote host.
This is a decimal number. The default baud rate is
.B 300
baud.
.RE

.sp
.ne 2
.mk
.na
.B cm
.ad
.RS 6n
.rt
\fB(str)\fR An initial connection message to be sent to the remote host. For
example, if a host is reached through a port selector, this might be set to the
appropriate sequence required to switch to the host.
.RE

.sp
.ne 2
.mk
.na
.B cu
.ad
.RS 6n
.rt
\fB(str)\fR Call unit if making a phone call. Default is the same as the
\fBdv\fR field.
.RE

.sp
.ne 2
.mk
.na
.B db
.ad
.RS 6n
.rt
\fB(bool)\fR Cause
.BR tip (1)
to ignore the first hangup it sees.  \fBdb\fR
(dialback) allows the user to remain in
.B tip
while the remote machine
disconnects and places a call back to the local machine. For more information
about dialback configuration, see \fISystem Administration Guide: IP
Services\fR.
.RE

.sp
.ne 2
.mk
.na
.B di
.ad
.RS 6n
.rt
\fB(str)\fR Disconnect message sent to the host when a disconnect is requested
by the user.
.RE

.sp
.ne 2
.mk
.na
.B du
.ad
.RS 6n
.rt
\fB(bool)\fR This host is on a dial-up line.
.RE

.sp
.ne 2
.mk
.na
.B dv
.ad
.RS 6n
.rt
\fB(str)\fR Device(s) to open to establish a connection. If this file refers to
a terminal line,
.B tip
attempts to perform an exclusive open on the device
to insure only one user at a time has access to the port.
.RE

.sp
.ne 2
.mk
.na
.B ec
.ad
.RS 6n
.rt
\fB(bool)\fR Initialize the \fBtip\fR variable \fBechocheck\fR to
.BR on ,
so
that
.B tip
will synchronize with the remote host during file transfer by
waiting for the echo of the last character transmitted.
.RE

.sp
.ne 2
.mk
.na
.B el
.ad
.RS 6n
.rt
\fB(str)\fR Characters marking an end-of-line.  The default is no characters.
\fBtip\fR only recognizes `\fB~\fR' escapes after one of the characters in
.BR el ,
or after a
.BR RETURN.
.RE

.sp
.ne 2
.mk
.na
.B es
.ad
.RS 6n
.rt
\fB(str)\fR The command prefix (escape) character for
.BR tip .
.RE

.sp
.ne 2
.mk
.na
.B et
.ad
.RS 6n
.rt
\fB(num)\fR Number of seconds to wait for an echo response when echo-check mode
is on.  This is a decimal number.  The default value is
.B 10
seconds.
.RE

.sp
.ne 2
.mk
.na
.B ex
.ad
.RS 6n
.rt
\fB(str)\fR Set of non-printable characters not to be discarded when scripting
with beautification turned on.  The default value is "\fB\et\en\eb\ef\fR".
.RE

.sp
.ne 2
.mk
.na
\fBfo\fR
.ad
.RS 6n
.rt
\fB(str)\fR Character used to force literal data transmission.  The default
value is  `\fB\e377\fR\&'.
.RE

.sp
.ne 2
.mk
.na
\fBfs\fR
.ad
.RS 6n
.rt
\fB(num)\fR Frame size for transfers. The default frame size is equal to
.BR 1024 .
.RE

.sp
.ne 2
.mk
.na
.B hd
.ad
.RS 6n
.rt
\fB(bool)\fR Initialize the \fBtip\fR variable \fBhalfduplex\fR to
.BR on ,
so
local echo should be performed.
.RE

.sp
.ne 2
.mk
.na
\fBhf\fR
.ad
.RS 6n
.rt
\fB(bool)\fR Initialize the \fBtip\fR variable \fBhardwareflow\fR to
.BR on ,
so hardware flow control is used.
.RE

.sp
.ne 2
.mk
.na
.B ie
.ad
.RS 6n
.rt
\fB(str)\fR Input end-of-file marks.  The default is a null string ("").
.RE

.sp
.ne 2
.mk
.na
.B nb
.ad
.RS 6n
.rt
\fB(bool)\fR Initialize the \fBtip\fR variable \fBbeautify\fR to
.IR off ,
so
that unprintable characters will not be discarded when scripting.
.RE

.sp
.ne 2
.mk
.na
.B nt
.ad
.RS 6n
.rt
\fB(bool)\fR Initialize the \fBtip\fR variable \fBtandem\fR to
.IR off ,
so
that
.B XON/XOFF
flow control will not be used to throttle data from the
remote host.
.RE

.sp
.ne 2
.mk
.na
.B nv
.ad
.RS 6n
.rt
\fB(bool)\fR Initialize the \fBtip\fR variable \fBverbose\fR to
.IR off ,
so
that verbose mode will be turned on.
.RE

.sp
.ne 2
.mk
.na
.B oe
.ad
.RS 6n
.rt
\fB(str)\fR Output end-of-file string.  The default is a null string ("").
When
.B tip
is transferring a file, this string is sent at end-of-file.
.RE

.sp
.ne 2
.mk
.na
.B pa
.ad
.RS 6n
.rt
\fB(str)\fR The type of parity to use when sending data to the host.  This may
be one of
.BR even ,
.BR odd ,
.BR none ,
\fBzero\fR (always set bit  \fB8\fR
to
.BR 0 ),
\fBone\fR (always set bit  \fB8\fR to
.BR 1 ).
The default is
.BR none .
.RE

.sp
.ne 2
.mk
.na
.B pn
.ad
.RS 6n
.rt
\fB(str)\fR Telephone number(s) for this host. If the telephone number field
contains an `\fB@\fR' sign, \fBtip\fR searches the \fB/etc/phones\fR file for a
list of telephone numbers \(em see
.BR phones (4).
A `\fB%\fR' sign in the
telephone number indicates a 5-second delay for the Ventel Modem.
.sp
For Hayes-compatible modems, if the telephone number starts with an 'S', the
telephone number string will be sent to the modem without the "\fBDT\fR", which
allows reconfiguration of the modem's S-registers and other parameters; for
example, to disable auto-answer:  "\fBpn=S0=0DT5551234\fR";  or to also restrict
the modem to return only the basic result codes:  "\fBpn=S0=0X0DT5551234\fR".
.RE

.sp
.ne 2
.mk
.na
.B pr
.ad
.RS 6n
.rt
\fB(str)\fR Character that indicates end-of-line on the remote host.  The
default value is  \fB`\fR\en\fB\&'.\fR
.RE

.sp
.ne 2
.mk
.na
.B ra
.ad
.RS 6n
.rt
\fB(bool)\fR Initialize the \fBtip\fR variable \fBraise\fR to
.BR on ,
so that
lower case letters are mapped to upper case before sending them to the remote
host.
.RE

.sp
.ne 2
.mk
.na
.B rc
.ad
.RS 6n
.rt
\fB(str)\fR Character that toggles case-mapping mode.  The default value is
`\fB\e377\fR\&'.
.RE

.sp
.ne 2
.mk
.na
.B re
.ad
.RS 6n
.rt
\fB(str)\fR The file in which to record session scripts.  The default value is
.BR tip.record .
.RE

.sp
.ne 2
.mk
.na
.B rw
.ad
.RS 6n
.rt
\fB(bool)\fR Initialize the \fBtip\fR variable \fBrawftp\fR to
.BR on ,
so
that all characters will be sent as is during file transfers.
.RE

.sp
.ne 2
.mk
.na
.B sc
.ad
.RS 6n
.rt
\fB(bool)\fR Initialize the \fBtip\fR variable \fBscript\fR to
.BR on ,
so
that everything transmitted by the remote host will be recorded.
.RE

.sp
.ne 2
.mk
.na
.B tb
.ad
.RS 6n
.rt
\fB(bool)\fR Initialize the \fBtip\fR variable \fBtabexpand\fR to
.BR on ,
so
that tabs will be expanded to spaces during file transfers.
.RE

.sp
.ne 2
.mk
.na
.B tc
.ad
.RS 6n
.rt
\fB(str)\fR Indicates that the list of capabilities is continued in the named
description. This is used primarily to share common capability information.
.RE

.SH EXAMPLES
.LP
\fBExample 1\fR Using the Capability Continuation Feature
.sp
.LP
Here is a short example showing the use of the capability continuation
feature:

.sp
.in +2
.nf
UNIX-1200:\e
	:dv=/dev/cua0:el=^D^U^C^S^Q^O@:du:at=ventel:ie=#$%:oe=^D
:br#1200:arpavax|ax:\e
	:pn=7654321%:tc=UNIX-1200
.fi
.in -2
.sp

.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/remote
.ad
.RS 15n
.rt
remote host description file.
.RE

.sp
.ne 2
.mk
.na
.B /etc/phones
.ad
.RS 15n
.rt
remote host phone number database.
.RE

.SH SEE ALSO
.sp
.LP
.BR tip (1),
.BR phones (4)
.sp
.LP
.I System Administration Guide: IP Services
