usr/src/man/man4/resolv.conf.4
'\" te
.\" Copyright (c) 2004, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright 1989 AT&T
.\" Copyright (c) 1983 Regents of the University of California.
.\" All rights reserved. The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.TH resolv.conf 4 "15 Dec 2004" "SunOS 5.11" "File Formats"
.SH NAME
resolv.conf \- resolver configuration file
.SH SYNOPSIS
.LP
.nf
\fB/etc/resolv.conf\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B resolver
is a set of routines that provide access to the Internet
Domain Name System. See \fBresolver\fR(3RESOLV). \fBresolv.conf\fR is a
configuration file that contains the information that is read by the
\fBresolver\fR routines the first time they are invoked by a process. The file is
designed to be human readable and contains a list of keywords with values that
provide various types of
.B resolver
information.
.sp
.LP
The \fBresolv.conf\fR file contains the following configuration directives:
.sp
.ne 2
.mk
.na
.B nameserver
.ad
.RS 23n
.rt
Specifies the IPv4 or IPv6 Internet address of a name server that the resolver
is to query. Up to
.I MAXNS
name servers may be listed, one per keyword. See
<\fBresolv.h\fR>. If there are multiple servers, the resolver library queries
them in the order listed. If no name server entries are present, the resolver
library queries the name server on the local machine. The resolver library
follows the algorithm to try a name server until the query times out. It then
tries the name servers that follow, until each query times out. It repeats all
the name servers until a maximum number of retries are made.
.RE

.sp
.ne 2
.mk
.na
.B domain
.ad
.RS 23n
.rt
Specifies the local domain name. Most queries for names within this domain can
use short names relative to the local domain. If no domain entry is present, the
domain is determined from
.BR sysinfo (2)
or from
.BR gethostname (3C).
(Everything after the first `.' is presumed to be the domain name.) If the host
name does not contain a domain part, the root domain is assumed. You can use the
\fBLOCALDOMAIN\fR environment variable to override the domain name.
.RE

.sp
.ne 2
.mk
.na
.B search
.ad
.RS 23n
.rt
The search list for host name lookup. The search list is normally determined
from the local domain name. By default, it contains only the local domain name.
You can change the default behavior by listing the desired domain search path
following the search keyword, with spaces or tabs separating the names. Most
\fBresolver\fR queries will be attempted using each component of the search path
in turn until a match is found. This process may be slow and will generate a lot
of network traffic if the servers for the listed domains are not local. Queries
will time out if no server is available for one of the domains.
.sp
The search list is currently limited to six domains and a total of 256
characters.
.RE

.sp
.ne 2
.mk
.na
\fBsortlist\fIaddresslist\fR
.ad
.RS 23n
.rt
Allows addresses returned by the libresolv-internal
.B gethostbyname()
to be
sorted. A
.B sortlist
is specified by IP address netmask pairs. The netmask is
optional and defaults to the natural netmask of the net. The IP address and
optional network pairs are separated by slashes. Up to 10 pairs may be specified.
For example:
.sp
.in +2
.nf
sortlist 130.155.160.0/255.255.240.0 130.155.0.0
.fi
.in -2
.sp

.RE

.sp
.ne 2
.mk
.na
.B options
.ad
.RS 23n
.rt
Allows certain internal resolver variables to be modified. The syntax is
.sp
.in +2
.nf
options option ...
.fi
.in -2
.sp

where option is one of the following:
.sp
.ne 2
.mk
.na
.B debug
.ad
.RS 18n
.rt
Sets
.B RES_DEBUG
in the
.B _res.options
field.
.RE

.sp
.ne 2
.mk
.na
\fBndots:\fIn\fR
.ad
.RS 18n
.rt
Sets a threshold floor for the number of dots which must appear in a name given
to
.B res_query()
before an initial absolute (as-is) query is performed. See
.BR resolver (3RESOLV).
The default value for
.I n
is 1, which means that if
there are any dots in a name, the name is tried first as an absolute name before
any search list elements are appended to it.
.RE

.sp
.ne 2
.mk
.na
\fBtimeout:\fIn\fR
.ad
.br
.na
\fBretrans:\fIn\fR
.ad
.RS 18n
.rt
Sets the amount of time the resolver will wait for a response from a remote name
server before retrying the query by means of a different name server. Measured in
seconds, the default is
.BR RES_TIMEOUT .
See <\fBresolv.h\fR>. The
\fBtimeout\fR and \fBretrans\fR values are the starting point for an exponential
back off procedure where the
.B timeout
is doubled for every retransmit
attempt.
.RE

.sp
.ne 2
.mk
.na
\fBattempts:\fIn\fR
.ad
.br
.na
\fBretry:\fIn\fR
.ad
.RS 18n
.rt
Sets the number of times the resolver will send a query to its name servers
before giving up and returning an error to the calling application. The default
is
.BR RES_DFLRETRY .
See <\fBresolv.h\fR>.
.RE

.sp
.ne 2
.mk
.na
.B rotate
.ad
.RS 18n
.rt
Sets
.B RES_ROTATE
in
.BR _res.options .
The name servers are queried
round-robin from among those listed. The query load is spread among all listed
servers, rather than having all clients try the first listed server first every
time.
.RE

.sp
.ne 2
.mk
.na
.B no-check-names
.ad
.RS 18n
.rt
Sets
.B RES_NOCHECKNAME
in
.BR _res.options .
This disables the modern BIND
checking of incoming host names and mail names for invalid characters such as
underscore
.RB ( _ ),
non-ASCII, or control characters.
.RE

.sp
.ne 2
.mk
.na
.B inet6
.ad
.RS 18n
.rt
Sets
.B RES_USE_INET6
in
.BR _res.options .
In the Solaris BIND port, this
has no effect on
.BR gethostbyname "(3NSL). To retrieve IPv6 addresses or IPv4"
addresses, use \fBgetaddrinfo\fR(3SOCKET) instead of setting \fBinet6\fR.
.RE

.RE

.sp
.LP
The
.B domain
and
.B search
keywords are mutually exclusive. If more than
one instance of these keywords is present, the last instance takes precedence.
.sp
.LP
You can override the
.B search
keyword of the system \fBresolv.conf\fR file
on a per-process basis by setting the environment variable
.B LOCALDOMAIN
to a
space-separated list of search domains.
.sp
.LP
You can amend the
.B options
keyword of the system \fBresolv.conf\fR file on
a per-process basis by setting the environment variable
.B RES_OPTIONS
to a
space-separated list of resolver options.
.sp
.LP
The keyword and value must appear on a single line. Start the line with the
keyword, for example,
.BR nameserver ,
followed by the value, separated by white
space.
.SH FILES
.sp
.ne 2
.mk
.na
\fB/etc/resolv.conf\fR
.ad
.RS 20n
.rt

.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityStandard BIND 8.3.3
.TE

.SH SEE ALSO
.sp
.LP
.BR domainname (1M),
\fBsysinfo\fR(2), \fBgethostbyname\fR(3NSL),
\fBgetnameinfo\fR(3SOCKET), \fBgetipnodebyname\fR(3SOCKET),
.BR gethostname (3C),
.BR resolver (3RESOLV),
.BR attributes (5)
.sp
.LP
Vixie, Paul, Dunlap, Keven J., Karels, Michael J. \fIName Server Operations
Guide for BIND\fR. Internet Software Consortium, 1996.
