usr/src/man/man4/rmtab.4
'\" te
.\" Copyright (C) 1999, Sun Microsystems,
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" Inc. All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH rmtab 4 "15 Nov 1990" "SunOS 5.11" "File Formats"
.SH NAME
rmtab \- remote mounted file system table
.SH SYNOPSIS
.LP
.nf
\fB/etc/rmtab\fR
.fi

.SH DESCRIPTION
.sp
.LP
.B rmtab
contains a table of filesystems that are remotely mounted by
.B NFS
clients. This file is maintained by
.BR mountd (1M),
the mount
daemon. The data in this file should be obtained only from
.BR mountd (1M)
using the
.B MOUNTPROC_DUMP
remote procedure call.
.sp
.LP
The file contains a line of information for each remotely mounted
filesystem. There are a number of lines of the form:
.sp
.in +2
.nf
\fBhostname\fB:\fIfsname\fR
.fi
.in -2

.sp
.LP
The mount daemon adds an entry for any client that successfully executes a
mount request and deletes the appropriate entries for an unmount request.
.sp
.LP
Lines beginning with a hash (' \fB#\fR') are commented out. These lines are
removed from the file by \fBmountd\fR(1M) when it first starts up. Stale
entries may accumulate for clients that crash without sending an unmount
request.
.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/rmtab
.ad
.RS 14n
.rt

.RE

.SH SEE ALSO
.sp
.LP
.BR mountd (1M),
.BR showmount (1M)
