usr/src/man/man4/rndc.conf.4
'\" te
.\" Copyright (C) 2004  Internet Systems Consortium, Inc. ("ISC")
.\" Copyright (C) 2000, 2001 Internet Software Consortium.
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND ISC DISCLAIMS ALL WARRANTIES WITH
.\" REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF MERCHANTABILITY
.\" AND FITNESS. IN NO EVENT SHALL ISC BE LIABLE FOR ANY SPECIAL, DIRECT,
.\" INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES WHATSOEVER RESULTING FROM
.\" LOSS OF USE, DATA OR PROFITS, WHETHER IN AN ACTION OF CONTRACT, NEGLIGENCE
.\" OR OTHER TORTIOUS ACTION, ARISING OUT OF OR IN CONNECTION WITH THE USE OR
.\" PERFORMANCE OF THIS SOFTWARE.
.\"
.\" Portions Copyright (c) 2009, Sun Microsystems, Inc. All Rights Reserved.
.TH rndc.conf 4 "24 Dec 2008" "SunOS 5.11" "File Formats"
.SH NAME
rndc.conf \- rndc configuration file
.SH SYNOPSIS
.LP
.nf
rndc.conf
.fi

.SH DESCRIPTION
.sp
.LP
\fBrndc.conf\fR is the configuration file for
.BR rndc ,
the BIND 9 name
server control utility. This file has a similar structure and syntax to
\fBnamed.conf\fR. Statements are enclosed in braces and terminated with a
semi-colon. Clauses in the statements are also semi-colon terminated. The
usual comment styles are supported:
.sp
.ne 2
.mk
.na
.B C style
.ad
.RS 14n
.rt
/* */
.RE

.sp
.ne 2
.mk
.na
.B C++ style
.ad
.RS 14n
.rt
// to end of line
.RE

.sp
.ne 2
.mk
.na
.B Unix style
.ad
.RS 14n
.rt
# to end of line
.RE

.sp
.LP
\fBrndc.conf\fR is much simpler than
.BR named.conf .
The file uses three
statements: an options statement, a server statement and a key statement.
.sp
.LP
The
.B options
statement contains three clauses. The
\fBdefault-server\fR clause is followed by the name or address of a name
server. This host is used when no name server is provided as an argument to
.BR rndc .
The \fBdefault-key\fR clause is followed by the name of a key
which is identified by a
.B key
statement. If no
.B keyid
is provided
on the rndc command line, and no
.B key
clause is found in a matching
\fBserver\fR statement, this default key will be used to authenticate the
server's commands and responses. The \fBdefault-port\fR clause is followed
by the port to connect to on the remote name server. If no
.B port
option
is provided on the rndc command line, and no
.B port
clause is found in a
matching
.B server
statement, this default port will be used to
connect.
.sp
.LP
After the
.B server
keyword, the server statement includes a string
which is the hostname or address for a name server. The statement has two
possible clauses:
.B key
and
.BR port .
The key name must match the name
of a key statement in the file. The port number specifies the port to
connect to.
.sp
.LP
The
.B key
statement begins with an identifying string, the name of the
key. The statement has two clauses.
.B algorithm
identifies the
encryption algorithm for
.B rndc
to use; currently only HMAC-MD5 is
supported. This is followed by a secret clause which contains the base-64
encoding of the algorithm's encryption key. The base-64 string is enclosed
in double quotes.
.sp
.LP
There are two common ways to generate the base-64 string for the secret.
The BIND 9 program \fBrndc-confgen\fR(1M) can be used to generate a random
key, or the
.B mmencode
program, also known as
.BR mimencode ,
can be
used to generate a base-64 string from known input.
.B mmencode
does not
ship with BIND 9 but is available on many systems. See the EXAMPLES section
for sample command lines for each.
.SH EXAMPLES
.sp
.in +2
.nf
options {
     default-server  localhost;
     default-key     samplekey;
};

server localhost {
     key             samplekey;
};

key samplekey {
     algorithm hmac-md5;
     secret
     "c3Ryb25nIGVub3VnaCBmb3IgYSBtYW4gYnV0IG1hZGUgZm9yIGEgd29tYW4K";
};

.fi
.in -2
.sp

.sp
.LP
In the above example,
.B rndc
by default uses the server at localhost
(127.0.0.1) and the key called
.IR samplekey .
Commands to the localhost
server use the
.I samplekey
key, which must also be defined in the
server's configuration file with the same name and secret. The key statement
indicates that
.I samplekey
uses the HMAC-MD5 algorithm. Its secret
clause contains the base-64 encoding of the HMAC-MD5 secret enclosed in
double quotes.
.sp
.LP
To generate a random secret with
.BR rndc-confgen :
.sp
.in +2
.nf
rndc-confgen
.fi
.in -2
.sp

.sp
.LP
A complete \fBrndc.conf\fR file, including the randomly generated key, will
be written to the standard output. Commented out
.B key
and
\fBcontrols\fR statements for \fBnamed.conf\fR are also printed.
.sp
.LP
To generate a base-64 secret with
.BR mmencode :
.sp
.in +2
.nf
echo "known plaintext for a secret" | mmencode
.fi
.in -2
.sp

.SH NAME SERVER CONFIGURATION
.sp
.LP
The name server must be configured to accept rndc connections and to
recognize the key specified in the \fBrndc.conf\fR file, using the controls
statement in
.BR named.conf .
See the sections on the
.BR controls
statement in the \fIBIND 9 Administrator Reference Manual\fR for details.
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWbind
_
Interface StabilityExternal
.TE

.SH SEE ALSO
.sp
.LP
.BR rndc (1M),
\fBrndc-confgen\fR(1M), \fBattributes\fR(5)
.sp
.LP
\fIBIND 9 Administrator Reference Manual\fR
