usr/src/man/man4/rpc.4
'\" te
.\" Copyright (c) 1991, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" Copyright 1989 AT&T
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH rpc 4 "10 Dec 1991" "SunOS 5.11" "File Formats"
.SH NAME
rpc \- rpc program number data base
.SH SYNOPSIS
.LP
.nf
\fB/etc/rpc\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B rpc
file is a local source containing user readable names that
can be used in place of
.B RPC
program numbers.  The
.B rpc
file can
be used in conjunction with or instead of other rpc sources, including the
.B NIS
maps ``rpc.byname'' and ``rpc.bynumber'' and the
.B NIS+
table
``rpc''.
.sp
.LP
The rpc file has one line for each
.B RPC
program name. The line has the
following format:
.sp
.in +2
.nf
\fIname-of-the-RPC-program\fR \fIRPC-program-number\fR \fIaliases\fR
.fi
.in -2

.sp
.LP
Items are separated by any number of blanks and/or tab characters. A
``\fB#\fR'' indicates the beginning of a comment; characters up to the end
of the line are not interpreted by routines which search the file.
.SH EXAMPLES
.LP
.B Example 1
RPC Database
.sp
.LP
Below is an example of an RPC database:

.sp
.in +2
.nf
#
#	rpc
#
rpcbind	100000	portmap	sunrpc	portmapper
rusersd	100002	rusers
nfs	100003	nfsprog
mountd	100005	mount	showmount
walld	100008	rwall	shutdown
sprayd	100012	spray
llockmgr	100020
nlockmgr	100021
status	100024
bootparam	100026
keyserv	100029	keyserver
.fi
.in -2
.sp

.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/nsswitch.conf
.ad
.RS 22n
.rt

.RE

.SH SEE ALSO
.sp
.LP
.BR nsswitch.conf (4)
