usr/src/man/man4/sasl_appname.conf.4
'\" te
.\" Copyright (C) 1998-2003, Carnegie Mellon Univeristy.  All Rights Reserved.
.\" Portions Copyright (c) 2003, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH sasl_appname.conf 4 "14 Oct 2003" "SunOS 5.11" "File Formats"
.SH NAME
sasl_appname.conf \- SASL options and configuration file
.SH SYNOPSIS
.LP
.nf
/etc/sasl/\fIappname\fB\&.conf\fR
.fi

.SH DESCRIPTION
.sp
.LP
The \fB/etc/sasl/\fIappname\fR.conf\fR file is a user-supplied
configuration file that supports user set options for server applications.
.sp
.LP
You can modify the behavior of
.B libsasl
and its plug-ins for server
applications by specifying option values in
\fB/etc/sasl/\fIappname\fR.conf\fR file, where \fIappname\fR is the
application defined name of the application. For
.BR sendmail ,
the file
would be
.BR /etc/sasl/Sendmail.conf .
See your application documentation
for information on the application name.
.sp
.LP
Options that you set in a \fIappname\fR.conf\fR file do not override
SASL options specified by the application itself.
.sp
.LP
The format for each option setting is:
.sp
.in +2
.nf
option_name:value.
.fi
.in -2

.sp
.LP
You can comment lines in the file by using a leading #.
.sp
.LP
The SASL library supports the following options for server applications:
.sp
.ne 2
.mk
.na
.B auto_transition
.ad
.RS 25n
.rt
When set to
.BR yes ,
plain users and login plug-ins are automatically
transitioned to other mechanisms when they do a successful plaintext
authentication. The default value for
.B auto_transition
is
.BR no .
.RE

.sp
.ne 2
.mk
.na
.B auxprop_plugin
.ad
.RS 25n
.rt
A space-separated list of names of auxiliary property plug-ins to use. By
default, SASL will use or query all available auxiliary property plug-ins.
.RE

.sp
.ne 2
.mk
.na
.B canon_user_plugin
.ad
.RS 25n
.rt
The name of the canonical user plug-in to use. By default, the value of
.B canon_user_plugin
is
.BR INTERNAL ,
to indicated the use of built-in
plug-ins..
.RE

.sp
.ne 2
.mk
.na
.B log_level
.ad
.RS 25n
.rt
An integer value for the desired level of logging for a server, as defined
in <\fBsasl.h\fR>. This sets the
.B log_level
in the
.B sasl_server_params_t struct
in
.BR /usr/include/sasl/saslplug.h .
The
default value for
.B log_level
is
.B 1
to indicate
.BR SASL_LOG_ERR .

.RE

.sp
.ne 2
.mk
.na
.B mech_list
.ad
.RS 25n
.rt
Whitespace separated list of SASL mechanisms to allow, for example,
.BR "DIGEST-MD5 GSSAPI" .
The
.B mech_list
option is used to restrict the
mechanisms to a subset of the installed plug-ins. By default, SASL will use
all available mechanisms.
.RE

.sp
.ne 2
.mk
.na
.B pw_check
.ad
.RS 25n
.rt
Whitespace separated list of mechanisms used to verify passwords that are
used by \fBsasl_checkpass\fR(3SASL). The default value for
.B pw_check
is
.BR auxprop .
.RE

.sp
.ne 2
.mk
.na
.B reauth_timeout
.ad
.RS 25n
.rt
This SASL option is used by the server DIGEST-MD5 plug-in. The value of
.B reauth_timeout
is the length in time (in minutes) that authentication
information will be cached for a fast reauthorization. A value of 0 will
disable reauthorization. The default value of
.B reauth_timeout
is 1440
(24 hours).
.RE

.sp
.ne 2
.mk
.na
.B server_load_mech_list
.ad
.RS 25n
.rt
A space separated list of mechanisms to load. If in the process of loading
server plug-ns no desired mechanisms are included in the plug-in, the
plug-in will be unloaded. By default, SASL loads all server plug-ins.
.RE

.sp
.ne 2
.mk
.na
.B user_authid
.ad
.RS 25n
.rt
If the value of
.B user_authid
is
.BR yes ,
then the GSSAPI will
acquire the client credentials rather than use the default credentials when
it creates the GSS client security context. The default value of
.B user_authid
is
.BR no ,
whereby SASL uses the default client Kerberos
identity.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityEvolving
.TE

.SH SEE ALSO
.sp
.LP
.BR attributes (5)
