usr/src/man/man4/scsi.4
'\" te
.\" Copyright (c) 2008, Sun Microsystems, Inc. All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH scsi 4 "30 May 2008" "SunOS 5.11" "File Formats"
.SH NAME
scsi \- configuration files for SCSI target drivers
.SH DESCRIPTION
.sp
.LP
The architecture of the Solaris
.B SCSI
subsystem distinguishes two
types of device drivers:
.B SCSI
target drivers, and
.B SCSI
host
adapter drivers. Target drivers like
.BR sd (7D)
and
.BR st (7D)
manage
the device on the other end of the
.B SCSI
bus. Host adapter drivers
manage the
.B SCSI
bus on behalf of all the devices that share it.
.sp
.LP
Drivers for host adapters provide a common set of interfaces for target
drivers. These interfaces comprise the Sun Common
.B SCSI
Architecture (
.B SCSA)
which are documented as part of the Solaris DDI/DKI. See
.BR scsi_ifgetcap (9F),
.BR scsi_init_pkt (9F),
and
.BR scsi_transport (9F)
for further details of these, and associated
routines.
.sp
.LP
Depending on the interconnect (transport), SCSI target devices are either
self-identifying or rely on
.BR driver.conf (4)
entries to be recognized by
the system. For self-identifying target devices the driver binding is chosen
based on the IEEE-1275 like 'compatible' forms of the target devices.
Currently the Fibre Channel interconnects, \fBfcp\fR(7D), \fBifp\fR(7D),
.BR scsi_vhci (7D),
.BR sf (7D),
and the SATA framework drivers (see
.BR sata (7D))
are self-identifying. You must specify other possible
interconnects target devices by using the target driver
.BR driver.conf (4)
configuration files.
.SS "Self-Identifying"
.sp
.LP
Host adapter drivers of class scsi-self-identifying that dynamically create
self-identifying target device children establish a \fBcompatible\fR
property on each child. The compatible property is an ordered array of
strings, each string is a compatible
.BR form .
High precedence forms are
defined first. For a particular device, the highest precedence form that has
an established driver alias selects the driver for the device. Driver
associations to compatible forms, called aliases, are administered by way of
.BR add_drv (1M),
.BR update_drv (1M),
and
.BR rem_drv "(1M) utilities."
.sp
.LP
The forms for self-identifying SCSI target devices are derived from the
SCSI target device's INQUIRY data. A diverse set of forms is defined,
allowing for flexibility in binding.
.sp
.LP
From the SCSI INQUIRY data, three types of information are extracted:
scsi_dtype, flag bits, and SCSI_ASCII vendor product revision.
.sp
.LP
The scsi_dtype is the first component of most forms. It is represented as
two hex digits. For nodes that represent embedded secondary functions, such
as an embedded enclosure service or media changer, additional forms are
generated that contain the dtype of the secondary function followed by the
dtype of the device in which the secondary function is embedded.
.sp
.LP
For forms that use flag bits, all applicable flags are concatenated (in
alphabetical order) into a single flags string. Removable media is
represented by a flag. For forms that use the SCSI_ASCII INQUIRY vendor,
product, and revision fields, a one-way conversion algorithm translates
SCSI_ASCII to a IEEE 1275 compatible string.
.sp
.LP
It is possible that a device might change the INQUIRY data it returns over
time as a result of a device initialization sequence or in response to
out-of-band management. A device node's compatible property is based on the
INQUIRY data when the device node was created.
.sp
.LP
The following forms, in high to low precedence order, are defined for SCSI
target device nodes.
.sp
.in +2
.nf
scsiclass,DDEEFFF.vVVVVVVVV.pPPPPPPPPPPPPPPPP.rRRRR (1  *1&2)
scsiclass,DDEE.vVVVVVVVV.pPPPPPPPPPPPPPPPP.rRRRR    (2  *1)
scsiclass,DDFFF.vVVVVVVVV.pPPPPPPPPPPPPPPPP.rRRRR   (3  *2)
scsiclass,DD.vVVVVVVVV.pPPPPPPPPPPPPPPPP.rRRRR      (4)
scsiclass,DDEEFFF.vVVVVVVVV.pPPPPPPPPPPPPPPPP       (5  *1&2)
scsiclass,DDEE.vVVVVVVVV.pPPPPPPPPPPPPPPPP          (6  *1)
scsiclass,DDFFF.vVVVVVVVV.pPPPPPPPPPPPPPPPP         (7  *2)
scsiclass,DD.vVVVVVVVV.pPPPPPPPPPPPPPPPP            (8)
scsiclass,DDEEFFF                                   (9 *1&2)
scsiclass,DDEE                                      (10 *1)
scsiclass,DDFFF                                     (11 *2)
scsiclass,DD                                        (12)
scsiclass                                           (13)
   *1 only produced on a secondary function node
   *2 only produced on a node with flags
.fi
.in -2

.sp
.LP
where:
.sp
.ne 2
.mk
.na
.B v
.ad
.RS 20n
.rt
Is the letter
.BR v .
Denotes the beginning of
.BR VVVVVVVV .
.RE

.sp
.ne 2
.mk
.na
.B VVVVVVVV
.ad
.RS 20n
.rt
Translated scsi_vendor: SCSI standard INQUIRY data "Vendor identification"
SCSI_ASCII field (bytes 8-15).
.RE

.sp
.ne 2
.mk
.na
.B p
.ad
.RS 20n
.rt
Is the letter
.BR p .
Denotes the beginning of
.BR PPPPPPPPPPPPPPPP .
.RE

.sp
.ne 2
.mk
.na
.B PPPPPPPPPPPPPPPP
.ad
.RS 20n
.rt
Translated scsi_product: SCSI standard INQUIRY data "Product
identification" SCSI_ASCII field (bytes 16-31).
.RE

.sp
.ne 2
.mk
.na
.B r
.ad
.RS 20n
.rt
Is the letter
.BR r .
Denotes the beginning of
.BR RRRR .
.RE

.sp
.ne 2
.mk
.na
.B RRRR
.ad
.RS 20n
.rt
Translated scsi_revision: SCSI standard INQUIRY data "Product revision
level" SCSI_ASCII field (bytes 32-35).
.RE

.sp
.ne 2
.mk
.na
.B DD
.ad
.RS 20n
.rt
Is a two digit ASCII hexadecimal number. The value of the two digits is
based one the SCSI "Peripheral device type" command set associated with the
node. On a primary node this is the scsi_dtype of the primary command set;
on a secondary node this is the
.B scsi_dtype
associated with the
embedded function command set.
.RE

.sp
.ne 2
.mk
.na
.B EE
.ad
.RS 20n
.rt
Same encoding used for
.BR DD .
This form is only generated on secondary
function nodes. The
.B DD
function is embedded in an
.B EE
device.
.RE

.sp
.ne 2
.mk
.na
.B FFF
.ad
.RS 20n
.rt
Concatenation, in alphabetical order, of the flag characters below. The
following flag characters are defined:
.sp
.ne 2
.mk
.na
.B R
.ad
.RS 5n
.rt
Removable media: Used when
.B scsi_rmb
is set
.RE

Forms using
.B FFF
are only be generated if there are applicable flag
characters.
.RE

.sp
.LP
Solaris might create additional
.B compatible
forms not described. These
forms are for Solaris internal use only. Any additional use of these forms
is discouraged. Future releases of Solaris might not produce these forms.
.SS "driver.conf"
.sp
.LP
Configuration files for
.B SCSI
target drivers should identify the host
adapter driver implicitly using the
.I class
keyword to remove any
dependency on the particular host adapter involved.
.sp
.LP
All host adapter drivers of class
.B scsi
recognize the following
properties:
.sp
.ne 2
.mk
.na
.B target
.ad
.RS 10n
.rt
Integer-valued
.B SCSI
target identifier that this driver claims.
.RE

.sp
.ne 2
.mk
.na
.B lun
.ad
.RS 10n
.rt
Integer-valued
.B SCSI
logical unit number (
.B LUN)
that this driver
claims.
.RE

.sp
.LP
All
.B SCSI
target driver configuration file device definitions except
stub device definitions for discovery of
.B devid
must provide target and
.B lun
properties. These properties are used to construct the address
part of the device name under
.BR /devices .
The stub device definitions
for discovery of
.B devid
must be able to specify or imply the host
adapter drivers that might have children that bind to the target driver. So
all SCSI target driver configuration file stub device definitions must be
defined by property class or parent.
.sp
.LP
The
.B SCSI
target driver configuration files shipped with Solaris have
entries for
.B "LUN 0"
only. For devices that support other
.B LUNs,
such as some
.B CD
changers, the system administrator can
edit the driver configuration file to add entries for other
.BR LUNs.
.SH EXAMPLES
.LP
.B Example 1
An Example Configuration File for a SCSI Target Driver
.sp
.LP
The following is an example configuration file for a SCSI target driver
called
.BR toaster.conf .

.sp
.in +2
.nf
#
# Copyright (c) 1992, by Sun Microsystems, Inc.
#
#ident "@(#)toaster.conf  1.2     92/05/12 SMI"
name="toaster" class="scsi" target=4 lun=0;
.fi
.in -2
.sp

.sp
.LP
Add the following lines to
.B sd.conf
for a six-
.B CD
changer on
.BR "target 3" ,
with
.B "LUNs 0"
to
.BR 5 .

.sp
.in +2
.nf
name="sd" class="scsi" target=3 lun=1;
name="sd" class="scsi" target=3 lun=2;
name="sd" class="scsi" target=3 lun=3;
name="sd" class="scsi" target=3 lun=4;
name="sd" class="scsi" target=3 lun=5;
.fi
.in -2
.sp

.sp
.LP
It is not necessary to add the line for
.BR "LUN 0" ,
as it already
exists in the file shipped with Solaris.

.LP
.B Example 2
A Stub Device Definition of \fBsd.conf\fR
.sp
.LP
The following line is a stub device definition which implies the host
adapter drivers of class scsi-self-identifying might have children that bind
to the
.BR sd "(7D) driver:"

.sp
.in +2
.nf
name="sd" class="scsi-self-identifying";
.fi
.in -2
.sp

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWckr
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
.BR add_drv (1M),
.BR rem_drv (1M),
.BR update_drv (1M),
.BR driver.conf (4),
.BR attributes (5),
.BR fcp (7D),
.BR ifp (7D),
.BR sata (7D),
.BR scsi_vhci (7D),
.BR sd (7D),
.BR sf (7D),
.BR st (7D),
.BR scsi_ifgetcap (9F),
.BR scsi_init_pkt (9F),
.BR scsi_transport (9F)
.sp
.LP
.I Writing Device Drivers
.sp
.LP
.I "ANS X3T9.2/82-2 SMALL COMPUTER SYSTEM INTERFACE (SCSI-1)
.sp
.LP
.I "ANS X3T9.2/375D Small Computer System Interface - 2 (SCSI-2)
.sp
.LP
.I "ANS X3T10/994D SCSI-3 Architecture Model (SAM)
.sp
.LP
.I "IEEE 1275 SCSI Target Device Binding
.SH NOTES
.sp
.LP
With
.BR driver.conf (4)
configuration, you need to ensure that the
.B target
and
.B lun
values claimed by your target driver do not
conflict with existing target drivers on the system. For example, if the
target is a direct access device, the standard
.B sd.conf
file usually
makes
.B sd
claim it before any other driver has a chance to probe it.
