usr/src/man/man4/sel_config.4
'\" te
.\" Copyright (c) 2007, Sun Microsystems, Inc. All Rights Reserved.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH sel_config 4 "20 Jul 2007" "SunOS 5.11" "File Formats"
.SH NAME
sel_config \- selection rules for copy, cut, paste, drag and drop
operations
.SH SYNOPSIS
.LP
.nf
\fB/usr/dt/config/sel_config\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B sel_config
file specifies how a system that is configured with
Trusted Extensions behaves when a user transfers data between windows that
have different labels. Transfer operations include cut-and-paste,
copy-and-paste, and drag-and-drop. There are two types of entries in this
file: automatic confirmation and automatic reply.
.SS "Automatic Confirmation"
.sp
.LP
This type of entry specifies whether a confirmation window, the selection
confirmer, displays. Each entry has the form:
.sp
.in +2
.nf
\fIrelationship\fR: \fIconfirmation\fR
.fi
.in -2
.sp

.sp
.LP
.I relationship
identifies the result of comparing the selected data's
source and destination windows' labels. There are three allowed values:
.sp
.ne 2
.mk
.na
.B upgradesl
.ad
.RS 20n
.rt
The source window's label is less than the destination window's label.
.RE

.sp
.ne 2
.mk
.na
.B downgradesl
.ad
.RS 20n
.rt
The source window's label is higher than the destination window's label.
.RE

.sp
.ne 2
.mk
.na
.B disjointsl
.ad
.RS 20n
.rt
The source and destination windows' labels are disjoint. Neither label
dominates the other.
.RE

.sp
.LP
.I confirmation
specifies whether to perform automatic confirmation.
Allowed values are:
.sp
.ne 2
.mk
.na
.B n
.ad
.RS 5n
.rt
Use manual confirmation, that is, display the selection confirmer window.
This is the default.
.RE

.sp
.ne 2
.mk
.na
.B y
.ad
.RS 5n
.rt
Use automatic confirmation, that is, do not display the selection confirmer
window.
.RE

.SS "Automatic Reply"
.sp
.LP
A single user operation can involve several flows of information between
the source and destination windows. The automatic reply set of entries
provides a means to reduce the number of confirmations that are required of
the user.
.sp
.LP
There must be one entry of this form:
.sp
.in +2
.nf
autoreply: \fIvalue\fR
.fi
.in -2
.sp

.sp
.LP
If
.I value
is
.B y
(for yes), then the remaining entries of the set
are used as attributes for the selection data (rather than the actual
contents) to complete the operation without confirmation. If
.I value
is
.B n
(for no), then the remaining entries are ignored.
.sp
.LP
Defaults can be specified for any
.I type
field that appears in the
Confirmer window. Below are some sample entries for defaults.
.sp
.in +2
.nf
replytype: TARGETS
replytype: Pixel Sets
replytype: LENGTH
replytype: Type Of Monitor
.fi
.in -2
.sp

.sp
.LP
The
.B TARGETS
entry, when used, returns the list of target atoms that
are supported by the source window. The
.B "Pixel Sets"
and \fBType Of
Monitor\fR entries are used for animation during a drag-and-drop operation.
The
.B LENGTH
entry specifies the number of bytes in the selection.
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWtsu
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
.BR attributes (5)
.sp
.LP
.I "Rules When Changing the Level of Security for Data
in \fISolaris
Trusted Extensions Administrator\&'s Procedures\fR
.SH NOTES
.sp
.LP
The functionality described on this manual page is available only if the
system is configured with Trusted Extensions.
