usr/src/man/man4/sendmail.4
'\" te
.\" Copyright (c) 2008, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH sendmail 4 "8 May 2008" "SunOS 5.11" "File Formats"
.SH NAME
sendmail, sendmail.cf, submit.cf \- sendmail configuration files
.SH SYNOPSIS
.LP
.nf
\fB/etc/mail/sendmail.cf\fR
.fi

.LP
.nf
\fB/etc/mail/submit.cf\fR
.fi

.SH DESCRIPTION
.sp
.LP
The \fBsendmail.cf\fR and \fBsubmit.cf\fR files are the configuration files
for \fBsendmail\fR(1M). Starting with version 8.12 of
.BR sendmail ,
which
was shipped with version 9 of the Solaris operating system, two
configuration files are used for submission and transmission of mail,
instead of only
.BR sendmail.cf ,
as before. These are:
.sp
.ne 2
.mk
.na
.B sendmail.cf
.ad
.RS 15n
.rt
Remains the principal
.B sendmail
configuration file. Used for the Mail
Transmission Agent (MTA).
.RE

.sp
.ne 2
.mk
.na
.B submit.cf
.ad
.RS 15n
.rt
Used for the Mail Submission Program (MSP). The MSP is used to submit mail
messages. Unlike the MTA, it does not run as an SMTP daemon.
.RE

.sp
.LP
The MSP does not require root privileges, thus the two-file model provides
better security than the pre-\fBsendmail\fR 8.12 model, in which the MSP ran
as a daemon and required root privileges.
.sp
.LP
In the default
.B sendmail
configuration,
.B sendmail
uses
.BR submit.cf ,
as indicated in
.BR ps (1)
output. In
.B ps
output, you
will observe two
.B sendmail
invocations, such as the ones below:
.sp
.in +2
.nf
/usr/lib/sendmail -Ac -q15m
/usr/lib/sendmail -bd -q15m
.fi
.in -2

.sp
.LP
The first indicates the use of
.BR submit.cf ,
with the client queue
(\fB/var/spool/clientmqueue\fR) being checked\(emand, if needed,
flushed\(emevery 15 minutes. The second invocation runs
.B sendmail
as a
daemon, waiting for incoming SMTP connections.
.sp
.LP
As shipped,
.B sendmail.cf
and, in particular,
.BR submit.cf ,
are
appropriate for most environments. Where a knowledgeable system
administrator needs to make a change, he should use the following
procedures.
.sp
.LP
For
.BR sendmail.cf :
.RS +4
.TP
1.
Change directories to the directory that contains the source files for the
configuration files.
.sp
.in +2
.nf
# \fBcd /etc/mail/cf/cf\fR
.fi
.in -2
.sp

.RE
.RS +4
.TP
2.
Create a copy of the
.B sendmail
file for your system.
.sp
.in +2
.nf
# \fBcp sendmail.mc `hostname`.mc\fR
.fi
.in -2
.sp

.RE
.RS +4
.TP
3.
Edit
.BR `hostname`.mc .
Make changes suitable for your system and
environment.
.RE
.RS +4
.TP
4.
Run
.B make
to generate the configuration file.
.sp
.in +2
.nf
# \fB/usr/bin/make `hostname`.cf\fR
.fi
.in -2
.sp

.RE
.RS +4
.TP
5.
Copy the newly generated file to its correct location.
.sp
.in +2
.nf
# \fBcp `hostname`.cf /etc/mail/sendmail.cf\fR
.fi
.in -2
.sp

.RE
.RS +4
.TP
6.
Restart the
.B sendmail
service.
.sp
.in +2
.nf
# \fBsvcadm restart sendmail\fR
.fi
.in -2
.sp

.RE
.sp
.LP
You must restart
.B sendmail
for
.B sendmail.cf
file changes to take
effect, as indicated in step 6. Steps 4 - 6 can be automated. See
.B Automated Rebuilding of Configuration Files
below.
.sp
.LP
For
.BR submit.cf :
.RS +4
.TP
1.
Change directories to the directory that contains the source files for the
configuration files.
.sp
.in +2
.nf
# \fBcd /etc/mail/cf/cf\fR
.fi
.in -2
.sp

.RE
.RS +4
.TP
2.
Create a copy of the
.B submit
file for your system.
.sp
.in +2
.nf
# \fBcp submit.mc submit-`hostname`.mc\fR
.fi
.in -2
.sp

.RE
.RS +4
.TP
3.
Edit
.BR submit-`hostname`.mc .
Make changes suitable for your system and
environment.
.RE
.RS +4
.TP
4.
Run
.B make
to generate the configuration file.
.sp
.in +2
.nf
# \fB/usr/bin/make submit-`hostname`.cf\fR
.fi
.in -2
.sp

.RE
.RS +4
.TP
5.
Copy the newly generated file to its correct location.
.sp
.in +2
.nf
# \fBcp submit-`hostname`.cf /etc/mail/submit.cf\fR
.fi
.in -2
.sp

.RE
.sp
.LP
You do not need to restart
.B sendmail
for changes to
.B submit.cf
to
take effect.  Steps 4 and 5 can be automated. See \fBAutomated Rebuilding of
Configuration Files\fR below.
.SS "Enabling Access to Remote Clients"
.sp
.LP
The \fBsendmail\fR(1M) man page describes how the \fBconfig/local_only\fR
property can be set to
.B true
or
.B false
to disallow or allow,
respectively, access to remote clients for unmodified systems.
.sp
.LP
Setting values for the following properties for the service instance
.B svc:/network/smtp:sendmail
results in automated (re)building of
configuration files:
.sp
.in +2
.nf
path_to_sendmail_mc
path_to_submit_mc
.fi
.in -2
.sp

.sp
.LP
The values for these properties should be strings which represent the path
name of the \fB\&.mc\fR files referred to in steps 2 and 3 of both
procedures above. Recommended values are:
.sp
.in +2
.nf
/etc/mail/cf/cf/`hostname`.mc
/etc/mail/cf/cf/submit-`hostname`.mc
.fi
.in -2
.sp

.sp
.LP
Each property, if set, results in the corresponding \fB\&.mc\fR file being
used to (re)build the matching \fB\&.cf\fR file when the service is
started.
.sp
.LP
These properties persist across upgrades and patches. To prevent a patch or
upgrade from clobbering your \fB\&.cf\fR file, or renaming it to
\fB\&.cf.old\fR, you can set the desired  properties instead.
.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/mail/cf/README
.ad
.RS 23n
.rt
Describes
.B sendmail
configuration files.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWsndmr
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
.BR make (1S),
.BR ps (1),
.BR sendmail (1M),
.BR svcadm (1M),
.BR attributes (5)
.sp
.LP
.I System Administration Guide: Network Services
