usr/src/man/man4/services.4
'\" te
.\" Copyright 1989 AT&T
.\" Copyright (c) 1983 Regents of the University of California.
.\" All rights reserved. The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\" Copyright (C) 2000, Sun Microsystems, Inc. All Rights Reserved
.TH services 4 "12 Oct 2000" "SunOS 5.11" "File Formats"
.SH NAME
services \- Internet services and aliases
.SH SYNOPSIS
.LP
.nf
\fB/etc/inet/services\fR
.fi

.LP
.nf
\fB/etc/services\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B services
file  is a local source of information regarding each
service available through the Internet. The
.B services
file can be used
in conjunction with or instead of other services sources, including the
\fBNIS\fR maps "services.byname" and the \fBNIS+\fR table "services."
Programs use the
.BR getservbyname "(3SOCKET) routines to access this"
information.
.sp
.LP
The
.B services
file contains an entry for each service. Each entry has
the form:
.sp
.in +2
.nf
\fIservice-name   port\fR/\fIprotocol   aliases\fR
.fi
.in -2

.sp
.ne 2
.mk
.na
.I service-name
.ad
.RS 17n
.rt
This is the official Internet service name.
.RE

.sp
.ne 2
.mk
.na
\fIport\fR/\fIprotocol\fR
.ad
.RS 17n
.rt
This field is composed of the port number and protocol through which the
service is provided, for instance,
.BR 512/tcp .
.RE

.sp
.ne 2
.mk
.na
.I aliases
.ad
.RS 17n
.rt
This is a list of alternate names by which the service might be
requested.
.RE

.sp
.LP
Fields can be separated by any number of
.B SPACE
.RB and/or " TAB"
characters. A number sign (\fB#\fR) indicates the beginning of a comment;
any characters that follow the comment character up to the end of the line
are not interpreted by routines which search the file.
.sp
.LP
Service names may contain any printable character other than a field
delimiter, a
.BR NEWLINE ,
or a comment character.
.sp
.LP
Any changes to a port assignment do not affect the actual port registration
of the service.
.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/nsswitch.conf
.ad
.RS 22n
.rt
configuration file for name-service switch
.RE

.SH SEE ALSO
.sp
.LP
.BR getservbyname (3SOCKET),
.BR inetd.conf (4),
.BR nsswitch.conf (4)
.SH NOTES
.sp
.LP
.B /etc/inet/services
is the official SVR4 name of the
.BR services
file. The symbolic link
.B /etc/services
exists for
.BR BSD
compatibility.
