usr/src/man/man4/shadow.4
'\" te
.\" Copyright 1989 AT&T Copyright (c) 2002, Sun Microsystems, Inc. All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH shadow 4 "15 Sep 2005" "SunOS 5.11" "File Formats"
.SH NAME
shadow \- shadow password file
.SH DESCRIPTION
.sp
.LP
.B /etc/shadow
is an access-restricted ASCII system file that stores
users' encrypted passwords and related information. The shadow file can be
used in conjunction with other shadow sources, including the
.B NIS
maps
.B passwd.byname
and
.B passwd.byuid
and the NIS+ table
.BR passwd .
Programs use the \fBgetspnam\fR(3C) routines to access this information.
.sp
.LP
The fields for each user entry are separated by colons. Each user is
separated from the next by a newline. Unlike the
.B /etc/passwd
file,
.B /etc/shadow
does not have general read permission.
.sp
.LP
Each entry in the shadow file has the form:
.sp
.in +2
.nf
\fIusername\fR:\fIpassword\fR:\fIlastchg\fR:\fImin\fR:\fImax\fR:\fIwarn\fR:\fIinactive\fR:\fIexpire\fR:\fIflag\fR
.fi
.in -2

.sp
.LP
The fields are defined as follows:
.sp
.ne 2
.mk
.na
.I username
.ad
.RS 12n
.rt
The user's login name (UID).
.RE

.sp
.ne 2
.mk
.na
.I password
.ad
.RS 12n
.rt
An encrypted password for the user generated by
.BR crypt "(3C), a"
.I lock
string to indicate that the login is not accessible, or no
string, which shows that there is no password for the login.
.sp
The lock string is defined as
.B *LK*
in the first four characters of
the password field.
.RE

.sp
.ne 2
.mk
.na
.I lastchg
.ad
.RS 12n
.rt
The number of days between January 1, 1970, and the date that the password
was last modified. The
.I lastchg
value is a decimal number, as
interpreted by
.BR strtol (3C).
.RE

.sp
.ne 2
.mk
.na
.I min
.ad
.RS 12n
.rt
The minimum number of days required between password changes. This field
must be set to 0 or above to enable password aging.
.RE

.sp
.ne 2
.mk
.na
.I max
.ad
.RS 12n
.rt
The maximum number of days the password is valid.
.RE

.sp
.ne 2
.mk
.na
.I warn
.ad
.RS 12n
.rt
The number of days before password expires that the user is warned.
.RE

.sp
.ne 2
.mk
.na
.I inactive
.ad
.RS 12n
.rt
The number of days of inactivity allowed for that user. This is counted on
a per-machine basis; the information about the last login is taken from the
machine's
.B lastlog
file.
.RE

.sp
.ne 2
.mk
.na
.I expire
.ad
.RS 12n
.rt
An absolute date expressed as the number of days since the Unix Epoch
(January 1, 1970). When this number is reached the login can no longer be
used. For example, an
.I expire
value of
.B 13514
specifies a login
expiration of January 1, 2007.
.RE

.sp
.ne 2
.mk
.na
.I flag
.ad
.RS 12n
.rt
Failed login count in low order four bits; remainder reserved for future
use, set to zero.
.RE

.sp
.LP
A value of
.B -1
for
.IR min ,
.IR max ,
or
.I warn
disables
password aging.
.sp
.LP
The encrypted password consists of at most
.BR CRYPT_MAXCIPHERTEXTLEN
characters chosen from a 64-character alphabet (\fB\&.\fR,
.BR / ,
\fB0\(mi9\fR, \fBA\(miZ\fR, \fBa\(miz\fR). Two additional special
characters, "$" and ",", can also be used and are defined in
.BR crypt (3C).
To update this file, use the
.BR passwd (1),
.BR useradd (1M),
.BR usermod (1M),
or
.BR userdel "(1M) commands."
.sp
.LP
.RB "In order to make system administration manageable," " /etc/shadow"
entries should appear in exactly the same order as
.BR /etc/passwd
entries; this includes ``+'' and ``-'' entries if the
.B compat
source is
being used (see
.BR nsswitch.conf (4)).
.sp
.LP
Values for the various time-related fields are interpreted as Greenwich
Mean Time.
.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/shadow
.ad
.RS 22n
.rt
shadow password file
.RE

.sp
.ne 2
.mk
.na
.B /etc/passwd
.ad
.RS 22n
.rt
password file
.RE

.sp
.ne 2
.mk
.na
.B /etc/nsswitch.conf
.ad
.RS 22n
.rt
name-service switch configuration file
.RE

.sp
.ne 2
.mk
.na
.B /var/adm/lastlog
.ad
.RS 22n
.rt
time of last login
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityStable
.TE

.SH SEE ALSO
.sp
.LP
.BR login (1),
.BR passwd (1),
.BR useradd (1M),
.BR userdel (1M),
.BR usermod (1M),
.BR strtol (3C),
.BR crypt (3C),
.BR crypt_gensalt (3C),
.BR getspnam (3C),
.BR putspent (3C),
.BR nsswitch.conf (4),
.BR passwd (4),
.BR attributes (5),
.BR pam_unix_account (5),
.BR pam_unix_auth (5)
.SH NOTES
.sp
.LP
If password aging is turned on in any name service the
.I passwd:
line
in the
.B /etc/nsswitch.conf
file must have a format specified in the
.BR nsswitch.conf (4)
man page.
.sp
.LP
If the
.B /etc/nsswitch.conf
passwd policy is not in one of the
supported formats, logins will not be allowed upon password expiration,
because the software does not know how to handle password updates under
these conditions. See
.BR nsswitch.conf (4)
for additional information.
