usr/src/man/man4/sharetab.4
'\" te
.\" Copyright 1989 AT&T
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH sharetab 4 "3 Jul 1990" "SunOS 5.11" "File Formats"
.SH NAME
sharetab \- shared file system table
.SH DESCRIPTION
.sp
.LP
.B sharetab
resides in directory
.B /etc/dfs
and contains a table of
local resources shared by the
.B share
command.
.sp
.LP
Each line of the file consists of the following fields:
.sp
.LP
.I pathname resource fstype specific_options description
.sp
.LP
where
.sp
.ne 2
.mk
.na
.I pathname
.ad
.RS 20n
.rt
Indicate the path name of the shared resource.
.RE

.sp
.ne 2
.mk
.na
.I resource
.ad
.RS 20n
.rt
Indicate the symbolic name by which remote systems can  access the
resource.
.RE

.sp
.ne 2
.mk
.na
.I fstype
.ad
.RS 20n
.rt
Indicate the file system type of the shared resource.
.RE

.sp
.ne 2
.mk
.na
.I specific_options
.ad
.RS 20n
.rt
Indicate file-system-type-specific options that were given to the
.B share
command when the resource was shared.
.RE

.sp
.ne 2
.mk
.na
.I description
.ad
.RS 20n
.rt
Describe the shared resource provided by the system administrator when the
resource was shared.
.RE

.SH SEE ALSO
.sp
.LP
.BR share (1M)
