usr/src/man/man4/shells.4
'\" te
.\" Copyright (c) 2007 Sun Microsystems, Inc. All Rights Reserved.
.\" Portions Copyright (c) 1982-2007 AT&T Knowledge Ventures
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH shells 4 "20 Nov 2007" "SunOS 5.11" "File Formats"
.SH NAME
shells \- shell database
.SH SYNOPSIS
.LP
.nf
\fB/etc/shells\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B shells
file contains a list of the shells on the system.
Applications use this file to determine whether a shell is valid. See
.BR getusershell (3C).
For each shell a single line should be present,
consisting of the shell's path, relative to root.
.sp
.LP
A hash mark (\fB#\fR) indicates the beginning of a comment; subsequent
characters up to the end of the line are not interpreted by the routines
which search the file. Blank lines are also ignored.
.sp
.LP
The following default shells are used by utilities:
.BR /bin/bash ,
.BR /bin/csh ,
.BR /bin/jsh ,
.BR /bin/ksh ,
.BR /bin/ksh93 ,
\fB/bin/pfcsh\fR, \fB/bin/pfksh\fR,
.BR /bin/pfsh ,
.BR /bin/sh ,
.BR /bin/tcsh ,
.BR /bin/zsh ,
.BR /sbin/jsh ,
.BR /sbin/sh ,
.BR /usr/bin/bash ,
.BR /usr/bin/csh ,
.BR /usr/bin/jsh ,
.BR /usr/bin/ksh ,
.BR /usr/bin/ksh93 ,
.BR /usr/bin/pfcsh ,
.BR /usr/bin/pfksh ,
.BR /usr/bin/pfsh ,
and
.BR /usr/bin/sh ,
.BR /usr/bin/tcsh ,
.BR /usr/bin/zsh ,
and
.BR /usr/sfw/bin/zsh .
\fB/etc/shells\fR overrides the default list.
.sp
.LP
Invalid shells in
.B /etc/shells
could cause unexpected behavior, such
as being unable to log in by way of
.BR ftp (1).
.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/shells
.ad
.RS 15n
.rt
list of shells on system
.RE

.SH SEE ALSO
.sp
.LP
.BR vipw (1B),
\fBftpd\fR(1M), \fBsendmail\fR(1M), \fBgetusershell\fR(3C),
.BR aliases (4)
