usr/src/man/man4/shells.4
'\" te
.\" Copyright (c) 2007 Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" Portions Copyright (c) 1982-2007 AT&T Knowledge Ventures
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH shells 4 "20 Nov 2007" "SunOS 5.11" "File Formats"
.SH NAME
shells \- shell database
.SH SYNOPSIS
.LP
.nf
\fB/etc/shells\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B shells
file contains a list of the shells on the system.
Applications use this file to determine whether a shell is valid. See
.BR getusershell (3C).
For each shell a single line should be present,
consisting of the shell's path, relative to root.
.sp
.LP
A hash mark
.RB ( # )
indicates the beginning of a comment; subsequent
characters up to the end of the line are not interpreted by the routines
which search the file. Blank lines are also ignored.
.sp
.LP
The following default shells are used by utilities:
.BR /bin/bash ,
.BR /bin/csh ,
.BR /bin/jsh ,
.BR /bin/ksh ,
.BR /bin/ksh93 ,
.BR /bin/pfcsh ,
.BR /bin/pfksh ,
.BR /bin/pfsh ,
.BR /bin/sh ,
.BR /bin/tcsh ,
.BR /bin/zsh ,
.BR /sbin/jsh ,
.BR /sbin/sh ,
.BR /usr/bin/bash ,
.BR /usr/bin/csh ,
.BR /usr/bin/jsh ,
.BR /usr/bin/ksh ,
.BR /usr/bin/ksh93 ,
.BR /usr/bin/pfcsh ,
.BR /usr/bin/pfksh ,
.BR /usr/bin/pfsh ,
and
.BR /usr/bin/sh ,
.BR /usr/bin/tcsh ,
.BR /usr/bin/zsh ,
and
.BR /usr/sfw/bin/zsh .
.B /etc/shells
overrides the default list.
.sp
.LP
Invalid shells in
.B /etc/shells
could cause unexpected behavior, such
as being unable to log in by way of
.BR ftp (1).
.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/shells
.ad
.RS 15n
.rt
list of shells on system
.RE

.SH SEE ALSO
.sp
.LP
.BR vipw (1B),
.BR ftpd (1M),
.BR sendmail (1M),
.BR getusershell (3C),
.BR aliases (4)
