usr/src/man/man4/smbautohome.4
'\" te
.\" Copyright (c) 2009, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH smbautohome 4 "5 Jan 2009" "SunOS 5.11" "File Formats"
.SH NAME
smbautohome \- CIFS autohome configuration
.SH SYNOPSIS
.LP
.nf
\fBsmbautohome\fR
.fi

.SH DESCRIPTION
.sp
.LP
The Solaris CIFS service can automatically share home directories when a
CIFS client connects. The autohome map file,
.BR /etc/smbautohome ,
uses
the search options and rules to determine whether to share a home directory
when a CIFS client connects to the server.
.sp
.LP
For example, the following entries specify the autohome rules for a
particular environment:
.sp
.in +2
.nf
+nsswitch	    dn=ad,dn=sun,dn=com,ou=users
jane    /home/?/&    dn=ad,dn=sun,dn=com,ou=users
.fi
.in -2
.sp

.sp
.LP
The
.B nsswitch
autohome entry uses the naming service to match users to
home directories. The second autohome entry specifies that the home
directory for user
.B jane
is
.BR /home/j/jane .
.SS "autohome Map Entry Format"
.sp
.LP
A map entry, which is also referred to as a mapping, uses the following
format:
.sp
.in +2
.nf
\fIkey\fR \fIlocation\fR [ \fIoptions\fR ]
.fi
.in -2
.sp

.sp
.LP
.I key
is a user name,
.I location
is the fully qualified path for
the user's home directory, and
.I options
specifies the share options,
for example, an AD container or description. See \fBsharemgr\fR(1M) for
information on share options.
.sp
.LP
If you intend to publish the share in Active Directory (AD), you \fBmust\fR
specify an AD container name, which is specified as a comma-separated list
of attribute name-value pairs. The attributes use the LDAP distinguished
name (DN) or relative distinguished name (RDN) format.
.sp
.LP
The DN or RDN must be specified in LDAP format by using the following
attribute types:
.RS +4
.TP
.ie t \(bu
.el o
.B cn=
represents the common name
.RE
.RS +4
.TP
.ie t \(bu
.el o
.B ou=
represents the organizational unit
.RE
.RS +4
.TP
.ie t \(bu
.el o
.B dc=
represents the domain component
.RE
.sp
.LP
The attribute type that is used to describe an object's RDN is called a
.BR "naming attribute" .
AD uses the naming attributes as follows:
.RS +4
.TP
.ie t \(bu
.el o
.B cn
for the
.B user
object class
.RE
.RS +4
.TP
.ie t \(bu
.el o
.B ou
for the
.B OU
(organizational unit) object class
.RE
.RS +4
.TP
.ie t \(bu
.el o
.B dc
for the
.B domainDns
object class
.RE
.SS "autohome Map Key Substitution"
.sp
.LP
The autohome feature supports the following wildcard substitutions for the
value of the key field:
.RS +4
.TP
.ie t \(bu
.el o
The ampersand character (\fB&\fR) is expanded to the value of the key field
for the entry in which it occurs. In the following example,
.B &
expands
to
.BR jane :
.sp
.in +2
.nf
jane /home/&
.fi
.in -2

.RE
.RS +4
.TP
.ie t \(bu
.el o
The question mark character (\fB?\fR) is expanded to the value of the first
character in the key field for the entry in which it occurs. In the
following example,
.B ?
expands to
.BR j :
.sp
.in +2
.nf
jane /home/?/&
.fi
.in -2

.RE
.SS "Wildcard Rule"
.sp
.LP
When supplied in the key field, the asterisk character (\fB*\fR) is
recognized as the "catch-all" entry. Such an entry matches any key not
previously matched.
.sp
.LP
For example, the following entry would map any user to a home directory in
.B /home
in which the home directory name was the same as the user
name:
.sp
.in +2
.nf
*    /home/&
.fi
.in -2

.sp
.LP
The wildcard rule is
.B only
applied if an appropriate rule is not
matched by another map entry.
.SS "NSSwitch Map"
.sp
.LP
The
.B nsswitch
map is used to request that the home directory be
obtained from a password database, such as the local, NIS, NIS+, or LDAP
databases. If an AD path is appended, it is used to publish shares.
.sp
.in +2
.nf
+nsswitch
.fi
.in -2

.sp
.LP
Like the "catch-all" entry, the \fBnsswitch\fR map is \fBonly\fR searched
if an appropriate rule is not matched by another map entry.
.sp
.LP
The wildcard and
.B nsswitch
rules are mutually exclusive. Do not
include an
.B nsswitch
rule if a wildcard rule has already been
defined.
.SH FILES
.sp
.LP
.B /etc/smbautohome
.SH ATTRIBUTES
.sp
.LP
See the
.BR attributes (5)
man page for descriptions of the following
attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWsmbsu
_
Interface StabilityUncommitted
.TE

.SH SEE ALSO
.sp
.LP
.BR sharectl (1M),
.BR sharemgr (1M),
.BR smbadm (1M),
.BR smbd (1M),
.BR smbstat (1M),
.BR smb (4),
.BR attributes (5)
