usr/src/man/man4/smhba.conf.4
'\" te
.\" Copyright (c) 2009, Sun Microsystems, Inc. All Rights Reserved.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH smhba.conf 4 "28 Sep 2009" "SunOS 5.11" "File Formats"
.SH NAME
smhba.conf \- configuration file for the SMHBAAPI library
.SH DESCRIPTION
.sp
.LP
The \fB/etc/smhba.conf\fR file is used to specify the Vendor-Specific
Libraries that are installed on the system. This file is used by the Common
Library to load the individual VSLs when
.BR HBA_LoadLibrary "(3HBAAPI) is"
called. If changes are made to the file while the library is in use, the
library should be freed and reloaded. A version 1 VSL is compatible only
with a version 1 Common Library. A version 2 VSL is compatible with both a
version 1 and a version 2 Common Library.
.sp
.LP
Each VSL entry is a single line of the form:
.sp
.in +2
.nf
"name"	    "library path"
.fi
.in -2

.sp
.LP
where:
.sp
.ne 2
.mk
.na
.I name
.ad
.RS 16n
.rt
is the description of library. The library name should be prepended with
the domain of the manufacturer of the library.
.RE

.sp
.ne 2
.mk
.na
.I library path
.ad
.RS 16n
.rt
is the absolute path to the shared object library file.
.RE

.SH EXAMPLES
.LP
\fBExample 1\fR Contents of \fB/etc/smhba.conf\fR
.sp
.in +2
.nf
#
# This file contains names and references to SM-HBA libraries
#
# Format:
#
# <library name>  <library pathname>
#
# The library name should be prepended with the domain of
# the manufacturer or driver author.
com.sun.sashba        /usr/lib/libsun_sas.so.1
com.sun.sashba64      /usr/lib/64/libsun_sas.so.1
.fi
.in -2

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityCommitted
_
StandardT{
ANSI INCITS 428  Storage Management Host Bus Adapter Application Programming Ingerface(SM-HBA)
T}
.TE

.SH SEE ALSO
.sp
.LP
.BR HBA_LoadLibrary (3HBAAPI),
.BR libSMHBAAPI (3LIB),
.BR attributes (5)
.SH NOTES
.sp
.LP
The SMHBAAPI library is provided in both 32-and 64-bit versions, but only
one configuration file is specified. As a result, both 32- and 64-bit VSL
libraries must be specified within the same file. When using the 32-bit
Common Library, the 64-bit VSLs will fail to load. When using the 64-bit
Common Library, the 32-bit VSLs will fail to load. These failures are
silently ignored by the Common Library during normal usage, but can result
in warning messages when running client applications in a debugger.
