usr/src/man/man4/sndr.4
'\" te
.\" Copyright (C) 2007 Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH sndr 4 "08 Jun 2007" "SunOS 5.11" "File Formats"
.SH NAME
sndr \- SNDR parameter values
.SH SYNOPSIS
.LP
.nf
\fB/etc/default/sndr\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B sndr
file resides in
.B /etc/default
and provides startup
parameters for the
.BR sndrd "(1M) and"
.BR sndrsyncd (1M)
daemons.
.sp
.LP
The
.B sndr
file format is ASCII and comment lines begin with the
crosshatch (#)  character. Parameters consist of a keyword followed by an
equal (=) sign  followed by the parameter value of the form:
.sp
.in +2
.nf
keyword=value
.fi
.in -2

.sp
.LP
The following parameters are currently supported in the
.B sndr
file:
.sp
.ne 2
.mk
.na
.B SNDR_THREADS=num
.ad
.sp .6
.RS 4n
Sets the maximum number of connections allowed to the server over
connection-oriented transports.  By default, the number of connections is
16.
.RE

.sp
.ne 2
.mk
.na
.B SNDR_LISTEN_BACKLOG=num
.ad
.sp .6
.RS 4n
Sets connection queue length for the RDC TCP over a connection-oriented
transport. The default value is 10 entries.
.RE

.sp
.ne 2
.mk
.na
.B SNDR_TRANSPORT=string
.ad
.sp .6
.RS 4n
Sets the transport used for the RDC connection. If IPv6 is installed, the
default value is "\fB/dev/tcp\fR" or "\fB/dev/tcp6\fR."
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for a description of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Architecturex86
_
Availability SUNWrdcu
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
.BR sndrd (1M),
.BR sndrsyncd (1M)
