usr/src/man/man4/sndr.4
'\" te
.\" Copyright (C) 2007 Sun Microsystems, Inc. All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH sndr 4 "08 Jun 2007" "SunOS 5.11" "File Formats"
.SH NAME
sndr \- SNDR parameter values
.SH SYNOPSIS
.LP
.nf
\fB/etc/default/sndr\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B sndr
file resides in \fB/etc/default\fR and provides startup
parameters for the
.BR sndrd "(1M) and"
.BR sndrsyncd (1M)
daemons.
.sp
.LP
The
.B sndr
file format is ASCII and comment lines begin with the
crosshatch (#)  character. Parameters consist of a keyword followed by an
equal (=) sign  followed by the parameter value of the form:
.sp
.in +2
.nf
keyword=value
.fi
.in -2

.sp
.LP
The following parameters are currently supported in the
.B sndr
file:
.sp
.ne 2
.mk
.na
.B SNDR_THREADS=num
.ad
.sp .6
.RS 4n
Sets the maximum number of connections allowed to the server over
connection-oriented transports.  By default, the number of connections is
16.
.RE

.sp
.ne 2
.mk
.na
.B SNDR_LISTEN_BACKLOG=num
.ad
.sp .6
.RS 4n
Sets connection queue length for the RDC TCP over a connection-oriented
transport. The default value is 10 entries.
.RE

.sp
.ne 2
.mk
.na
.B SNDR_TRANSPORT=string
.ad
.sp .6
.RS 4n
Sets the transport used for the RDC connection. If IPv6 is installed, the
default value is "\fB/dev/tcp\fR" or "\fB/dev/tcp6\fR."
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for a description of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Architecturex86
_
Availability SUNWrdcu
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
.BR sndrd (1M),
.BR sndrsyncd (1M)
