usr/src/man/man4/sock2path.4
'\" te
.\" Copyright (c) 2008, Sun Microsystems, Inc.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH sock2path 4 "4 Nov 2008" "SunOS 5.11" "File Formats"
.SH NAME
sock2path \- socket mapping file that maps sockets to transport providers
.SH SYNOPSIS
.LP
.nf
\fB/etc/sock2path\fR
.fi

.SH DESCRIPTION
.sp
.LP
The socket mapping file,
.BR /etc/sock2path ,
is a system file that
contains the mappings between the
.BR socket "(3SOCKET) call parameters and"
the transport provider driver. Its format is described on the
.BR soconfig (1M)
manual page.
.sp
.LP
The
.BR init (1M)
utility uses the \fBsoconfig\fR utility with the
.B sock2path
file during the boot sequence.
.SH EXAMPLES
.LP
.B Example 1
An Example of the
.B sock2path
File
.sp
.LP
The following is an example of a
.B sock2path
file:

.sp
.in +2
.nf
# Family    Type    Protocol    Module | Path
     2       2         0          tcp
     2       2         6          tcp
     26      2         0          tcp
     26      2         6          tcp
     2       1         0          udp
     2       1        17          udp
    26       1         0          udp
    26       1        17          udp
     1       2         0          /dev/ticotsord
     1       6         0          /dev/ticotsord
     1       1         0          /dev/ticlts
     2       4         0          icmp
    26       4         0          icmp
    24       4         0          rts
    27       4         2          /dev/keysock
.fi
.in -2

.SH SEE ALSO
.sp
.LP
.BR init (1M),
.BR soconfig (1M),
.BR socket (3SOCKET)
