usr/src/man/man4/space.4
'\" te
.\" Copyright 1989 AT&T  Copyright (c) 1997, Sun Microsystems, Inc.  All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH space 4 "7 Feb 1997" "SunOS 5.11" "File Formats"
.SH NAME
space \- disk space requirement file
.SH DESCRIPTION
.sp
.LP
.B space
is an
.B ASCII
file that gives information about disk space
requirements for the target environment. The
.B space
file defines space
needed beyond what is used by objects defined in the
.BR prototype (4)
file; for example, files which will be installed with the \fBinstallf\fR(1M)
command. The
.B space
file should define the maximum amount of additional
space that a package will require.
.sp
.LP
The generic format of a line in this file is:
.sp
.LP
.I pathname  blocks  inodes
.sp
.LP
Definitions for the fields are as follows:
.sp
.ne 2
.mk
.na
.I pathname
.ad
.RS 12n
.rt
Specify a directory name which may or may not be the mount  point for a
filesystem. Names that do not begin with a slash  ('\fB/\fR') indicate
relocatable directories.
.RE

.sp
.ne 2
.mk
.na
.I blocks
.ad
.RS 12n
.rt
Define the number of disk blocks required for installation of the files and
directory entries contained in the pathname (using a 512-byte block size).
.RE

.sp
.ne 2
.mk
.na
.I inodes
.ad
.RS 12n
.rt
Define the number of inodes required for installation of the files and
directory entries contained in the pathname.
.RE

.SH EXAMPLES
.LP
.B Example 1
A sample file.
.sp
.in +2
.nf
# extra space required by config data which is
# dynamically loaded onto the system
data	500	1
.fi
.in -2
.sp

.SH SEE ALSO
.sp
.LP
.BR installf (1M),
.BR prototype (4)
.sp
.LP
\fIApplication Packaging Developer\&'s Guide\fR
