usr/src/man/man4/sulog.4
'\" te
.\" Copyright (c) 1994, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright 1989 AT&T
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH sulog 4 "6 Jun 1994" "SunOS 5.11" "File Formats"
.SH NAME
sulog \- su command log file
.SH SYNOPSIS
.LP
.nf
\fB/var/adm/sulog\fR
.fi

.SH DESCRIPTION
.sp
.LP
The 
.B sulog
file is a record of all attempts by users on the system
to execute the
.BR su "(1M) command.  Each time "
.BR su (1M)
is executed,
an entry is added to the
.B sulog
file.
.sp
.LP
Each entry in the
.B sulog
file is a single line of the form:
.sp
.in +2
.nf
\fBSU\fR \fBdate\fR \fBtime\fR
\fIresult port user\fB-\fInewuser\fR
.fi
.in -2
.sp

.sp
.LP
where
.sp
.ne 2
.mk
.na
.B date
.ad
.RS 11n
.rt
The month and date
.BR su "(1M) was executed. "
.B date
is displayed in
the form \fImm\fB/\fBdd\fR where  \fImm\fR is the month number and
\fBdd\fR is the day number in the month.
.RE

.sp
.ne 2
.mk
.na
.B time
.ad
.RS 11n
.rt
The time  \fBsu\fR(1M) was executed. \fBtime\fR is displayed in the form
\fIHH\fB/\fIMM\fR where  \fIHH\fR is the hour number (24 hour system)
and
.I MM
is the minute number.
.RE

.sp
.ne 2
.mk
.na
.I result
.ad
.RS 11n
.rt
The result of the 
.BR su "(1M) command.  A ` + ' sign is displayed in this"
field if the su attempt was successful; otherwise  a ` - ' sign is
displayed.
.RE

.sp
.ne 2
.mk
.na
.I port
.ad
.RS 11n
.rt
The name of the terminal device from which 
.BR su "(1M) was executed."
.RE

.sp
.ne 2
.mk
.na
.I user
.ad
.RS 11n
.rt
The user id of the user executing the 
.BR su "(1M) command."
.RE

.sp
.ne 2
.mk
.na
.I newuser
.ad
.RS 11n
.rt
The user id being switched to with 
.BR su (1M).
.RE

.SH EXAMPLES
.LP
\fBExample 1\fR A sample \fBsulog\fR file.
.sp
.LP
Here is a sample
.B sulog
file:

.sp
.in +2
.nf
SU 02/25 09:29 + console root-sys
SU 02/25 09:32 + pts/3 user1-root
SU 03/02 08:03 + pts/5 user1-root
SU 03/03 08:19 + pts/5 user1-root
SU 03/09 14:24 - pts/5 guest3-root
SU 03/09 14:24 - pts/5 guest3-root
SU 03/14 08:31 + pts/4 user1-root
.fi
.in -2
.sp

.SH FILES
.sp
.ne 2
.mk
.na
.B /var/adm/sulog
.ad
.RS 19n
.rt
su log file
.RE

.sp
.ne 2
.mk
.na
\fB/etc/default/su\fR
.ad
.RS 19n
.rt
contains the default location of 
.BR sulog
.RE

.SH SEE ALSO
.sp
.LP
.BR su (1M)
