usr/src/man/man4/sysbus.4
'\" te
.\" Copyright (c) 2004, Sun Microsystems, Inc.  All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH sysbus 4 "18 Nov 2004" "SunOS 5.11" "File Formats"
.SH NAME
sysbus, isa \- device tree properties for ISA bus device drivers
.SH DESCRIPTION
.sp
.LP
Solaris for x86 supports the
.B ISA
bus as the system bus. Drivers for
devices on this buse use the device tree built by the booting system to
retrieve the necessary system resources used by the driver. These resources
include device I/O port addresses, any interrupt capabilities  that the
device can have, any DMA channels it can require, and any memory-mapped
addresses it can occupy.
.sp
.LP
Configuration files for
.B ISA
device drivers are only necessary to
describe properties used by a particular driver that are not part of the
standard properties found in the device tree. See
.BR driver.conf (4)
for
further details of configuration file syntax.
.sp
.LP
The
.B ISA
nexus drivers all belong to class
.BR sysbus .
All bus
drivers of class
.B sysbus
recognize the following properties:
.sp
.ne 2
.mk
.na
.B interrupts
.ad
.RS 16n
.rt
An arbitrary-length array where each element of the array represents a
hardware interrupt (IRQ) that is used by the device.  In general, this array
only has one entry unless a particular device uses more than one IRQ.
.sp
Solaris defaults all
.B ISA
interrupts to IPL 5.  This interrupt
priority can be overridden by placing an
.B interrupt-priorities
property
in a .conf file for the driver. Each entry in the array of integers for the
.B interrupt-priorities
property is matched one-to-one with the elements
in the
.B interrupts
property to specify the
.B IPL
value that is used
by the system for this interrupt in this driver. This is the priority that
this device's interrupt handler receives relative to the interrupt handlers
of other drivers.  The priority is an integer from
.B 1
to
.BR 16 .
Generally, disks are assigned a priority of
.BR 5 ,
while mice and printers
are lower, and serial communication devices are higher, typically
.BR 7 .
.B 10
is reserved by the system and must not be used.  Priorities
.B 11
and greater are high level priorities and are generally not
recommended (see
.BR ddi_intr_hilevel (9F)).
.sp
The driver can refer to the elements of this array by index using
.BR ddi_add_intr (9F).
The index into the array is passed as the
.I inumber
argument of
.BR ddi_add_intr() .
.sp
Only devices that generate interrupts have an
.B interrupts
property.
.RE

.sp
.ne 2
.mk
.na
.B reg
.ad
.RS 16n
.rt
An arbitrary-length array where each element of the array consists of a
3-tuple of integers.  Each array element describes a contiguous memory
address range associated with the device on the bus.
.sp
The first integer of the tuple specifies the memory type,
.B 0
specifies
a memory range and
.B 1
specifies an I/O range. The second integer
specifies the base address of the memory range. The third integer of each
3-tuple specifies  the size, in bytes, of the mappable region.
.sp
The driver can refer to the elements of this array by index, and construct
kernel mappings to these addresses using
.BR ddi_map_regs "(9F). The index"
into the array is passed as the
.I rnumber
argument of
.BR ddi_map_regs() .
.sp
All
.B sysbus
devices have
.B reg
properties.  The first tuple of
this property  is used to construct the address part of the device name
under
.BR /devices .
In the case of
.B "Plug and Play ISA"
devices, the
first tuple is a special tuple that does not denote a memory range, but is
used by the system only to create the address part of the device name.  This
special tuple can be recognized by determining if the top bit of the first
integer is set to a one.
.sp
The order of the tuples in the reg property is determined by the boot
system probe code and depends on the characteristics of each particular
device. However, the reg property maintains the same order of entries from
system boot to system boot.  The recommended way to determine the reg
property for a particular device is to use the
.BR prtconf (1M)
command
after installing the particular device.  The output of the
.B prtconf
command can be examined to determine the reg property for any installed
device.
.sp
You can use the
.B ddi_get*
and
.B ddi_put*
family of functions to
access register space from a high-level interrupt context.
.RE

.sp
.ne 2
.mk
.na
.B dma-channels
.ad
.RS 16n
.rt
A list of integers that specifies the DMA channels used by this device.
Only devices that use DMA channels have a
.B dma-channels
property.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Architecturex86
.TE

.SH SEE ALSO
.sp
.LP
.BR prtconf (1M),
.BR driver.conf (4),
.BR scsi (4),
.BR attributes (5),
.BR ddi_add_intr (9F),
.BR ddi_intr_hilevel (9F),
.BR ddi_map_regs (9F),
.BR ddi_prop_op (9F)
.sp
.LP
.I Writing Device Drivers
