usr/src/man/man4/syslog.conf.4
'\" te
.\" Copyright (c) 2003 Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" Copyright (c) 1983 Regents of the University of California.
.\" All rights reserved. The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.TH syslog.conf 4 "26 Apr 2006" "SunOS 5.11" "File Formats"
.SH NAME
syslog.conf \- configuration file for syslogd system log daemon
.SH SYNOPSIS
.LP
.nf
\fB/etc/syslog.conf\fR
.fi

.SH DESCRIPTION
.sp
.LP
The file
.B /etc/syslog.conf
contains information used by the system log
daemon, \fBsyslogd\fR(1M), to forward a system message to appropriate log
files and/or users.
.B syslogd
preprocesses this file through
.BR m4 (1)
to obtain the correct information for certain log files, defining
\fBLOGHOST\fR if the address of "loghost" is the same as one of the
addresses of the host that is running
.BR syslogd .
.sp
.LP
A configuration entry is composed of two TAB-separated fields:
.sp
.in +2
.nf
\fIselector		action\fR
.fi
.in -2

.sp
.LP
The
.I selector
field contains a semicolon-separated list of priority
specifications of the form:
.sp
.in +2
.nf
\fIfacility\fB\&.\fIlevel\fR [ \fB;\fR \fIfacility\fB\&.\fIlevel\fR ]
.fi
.in -2

.sp
.LP
where
.I facility
is a system facility, or comma-separated list of
facilities, and
.I level
is an indication of the severity of the
condition being logged. Recognized values for
.I facility
include:
.sp
.ne 2
.mk
.na
.B user
.ad
.RS 12n
.rt
Messages generated by user processes. This is the default priority for
messages from programs or facilities not listed in this file.
.RE

.sp
.ne 2
.mk
.na
.B kern
.ad
.RS 12n
.rt
Messages generated by the kernel.
.RE

.sp
.ne 2
.mk
.na
.B mail
.ad
.RS 12n
.rt
The mail system.
.RE

.sp
.ne 2
.mk
.na
.B daemon
.ad
.RS 12n
.rt
System daemons, such as \fBin.ftpd\fR(1M)
.RE

.sp
.ne 2
.mk
.na
.B auth
.ad
.RS 12n
.rt
The authorization system:
.BR login (1),
.BR su (1M),
.BR getty (1M),
among others.
.RE

.sp
.ne 2
.mk
.na
.B lpr
.ad
.RS 12n
.rt
The line printer spooling system:
.BR lpr (1B),
.BR lpc (1B),
among
others.
.RE

.sp
.ne 2
.mk
.na
.B news
.ad
.RS 12n
.rt
Designated for the USENET network news system.
.RE

.sp
.ne 2
.mk
.na
.B uucp
.ad
.RS 12n
.rt
Designated for the UUCP system; it does not currently use the \fBsyslog\fR
mechanism.
.RE

.sp
.ne 2
.mk
.na
.B cron
.ad
.RS 12n
.rt
Designated for \fBcron\fR/\fBat\fR messages generated by systems that do
logging through
.BR syslog .
The current version of the Solaris Operating
Environment does not use this facility for logging.
.RE

.sp
.ne 2
.mk
.na
.B audit
.ad
.RS 12n
.rt
Designated for audit messages generated by systems that audit by means of
syslog.
.RE

.sp
.ne 2
.mk
.na
.B local0-7
.ad
.RS 12n
.rt
Designated for local use.
.RE

.sp
.ne 2
.mk
.na
.B mark
.ad
.RS 12n
.rt
For timestamp messages produced internally by
.BR syslogd .
.RE

.sp
.ne 2
.mk
.na
.B *
.ad
.RS 12n
.rt
An asterisk indicates all facilities except for the
.B mark
facility.
.RE

.sp
.LP
Recognized values for
.I level
are (in descending order of severity):
.sp
.ne 2
.mk
.na
.B emerg
.ad
.RS 11n
.rt
For panic conditions that would normally be broadcast to all users.
.RE

.sp
.ne 2
.mk
.na
.B alert
.ad
.RS 11n
.rt
For conditions that should be corrected immediately, such as a corrupted
system database.
.RE

.sp
.ne 2
.mk
.na
.B crit
.ad
.RS 11n
.rt
For warnings about critical conditions, such as hard device errors.
.RE

.sp
.ne 2
.mk
.na
.B err
.ad
.RS 11n
.rt
For other errors.
.RE

.sp
.ne 2
.mk
.na
.B warning
.ad
.RS 11n
.rt
For warning messages.
.RE

.sp
.ne 2
.mk
.na
.B notice
.ad
.RS 11n
.rt
For conditions that are not error conditions, but may require special
handling. A configuration entry with a
.I level
value of
.BR notice
must appear on a separate line.
.RE

.sp
.ne 2
.mk
.na
.B info
.ad
.RS 11n
.rt
Informational messages.
.RE

.sp
.ne 2
.mk
.na
.B debug
.ad
.RS 11n
.rt
For messages that are normally used only when debugging a program.
.RE

.sp
.ne 2
.mk
.na
.B none
.ad
.RS 11n
.rt
Do not send messages from the indicated
.I facility
to the selected
file. For example, a
.I selector
of
.sp
.B *.debug;mail.none
.sp
sends all messages
.I except
mail messages to the selected file.
.RE

.sp
.LP
For a given
.I facility
and
.IR level ,
.B syslogd
matches all
messages for that level and all higher levels. For example, an entry that
specifies a level of
.B crit
also logs messages at the
.B alert
and
.B emerg
levels.
.sp
.LP
The
.I action
field indicates where to forward the message. Values for
this field can have one of four forms:
.RS +4
.TP
.ie t \(bu
.el o
A filename, beginning with a leading slash, which indicates that messages
specified by the
.I selector
are to be written to the specified file. The
file is opened in append mode if it exists. If the file does not exist,
logging silently fails for this action.
.RE
.RS +4
.TP
.ie t \(bu
.el o
The name of a remote host, prefixed with an
.BR @ ,
as with:
\fB@\fIserver\fR, which indicates that messages specified by the
.I selector
are to be forwarded to the
.B syslogd
on the named host.
The hostname "loghost" is treated, in the default \fBsyslog.conf\fR, as the
hostname given to the machine that logs
.B syslogd
messages. Every
machine is "loghost" by default, per the hosts database. It is also possible
to specify one machine on a network to be "loghost" by, literally, naming
the machine "loghost". If the local machine is designated to be "loghost",
then
.B syslogd
messages are written to the appropriate files. Otherwise,
they are sent to the machine "loghost" on the network.
.RE
.RS +4
.TP
.ie t \(bu
.el o
A comma-separated list of usernames, which indicates that messages
specified by the
.I selector
are to be written to the named users if they
are logged in.
.RE
.RS +4
.TP
.ie t \(bu
.el o
An asterisk, which indicates that messages specified by the \fIselector\fR
are to be written to all logged-in users.
.RE
.sp
.LP
Blank lines are ignored. Lines for which the first nonwhite character is a
\&'\fB#\fR' are treated as comments.
.SH EXAMPLES
.LP
.B Example 1
A Sample Configuration File
.sp
.LP
With the following configuration file:

.sp

.sp
.TS
tab();
lw(2.75i) lw(2.75i)
lw(2.75i) lw(2.75i)
.
\fB*.notice\fR\fB/var/log/notice\fR
\fBmail.info\fR\fB/var/log/notice\fR
\fB*.crit\fR\fB/var/log/critical\fR
\fBkern,mark.debug\fR\fB/dev/console\fR
\fBkern.err\fR\fB@server\fR
\fB*.emerg\fR\fB*\fR
\fB*.alert\fR\fBroot,operator\fR
\fB*.alert;auth.warning\fR\fB/var/log/auth\fR
.TE

.sp
.LP
.BR syslogd (1M)
logs all mail system messages except
.B debug
messages
and all
.B notice
(or higher) messages into a file named
.BR /var/log/notice .
It logs all critical messages into
.BR /var/log/critical ,
and all kernel messages and 20-minute marks onto
the system console.

.sp
.LP
Kernel messages of
.B err
(error) severity or higher are forwarded to
the machine named
.BR server .
Emergency messages are forwarded to all
users. The users
.B root
and
.B operator
are informed of any
.B alert
messages. All messages from the authorization system of
.B warning
level or higher are logged in the file
.BR /var/log/auth .

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityStable
.TE

.SH SEE ALSO
.sp
.LP
.BR at (1),
.BR crontab (1),
.BR logger (1),
.BR login (1),
.BR lp (1),
.BR lpc (1B),
.BR lpr (1B),
.BR m4 (1),
.BR cron (1M),
.BR getty (1M),
.BR in.ftpd (1M),
.BR su (1M),
.BR syslogd (1M),
.BR syslog (3C),
.BR hosts (4),
.BR attributes (5)
