usr/src/man/man4/system.4
'\" te
.\" Copyright (c) 2003 Sun Microsystems, Inc.  All Rights Reserved.
.\" Copyright 1989 AT&T
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH system 4 "3 Nov 2004" "SunOS 5.11" "File Formats"
.SH NAME
system \- system configuration information file
.SH DESCRIPTION
.sp
.LP
The
.B system
file is used for customizing the operation of the
operating system kernel. The recommended procedure is to preserve the
original
.B system
file before modifying it.
.sp
.LP
The
.B system
file contains commands which are read by the kernel during
initialization and used to customize the operation of your system. These
commands are useful for modifying the system's treatment of its loadable
kernel modules.
.sp
.LP
The syntax of the
.B system
file consists of a list of keyword/value
pairs which are recognized by the system as valid commands. Comment lines
must begin with an asterisk (\fB*\fR) or a hash mark (\fB#\fR) and end with
a newline character. All commands are case-insensitive except where noted.
.sp
.LP
Commands that modify the system's operation with respect to loadable kernel
modules require you to specify the module type by listing the module's
namespace. The following namespaces are currently supported on all
platforms:
.sp
.ne 2
.mk
.na
.B drv
.ad
.RS 10n
.rt
Modules in this namespace are device drivers.
.RE

.sp
.ne 2
.mk
.na
.B exec
.ad
.RS 10n
.rt
Modules in this namespace are execution format modules. The following
.B exec
modules are currently provided:
.sp
.ne 2
.mk
.na
.B Only on SPARC system:
.ad
.RS 28n
.rt
.sp
.in +2
.nf
aoutexec
.fi
.in -2
.sp

.RE

.sp
.ne 2
.mk
.na
.B Only on x86 system:
.ad
.RS 28n
.rt
.sp
.in +2
.nf
coffexec
.fi
.in -2
.sp

.RE

.sp
.ne 2
.mk
.na
.B On SPARC and IA systems:
.ad
.RS 28n
.rt
.sp
.in +2
.nf
elfexec
intpexec
javaexec
.fi
.in -2
.sp

.RE

.RE

.sp
.ne 2
.mk
.na
.B fs
.ad
.RS 10n
.rt
These modules are filesystems.
.RE

.sp
.ne 2
.mk
.na
.B sched
.ad
.RS 10n
.rt
These modules implement a process scheduling algorithm.
.RE

.sp
.ne 2
.mk
.na
.B strmod
.ad
.RS 10n
.rt
These modules are
.B STREAMS
modules.
.RE

.sp
.ne 2
.mk
.na
.B sys
.ad
.RS 10n
.rt
These modules implement loadable system-call modules.
.RE

.sp
.ne 2
.mk
.na
.B misc
.ad
.RS 10n
.rt
These modules do not fit into any of the above categories, so are
considered "miscellaneous" modules.
.RE

.sp
.LP
SPARC only:
.sp
.ne 2
.mk
.na
.B dacf
.ad
.RS 8n
.rt
These modules provide rules and actions for device auto-configuration.
.RE

.sp
.ne 2
.mk
.na
.B tod
.ad
.RS 8n
.rt
These modules provide support for the time of day hardware.
.RE

.sp
.ne 2
.mk
.na
.B cpu
.ad
.RS 8n
.rt
These modules provide \fBCPU\fR-specific kernel routines.
.RE

.sp
.LP
A description of each of the supported commands follows:
.sp
.ne 2
.mk
.na
\fBexclude:\fR <\fInamespace\fR>/<\fImodulename\fR>\fR
.ad
.sp .6
.RS 4n
.RB "Do not allow the listed loadable kernel module to be loaded." " exclude"
commands are cumulative; the list of modules to
.B exclude
is created by
combining every
.B exclude
entry in the
.B system
file.
.RE

.sp
.ne 2
.mk
.na
\fBinclude:\fR <\fInamespace\fR>/<\fImodulename\fR>\fR
.ad
.sp .6
.RS 4n
Include the listed loadable kernel module. This is the system's default, so
using
.B include
does not modify the system's operation. \fBinclude\fR
commands are cumulative.
.RE

.sp
.ne 2
.mk
.na
\fBforceload:\fR <\fInamespace\fR>/<\fImodulename\fR>\fR
.ad
.sp .6
.RS 4n
Force this kernel module to be loaded during kernel initialization. The
default action is to automatically load the kernel module when its services
are first accessed.
.B forceload
commands are cumulative.
.RE

.sp
.ne 2
.mk
.na
.B rootdev:
<\fIdevice name\fR>\fR
.ad
.sp .6
.RS 4n
Set the root device to the listed value instead of using the default root
device as supplied by the boot program.
.RE

.sp
.ne 2
.mk
.na
.B rootfs:
<\fIroot filesystem type\fR>\fR
.ad
.sp .6
.RS 4n
Set the root filesystem type to the listed value.
.RE

.sp
.ne 2
.mk
.na
.B moddir:
<\fIfirst module path\fR>[[{:, }<\fIsecond
\&.\|.\|.\fR>].\|.\|.]\fR
.ad
.sp .6
.RS 4n
Set the search path for loadable kernel modules. This command operates very
much like the
.B PATH
shell variable. Multiple directories to search can
be listed together, delimited either by blank spaces or colons.
.RE

.sp
.ne 2
.mk
.na
\fBset\fR [\fI<module>\fR:]\fI<symbol>\fR {=, |, &}
[~][-]\fI<value>\fR
.ad
.sp .6
.RS 4n
Set an integer or character pointer in the kernel or in the selected kernel
module to a new value. This command is used to change kernel and module
parameters and thus modify the operation of your system. Assignment
operations are not cumulative, whereas bitwise
.B AND
and
.BR OR
operations are cumulative.
.sp
Operations that are supported for modifying integer variables are: simple
assignment, inclusive bitwise
.B OR,
bitwise
.B AND,
one's complement,
and negation. Variables in a specific loadable module can be targeted for
modification by specifying the variable name prefixed with the kernel module
name and a colon (:) separator. Values can be specified as hexadecimal
(0x10), Octal (046), or Decimal (5).
.sp
The only operation supported for modifying character pointers is simple
assignment. Static string data such as character arrays cannot be modified
using the
.B set
command. Use care and ensure that the variable you are
modifying is in fact a character pointer. The
.B set
command is very
powerful, and will likely cause problems if used carelessly. The following
escape sequences are supported within the quoted string:
.sp
.in +2
.nf
\en 	(newline)
\et 	(tab)
\eb 	(backspace)
.fi
.in -2
.sp

.RE

.SH EXAMPLES
.LP
.B Example 1
A sample
.B system
file.
.sp
.LP
The following is a sample
.B system
file.

.sp
.in +2
.nf
* Force the ELF exec kernel module to be loaded during kernel
* initialization. Execution type modules are in the exec namespace.
forceload: exec/elfexec
* Change the root device to /sbus@1,f8000000/esp@0,800000/sd@3,0:a.
* You can derive root device names from /devices.
* Root device names must be the fully expanded Open Boot Prom
* device name. This command is platform and configuration specific.
* This example uses the first partition (a) of the SCSI disk at
* SCSI target 3 on the esp host adapter in slot 0 (on board)
* of the SBus of the machine.
* Adapter unit-address 3,0 at sbus unit-address 0,800000.
rootdev: /sbus@1,f8000000/esp@0,800000/sd@3,0:a
* Set the filesystem type of the root to ufs. Note that
* the equal sign can be used instead of the colon.
rootfs:ufs
* Set the search path for kernel modules to look first in
* /usr/phil/mod_test for modules, then in /kernel/modules (the
* default) if not found. Useful for testing new modules.
* Note that you can delimit your module pathnames using
* colons instead of spaces: moddir:/newmodules:/kernel/modules
moddir:/usr/phil/mod_test /kernel/modules.
* Set the configuration option {_POSIX_CHOWN_RESTRICTED} :
* This configuration option is enabled by default.
set rstchown = 1
* Disable the configuration option {_POSIX_CHOWN_RESTRICTED} :
set rstchown = 0
* Turn on debugging messages in the modules mydriver. This is useful
* during driver development.
set mydriver:debug = 1
* Bitwise AND the kernel variable "moddebug" with the
* one's complement of the hex value 0x880, and set
* "moddebug" to this new value.
set moddebug & ~0x880
* Demonstrate the cumulative effect of the SET
* bitwise AND/OR operations by further modifying "moddebug"
* by ORing it with 0x40.
set moddebug | 0x40
.fi
.in -2
.sp

.SH SEE ALSO
.sp
.LP
.BR boot (1M),
.BR init (1M),
.BR kernel (1M)
.SH WARNINGS
.sp
.LP
Use care when modifying the
.B system
file; it modifies the operation of
the kernel. If you preserved the original
.B system
file, you can boot
using
.BR "boot -a" ,
which will ask you to specify the path to the saved
file. This should allow the system to boot correctly. If you cannot locate a
.B system
file that will work, you may specify
.BR /dev/null .
This acts
as an empty
.B system
file, and the system will attempt to boot using its
default settings.
.SH NOTES
.sp
.LP
The
.B /etc/system
file is read only once, at boot time.
