usr/src/man/man4/TIMEZONE.4
'\" te
.\" Copyright (c) 2003, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" Copyright 1989 AT&T
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH TIMEZONE 4 "26 Jun 2003" "SunOS 5.11" "File Formats"
.SH NAME
TIMEZONE \- set default system time zone and locale
.SH SYNOPSIS
.LP
.nf
\fB/etc/TIMEZONE\fR
\fB/etc/default/init\fR
.fi

.SH DESCRIPTION
.sp
.LP
This file sets the time zone environment variable
.BR TZ ,
and the
locale-related environment variables
.BR LANG ,
.BR LC_COLLATE ,
.BR LC_CTYPE ,
.BR LC_MESSAGES ,
.BR LC_MONETARY ,
.BR LC_NUMERIC ,
and
.BR LC_TIME .
.sp
.LP
.B /etc/TIMEZONE
is a symbolic link to
.BR /etc/default/init .
.sp
.LP
The number of environment variables that can be set from
.B /etc/default/init
is limited to 20.
.sp
.LP
The format of the file is:
.sp
.in +2
.nf
\fIVAR\fB=\fIvalue\fR
.fi
.in -2
.sp

.sp
.LP
where
.I VAR
is a timezone environment variable and
.I value
is the
value assigned to the variable.
.I value
can be enclosed in double quotes
(") or single quotes (\&'). The double or single quotes cannot be part of
the value.
.SH SEE ALSO
.sp
.LP
.BR init (1M),
.BR rtc (1M),
.BR ctime (3C),
.BR environ (5)
.SH NOTES
.sp
.LP
When changing the
.B TZ
setting on x86 systems, you must make a
corresponding change to the
.B /etc/rtc_config
file to account for the
new timezone setting. This can be accomplished by executing the following
commands, followed by a reboot, to make the changes take effect:
.sp
.in +2
.nf
# rtc \fB-z\fR \fIzone-name\fR
# rtc \fB-c\fR

.fi
.in -2
.sp

.sp
.LP
where
.I zone-name
is the same name as the
.B TZ
variable setting.
.sp
.LP
See
.BR rtc (1M)
for information on the
.B rtc
command.
