usr/src/man/man4/TrustedExtensionsPolicy.4
'\" te
.\" Copyright (c) 2007, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH TrustedExtensionsPolicy 4 "20 Jul 2007" "SunOS 5.11" "File Formats"
.SH NAME
TrustedExtensionsPolicy \- configuration file for Trusted Extensions X
Server Extension
.SH SYNOPSIS
.LP
.nf
\fB/usr/X11/lib/X11/xserver/TrustedExtensionsPolicy\fR
.fi

.LP
.nf
\fB/usr/openwin/server/etc/TrustedExtensionsPolicy\fR
.fi

.SH DESCRIPTION
.sp
.LP
.B TrustedExtensionsPolicy
is the configuration file for Trusted
Extensions X Server Extension
.RB ( SUN_TSOL ).
.B SUN_TSOL
provides
security policy enforcement. This enforcement is based on Mandatory Access
Control (MAC) and Discretionary Access Control (DAC).
.sp
.LP
Blank lines and comments in the
.B TrustedExtensionsPolicy
file are
ignored. Comments start with a pound sign (#). The format of the file is as
follows:
.sp
.in +2
.nf
\fIkeyword\fR{space|tab}\fIvalue\fR
.fi
.in -2
.sp

.sp
.LP
where
.I keyword
can be one of the following:
.sp
.ne 2
.mk
.na
.B atom
.ad
.RS 13n
.rt
Label this atom
.BR ADMIN_LOW ,
so that
.BR XGetAtomName (3X11)
succeeds.
.RE

.sp
.ne 2
.mk
.na
.B property
.ad
.RS 13n
.rt
Instantiate this property once. The default is to polyinstantiate a
property.
.RE

.sp
.ne 2
.mk
.na
.B selection
.ad
.RS 13n
.rt
Polyinstantiate this selection. The default is to instantiate the selection
once.
.RE

.sp
.ne 2
.mk
.na
.B extension
.ad
.RS 13n
.rt
Disable this extension.
.RE

.sp
.ne 2
.mk
.na
.B privilege
.ad
.RS 13n
.rt
Implicitly allow this window privilege on all clients.
.RE

.sp
.LP
For possible keyword values, see the
.B /usr/X11/lib/X11/xserver/TrustedExtensionsPolicy
file for the Xorg X
server. For Xsun, see the
.B /usr/openwin/server/etc/TrustedExtensionsPolicy
file.
.SH EXAMPLES
.sp
.LP
The following entry in the
.B TrustedExtensionsPolicy
file
polyinstantiates the
.B Dtpad
program:
.sp
.in +2
.nf
selection Dtpad
.fi
.in -2
.sp

.sp
.LP
If the entry is missing, or commented out, the
.B Dtpad
program is
instantiated once.
.sp
.LP
Similarly, the following entry instantiates the
.B WM_ICON_SIZE
property
once:
.sp
.in +2
.nf
property WM_ICON_SIZE
.fi
.in -2
.sp

.sp
.LP
If the entry is missing, or commented out, the
.B WM_ICON_SIZE
property
is polyinstantiated.
.SH FILES
.sp
.ne 2
.mk
.na
.B /usr/X11/lib/X11/xserver/TrustedExtensionsPolicy
.ad
.sp .6
.RS 4n
Configuration file for Trusted Extensions X Server Extension
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.03i) |cw(3.47i)
lw(2.03i) |lw(3.47i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWxwts
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
.BR XGetAtomName (3X11),
.BR attributes (5)
.SH NOTES
.sp
.LP
The functionality described on this manual page is available only if the
system is configured with Trusted Extensions.
