usr/src/man/man4/updaters.4
'\" te
.\" Copyright 1989 AT&T  Copyright (c) 1988 Sun Microsystems, Inc. - All Rights Reserved.  All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH updaters 4 "24 Oct 1996" "SunOS 5.11" "File Formats"
.SH NAME
updaters \- configuration file for NIS updating
.SH SYNOPSIS
.LP
.nf
\fB/var/yp/updaters\fR
.fi

.SH DESCRIPTION
.sp
.LP
The file
.B /var/yp/updaters
is a makefile (see
.BR make (1S))
which is
used for updating the Network Information Service (NIS) databases. Databases
can only be updated in a secure network, that is, one that has a
.BR publickey (4)
database. Each entry in the file is a make target for a
particular
.B NIS
database. For example, if there is an \fBNIS\fR
database named
.B passwd.byname
that can be updated, there should be a
.B make
target named
.B passwd.byname
in the
.B updaters
file with
the command to update the file.
.sp
.LP
The information necessary to make the update is passed to the update
command through standard input. The information passed is described below
(all items are followed by a
.B NEWLINE
except for 4 and 6):
.sp
.ne 2
.mk
.na
.B 1.
.ad
.RS 6n
.rt
Network name of client wishing to make the update (a string).
.RE

.sp
.ne 2
.mk
.na
.B 2.
.ad
.RS 6n
.rt
Kind of update (an integer).
.RE

.sp
.ne 2
.mk
.na
.B 3.
.ad
.RS 6n
.rt
Number of bytes in key (an integer).
.RE

.sp
.ne 2
.mk
.na
.B 4.
.ad
.RS 6n
.rt
Actual bytes of key.
.RE

.sp
.ne 2
.mk
.na
.B 5.
.ad
.RS 6n
.rt
Number of bytes in data (an integer).
.RE

.sp
.ne 2
.mk
.na
.B 6.
.ad
.RS 6n
.rt
Actual bytes of data.
.RE

.sp
.LP
After receiving this information through standard input, the command  to
update the particular database determines whether the user is allowed to
make the change.  If not, it exits with the status
.B YPERR_ACCESS.
If
the user is allowed to make the change, the command makes the  change and
exits with a status of zero. If there are any errors that may prevent the
.B updaters
from making the change, it should exit with the status that
matches a valid
.B NIS
error code described in
.BR <rpcsvc/ypclnt.h> \&.
.SH FILES
.sp
.ne 2
.mk
.na
.B /var/yp/updaters
.ad
.RS 20n
.rt
The makefile used for updating the
.B NIS
databases.
.RE

.SH SEE ALSO
.sp
.LP
.BR make (1S),
.BR rpc.ypupdated (1M),
.BR publickey (4)
.SH NOTES
.sp
.LP
The Network Information Service (NIS) was formerly known as Sun Yellow
Pages (YP).  The functionality of the two remains the same; only the name
has changed. The name Yellow Pages is a registered trademark in the United
Kingdom of British Telecommunications plc, and may not be used without
permission.
