usr/src/man/man4/utmpx.4
'\" te
.\" Copyright (c) 2008, Sun Microsystems, Inc.  All Rights Reserved
.\" Copyright 1989 AT&T
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH utmpx 4 "6 Mar 2008" "SunOS 5.11" "File Formats"
.SH NAME
utmpx, wtmpx \- utmpx and wtmpx database entry formats
.SH SYNOPSIS
.LP
.nf
\fB#include <utmpx.h>\fR
\fB/var/adm/utmpx\fR
\fB/var/adm/wtmpx\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B utmpx
and
.B wtmpx
files are extended database files that have
superseded the obsolete
.B utmp
and
.B wtmp
database files.
.sp
.LP
The
.B utmpx
database contains user access and accounting information
for commands such as
.BR who (1),
.BR write (1),
and
.BR login (1).
The
\fBwtmpx\fR database contains the history of user access and accounting
information for the 
.B utmpx
database.
.SH USAGE
.sp
.LP
Applications should not access these databases directly, but should use the
functions described on the
.BR getutxent "(3C) manual page to interact with"
the
.B utmpx
and
.B wtmpx
databases to ensure that they are maintained
consistently.
.SH FILES
.sp
.ne 2
.mk
.na
.B /var/adm/utmpx
.ad
.RS 18n
.rt
user access and adminstration information
.RE

.sp
.ne 2
.mk
.na
.B /var/adm/wtmpx
.ad
.RS 18n
.rt
history of user access and adminstrative information
.RE

.SH SEE ALSO
.sp
.LP
.BR getutxent (3C),
.BR wait (3C),
.BR wait.h (3HEAD)
