usr/src/man/man4/utmp.4
'\" te
.\" Copyright 1989 AT&T  Copyright (c) 1998, Sun Microsystems, Inc.  All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH utmp 4 "22 Feb 1999" "SunOS 5.11" "File Formats"
.SH NAME
utmp, wtmp \- utmp and wtmp database entry formats
.SH SYNOPSIS
.LP
.nf
\fB#include <utmp.h>\fR
\fB/var/adm/utmp\fR
\fB/var/adm/wtmp\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B utmp
and
.B wtmp
database files are obsolete and are no longer
present on the system.  They have been superseded by the extended database
contained in the
.B utmpx
and
.B wtmpx
database files.  See
.BR utmpx (4).
.sp
.LP
It is possible for
.B /var/adm/utmp
to reappear on the system. This
would most likely occur if a third party application that still uses
.B utmp
recreates the file if it finds it missing. This file should not
be allowed to remain on the system. The user should investigate to determine
which application is recreating this file.
.SH SEE ALSO
.sp
.LP
.BR utmpx (4)
