usr/src/man/man4/volume-request.4
'\" te
.\" Copyright (c) 2003, Sun Microsystems, Inc. All Rights Reserved.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH volume-request 4 "27 Apr 2005" "SunOS 5.11" "File Formats"
.SH NAME
volume-request, volume-defaults \- Solaris Volume Manager configuration
information for top down volume creation with metassist
.SH SYNOPSIS
.LP
.nf
\fB/usr/share/lib/xml/dtd/volume-request.dtd\fR
.fi

.LP
.nf
\fB/usr/share/lib/xml/dtd/volume-defaults.dtd\fR
.fi

.LP
.nf
\fB/etc/defaults/metassist.xml\fR
.fi

.SH DESCRIPTION
.sp
.LP
A volume request file, XML-based and compliant with the
\fBvolume-request.dtd\fR Document Type Definition, describes the
characteristics of the volumes that
.B metassist
should produce.
.sp
.LP
A system administrator would use the volume request file instead of
providing options at the command line to give more specific instructions
about the characteristics of the volumes to create. A volume request file
can request more than one volume, but all requested volumes must reside in
the same disk set.
.sp
.LP
If you start
.B metassist
by providing a volume-request file as input,
\fBmetassist\fR can implement the configuration specified in the file, can
generate a command file that sets up the configuraiton for you to inspect or
edit, or can generate a volume configuration file for you to inspect or
edit.
.sp
.LP
As a system administrator, you would want to create a volume request file
if you need to reuse configurations (and do not want to reenter the same
command arguments), or if you prefer to use a configuration file to specify
volume characteristics.
.sp
.LP
Volume request files must be valid XML that complies with the document type
definition in the volume-request.dtd file, located at
.BR /usr/share/lib/xml/dtd/volume-request.dtd .
You create a volume request
file, and provide it as input to metassist to create volumes from the top
down.
.SS "Defining Volume Request"
.sp
.LP
The top level element
.B <volume-request>
surrounds the volume request
data. This element has no attributes. A volume request requires at least one
<diskset> element, which must be the first element after
.BR <volume-request> \&.
.sp
.LP
Optionally, the
.B <volume-request>
element can include one or more
\fB<available>\fR and \fB<unavailable>\fR elements to specify which
controllers or disks associated with a specific controller can or cannot be
used to create the volume.
.sp
.LP
Optionally, the
.B <volume-request>
element can include a
.BR <hsp>
element to specify characteristics of a hot spare pool if fault recovery is
used.
.sp
.LP
If not specified for a volume with fault-recovery, the first hot spare pool
found in the disk set is used. If no hot spare pool exists but one is
required, a hot spare pool is created.
.sp
.LP
Optionally, the volume-request can include one or more
.BR <concat> ,
.BR <stripe> ,
.BR <mirror> ,
\fB<volume>\fR elements to specify volumes
to create.
.SS "Defining Disk Set"
.sp
.LP
Within the
.B <volume-request>
element, a
.B <diskset>
element must
exist. The
.B <diskset>
element, with the name attribute, specifies the
name of the disk set to be used. If this disk set does not exist, it is
created. This element and the name attribute are required.
.SS "Defining Availability"
.sp
.LP
Within the
.B <volume-request>
element and within other elements, you
can specify available or unavailable components (disks, or disks on a
specific controller path) for use or exclusion from use in a volume or hot
spare pool.
.sp
.LP
The
.B <available>
and
.B <unavailable>
elements require a name
attribute which specifies either a full
.B ctd
name, or a partial
\fBctd\fR name that is used with the implied wildcard to complete the
expression. For example, specifying
.BR c3t2d 0
as available would look
like:
.sp
.in +2
.nf
<available name="/dev/dsk/c3t2d0">
.fi
.in -2

.sp
.LP
The
.B <available>
element also makes any unnamed components
unavailable. Specifying all controllers exept
.B c1
unavailable would
look like:
.sp
.in +2
.nf
<available name="c1">
.fi
.in -2

.sp
.LP
Specifying all disks on controller 2 as unavailable would look like:
.sp
.in +2
.nf
<unavailable name="c2">
.fi
.in -2

.sp
.LP
The
.B <unavailable>
element can also be used to further restrict the
list of available components. For example, specifying all controllers exept
\fBc1\fR unavailable, and making all devices associated with c1t2
unavailable as well would look like this:
.sp
.in +2
.nf
<available name="c1">
<unavailable name="c1t2">
.fi
.in -2

.sp
.LP
Components specified as available must be either part of the named disk set
used for this volume creation, or must be unused and not in any disk set. If
the components are selected for use, but are not in the specified diskset,
the
.B metassist
command automatically adds them to the diskset.
.sp
.LP
It is unnecessary to specify components that are in other disk sets as
unavailable.
.B metassist
automatically excludes them from consideration.
However, unused components or components that are not obviously used (for
example, an unmounted slice that is reserved for different uses) must be
explicitly specified as unavailable, or the
.B metassist
command can
include them in the configuration.
.SS "Defining Hot Spare Pool"
.sp
.LP
The next element within the <volume-request> element, after the
\fB<diskset>\fR and, optionally, \fB<available>\fR and \fB<unavailable>\fR
elements, is the
.B <hsp>
element. Its sole attribute specifies the name
of the hot spare pool:
.sp
.in +2
.nf
<hsp name="hsp001">
.fi
.in -2

.sp
.LP
The hot spare pool names must start with
.B hsp
and conclude with a
number, thus following the existing Solaris Volume Manager hot spare pool
naming requirements.
.sp
.LP
Within the
.B <hsp>
element, you can specify one or more
\fB<available>\fR and \fB<unavailable>\fR elements to specify which disks,
or disks associated with a specific controller can or cannot be used to
create the hot spares within the pool.
.sp
.LP
Also within the
.B <hsp>
element, you can use the
.B <slice>
element
to specify hot spares to be included in the hot spare pool (see \fBDEFINING
SLICE\fR). Depending on the requirements placed on the hot spare pool by
other parts of the volume request, additional slices can be added to the hot
spare pool.
.SS "Defining Slice"
.sp
.LP
The
.B <slice>
element is used to define slices to include or exclude
within other elements. It requires only a name attribute to specify the ctd
name of the slice, and the context of the
.B <slice>
element determines
the function of the element. Sample slice elements might look like:
.sp
.in +2
.nf
<slice name="c0t1d0s2" />
<slice name="c0t12938567201lkj29561sllkj381d0s2" />
.fi
.in -2

.SS "Defining Stripe"
.sp
.LP
The
.B <stripe>
element defines stripes (interlaced RAID 0 volumes) to
be used in a volume. It can contain either slice elements (to explicitly
determine which slices are used), or appropriate combinations of available
and unavailable elements if the specific determination of slices is to be
left to the metassist command.
.sp
.LP
The
.B <stripe>
element takes an optional name attribute to specify a
name. If the name is not specified, an available name is automatically
selected from available Solaris Volume Manager names. If possible, names for
related components are related.
.sp
.LP
The
.B <stripe>
element takes an optional size attribute that specifies
the size as value and units (for example, 10TB, 5GB). If slices for the
\fB<stripe>\fR are explicitly specified, the size attribute is ignored. The
\fB<available>\fR and \fB<unavailable>\fR elements can be used to constrain
slices for use in a stripe.
.sp
.LP
The
.B <stripe>
elements takes optional
.B mincomp
and
.BR maxcomp
attributes to specify both the minimum and maximum number of components that
can be included in it. As with size, if slices for the
.B <stripe>
are
explicitly specified, the
.B mincomp
and
.B maxcomp
attributes are
ignored.
.sp
.LP
The
.B <stripe>
elements takes an optional interlace attribute as value
and units (for example,
.BR "16KB, 5BLOCKS, 20KB" ).
If this value is not
specified, the Solaris Volume Manager default value is used.
.sp
.LP
The
.B <stripe>
element takes an optional usehsp attribute to specify if
a hot spare pool should be associated with this component. This attribute is
specified as a boolean value, as \fBusehsp="TRUE"\fR. If the component is
not a submirror, this attribute is ignored.
.SS "Defining Concat"
.sp
.LP
The
.B <concat>
element defines concats (non-interlaced RAID 0 volumes)
to be used in a configuration. It is specified in the same way as a
\fB<stripe>\fR element, except that the
.BR mincomp ,
.BR maxcomp ,
and
interlace attributes are not valid.
.SS "Defining Mirror"
.sp
.LP
The
.B <mirror>
element defines mirrors (RAID 1 volumes) to be used in a
volume configuration. It can contain combinations of
.B <concat>
and
\fB<stripe>\fR elements (to explicitly determine which volumes are used as
submirrors). Alternatively, it can have a size attribute specified, along
with the appropriate combinations of available and unavailable elements to
leave the specific determination of components to the
.BR metassist
command.
.sp
.LP
The
.B <mirror>
element takes an optional name attribute to specify a
name. If the name is not specified, an available name is automatically
selected.
.sp
.LP
The
.B <mirror>
element takes an optional size attribute that specifies
the size as value and units (for example, 10TB, 5GB). If
.B <stripe>
and
\fB<concat>\fR elements for the mirror are not specified, this attribute is
required. Otherwise, it is ignored.
.sp
.LP
The
.B <mirror>
element takes an optional nsubmirrors attribute to
define the number of submirrors (1-4) to include. Like the size attribute,
this attribute is ignored if the underlying
.B <concat>
and
\fB<stripe\fR> submirrors are explicitly specified. The \fB<mirror>\fR
element takes an optional read attribute to define the mirror read options
(\fBROUNDROBIN\fR,
.BR GEOMETRIC ,
or
.BR FIRST )
for the mirror. If this
attribute is not specified, the Solaris Volume Manager default value is
used.
.sp
.LP
The
.B <mirror>
element takes an optional write attribute to define the
mirror write options (\fBPARALLEL\fR,
.BR SERIAL ,
or
.BR FIRST )
for the
mirror. If this attribute is not specified, the Solaris Volume Manager
default value is used.
.sp
.LP
The
.B <mirror>
element takes an optional usehsp attribute to specify if
a hot spare pool should be associated with each submirror. This attribute is
specified as a boolean value, as \fBusehsp="TRUE"\fR. If the \fBusehsp\fR
attribute is specified in the configuration of the
.B <stripe>
or
\fB<concat>\fR element used as a submirror, it overrides the value of
\fBusehsp\fR attributes for the mirror as a whole.
.SS "Defining Volume by Quality of Service"
.sp
.LP
The
.B <volume>
element defines volumes (high-level) by the quality of
service they should provide. (The
.B <volume>
element offers the same
functionality that options on the metassist command line can provide.)
.sp
.LP
The
.B <volume>
element can contain combinations of
.BR <available>
and
.B <unavailable>
elements to determine which components can be
included in the configuration.
.sp
.LP
The
.B <volume>
element takes an optional name attribute to specify a
name. If the name is not specified, an available name is automatically
selected.
.sp
.LP
The
.B <volume>
element takes a required size attribute that specifies
the size as value and units (for example, 10TB, 5GB).
.sp
.LP
The
.B <volume>
element takes an optional redundancy attribute to define
the number of additional copies of data (1-4) to include. In a worst-case
scenario, a volume can suffer failure of \fIn\fB-1\fR components without
data loss, where \fBredundancy=\fIn\fR. With fault recovery options, the
volume could withstand up to \fIn\fB+hsps-1\fR non-concurrent failures
without data loss. Specifying
.B redundancy=0
results in a RAID 0 volume
being created (a stripe, specifically).
.sp
.LP
The
.B <volume>
element takes an optional faultrecovery attribute to
determine if additional components should be allocated to recover from
component failures in the volume. This is used to determine whether the
volume is associated with a hot spare pool. The faultrecovery attribute is a
boolean attribute, with a default value of
.BR FALSE .
.sp
.LP
The
.B <volume>
element takes an optional datapaths attribute to
determine if multiple data paths should be required to access the volume.
The datapaths attribute should be set to a numeric value.
.SS "Defining Default Values Globally"
.sp
.LP
Global defaults can be set in
.BR /etc/default/metassist.xml .
This
volume-defaults file can contain most of the same elements as a
volume-request file, but differs structurally from a volume-request file:
.RS +4
.TP
.ie t \(bu
.el o
The container element must be
.BR <volume-defaults> ,
not
.BR <volume-request> \&.
.RE
.RS +4
.TP
.ie t \(bu
.el o
The \fB<volume-defaults>\fR element can contain
.BR <available> ,
.BR <unavailable> ,
.BR <hsp> ,
.BR <concat> ,
.BR <stripe> ,
.BR <mirror> ,
or
.B <volume>
elements.
.sp
Attributes specified by these elements define global default values, unless
overridden by the corresponding attributes and elements in a volume-request.
None of these elements is a container element.
.RE
.RS +4
.TP
.ie t \(bu
.el o
The \fB<volume-defaults>\fR element can contain one or more \fB<diskset>\fR
elements to provide disk set-specific defaults. The
.B <diskset>
element
can contain
.BR <available> ,
.BR <unavailable> ,
.BR <hsp> ,
.BR <concat> ,
.BR <stripe> ,
.BR <mirror> ,
or
.BR <volume>
elements.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Settings specified outside of a
.B <diskset>
element apply to all disk
sets, but can be overridden within each
.B <diskset>
element.
.RE
.SH EXAMPLES
.LP
\fBExample 1\fR Creating a Redundant Volume
.sp
.LP
The following example shows a volume request file used to create a
redundant and fault tolerant volume of 1TB.

.sp
.in +2
.nf
<volume-request>
  <diskset name="sparestorage"/>
  <volume size="1TB" redundancy="2" faultrecovery="TRUE">
    <available name="c2" />
    <available name="c3" />
    <unavailable name="c2t2d0" />
  </volume>
</volume-request>
.fi
.in -2

.LP
\fBExample 2\fR Creating a Complex Configuration
.sp
.LP
The following example shows a sample volume-request file that specifies a
disk set name, and specifically itemizes characteristics of components to
create.

.sp
.in +2
.nf
<volume-request>

    <!-- Specify the disk set to use -->
    <diskset name="mailspool"/>

    <!-- Generally available devices -->
    <available name="c0"/>

    <!-- Create a 3-way mirror with redundant datapaths and HSPs /
          via QoS -->
    <volume size="10GB" redundancy="3" datapaths="2" /
          faultrecovery="TRUE"/>

    <!-- Create a 1-way mirror with a HSP via QoS -->
    <volume size="10GB" faultrecovery="TRUE"/>

    <!-- Create a stripe via QoS -->
    <volume size="100GB"/>

</volume-request>
.fi
.in -2

.SH BOUNDARY VALUES
.sp
.in +2
.nf
Attribute       Minimum         Maximum
mincomp         1               N/A
maxcomp         N/A             32
nsubmirrors     1               4
passnum         0               9
datapaths       1               4
redundancy      0               4
.fi
.in -2
.sp

.SH FILES
.sp
.ne 2
.mk
.na
.B /usr/share/lib/xml/dtd/volume-request.dtd
.ad
.sp .6
.RS 4n

.RE

.sp
.ne 2
.mk
.na
\fB/usr/share/lib/xml/dtd/volume-defaults.dtd\fR
.ad
.sp .6
.RS 4n

.RE

.sp
.ne 2
.mk
.na
\fB/etc/defaults/metassist.xml\fR
.ad
.sp .6
.RS 4n

.RE

.SH SEE ALSO
.sp
.LP
.BR metassist (1M),
.BR metaclear (1M),
.BR metadb (1M),
.BR metadetach (1M),
.BR metahs (1M),
.BR metainit (1M),
.BR metaoffline (1M),
.BR metaonline (1M),
.BR metaparam (1M),
.BR metarecover (1M),
.BR metareplace (1M),
.BR metaroot (1M),
.BR metaset (1M),
.BR metasync (1M),
.BR metattach (1M),
\fBmount_ufs\fR(1M), \fBmddb.cf\fR(4)
.sp
.LP
.I Solaris Volume Manager Administration Guide
