usr/src/man/man4/volume-config.4
'\" te
.\" Copyright (c) 2003, Sun Microsystems, Inc. All Rights Reserved.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH volume-config 4 "8 Aug 2003" "SunOS 5.11" "File Formats"
.SH NAME
volume-config \- Solaris Volume Manager volume configuration information
for top down volume creation with metassist
.SH SYNOPSIS
.LP
.nf
\fB/usr/share/lib/xml/dtd/volume-config.dtd\fR
.fi

.SH DESCRIPTION
.sp
.LP
A volume configuration file, XML-based and compliant with the
\fBvolume-config.dtd\fR Document Type Definition, describes the detailed
configuration of the volume or volumes to be created, including the names,
sizes and configurations of all the components used in the volume or
volumes. This configuration file can be automatically generated by running
\fBmetassist\fR with the \fB-d\fR option, or can be manually created.
.sp
.LP
The volume configuration file can then be used to either generate a command
file or to directly create volumes by running
.B metassist
and specifying
the volume configuration file as input to the command.
.sp
.LP
As a system administrator, you would want to change, manually create, or
edit the volume configuration file only if there are small details of the
configuration that you want to change. For example, you might want to change
names for volumes or hot spare pools, mirror read option, or stripe
interlace values.
.sp
.LP
It would be possible to also select different devices or change slice sizes
or make similar changes, but that is generally not recommended. Substantial
changes to the volume-config file could result in a poor or non-functional
configuration.
.sp
.LP
With a \fBvolume-config\fR file, you can run
.B metassist
and provide
the file as input to the command to generate either a command file or to
actually set up the configuration.
.SS "Defining Volume Configuration"
.sp
.LP
The top level element \fB<volume-config>\fR surrounds the volume
configuration data. This element has no attributes. A volume configuration
requires exactly one
.B <diskset>
element, which must be the first
element of the volume configuration. Additionally, the \fBvolume-config\fR
can have zero or more of the following elements:
.BR <disk> ,
.BR <slice> ,
.BR <hsp> ,
.BR <concat> ,
.BR <stripe> ,
.B <mirror>
as required to define the configuration of the volume to be created.
.SS "Defining Disk Set"
.sp
.LP
Within the \fB<volume-config>\fR element, a
.B <diskset>
element must
exist. The
.B <diskset>
element, with the name attribute, specifies the
name of the diskset in which to create the volume or volumes. This element
and attribute are required. If this named disk set does not exist, it is
created upon implementation of this volume configuration.
.SS "Defining Slice"
.sp
.LP
The volume configuration format provides for a <slice> element that defines
the name of a slice to use as a component of a volume. The \fB<slice>\fR
element requires a name attribute which specifies a full ctd name. If the
\fB<slice>\fR is newly created as part of the volume configuration, the
\fBstartsector\fR and \fBsizeinblocks\fR attributes must be specified. If
the slice was previously existing, these attributes need not be specified.
.SS "Defining Hot Spare Pool"
.sp
.LP
The volume configuration format provides for a
.BR <hsp >
element that
defines the name of a hot spare pool to use as a component of a
configuration. The
.B <hsp>
element requires a name attribute which
specifies a hot spare pool name.
.sp
.LP
Slices defined by
.B <slice>
elements contained in the
.BR <hsp>
element are included in the hot spare pool when metassist creates it."
.SS "Defining Stripe"
.sp
.LP
The
.B <stripe>
element defines stripes (interlaced RAID 0 volumes) to
be used in a volume. The
.B <stripe>
element takes a required name
attribute to specify a name conforming to Solaris Volume Manager naming
requirements. If the name specifies an existing stripe, no \fB<slice>\fR
elements are required. If the name specifies a new stripe, the \fB<slice>\fR
elements to construct the slice must be specified within the
.BR <stripe>
element. The
.B <stripe>
elements takes an optional interlace attribute
as value and units (for example, 16KB, 5BLOCKS, 20MB). If this value isn't
specified, the Solaris Volume Manager default value is used.
.SS "Defining Concat"
.sp
.LP
The
.B <concat>
element defines concats (non-interlaced RAID 0 volumes)
to be used in a configuration. It is the same as a
.B <stripe>
element,
except that the interlace attribute is not valid.
.SS "Defining Mirror"
.sp
.LP
The
.B <mirror>
element defines mirrors (RAID 1 volumes) to be used in a
volume configuration. It can contain combinations of
.B <concat>
and
\fB<stripe>\fR elements (to explicitly determine which volumes are used as
submirrors).
.sp
.LP
The
.B <mirror>
element takes a required name attribute to specify a
name conforming to Solaris Volume Manager naming requirements.
.sp
.LP
The
.B <mirror>
element takes an optional read attribute to define the
mirror read options (\fBROUNDROBIN\fR,
.BR GEOMETRIC ,
or
.BR FIRST )
for
the mirrors. If this attribute is not specified, the Solaris Volume Manager
default value is used.
.sp
.LP
The
.B <mirror>
element takes an optional write attribute to define the
mirror write options (\fBPARALLEL\fR,
.BR SERIAL ,
or
.BR FIRST )
for the
mirrors. If this attribute is not specified, the Solaris Volume Manager
default value is used. The
.B <mirror>
element takes an optional
\fBpassnum\fR attribute (\fB0\fR-\fB9\fR) to define the mirror passnum that
defines the order in which mirrors are resynced at boot, if required.
Smaller numbers are resynced first. If this attribute is not specified, the
Solaris Volume Manager default value is used.
.SH EXAMPLES
.LP
\fBExample 1\fR Specifying a Volume Configuration
.sp
.LP
The following is an example volume configuration:

.sp
.in +2
.nf
<!-- Example configuration -->
<volume-config>
  <!-- Specify the existing disk set to use -->
  <diskset name="redundant"/>

<!-- Create slices -->
<slice name="/dev/dsk/c0t0d1s7" startsector="1444464" \e
     sizeinblocks="205632BLOCKS"/>
<slice name="/dev/dsk/c0t0d1s6" startsector="1239840" \e
     sizeinblocks="102816KB"/>

<!-- Create a  concat -->
<concat name="d12">
<slice name="/dev/dsk/c0t0d0s7"/>
<slice name="/dev/dsk/c0t0d0s6"/>
<slice name="/dev/dsk/c0t0d1s7"/>
<slice name="/dev/dsk/c0t0d1s6"/>

<!-- Create (and use) a HSP -->
hsp name="hsp0">
<slice name="/dev/dsk/c0t0d4s0"/>
<slice name="/dev/dsk/c0t0d4s1"/>
<slice name="/dev/dsk/c0t0d4s3"/>
<slice name="/dev/dsk/c0t0d4s4"/>
</hsp>

</concat>

<!-- Create a stripe -->
<stripe name="d15" interlace="32KB">
<slice name="/dev/dsk/c0t0d0s7"/>
<slice name="/dev/dsk/c0t0d1s7"/>

<!-- Use a previously-defined HSP -->
<hsp name="hsp0"/>
</stripe>

<!-- Create a  mirror -->
<mirror name="d10">

<!-- Submirror 1: An existing stripe -->
<stripe name="d11"/>

<!-- Submirror 2: The concat defined above -->
<concat name="d12"/>

<!-- Submirror 3: A stripe defined here -->
<stripe name="d13">
<slice name="/dev/dsk/c0t0d2s6"/>
<slice name="/dev/dsk/c0t0d2s7"/>
<slice name="/dev/dsk/c0t0d3s6"/>
slice name="/dev/dsk/c0t0d3s7"/>
</stripe>

</mirror>

</volume-config>
.fi
.in -2

.SH FILES
.sp
.ne 2
.mk
.na
\fB/usr/share/lib/xml/dtd/volume-config.dtd\fR
.ad
.sp .6
.RS 4n

.RE

.SH SEE ALSO
.sp
.LP
.BR metassist (1M),
.BR metaclear (1M),
.BR metadb (1M),
.BR metadetach (1M),
.BR metahs (1M),
.BR metainit (1M),
.BR metaoffline (1M),
.BR metaonline (1M),
.BR metaparam (1M),
.BR metarecover (1M),
.BR metareplace (1M),
.BR metaroot (1M),
.BR metaset (1M),
.BR metasync (1M),
.BR metattach (1M),
\fBmount_ufs\fR(1M), \fBmddb.cf\fR(4)
.sp
.LP
.I Solaris Volume Manager Administration Guide
