usr/src/man/man4/warn.conf.4
'\" te
.\" Copyright 1987, 1989 by the Student Information Processing Board of the
.\" Massachusetts Institute of Technology. For copying and distribution
.\" information, please see the file kerberosv5/mit-sipb-copyright.h.
.\" Portions Copyright (c) 2004, Sun Microsystems, Inc.  All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH warn.conf 4 "30 Mar 2005" "SunOS 5.11" "File Formats"
.SH NAME
warn.conf \- Kerberos warning configuration file
.SH SYNOPSIS
.LP
.nf
/etc/krb5/warn.conf
.fi

.SH DESCRIPTION
.sp
.LP
The
.B warn.conf
file contains configuration information specifying how
users will be warned by the
.B ktkt_warnd
daemon about ticket expiration.
In addition, this file can be used to auto-renew the user's Ticket-Granting
Ticket (TGT) instead of warning the user. Credential expiration warnings and
auto-renew results are sent, by means of syslog, to
.BR auth.notice .
.sp
.LP
Each Kerberos client host must have a
.B warn.conf
file in order for
users on that host to get Kerberos warnings from the client. Entries in the
.B warn.conf
file must have the following format:
.sp
.in +2
.nf
\fIprincipal\fR [renew[:\fIopt1\fR,.\|.\|.\fIoptN\fR]] syslog|terminal \fItime\fR
.fi
.in -2

.sp
.LP
or:
.sp
.in +2
.nf
\fIprincipal\fR [renew[:\fIopt1\fR,.\|.\|.\fIoptN\fR]] mail \fItime\fR [\fIemail address\fR]
.fi
.in -2

.sp
.ne 2
.mk
.na
.I principal
.ad
.RS 17n
.rt
Specifies the principal name to be warned. The asterisk (\fB*\fR) wildcard
can be used to specify groups of principals.
.RE

.sp
.ne 2
.mk
.na
.B renew
.ad
.RS 17n
.rt
Automatically renew the credentials (TGT) until renewable lifetime expires.
This is equivalent to the user running
.BR "kinit -R" .
.sp
The renew options include:
.sp
.ne 2
.mk
.na
.B log-success
.ad
.RS 15n
.rt
Log the result of the renew attempt on success using the specified method
(\fBsyslog\fR|\fBterminal\fR|\fBmail\fR).
.RE

.sp
.ne 2
.mk
.na
.B log-failure
.ad
.RS 15n
.rt
Log the result of the renew attempt on failure using the specified method
(\fBsyslog\fR|\fBterminal\fR|\fBmail\fR). Some renew failure conditions are:
TGT renewable lifetime has expired, the KDCs are unavailable, or the cred
cache file has been removed.
.RE

.sp
.ne 2
.mk
.na
.B log
.ad
.RS 15n
.rt
Same as specifing both
.B log-success
and
.BR log-failure .
.RE

.LP
Note -
.sp
.RS 2
If no log options are given, no logging is done.
.RE
.RE

.sp
.ne 2
.mk
.na
.B syslog
.ad
.RS 17n
.rt
Sends the warnings to the system's syslog. Depending on the
.B /etc/syslog.conf
file, syslog entries are written to the
.B /var/adm/messages
file and/or displayed on the terminal.
.RE

.sp
.ne 2
.mk
.na
.B terminal
.ad
.RS 17n
.rt
Sends the warnings to display on the terminal.
.RE

.sp
.ne 2
.mk
.na
.B mail
.ad
.RS 17n
.rt
Sends the warnings as email to the address specified by
.IR email_address .
.RE

.sp
.ne 2
.mk
.na
.I time
.ad
.RS 17n
.rt
Specifies how much time before the
.B TGT
expires when a warning should
be sent. The default time value is seconds, but you can specify \fBh\fR
(hours) and
.B m
(minutes) after the number to specify other time
values.
.RE

.sp
.ne 2
.mk
.na
.I email_address
.ad
.RS 17n
.rt
Specifies the email address at which to send the warnings. This field must
be specified only with the
.B mail
field.
.RE

.SH EXAMPLES
.LP
.B Example 1
Specifying Warnings
.sp
.LP
The following
.B warn.conf
entry

.sp
.in +2
.nf
\fB* syslog 5m\fR
.fi
.in -2
.sp

.sp
.LP
specifies that warnings will be sent to the syslog five minutes before the
expiration of the
.B TGT
for all principals. The form of the message
is:

.sp
.in +2
.nf
jdb@ACME.COM: your kerberos credentials expire in 5 minutes
.fi
.in -2
.sp

.LP
.B Example 2
Specifying Renewal
.sp
.LP
The following
.B warn.conf
entry:

.sp
.in +2
.nf
* renew:log terminal 30m
.fi
.in -2

.sp
.LP
\&.\|.\|.specifies that renew results will be sent to the user's terminal 30
minutes before the expiration of the TGT for all principals. The form of the
message (on renew success) is:

.sp
.in +2
.nf
myname@ACME.COM: your kerberos credentials have been renewed
.fi
.in -2

.SH FILES
.sp
.ne 2
.mk
.na
.B /usr/lib/krb5/ktkt_warnd
.ad
.RS 28n
.rt
Kerberos warning daemon
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityEvolving
.TE

.SH SEE ALSO
.sp
.LP
.BR kinit (1),
.BR kdestroy (1),
.BR ktkt_warnd (1M),
.BR syslog.conf (4),
.BR utmpx (4),
.BR attributes (5),
.BR kerberos (5),
.BR pam_krb5 (5)
.SH NOTES
.sp
.LP
The auto-renew of the TGT is attempted only if the user is logged-in, as
determined by examining
.BR utmpx (4).
