usr/src/man/man4/xferlog.4
'\" te
.\" Copyright (C) 2003, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH xferlog 4 "25 Apr 2003" "SunOS 5.11" "File Formats"
.SH NAME
xferlog \- FTP Server transfer log file
.SH SYNOPSIS
.LP
.nf
\fB/var/log/xferlog\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B xferlog
file contains transfer logging information from the FTP
Server,
.BR in.ftpd (1M).
You can use the logfile capability to change the
location of the log file. See
.BR ftpaccess (4).
.sp
.LP
By default, each server entry is composed of a single line of the following
form. All fields are separated by spaces.
.sp
.in +2
.nf
\fIcurrent-time\fR  \fItransfer-time \fR   \fIremote-host\fR  \fIbytes-transferred\fR  \e
        \fIfilename\fR
\fItransfer-type\fR  \fIspecial-action-flag\fR  \fIdirection\fR \fIaccess-mode\fR  \fIusername\fR
\fIservice-name\fR  \fIauthentication-method\fR  \fIauthenticated-user-id\fR \e
         \fIcompletion-status\fR
.fi
.in -2

.sp
.LP
The
.B xferlog
format capability can be used to customize the transfer
log file format used. In addition to those in the default format, it also
supports
.BR chroot-filename ,
.BR file-size ,
and
.B restart-offset
fields. See
.BR ftpaccess (4).
.sp
.LP
The fields are defined as follows:
.sp
.ne 2
.mk
.na
.I current-time
.ad
.RS 25n
.rt
The current local time in the form
.BR "DDD MMM dd hh:mm:ss YYYY" ,
where:
.sp
.ne 2
.mk
.na
.B DDD
.ad
.RS 8n
.rt
Is the day of the week
.RE

.sp
.ne 2
.mk
.na
.B MMM
.ad
.RS 8n
.rt
Is the month
.RE

.sp
.ne 2
.mk
.na
.B dd
.ad
.RS 8n
.rt
Is the day of the month
.RE

.sp
.ne 2
.mk
.na
.B hh
.ad
.RS 8n
.rt
Is the hour
.RE

.sp
.ne 2
.mk
.na
.B mm
.ad
.RS 8n
.rt
Is the minutes
.RE

.sp
.ne 2
.mk
.na
.B ss
.ad
.RS 8n
.rt
Is the seconds
.RE

.sp
.ne 2
.mk
.na
.B YYYY
.ad
.RS 8n
.rt
Is the year
.RE

.RE

.sp
.ne 2
.mk
.na
.I transfer-time
.ad
.RS 25n
.rt
The total time in seconds for the transfer
.RE

.sp
.ne 2
.mk
.na
.I remote-host
.ad
.RS 25n
.rt
The remote host name
.RE

.sp
.ne 2
.mk
.na
.I bytes-transferred
.ad
.RS 25n
.rt
The number of bytes transferred
.RE

.sp
.ne 2
.mk
.na
.I filename
.ad
.RS 25n
.rt
The absolute pathname of the transferred file
.RE

.sp
.ne 2
.mk
.na
.I transfer-type
.ad
.RS 25n
.rt
A single character indicating the type of transfer:
.sp
.ne 2
.mk
.na
.B a
.ad
.RS 5n
.rt
Indicates an ascii transfer
.RE

.sp
.ne 2
.mk
.na
.B b
.ad
.RS 5n
.rt
Indicates a binary transfer
.RE

.RE

.sp
.ne 2
.mk
.na
.I special-action-flag
.ad
.RS 25n
.rt
One or more single character flags that indicate any special action taken.
The
.I special-action-flag
can have one of more of the following
values:
.sp
.ne 2
.mk
.na
.B C
.ad
.RS 16n
.rt
File was compressed
.RE

.sp
.ne 2
.mk
.na
.B U
.ad
.RS 16n
.rt
File was uncompressed
.RE

.sp
.ne 2
.mk
.na
.B T
.ad
.RS 16n
.rt
File was archived, for example, by using
.BR tar (1)
.RE

.sp
.ne 2
.mk
.na
.B _ (underbar)
.ad
.RS 16n
.rt
No action was taken.
.RE

.RE

.sp
.ne 2
.mk
.na
.I direction
.ad
.RS 25n
.rt
The direction of the transfer.
.I direction
can have one of the
following values:
.sp
.ne 2
.mk
.na
.B o
.ad
.RS 5n
.rt
Outgoing
.RE

.sp
.ne 2
.mk
.na
.B i
.ad
.RS 5n
.rt
Incoming
.RE

.RE

.sp
.ne 2
.mk
.na
.I access-mode
.ad
.RS 25n
.rt
The method by which the user is logged in.
.I access-mode
can have one
of the following values:
.sp
.ne 2
.mk
.na
.B a
.ad
.RS 5n
.rt
For an anonymous user.
.RE

.sp
.ne 2
.mk
.na
.B g
.ad
.RS 5n
.rt
For a passworded guest user. See the description of the
.B guestgroup
capability in
.BR ftpaccess (4).
.RE

.sp
.ne 2
.mk
.na
.B r
.ad
.RS 5n
.rt
For a real, locally authenticated user
.RE

.RE

.sp
.ne 2
.mk
.na
.I username
.ad
.RS 25n
.rt
The local username, or if anonymous, the ID string given
.RE

.sp
.ne 2
.mk
.na
.I service-name
.ad
.RS 25n
.rt
The name of the service invoked, usually
.B ftp
.RE

.sp
.ne 2
.mk
.na
.I authentication-method
.ad
.RS 25n
.rt
The method of authentication used.
.I authentication-method
can have one
of the following values:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 5n
.rt
None
.RE

.sp
.ne 2
.mk
.na
.B 1
.ad
.RS 5n
.rt
.I RFC 931
authentication
.RE

.RE

.sp
.ne 2
.mk
.na
.I authenticated-user-id
.ad
.RS 25n
.rt
The user ID returned by the authentication method. A
.B *
is used if an
authenticated user ID is not available.
.RE

.sp
.ne 2
.mk
.na
.I completion-status
.ad
.RS 25n
.rt
A single character indicating the status of the transfer.
.I completion-status
can have one of the following values:
.sp
.ne 2
.mk
.na
.B c
.ad
.RS 5n
.rt
Indicates complete transfer
.RE

.sp
.ne 2
.mk
.na
.B i
.ad
.RS 5n
.rt
Indicates incomplete transfer
.RE

.RE

.sp
.ne 2
.mk
.na
.I chroot-filename
.ad
.RS 25n
.rt
The pathname of the transferred file relative to the
.B chroot
point.
This will differ from the
.I filename
field for anonymous and guest
users.
.RE

.sp
.ne 2
.mk
.na
.I file-size
.ad
.RS 25n
.rt
The size, in bytes, of the file on the server.
.RE

.sp
.ne 2
.mk
.na
.I restart-offset
.ad
.RS 25n
.rt
The offset, in bytes, at which the file transfer was restarted (0 when no
restart offset was specified).
.RE

.SH FILES
.sp
.LP
.B /var/log/xferlog
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWftpr
_
Interface StabilityExternal
.TE

.SH SEE ALSO
.sp
.LP
.BR tar (1),
.BR in.ftpd (1M),
.BR ftpaccess (4),
.BR ftpconversions (4),
.BR attributes (5)
.sp
.LP
StJohns, Mike.
.IR "RFC 931, Authentication Server" .
Network Working Group.
January 1985.
