usr/src/man/man4/xferlog.4
'\" te
.\" Copyright (C) 2003, Sun Microsystems, Inc. All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH xferlog 4 "25 Apr 2003" "SunOS 5.11" "File Formats"
.SH NAME
xferlog \- FTP Server transfer log file
.SH SYNOPSIS
.LP
.nf
\fB/var/log/xferlog\fR
.fi

.SH DESCRIPTION
.sp
.LP
The \fBxferlog\fR file contains transfer logging information from the FTP
Server, \fBin.ftpd\fR(1M). You can use the logfile capability to change the
location of the log file. See \fBftpaccess\fR(4).
.sp
.LP
By default, each server entry is composed of a single line of the following
form. All fields are separated by spaces.
.sp
.in +2
.nf
\fIcurrent-time\fR  \fItransfer-time \fR   \fIremote-host\fR  \fIbytes-transferred\fR  \e
        \fIfilename\fR
\fItransfer-type\fR  \fIspecial-action-flag\fR  \fIdirection\fR \fIaccess-mode\fR  \fIusername\fR
\fIservice-name\fR  \fIauthentication-method\fR  \fIauthenticated-user-id\fR \e
         \fIcompletion-status\fR
.fi
.in -2

.sp
.LP
The \fBxferlog\fR format capability can be used to customize the transfer
log file format used. In addition to those in the default format, it also
supports \fBchroot-filename\fR, \fBfile-size\fR, and \fBrestart-offset\fR
fields. See \fBftpaccess\fR(4).
.sp
.LP
The fields are defined as follows:
.sp
.ne 2
.mk
.na
\fIcurrent-time\fR
.ad
.RS 25n
.rt
The current local time in the form \fBDDD MMM dd hh:mm:ss YYYY\fR, where:
.sp
.ne 2
.mk
.na
\fBDDD\fR
.ad
.RS 8n
.rt
Is the day of the week
.RE

.sp
.ne 2
.mk
.na
\fBMMM\fR
.ad
.RS 8n
.rt
Is the month
.RE

.sp
.ne 2
.mk
.na
\fBdd\fR
.ad
.RS 8n
.rt
Is the day of the month
.RE

.sp
.ne 2
.mk
.na
\fBhh\fR
.ad
.RS 8n
.rt
Is the hour
.RE

.sp
.ne 2
.mk
.na
\fBmm\fR
.ad
.RS 8n
.rt
Is the minutes
.RE

.sp
.ne 2
.mk
.na
\fBss\fR
.ad
.RS 8n
.rt
Is the seconds
.RE

.sp
.ne 2
.mk
.na
\fBYYYY\fR
.ad
.RS 8n
.rt
Is the year
.RE

.RE

.sp
.ne 2
.mk
.na
\fItransfer-time \fR
.ad
.RS 25n
.rt
The total time in seconds for the transfer
.RE

.sp
.ne 2
.mk
.na
\fIremote-host\fR
.ad
.RS 25n
.rt
The remote host name
.RE

.sp
.ne 2
.mk
.na
\fIbytes-transferred\fR
.ad
.RS 25n
.rt
The number of bytes transferred
.RE

.sp
.ne 2
.mk
.na
\fIfilename\fR
.ad
.RS 25n
.rt
The absolute pathname of the transferred file
.RE

.sp
.ne 2
.mk
.na
\fItransfer-type\fR
.ad
.RS 25n
.rt
A single character indicating the type of transfer:
.sp
.ne 2
.mk
.na
\fBa\fR
.ad
.RS 5n
.rt
Indicates an ascii transfer
.RE

.sp
.ne 2
.mk
.na
\fBb\fR
.ad
.RS 5n
.rt
Indicates a binary transfer
.RE

.RE

.sp
.ne 2
.mk
.na
\fIspecial-action-flag\fR
.ad
.RS 25n
.rt
One or more single character flags that indicate any special action taken.
The \fIspecial-action-flag\fR can have one of more of the following
values:
.sp
.ne 2
.mk
.na
\fBC\fR
.ad
.RS 16n
.rt
File was compressed
.RE

.sp
.ne 2
.mk
.na
\fBU\fR
.ad
.RS 16n
.rt
File was uncompressed
.RE

.sp
.ne 2
.mk
.na
\fBT\fR
.ad
.RS 16n
.rt
File was archived, for example, by using \fBtar\fR(1)
.RE

.sp
.ne 2
.mk
.na
\fB_ (underbar)\fR
.ad
.RS 16n
.rt
No action was taken.
.RE

.RE

.sp
.ne 2
.mk
.na
\fIdirection\fR
.ad
.RS 25n
.rt
The direction of the transfer. \fIdirection\fR can have one of the
following values:
.sp
.ne 2
.mk
.na
\fBo\fR
.ad
.RS 5n
.rt
Outgoing
.RE

.sp
.ne 2
.mk
.na
\fBi\fR
.ad
.RS 5n
.rt
Incoming
.RE

.RE

.sp
.ne 2
.mk
.na
\fIaccess-mode\fR
.ad
.RS 25n
.rt
The method by which the user is logged in. \fIaccess-mode\fR can have one
of the following values:
.sp
.ne 2
.mk
.na
\fBa\fR
.ad
.RS 5n
.rt
For an anonymous user.
.RE

.sp
.ne 2
.mk
.na
\fBg\fR
.ad
.RS 5n
.rt
For a passworded guest user. See the description of the \fBguestgroup\fR
capability in \fBftpaccess\fR(4).
.RE

.sp
.ne 2
.mk
.na
\fBr\fR
.ad
.RS 5n
.rt
For a real, locally authenticated user
.RE

.RE

.sp
.ne 2
.mk
.na
\fIusername\fR
.ad
.RS 25n
.rt
The local username, or if anonymous, the ID string given
.RE

.sp
.ne 2
.mk
.na
\fIservice-name\fR
.ad
.RS 25n
.rt
The name of the service invoked, usually \fBftp\fR
.RE

.sp
.ne 2
.mk
.na
\fIauthentication-method\fR
.ad
.RS 25n
.rt
The method of authentication used. \fIauthentication-method\fR can have one
of the following values:
.sp
.ne 2
.mk
.na
\fB0\fR
.ad
.RS 5n
.rt
None
.RE

.sp
.ne 2
.mk
.na
\fB1\fR
.ad
.RS 5n
.rt
\fIRFC 931\fR authentication
.RE

.RE

.sp
.ne 2
.mk
.na
\fIauthenticated-user-id\fR
.ad
.RS 25n
.rt
The user ID returned by the authentication method. A \fB*\fR is used if an
authenticated user ID is not available.
.RE

.sp
.ne 2
.mk
.na
\fIcompletion-status\fR
.ad
.RS 25n
.rt
A single character indicating the status of the transfer.
\fIcompletion-status\fR can have one of the following values:
.sp
.ne 2
.mk
.na
\fBc\fR
.ad
.RS 5n
.rt
Indicates complete transfer
.RE

.sp
.ne 2
.mk
.na
\fBi\fR
.ad
.RS 5n
.rt
Indicates incomplete transfer
.RE

.RE

.sp
.ne 2
.mk
.na
\fIchroot-filename\fR
.ad
.RS 25n
.rt
The pathname of the transferred file relative to the \fBchroot\fR point.
This will differ from the \fIfilename\fR field for anonymous and guest
users.
.RE

.sp
.ne 2
.mk
.na
\fIfile-size\fR
.ad
.RS 25n
.rt
The size, in bytes, of the file on the server.
.RE

.sp
.ne 2
.mk
.na
\fIrestart-offset\fR
.ad
.RS 25n
.rt
The offset, in bytes, at which the file transfer was restarted (0 when no
restart offset was specified).
.RE

.SH FILES
.sp
.LP
\fB/var/log/xferlog\fR
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWftpr
_
Interface StabilityExternal
.TE

.SH SEE ALSO
.sp
.LP
\fBtar\fR(1), \fBin.ftpd\fR(1M), \fBftpaccess\fR(4),
\fBftpconversions\fR(4), \fBattributes\fR(5)
.sp
.LP
StJohns, Mike. \fIRFC 931, Authentication Server\fR. Network Working Group.
January 1985.
