usr/src/man/man4/yppasswdd.4
'\" te
.\" Copyright (c) 2001, Sun Microsystems, Inc.  All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH yppasswdd 4 "8 Nov 2001" "SunOS 5.11" "File Formats"
.SH NAME
yppasswdd \- configuration file for rpc.yppasswdd (NIS password daemon)
.SH SYNOPSIS
.LP
.nf
\fB/etc/default/yppasswdd\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B yppasswdd
file contains a parameter that modifies the behavior of
the
.BR rpc.yppasswdd "(1M) daemon."
.sp
.LP
The
.B yppasswdd
file contains a single parameter:
.sp
.in +2
.nf
#check_restricted_shell_name=1
.fi
.in -2
.sp

.sp
.LP
By default in the current release, this line in
.B yppasswdd
is commented
out. If you uncomment the line, when a user attempts to change his default
shell using
.B "`passwd -r nis -e`"
(see
.BR passwd (1)),
the
.B rpc.yppasswdd
daemon checks whether the name of the user's current
shell begins with an 'r'.
.B rpc.yppasswdd
considers any  shell whose name
begins with an 'r' (for example,
.BR rcsh )
to be a restricted shell. If a
user's shell does begin with 'r', his attempt to change from the default
shell will fail.
.sp
.LP
If the line in the
.B yppasswdd
file is commented out (the default), the
.B rpc.yppasswdd
daemon does not perform the restricted shell check.
.sp
.LP
The
.B yppasswdd
file is editable only by root or a member of the sys
group.
.SH FILES
.sp
.ne 2
.mk
.na
.B /etc/default/yppasswdd
.ad
.RS 26n
.rt
configuration file for
.B rpc.yppasswdd
daemon
.RE

.SH SEE ALSO
.sp
.LP
.BR rpc.yppasswdd (1M)
