usr/src/man/man4/ypserv.4
'\" te
.\" Copyright (C) 2003, Sun Microsystems, Inc.
.\" All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ypserv 4 "9 Aug 2004" "SunOS 5.11" "File Formats"
.SH NAME
ypserv \- configuration file for NIS to LDAP transition daemons
.SH SYNOPSIS
.LP
.nf
\fB/etc/default/ypserv\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B ypserv
file specifies configuration information for the
.BR ypserv (1M)
daemon. Configuration information can come from LDAP or be
specified in the
.B ypserv
file.
.sp
.LP
You can create a simple
.B ypserv
file by running
.BR inityp2l (1M).
The
.B ypserv
file can then be customized as required.
.sp
.LP
A related
.B NISLDAPmapping
file contains mapping information that
converts NIS entries into LDAP entries. See the
.BR NISLDAPmapping (4)
man
page for an overview of the setup that is needed to map NIS data to or from
LDAP.
.SH EXTENDED DESCRIPTION
.sp
.LP
The \fBypserv\fR(1M) server recognizes the attributes that follow. Values
specified for these attributes in the
.B ypserv
file, including any empty
values, override values that are obtained from LDAP. However, the
.B nisLDAPconfig*
values are read from the
.B ypserv
file only
.SS "Attributes"
.sp
.LP
The following are attributes that are used for initial configuration.
.sp
.ne 2
.mk
.na
.B nisLDAPconfigDN
.ad
.sp .6
.RS 4n
The
.B DN
for configuration information. If
.B nisLDAPconfigDN
is
empty, all other
.B nisLDAPConfig*
values are ignored.
.RE

.sp
.ne 2
.mk
.na
.B nisLDAPconfigPreferredServerList
.ad
.sp .6
.RS 4n
The list of servers to use for the configuration phase. There is no default
value. The following is an example of a value for
.BR nisLDAPconfigPreferredServerList :
.sp
.in +2
.nf
nisLDAPconfigPreferredServerList=127.0.0.1:389
.fi
.in -2

.RE

.sp
.ne 2
.mk
.na
.B nisLDAPconfigAuthenticationMethod
.ad
.sp .6
.RS 4n
The authentication method used to obtain the configuration information. The
recognized values for
.B nisLDAPconfigAuthenticationMethod
are:
.sp
.ne 2
.mk
.na
.B none
.ad
.RS 19n
.rt
No authentication attempted
.RE

.sp
.ne 2
.mk
.na
.B simple
.ad
.RS 19n
.rt
Password of proxy user sent in the clear to the LDAP server
.RE

.sp
.ne 2
.mk
.na
.B sasl/cram-md5
.ad
.RS 19n
.rt
Use
.B SASL/CRAM-MD5
authentication. This authentication method may not
be supported by all LDAP servers. A password must be supplied.
.RE

.sp
.ne 2
.mk
.na
.B sasl/digest-md5
.ad
.RS 19n
.rt
Use SASL/DIGEST-MD5 authentication. The \fBSASL/CRAM-MD5\fRauthentication
method may not be supported by all LDAP servers. A password must be
supplied.
.RE

.B nisLDAPconfigAuthenticationMethod
has no default value. The following
is an example of a value for
.BR nisLDAPconfigAuthenticationMethod :
.sp
.in +2
.nf
nisLDAPconfigAuthenticationMethod=simple
.fi
.in -2

.RE

.sp
.ne 2
.mk
.na
.B nisLDAPconfigTLS
.ad
.sp .6
.RS 4n
The transport layer security used for the connection to the server. The
recognized values are:
.sp
.ne 2
.mk
.na
.B none
.ad
.RS 8n
.rt
No encryption of transport layer data. The default value is
.BR none .
.RE

.sp
.ne 2
.mk
.na
.B ssl
.ad
.RS 8n
.rt
.B SSL
encryption of transport layer data. A certificate is required.
.RE

Export and import control restrictions might limit the availability of
transport layer security.
.RE

.sp
.ne 2
.mk
.na
.B nisLDAPconfigTLSCertificateDBPath
.ad
.sp .6
.RS 4n
The name of the directory that contains the certificate database. The
default path is
.BR /var/yp .
.RE

.sp
.ne 2
.mk
.na
.B nisLDAPconfigProxyUser
.ad
.sp .6
.RS 4n
The proxy user used to obtain configuration information.
.B nisLDAPconfigProxyUser
has no default value. If the value ends with a
comma, the value of the
.B nisLDAPconfigDN
attribute is appended. For
example:
.sp
.in +2
.nf
nisLDAPconfigProxyUser=cn=nisAdmin,ou=People,
.fi
.in -2

.RE

.sp
.ne 2
.mk
.na
.B nisLDAPconfigProxyPassword
.ad
.sp .6
.RS 4n
The password that should be supplied to LDAP for the proxy user when the
authentication method requires one. To avoid exposing this password publicly
on the machine, the password should only appear in the configuration file,
and the file should have an appropriate owner, group, and file mode.
.B nisLDAPconfigProxyPassword
has no default value.
.RE

.sp
.LP
The following are attributes used for data retrieval. The object class name
used for these attributes is
.BR nisLDAPconfig .
.sp
.ne 2
.mk
.na
.B preferredServerList
.ad
.sp .6
.RS 4n
The list of servers to use to read or to write mapped NIS data from or to
LDAP.
.B preferredServerList
has no default value. For example:
.sp
.in +2
.nf
preferredServerList=127.0.0.1:389
.fi
.in -2

.RE

.sp
.ne 2
.mk
.na
.B authenticationMethod
.ad
.sp .6
.RS 4n
The authentication method to use to read or to write mapped NIS data from
or to LDAP. For recognized values, see the \fBLDAPconfigAuthenticationMethod
attribute\fR. \fBauthenticationMethod\fR has no default value. For
example:
.sp
.in +2
.nf
authenticationMethod=simple
.fi
.in -2

.RE

.sp
.ne 2
.mk
.na
.B nisLDAPTLS
.ad
.sp .6
.RS 4n
The transport layer security to use to read or to write NIS data from or to
LDAP. For recognized values, see the
.B nisLDAPconfigTLS
attribute. The
default value is none. Export and import control restrictions might limit
the availability of transport layer security.
.RE

.sp
.ne 2
.mk
.na
.B nisLDAPTLSCertificateDBPath
.ad
.sp .6
.RS 4n
The name of the directory that contains the certificate
.BR DB .
For
recognized and default values for
.BR nisLDAPTLSCertificateDBPath ,
see the
.B nisLDAPconfigTLSCertificateDBPath
attribute.
.RE

.sp
.ne 2
.mk
.na
.B nisLDAPproxyUser
.ad
.sp .6
.RS 4n
Proxy user used by \fBypserv\fR(1M), \fBypxfrd\fR(1M) and
.BR yppasswdd (1M)
to read or to write from or to LDAP. Assumed to have the
appropriate permission to read and modify LDAP data. There is no default
value. If the value ends in a comma, the value of the context for the
current domain, as defined by a
.B nisLDAPdomainContext
attribute, is
appended. See
.BR NISLDAPmapping (4).
For example:
.sp
.in +2
.nf
nisLDAPproxyUser=cn=nisAdmin,ou=People,
.fi
.in -2

.RE

.sp
.ne 2
.mk
.na
.B nisLDAPproxyPassword
.ad
.sp .6
.RS 4n
The password that should be supplied to LDAP for the proxy user when the
authentication method so requires. To avoid exposing this password publicly
on the machine, the password should only appear in the configuration file,
and the file must have an appropriate owner, group, and file mode.
.B nisLDAPproxyPassword
has no default value.
.RE

.sp
.ne 2
.mk
.na
.B nisLDAPsearchTimeout
.ad
.sp .6
.RS 4n
Establishes the timeout for the LDAP search operation. The default value
for
.B nisLDAPsearchTimeout
is 180 seconds.
.RE

.sp
.ne 2
.mk
.na
.B nisLDAPbindTimeout
.ad
.br
.na
.B nisLDAPmodifyTimeout
.ad
.br
.na
.B nisLDAPaddTimeout
.ad
.br
.na
.B nisLDAPdeleteTimeout
.ad
.sp .6
.RS 4n
Establish timeouts for LDAP bind, modify, add, and delete operations,
respectively. The default value is 15 seconds for each attribute. Decimal
values are allowed.
.RE

.sp
.ne 2
.mk
.na
.B nisLDAPsearchTimeLimit
.ad
.sp .6
.RS 4n
Establish a value for the
.B LDAP_OPT_TIMELIMIT
option, which suggests a
time limit for the search operation on the LDAP server. The server may
impose its own constraints on possible values. See your LDAP server
documentation. The default is the
.B nisLDAPsearchTimeout
value. Only
integer values are allowed.
.sp
Since the
.B nisLDAPsearchTimeout
limits the amount of time the client
.B ypserv
will wait for completion of a search operation, do not set the
value of
.B nisLDAPsearchTimeLimit
larger than the value of
.BR nisLDAPsearchTimeout .
.RE

.sp
.ne 2
.mk
.na
.B nisLDAPsearchSizeLimit
.ad
.sp .6
.RS 4n
Establish a value for the
.B LDAP_OPT_SIZELIMIT
option, which suggests a
size limit, in bytes, for the search results on the LDAP server. The server
may impose its own constraints on possible values. See your LDAP server
documentation. The default value for
.B nisLDAPsearchSizeLimit
is zero,
which means the size limit is unlimited. Only integer values are allowed.
.RE

.sp
.ne 2
.mk
.na
.B nisLDAPfollowReferral
.ad
.sp .6
.RS 4n
Determines if the
.B ypserv
should follow referrals or not. Recognized
values for
.B nisLDAPfollowReferral
are
.B yes
and
.BR no .
The
default value for
.B nisLDAPfollowReferral
is
.BR no .
.RE

.sp
.LP
The following attributes specify the action to be taken when some event
occurs. The values are all of the form
.BR event=action .
The default
action is the first one listed for each event.
.sp
.ne 2
.mk
.na
.B nisLDAPretrieveErrorAction
.ad
.sp .6
.RS 4n
If an error occurs while trying to retrieve an entry from LDAP, one of the
following actions can be selected:
.sp
.ne 2
.mk
.na
.B use_cached
.ad
.RS 14n
.rt
Retry the retrieval the number of time specified by
.BR nisLDAPretrieveErrorAttempts ,
with the
.B nisLDAPretrieveErrorTimeout
value controlling the wait between each
attempt.
.sp
If all attempts fail, then a warning is logged and the value currently in
the cache is returned to the client.
.RE

.sp
.ne 2
.mk
.na
.B fail
.ad
.RS 14n
.rt
Proceed as for
.BR use_cached ,
but if all attempts fail, a
.B YPERR_YPERR
error is returned to the client.
.RE

.RE

.sp
.ne 2
.mk
.na
.B nisLDAPretrieveErrorAttempts
.ad
.sp .6
.RS 4n
The number of times a failed retrieval should be retried. The default value
for
.B nisLDAPretrieveErrorAttempts
is unlimited. While retries are made
the
.B ypserv
daemon will be prevented from servicing further requests
\&.\fBnisLDAPretrieveErrorAttempts\fR values other than \fB1\fR should be
used with caution.
.RE

.sp
.ne 2
.mk
.na
.B nisLDAPretrieveErrorTimeout
.ad
.sp .6
.RS 4n
The timeout in seconds between each new attempt to retrieve LDAP data. The
default value for
.B nisLDAPretrieveErrorTimeout
is 15 seconds.
.RE

.sp
.ne 2
.mk
.na
.B nisLDAPstoreErrorAction
.ad
.sp .6
.RS 4n
An error occurred while trying to store data to the LDAP repository.
.sp
.ne 2
.mk
.na
.B retry
.ad
.RS 9n
.rt
Retry operation
.B nisLDAPstoreErrorAttempts
times with
.B nisLDAPstoreErrorTimeout
seconds between each attempt. While retries
are made, the NIS daemon will be prevented from servicing further requests.
Use with caution.
.RE

.sp
.ne 2
.mk
.na
.B fail
.ad
.RS 9n
.rt
Return
.B YPERR_YPERR
error to the client.
.RE

.RE

.sp
.ne 2
.mk
.na
.B nisLDAPstoreErrorAttempts
.ad
.sp .6
.RS 4n
The number of times a failed attempt to store should be retried. The
default value for
.B nisLDAPstoreErrorAttempts
is unlimited. The value
for
.B nisLDAPstoreErrorAttempts
is ignored unless
.BR nisLDAPstoreErrorAction=retry .
.RE

.sp
.ne 2
.mk
.na
.B nisLDAPstoreErrortimeout
.ad
.sp .6
.RS 4n
The timeout, in seconds, between each new attempt to store LDAP data. The
default value for
.B nisLDAPstoreErrortimeout
is 15 seconds. The
.B nisLDAPstoreErrortimeout
value is ignored unless
.BR nisLDAPstoreErrorAction=retry .
.RE

.SS "Storing Configuration Attributes in LDAP"
.sp
.LP
Most attributes described on this man page, as well as those described on
.BR NISLDAPmapping (4),
can be stored in LDAP. In order to do so, you will
need to add the following definitions to your LDAP server, which are
described here in
.B LDIF
format suitable for use by
.BR ldapadd (1).
The attribute and objectclass OIDs are examples only.
.sp
.in +2
.nf
dn: cn=schema
changetype: modify
add: attributetypes
attributetypes: ( 1.3.6.1.4.1.11.1.3.1.1.2 NAME 'preferredServerList' \e
          DESC 'Preferred LDAP server host addresses used by DUA' \e
          EQUALITY caseIgnoreMatch \
          SYNTAX 1.3.6.1.4.1.1466.115.121.1.15 SINGLE-VALUE )
attributetypes: ( 1.3.6.1.4.1.11.1.3.1.1.6 NAME 'authenticationMethod' \e
          DESC 'Authentication method used to contact the DSA' \e
          EQUALITY caseIgnoreMatch \
          SYNTAX 1.3.6.1.4.1.1466.115.121.1.15 SINGLE-VALUE )

dn: cn=schema
     changetype: modify
     add: attributetypes
     attributetypes: ( 1.3.6.1.4.1.42.2.27.5.42.43.1.0 \e
               NAME 'nisLDAPTLS' \e
               DESC 'Transport Layer Security' \e
               SYNTAX 1.3.6.1.4.1.1466.115.121.1.26 SINGLE-VALUE )
     attributetypes: ( 1.3.6.1.4.1.42.2.27.5.42.43.1.1 \e
               NAME 'nisLDAPTLSCertificateDBPath' \e
               DESC 'Certificate file' \e
               SYNTAX 1.3.6.1.4.1.1466.115.121.1.26 SINGLE-VALUE )
     attributetypes: ( 1.3.6.1.4.1.42.2.27.5.42.43.1.2 \e
               NAME 'nisLDAPproxyUser' \e
               DESC 'Proxy user for data store/retrieval' \e
               SYNTAX 1.3.6.1.4.1.1466.115.121.1.26 SINGLE-VALUE )
     attributetypes: ( 1.3.6.1.4.1.42.2.27.5.42.43.1.3 \e
               NAME 'nisLDAPproxyPassword' \e
               DESC 'Password/key/shared secret for proxy user' \e
               SYNTAX 1.3.6.1.4.1.1466.115.121.1.26 SINGLE-VALUE )
     attributetypes: ( 1.3.6.1.4.1.42.2.27.5.42.43.1.6 \e
               NAME 'nisLDAPretrieveErrorAction' \e
               DESC 'Action following an LDAP search error' \e
               SYNTAX 1.3.6.1.4.1.1466.115.121.1.26 SINGLE-VALUE )
     attributetypes: ( 1.3.6.1.4.1.42.2.27.5.42.43.1.7 \e
               NAME 'nisLDAPretrieveErrorAttempts' \e
               DESC 'Number of times to retry an LDAP search' \e
               SYNTAX 1.3.6.1.4.1.1466.115.121.1.26 SINGLE-VALUE )
     attributetypes: ( 1.3.6.1.4.1.42.2.27.5.42.43.1.8 \e
               NAME 'nisLDAPretrieveErrorTimeout' \e
               DESC 'Timeout between each search attempt' \e
               SYNTAX 1.3.6.1.4.1.1466.115.121.1.26 SINGLE-VALUE )
     attributetypes: ( 1.3.6.1.4.1.42.2.27.5.42.43.1.9 \e
               NAME 'nisLDAPstoreErrorAction' \e
               DESC 'Action following an LDAP store error' \e
               SYNTAX 1.3.6.1.4.1.1466.115.121.1.26 SINGLE-VALUE )
     attributetypes: ( 1.3.6.1.4.1.42.2.27.5.42.43.1.10 \e
               NAME 'nisLDAPstoreErrorAttempts' \e
               DESC 'Number of times to retry an LDAP store' \e
               SYNTAX 1.3.6.1.4.1.1466.115.121.1.26 SINGLE-VALUE )
     attributetypes: ( 1.3.6.1.4.1.42.2.27.5.42.43.1.11 \e
               NAME 'nisLDAPstoreErrorTimeout' \e
               DESC 'Timeout between each store attempt' \e
               SYNTAX 1.3.6.1.4.1.1466.115.121.1.26 SINGLE-VALUE )
     attributetypes: ( 1.3.6.1.4.1.42.2.27.5.42.43.1.12 \e
               NAME 'nisLDAPdomainContext' \e
               DESC 'Context for a single domain' \e
               SYNTAX 1.3.6.1.4.1.1466.115.121.1.26 SINGLE-VALUE )
     attributetypes: ( 1.3.6.1.4.1.42.2.27.5.42.43.1.13 \e
               NAME 'nisLDAPyppasswddDomains' \e
               DESC 'List of domains for which password changes are made' \e
               SYNTAX 1.3.6.1.4.1.1466.115.121.1.26 SINGLE-VALUE )
     attributetypes: ( 1.3.6.1.4.1.42.2.27.5.42.43.1.14 \e
               NAME 'nisLDAPdatabaseIdMapping' \e
               DESC 'Defines a database id for a NIS object' \e
               SYNTAX 1.3.6.1.4.1.1466.115.121.1.26 )
     attributetypes: ( 1.3.6.1.4.1.42.2.27.5.42.43.1.15 \e
               NAME 'nisLDAPentryTtl' \e
               DESC 'TTL for cached objects derived from LDAP' \e
               SYNTAX 1.3.6.1.4.1.1466.115.121.1.26 )
     attributetypes: ( 1.3.6.1.4.1.42.2.27.5.42.43.1.16 \e
               NAME 'nisLDAPobjectDN' \e
               DESC 'Location in LDAP tree where NIS data is stored' \e
               SYNTAX 1.3.6.1.4.1.1466.115.121.1.26 )
     attributetypes: ( 1.3.6.1.4.1.42.2.27.5.42.43.1.17 ) \e
               NAME 'nisLDAPnameFields' \e
               DESC 'Rules for breaking NIS entries into fields' \e
               SYNTAX 1.3.6.1.4.1.1466.115.121.1.26 )
     attributetypes: ( 1.3.6.1.4.1.42.2.27.5.42.43.1.18 ) \e
               NAME 'nisLDAPsplitFields' \e
               DESC 'Rules for breaking fields into sub fields' \e
               SYNTAX 1.3.6.1.4.1.1466.115.121.1.26 )

     attributetypes: ( 1.3.6.1.4.1.42.2.27.5.42.43.1.19 \e
               NAME 'nisLDAPattributeFromField' \e
               DESC 'Rules for mapping fields to LDAP attributes' \e
               SYNTAX 1.3.6.1.4.1.1466.115.121.1.26 )

     attributetypes: ( 1.3.6.1.4.1.42.2.27.5.42.43.1.20 \e
               NAME 'nisLDAPfieldFromAttribute' \e
               DESC 'Rules for mapping fields to LDAP attributes' \e
               SYNTAX 1.3.6.1.4.1.1466.115.121.1.26 )

     attributetypes: ( 1.3.6.1.4.1.42.2.27.5.42.43.1.21 \e
               NAME 'nisLDAPrepeatedFieldSeparators' \e
               DESC 'Rules for mapping fields to LDAP attributes' \e
               SYNTAX 1.3.6.1.4.1.1466.115.121.1.26 )

     attributetypes: ( 1.3.6.1.4.1.42.2.27.5.42.43.1.22 \e
               NAME 'nisLDAPcommentChar' \e
               DESC 'Rules for mapping fields to LDAP attributes' \e
               SYNTAX 1.3.6.1.4.1.1466.115.121.1.26 )

     attributetypes: ( 1.3.6.1.4.1.42.2.27.5.42.43.1.23 \e
               NAME 'nisLDAPmapFlags' \e
               DESC 'Rules for mapping fields to LDAP attributes' \e
               SYNTAX 1.3.6.1.4.1.1466.115.121.1.26 )

     dn: cn=schema
     changetype: modify
     add: objectclasses
     objectclasses:  ( 1.3.6.1.4.1.42.2.27.5.42.43.1.0 NAME 'nisLDAPconfig' \e
               DESC 'NIS/LDAP mapping configuration' \e
               SUP top STRUCTURAL \e
               MAY ( cn $ preferredServerList $
                 authenticationMethod $ nisLDAPTLS $
                 nisLDAPTLSCertificateDBPath $
                 nisLDAPproxyUser $ nisLDAPproxyPassword $
                 nisLDAPretrieveErrorAction $
                 nisLDAPretrieveErrorAttempts $
                 nisLDAPretrieveErrorTimeout $
                 nisLDAPstoreErrorAction $
                 nisLDAPstoreErrorAttempts $
                 nisLDAPstoreErrorTimeout $
                 nisLDAPdomainContext $
                 nisLDAPyppasswddDomains $
                 nisLDAPdatabaseIdMapping $
                 nisLDAPentryTtl $
                 nisLDAPobjectDN $
                 nisLDAPnameFields $
                 nisLDAPsplitFields $
                 nisLDAPattributeFromField $
                 nisLDAPfieldFromAttribute $
                 nisLDAPrepeatedFieldSeparators $
                 nisLDAPcommentChar $
                 nisLDAPmapFlags ) )
.fi
.in -2

.sp
.LP
Create a file containing the following LDIF data. Substitute your actual
.B nisLDAPconfigDN
for \fBconfigDN\fR:
.sp
.in +2
.nf
dn: configDN
objectClass: top
objectClass: nisLDAPconfig
.fi
.in -2

.sp
.LP
Use this file as input to the
.BR ldapadd (1)
command in order to create
the NIS to LDAP configuration entry. Initially, the entry is empty. You can
use the
.BR ldapmodify (1)
command to add configuration attributes.
.SH EXAMPLES
.LP
.B Example 1
Creating a NIS to LDAP Configuration Entry
.sp
.LP
To set the server list to port 389 on 127.0.0.1, create the following file
and use it as input to
.BR ldapmodify (1):

.sp
.in +2
.nf
dn: configDN
preferredServerList: 127.0.0.1:389
.fi
.in -2

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
AvailabilitySUNWypu
_
Interface StabilityObsolete
.TE

.SH SEE ALSO
.sp
.LP
.BR ldapadd (1),
.BR ldapmodify (1),
.BR inityp2l (1M),
.BR yppasswdd (1M),
.BR ypserv (1M),
.BR ypxfrd (1M),
.BR NIS+LDAPmapping (4),
.BR attributes (5)
.sp
.LP
\fISystem Administration Guide: Naming and Directory Services (DNS, NIS,
and LDAP)\fR
