usr/src/man/man9e/attach.9e
'\" te
.\" Copyright (c) 2004, Sun Microsystems, Inc. All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH attach 9E "7 Jan 2004" "SunOS 5.11" "Driver Entry Points"
.SH NAME
attach \- Attach a device to the system, or resume it
.SH SYNOPSIS
.LP
.nf
#include <sys/ddi.h>
#include <sys/sunddi.h>



\fBint prefix\fBattach\fR(\fBdev_info_t *\fIdip\fR, \fBddi_attach_cmd_t\fR \fIcmd\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI)
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I dip
.ad
.RS 7n
.rt
A pointer to the device's
.B dev_info
structure.
.RE

.sp
.ne 2
.mk
.na
.I cmd
.ad
.RS 7n
.rt
Attach type. Possible values are
.B DDI_ATTACH
and
.BR DDI_RESUME .
Other values are reserved. The driver must return
.B DDI_FAILURE
if
reserved values are passed to it.
.RE

.SH DESCRIPTION
.sp
.LP
The \fBattach\fR(9E) function is the device-specific initialization entry
point. This entry point is
.B required
and must be written.
.SS "DDI_ATTACH"
.sp
.LP
The
.B DDI_ATTACH
command must be provided in the
.BR attach "(9E) entry"
point.
.B DDI_ATTACH
is used to initialize a given device instance. When
.BR attach (9E)
is called with
.I cmd
set to
.BR DDI_ATTACH ,
all
normal kernel services (such as \fBkmem_alloc\fR(9F)) are available for use
by the driver. Device interrupts are not blocked when attaching a device to
the system.
.sp
.LP
The \fBattach\fR(9E) function is called once for each instance of the
device on the system with
.I cmd
set to
.BR DDI_ATTACH .
Until
.BR attach (9E)
succeeds, the only driver entry point which may be called
is \fBgetinfo\fR(9E). See the \fIWriting Device Drivers\fR for more
information. The instance number may be obtained using
.BR ddi_get_instance (9F).
.sp
.LP
At attach time, all components of a power-manageable device are assumed to
be at unknown levels. Before using the device, the driver needs to bring the
required component(s) to a known power level. The
.BR pm_raise_power (9F)
function can be used to set the power level of a component. This function
must not be called before data structures referenced in
.BR power "(9E) have"
been initialized.
.SS "DDI_RESUME"
.sp
.LP
The
.B attach()
function may be called with
.I cmd
set to
.B DDI_RESUME
after \fBdetach\fR(9E) has been successfully called with
.I cmd
set to
.BR DDI_SUSPEND .
.sp
.LP
When called with
.I cmd
set to
.BR DDI_RESUME ,
.B attach()
must
restore the hardware state of a device (power may have been removed from the
device), allow pending requests to continue, and service new requests. In
this case, the driver must not make any assumptions about the state of the
hardware, but must restore the state of the device except for the power
level of components.
.sp
.LP
If the device driver uses the automatic device Power Management interfaces
(driver exports the \fBpm-components\fR(9P) property), the Power Management
framework sets its notion of the power level of each component of a device
to
.B unknown
while processing a
.B DDI_RESUME
command.
.sp
.LP
The driver can deal with components during
.B DDI_RESUME
in one of the
following ways:
.RS +4
.TP
1.
If the driver can determine the power level of the component without having
to power it up (for example, by calling
.BR ddi_peek (9F)
or some other
device-specific method) then it should notify the power level to the
framework by calling
.BR pm_power_has_changed (9F).
.RE
.RS +4
.TP
2.
The driver must also set its own notion of the power level of the component
to
.BR unknown .
The system will consider the component idle or busy based
on the most recent call to
.BR pm_idle_component "(9F) or"
.BR pm_busy_component (9F)
for that component. If the component is idle for
sufficient time, the framework will call into the driver's
.BR power (9E)
entry point to turn the component off. If the driver needs to access the
device, then it must call
.BR pm_raise_power (9F)
to bring the component up
to the level needed for the device access to succeed. The driver must honor
any request to set the power level of the component, since it cannot make
any assumption about what power level the component has (or it should have
called
.BR pm_power_has_changed "(9F) as outlined above). As a special case"
of this, the driver may bring the component to a known state because it
wants to perform an operation on the device as part of its
.BR DDI_RESUME
processing (such as loading firmware so that it can detect hot-plug
events).
.RE
.SH RETURN VALUES
.sp
.LP
The
.B attach()
function returns:
.sp
.ne 2
.mk
.na
.B DDI_SUCCESS
.ad
.RS 15n
.rt
Successful completion
.RE

.sp
.ne 2
.mk
.na
.B DDI_FAILURE
.ad
.RS 15n
.rt
Operation failed
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
.BR cpr (7),
.BR pm (7D),
.BR pm (9P),
.BR pm-components (9P),
.BR detach (9E),
.BR getinfo (9E),
.BR identify (9E),
.BR open (9E),
.BR power (9E),
.BR probe (9E),
.BR ddi_add_intr (9F),
.BR ddi_create_minor_node (9F),
.BR ddi_get_instance (9F),
.BR ddi_map_regs (9F),
.BR kmem_alloc (9F),
.BR pm_raise_power (9F)
.sp
.LP
.I Writing Device Drivers
