usr/src/man/man9e/close.9e
'\" te
.\" Copyright 2003 AT&T
.\" Copyright (c) 2008, Sun Microsystems, Inc.  All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH close 9E "24 Apr 2008" "SunOS 5.11" "Driver Entry Points"
.SH NAME
close \- relinquish access to a device
.SH SYNOPSIS
.SS "Block and Character"
.LP
.nf
#include <sys/types.h>
#include <sys/file.h>
#include <sys/errno.h>
#include <sys/open.h>
#include <sys/cred.h>
#include <sys/ddi.h>
#include <sys/sunddi.h>



\fBint prefix\fBclose\fR(\fBdev_t\fR \fIdev\fR, \fBint\fR \fIflag\fR, \fBint\fR \fIotyp\fR, \fBcred_t *\fIcred_p\fR);
.fi

.SS "STREAMS"
.LP
.nf
#include <sys/types.h>
#include <sys/stream.h>
#include <sys/file.h>
#include <sys/errno.h>
#include <sys/open.h>
#include <sys/cred.h>
#include <sys/ddi.h>
#include <sys/sunddi.h>



\fBint prefix\fBclose\fR(\fBqueue_t *\fIq\fR, \fBint\fR \fIflag\fR, \fBcred_t *\fIcred_p\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Architecture independent level 1 (DDI/DKI). This entry point is
\fIrequired\fR for block devices.
.SH PARAMETERS
.SS "Block and Character"
.sp
.ne 2
.mk
.na
.I dev
.ad
.RS 11n
.rt
Device number.
.RE

.sp
.ne 2
.mk
.na
\fIflag\fR
.ad
.RS 11n
.rt
File status flag, as set by the
.BR open (2)
or modified by the
\fBfcntl\fR(2) system calls. The flag is for information only\(emthe file
should always be closed completely. Possible values are:
.BR FEXCL ,
.BR FNDELAY ,
\fBFREAD, FKLYR,\fR and
.BR FWRITE .
Refer to
.BR open (9E)
for more information.
.RE

.sp
.ne 2
.mk
.na
.I otyp
.ad
.RS 11n
.rt
Parameter supplied so that the driver can determine how many times a device
was opened and for what reasons.  The flags assume the
.B open()
routine
may be called many times, but the
.B close()
routine should only be
called on the last
.B close()
of a device.
.sp
.ne 2
.mk
.na
.B OTYP_BLK
.ad
.RS 12n
.rt
Close was through block interface for the device.
.RE

.sp
.ne 2
.mk
.na
.B OTYP_CHR
.ad
.RS 12n
.rt
Close was through the raw/character interface for the device.
.RE

.sp
.ne 2
.mk
.na
.B OTYP_LYR
.ad
.RS 12n
.rt
.RB "Close a layered process (a higher-level driver called the" " close()"
routine of the device).
.RE

.RE

.sp
.ne 2
.mk
.na
.I *cred_p
.ad
.RS 11n
.rt
Pointer to the  user credential structure.
.RE

.SS "STREAMS"
.sp
.ne 2
.mk
.na
.I *q
.ad
.RS 11n
.rt
Pointer to  \fBqueue\fR(9S) structure used to reference the read side of
the driver.  (A queue is the central node of a collection of structures and
routines pointed to by a queue.)
.RE

.sp
.ne 2
.mk
.na
\fIflag\fR
.ad
.RS 11n
.rt
File status flag.
.RE

.sp
.ne 2
.mk
.na
.I *cred_p
.ad
.RS 11n
.rt
Pointer to the  user credential structure.
.RE

.SH DESCRIPTION
.sp
.LP
For STREAMS drivers, the
.B close()
routine is called by the kernel
through the  \fBcb_ops\fR(9S) table entry for the device. (Modules use the
\fBfmodsw\fR table.) A non-null value in the  \fBd_str\fR field of the
\fBcb_ops\fR entry points to a  \fBstreamtab\fR structure, which points to a
.BR qinit (9S)
containing a pointer to the
.B close()
routine.
Non-STREAMS
.B close()
routines are called directly from the
\fBcb_ops\fR table.
.sp
.LP
\fBclose()\fR ends the connection between the user process and the device,
and prepares the device (hardware and software) so that it is ready to be
opened again.
.sp
.LP
A device may be opened simultaneously by multiple processes and the
\fBopen()\fR driver routine is called for each open. For all \fIotyp\fR
values other than
.BR OTYP_LYR ,
the kernel calls the
.B close()
routine
when the last-reference occurs. For
.B OTYP_LYR
each close operation will
call the driver.
.sp
.LP
Kernel accounting for last-reference occurs at (\fIdev\fR,
.IR otyp )
granularity. Note that a device is referenced once its associated
.BR open (9E)
routine is entered, and thus \fBopen\fR(9E)'s  which have not
yet completed will prevent
.B close()
from  being called.  The driver's
\fBclose()\fR call associated with the  last-reference going away is
typically issued as result of a
.BR close (2),
.BR exit (2),
.BR munmap (2),
or
.BR umount (2).
However, a failed
.BR open (9E)
call
can cause this last-reference
.B close()
call to be issued as a result of
an
.BR open (2)
or
.BR mount (2).
.sp
.LP
The kernel provides
.B "open() close()"
exclusion guarantees to the
driver at the same
.IR devp ,
\fIotyp\fR granularity as last-reference
accounting. The kernel delays new calls to the
.B open()
driver routine
while the last-reference
.B close()
call is executing. For example, a
driver that blocks in
.B close()
will not see new calls to
.BR open()
until it returns from
.BR close() .
This effectively delays invocation of
other
.BR cb_ops "(9S) driver entry points that also depend on an"
.BR open (9E)
established device reference. If the driver has indicated
that an
.B EINTR
return is safe via the
.BR D_OPEN_RETURNS_EINTR
\fBcb_flag\fR, then a delayed \fBopen()\fR may be interrupted by a signal,
resulting in an
.B EINTR
return from
.B open()
prior to calling
.BR open (9E).
.sp
.LP
Last-reference accounting and
.B "open() close()"
exclusion
typically simplify driver writing. In some cases, however, they might be an
impediment for certain types of drivers. To overcome any impediment, the
driver can change minor numbers in
.BR open "(9E), as described below, or"
implement multiple minor nodes for the same device. Both techniques give the
driver control over when
.B close()
calls occur and whether additional
\fBopen()\fR calls will be delayed while \fBclose()\fR is executing.
.sp
.LP
In general, a
.B close()
routine should always check the validity of
the minor number component of the
.I dev
parameter.  The routine should
also check permissions as necessary, by using the user credential structure
(if pertinent), and the appropriateness of the  \fIflag\fR and  \fIotyp\fR
parameter values.
.sp
.LP
\fBclose()\fR could perform any of the following general functions:
.RS +4
.TP
.ie t \(bu
.el o
disable interrupts
.RE
.RS +4
.TP
.ie t \(bu
.el o
hang up phone lines
.RE
.RS +4
.TP
.ie t \(bu
.el o
rewind a tape
.RE
.RS +4
.TP
.ie t \(bu
.el o
deallocate buffers from a private buffering scheme
.RE
.RS +4
.TP
.ie t \(bu
.el o
.RB "unlock an unsharable device (that was locked in the " " open()"
routine)
.RE
.RS +4
.TP
.ie t \(bu
.el o
flush buffers
.RE
.RS +4
.TP
.ie t \(bu
.el o
notify a device of the close
.RE
.RS +4
.TP
.ie t \(bu
.el o
deallocate any resources allocated on open
.RE
.sp
.LP
The
.B close()
routines of STREAMS drivers and modules are called when
a stream is dismantled or a module popped. The steps for dismantling a
stream are performed in the following order. First, any multiplexor links
present are unlinked and the  lower streams are closed. Next, the following
steps are performed for each module or driver on the stream, starting at the
head and working toward the tail:
.RS +4
.TP
1.
The write queue is given a chance to drain.
.RE
.RS +4
.TP
2.
The
.B close()
routine is called.
.RE
.RS +4
.TP
3.
The module or driver is removed from the stream.
.RE
.SH RETURN VALUES
.sp
.LP
\fBclose()\fR should return \fB0\fR for success, or the appropriate error
number. Return errors rarely occur, but if a failure is detected, the driver
should decide whether the severity of the problem warrants either displaying
a message on the console or, in worst cases, triggering a system panic.
Generally, a failure in a
.B close()
routine occurs because a problem
occurred in the associated device.
.SH NOTES
.sp
.LP
If you use
.BR qwait_sig (9F),
.BR cv_wait_sig (9F)
or
.BR cv_timedwait_sig (9F),
you should note that
.B close()
may be called
in contexts in which signals cannot be received. The
.BR ddi_can_receive_sig (9F)
function is  provided to determine when this
hazard exists.
.SH SEE ALSO
.sp
.LP
.BR close (2),
.BR fcntl (2),
.BR open (2),
.BR umount (2),
.BR detach (9E),
.BR open (9E),
.BR ddi_can_receive_sig (9F),
.BR cb_ops (9S),
.BR qinit (9S),
.BR queue (9S)
.sp
.LP
.I Writing Device Drivers
.sp
.LP
.I STREAMS Programming Guide
