usr/src/man/man9e/dump.9e
'\" te
.\" Copyright (c) 1992, Sun Microsystems, Inc.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH dump 9E "9 Oct 2001" "SunOS 5.11" "Driver Entry Points"
.SH NAME
dump \- dump memory to device during system failure
.SH SYNOPSIS
.LP
.nf
#include <sys/types.h>
#include <sys/ddi.h>
#include <sys/sunddi.h>



\fBint\fR \fBdump\fR(\fBdev_t\fR \fIdev\fR, \fBcaddr_t\fR \fIaddr\fR, \fBdaddr_t\fR \fIblkno\fR, \fBint\fR \fInblk\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris specific (Solaris DDI). This entry point is
.BR required .
For
drivers that do not implement
.B dump()
routines,
.BR nodev (9F)
should
be used.
.SH ARGUMENTS
.sp
.ne 2
.mk
.na
.I dev
.ad
.RS 10n
.rt
Device number.
.RE

.sp
.ne 2
.mk
.na
.I addr
.ad
.RS 10n
.rt
Address for the beginning of the area to be dumped.
.RE

.sp
.ne 2
.mk
.na
.I blkno
.ad
.RS 10n
.rt
Block offset to dump memory.
.RE

.sp
.ne 2
.mk
.na
.I nblk
.ad
.RS 10n
.rt
Number of blocks to dump.
.RE

.SH DESCRIPTION
.sp
.LP
\fBdump()\fR is used to dump a portion of virtual address space directly to
a device in the case of system failure. It can also be used for checking the
state of the kernel during a checkpoint operation. The memory area to be
dumped is specified by
.I addr
(base address) and
.I nblk
(length). It
is dumped to the device specified by
.I dev
starting at offset
.IR blkno .
Upon completion
.B dump()
returns the status of the
transfer.
.sp
.LP
When the system is panicking, the calls of functions scheduled by
.BR timeout (9F)
and \fBddi_trigger_softintr\fR(9F) will never occur.
Neither can delay(9F) be relied upon, since it is implemented via
.BR timeout() .
See
.BR ddi_in_panic (9F).
.sp
.LP
\fBdump()\fR is called at interrupt priority.
.SH RETURN VALUES
.sp
.LP
\fBdump()\fR returns \fB0\fR on success, or the appropriate error number.
.SH SEE ALSO
.sp
.LP
.BR cpr (7),
.BR nodev (9F)
.sp
.LP
.I Writing Device Drivers
