usr/src/man/man9e/getinfo.9e
'\" te
.\" Copyright (c) 2004, Sun Microsystems, Inc.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH getinfo 9E "16 Jan 2008" "SunOS 5.11" "Driver Entry Points"
.SH NAME
getinfo \- get device driver information
.SH SYNOPSIS
.LP
.nf
#include <sys/ddi.h>
#include <sys/sunddi.h>



\fBint prefix\fBgetinfo\fR(\fBdev_info_t *\fIdip\fR, \fBddi_info_cmd_t\fR \fIcmd\fR,
     \fBvoid *\fIarg\fR, \fBvoid **\fIresultp\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI). This entry point is
.B required
for
drivers which export
.BR cb_ops "(9S) entry points."
.SH ARGUMENTS
.sp
.ne 2
.mk
.na
.I dip
.ad
.RS 11n
.rt
Do not use.
.RE

.sp
.ne 2
.mk
.na
.I cmd
.ad
.RS 11n
.rt
Command argument - valid command values are
.B DDI_INFO_DEVT2DEVINFO
and
.BR DDI_INFO_DEVT2INSTANCE .
.RE

.sp
.ne 2
.mk
.na
.I arg
.ad
.RS 11n
.rt
Command specific argument.
.RE

.sp
.ne 2
.mk
.na
.I resultp
.ad
.RS 11n
.rt
Pointer to where the requested information is stored.
.RE

.SH DESCRIPTION
.sp
.LP
When
.I cmd
is set to
.BR DDI_INFO_DEVT2DEVINFO ,
.B getinfo()
should
return the \fBdev_info_t\fR pointer associated with the \fBdev_t\fR
.IR arg .
The
.B dev_info_t
pointer should be returned in the field pointed to by
.IR resultp .
.sp
.LP
When
.I cmd
is set to
.BR DDI_INFO_DEVT2INSTANCE ,
.B getinfo()
should
return the instance number associated with the
.BR dev_t
.IR arg .
The
instance number should be returned in the field pointed to by
.IR resultp .

.sp
.LP
Drivers which do not export
.BR cb_ops "(9S) entry points are not required to"
provide a
.B getinfo()
entry point, and may use
.BR nodev (9F)
in the
.B devo_getinfo
field of the \fBdev_ops\fR(9S) structure. A \fBSCSI HBA
\fRdriver is an example of a driver which is not required to provide
.BR cb_ops (9S)
entry points.
.SH RETURN VALUES
.sp
.LP
.B getinfo()
should return:
.sp
.ne 2
.mk
.na
.B DDI_SUCCESS
.ad
.RS 15n
.rt
on success.
.RE

.sp
.ne 2
.mk
.na
.B DDI_FAILURE
.ad
.RS 15n
.rt
on failure.
.RE

.SH EXAMPLES
.LP
.B Example 1 getinfo()
implementation
.sp
.in +2
.nf
/*ARGSUSED*/
static int
rd_getinfo(dev_info_t *dip, ddi_info_cmd_t infocmd, void *arg, \e
void **resultp)
{
       /* Note that in this simple example
        * the minor number is the instance
        * number. 	 */

     devstate_t *sp;
     int error = DDI_FAILURE;
     switch (infocmd) {
     case DDI_INFO_DEVT2DEVINFO:
          if ((sp = ddi_get_soft_state(statep,
              getminor((dev_t) arg))) != NULL) {
                 *resultp = sp->devi;
                 error = DDI_SUCCESS;
          } else
                 *result = NULL;
          break;

     case DDI_INFO_DEVT2INSTANCE:
          *resultp = (void *) (uintptr_t) getminor((dev_t) arg);
          error = DDI_SUCCESS;
          break;
     }

     return (error);
}
.fi
.in -2

.SH SEE ALSO
.sp
.LP
.BR ddi_no_info (9F),
.BR nodev (9F),
.BR cb_ops (9S),
.BR dev_ops (9S)

.sp
.LP
.I Writing Device Drivers
.SH NOTES
.sp
.LP
Non-\fBgld\fR(7D)-based DLPI network streams drivers are encouraged to switch
to
.BR gld "(7D). Failing this, a driver that creates DLPI style-2   minor"
nodes must specify CLONE_DEV for its style-2
.BR ddi_create_minor_node (9F)
nodes and use
.BR qassociate "(9F). A driver that supports both style-1 and"
style-2 minor nodes should return DDI_FAILURE for DDI_INFO_DEVT2INSTANCE and
DDI_INFO_DEVT2DEVINFO
.B getinfo()
calls to style-2 minor nodes. (The
correct association is already established by
.BR qassociate "(9F)). A driver"
that only supports style-2 minor nodes can use \fBddi_no_info\fR(9F) for its
.B getinfo()
implementation. For drivers that do not follow these rules,
the results of a \fBmodunload\fR(1M) of the driver or a \fBcfgadm\fR(1M)
remove of hardware controlled by the driver are undefined.
