usr/src/man/man9e/identify.9e
'\" te
.\" Copyright (c) 2003, Sun Microsystems, Inc.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH identify 9E "11 Apr 2003" "SunOS 5.11" "Driver Entry Points"
.SH NAME
identify \- determine if a driver is associated with a device
.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI). This entry point is no longer
supported.
.BR nulldev (9F)
must be specified in the
.BR dev_ops (9S)
structure.
.SH SEE ALSO
.sp
.LP
.BR nulldev (9F),
.BR dev_ops (9S)
.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for a description of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
.B
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Stability LevelObsolete
.TE

.SH WARNING
.sp
.LP
For Solaris 10 and later versions, drivers must remove the
.B identify(9e)
implementation to recompile. Otherwise, the compiler
generates errors about DDI_IDENTIFIED and DDI_NOT_IDENTIFIED.
