usr/src/man/man9e/print.9e
'\" te
.\" Copyright 1989 AT&T
.\" Copyright (c) 1997, Sun Microsystems, Inc., All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH print 9E "15 Sep 1992" "SunOS 5.11" "Driver Entry Points"
.SH NAME
print \- display a driver message on system console
.SH SYNOPSIS
.LP
.nf
#include <sys/types.h>
#include <sys/errno.h>
#include <sys/ddi.h>
#include <sys/sunddi.h>



\fBint prefix\fBprint\fR(\fBdev_t\fR \fIdev\fR, \fBchar *\fIstr\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Architecture independent level 1 (DDI/DKI). This entry point is required
for block devices.
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I dev
.ad
.RS 8n
.rt
Device number.
.RE

.sp
.ne 2
.mk
.na
.I str
.ad
.RS 8n
.rt
Pointer to a character string describing the problem.
.RE

.SH DESCRIPTION
.sp
.LP
The
.B print()
routine is called by the kernel when it has detected an
exceptional condition (such as out of space) in the device.  To display the
message on the console, the driver should use the
.BR cmn_err (9F)
kernel
function. The driver should print the message along with any driver specific
information.
.SH RETURN VALUES
.sp
.LP
The
.B print()
routine should return
.B 0
for success, or the
appropriate error number.  The
.B print
routine can fail if the driver
implemented a non-standard
.B print()
routine that attempted to perform
error logging, but was unable to complete the logging for whatever reason.

.SH SEE ALSO
.sp
.LP
.BR cmn_err (9F)
.sp
.LP
.I Writing Device Drivers
