usr/src/man/man9e/prop_op.9e
'\" te
.\" Copyright (c) 2000 Sun Microsystems, Inc.  All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH prop_op 9E "8 Jul 1996" "SunOS 5.11" "Driver Entry Points"
.SH NAME
prop_op \- report driver property information
.SH SYNOPSIS
.LP
.nf
#include <sys/types.h>
#include <sys/ddi.h>
#include <sys/sunddi.h>



\fBint prefix\fBprop_op\fR(\fBdev_t\fR \fIdev\fR, \fBdev_info_t *\fIdip\fR,
     \fBddi_prop_op_t\fR \fIprop_op\fR, \fBint\fR \fIflags\fR, \fBchar *\fIname\fR, \fBcaddr_t\fR \fIvaluep\fR,
     \fBint *\fIlengthp\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI specific (Solaris DDI). This entry point is required, but it
can be
.BR ddi_prop_op (9F).
.SH ARGUMENTS
.sp
.ne 2
.mk
.na
.I dev
.ad
.RS 12n
.rt
Device number associated with this device.
.RE

.sp
.ne 2
.mk
.na
.I dip
.ad
.RS 12n
.rt
A pointer to the  device information structure for this device.
.RE

.sp
.ne 2
.mk
.na
.I prop_op
.ad
.RS 12n
.rt
Property operator. Valid operators are:
.sp
.ne 2
.mk
.na
.B PROP_LEN
.ad
.RS 26n
.rt
Get property length only. (\fIvaluep\fR unaffected).
.RE

.sp
.ne 2
.mk
.na
.B PROP_LEN_AND_VAL_BUF
.ad
.RS 26n
.rt
Get length and value into caller's buffer. (\fIvaluep\fR used as input).
.RE

.sp
.ne 2
.mk
.na
.B PROP_LEN_AND_VAL_ALLOC
.ad
.RS 26n
.rt
Get length and value into allocated buffer. (\fIvaluep\fR returned as
pointer to pointer to allocated buffer).
.RE

.RE

.sp
.ne 2
.mk
.na
\fIflags\fR
.ad
.RS 12n
.rt
The only possible flag value is:
.sp
.ne 2
.mk
.na
.B DDI_PROP_DONTPASS
.ad
.RS 21n
.rt
Do not pass request to parent if property not found.
.RE

.RE

.sp
.ne 2
.mk
.na
.I name
.ad
.RS 12n
.rt
Pointer to name of property to be interrogated.
.RE

.sp
.ne 2
.mk
.na
.I valuep
.ad
.RS 12n
.rt
If 
.I prop_op
is
.BR PROP_LEN_AND_VAL_BUF ,
this should be a pointer
to the user's buffer.  If
.I prop_op
is
.BR PROP_LEN_AND_VAL_ALLOC ,
this should be the
.I address
of a pointer.
.RE

.sp
.ne 2
.mk
.na
.I lengthp
.ad
.RS 12n
.rt
On exit,  *\fIlengthp\fR will contain the property length.  If
\fIprop_op\fR is  \fBPROP_LEN_AND_VAL_BUF\fR then \fIlengthp\fR should point
to an
.B int
that contains the length of caller's buffer,  before calling
.BR prop_op() .
.RE

.SH DESCRIPTION
.sp
.LP
\fBprop_op()\fR is an entry point which reports the values of certain
properties of the driver or device to the system. Each driver must have a
\fIprefix\fR \fBprop_op\fR entry point, but most drivers that do not need to
create or manage their own properties can use
.B ddi_prop_op()
for this
entry point.  Then the driver can use
.BR ddi_prop_update (9F)
to create
properties for its device.
.SH RETURN VALUES
.sp
.LP
\fBprop_op()\fR should return:
.sp
.ne 2
.mk
.na
.B DDI_PROP_SUCCESS
.ad
.RS 27n
.rt
Property found and returned.
.RE

.sp
.ne 2
.mk
.na
.B DDI_PROP_NOT_FOUND
.ad
.RS 27n
.rt
Property not found.
.RE

.sp
.ne 2
.mk
.na
.B DDI_PROP_UNDEFINED
.ad
.RS 27n
.rt
Prop explicitly undefined.
.RE

.sp
.ne 2
.mk
.na
.B DDI_PROP_NO_MEMORY
.ad
.RS 27n
.rt
Property found, but unable to allocate memory.
.I lengthp
has the
correct property length.
.RE

.sp
.ne 2
.mk
.na
.B DDI_PROP_BUF_TOO_SMALL
.ad
.RS 27n
.rt
Property found, but the supplied buffer is too small.
.I lengthp
has the
correct property length.
.RE

.SH EXAMPLES
.LP
\fBExample 1\fR Using \fBprop_op()\fR to Report Property Information
.sp
.LP
In the following example,
.B prop_op()
intercepts requests for the
\fItemperature\fR property. The driver tracks changes to \fItemperature\fR
using a variable in the state structure in order to avoid frequent calls to
.BR ddi_prop_update (9F).
The
.I temperature
property is only updated
when a request is made for this property.  It then uses the system routine
.BR ddi_prop_op (9F)
to process the property request.  If the property
request is not specific to a device, the driver does not intercept the
request. This is indicated when the value of the 
.I dev
parameter is
equal to
.BR DDI_DEV_T_ANY .

.sp
.in +2
.nf
int temperature;	/* current device temperature */
 .
 .
 .
static int
xxprop_op(dev_t dev, dev_info_t *dip, ddi_prop_op_t prop_op,
     int flags, char *name, caddr_t valuep, int *lengthp)
{
			int  instance;
			struct xxstate *xsp;
     if (dev == DDI_DEV_T_ANY)
				goto skip;
     instance = getminor(dev);
     xsp = ddi_get_soft_state(statep, instance);
     if (xsp == NULL)
				return (DDI_PROP_NOT_FOUND);
     if (strcmp(name, "temperature") == 0) {
				ddi_prop_update_int(dev, dip,\e
           "temperature", temperature);
     }
		       /*	other cases.\|.\|.	*/
     skip:
     return (ddi_prop_op(dev, dip, prop_op, flags,\e
             name, valuep, lengthp));
}
.fi
.in -2

.SH SEE ALSO
.sp
.LP
.BR Intro (9E),
.BR ddi_prop_op (9F),
.BR ddi_prop_update (9F)
.sp
.LP
.I Writing Device Drivers
