usr/src/man/man9e/segmap.9e
'\" te
.\" Copyright 1989 AT&T
.\" Copyright (c) 1995, Sun Microsystems, Inc.  All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH segmap 9E "14 Jan 1997" "SunOS 5.11" "Driver Entry Points"
.SH NAME
segmap \- map device memory into user space
.SH SYNOPSIS
.LP
.nf
#include <sys/types.h>
#include <sys/mman.h>
#include <sys/param.h>
#include <sys/vm.h>
#include <sys/ddi.h>
#include <sys/sunddi.h>



\fBint prefix\fBsegmap\fR(\fBdev_t\fR \fIdev\fR, \fBoff_t\fR \fIoff\fR, \fBstruct as *\fIasp\fR, \fBcaddr_t *\fIaddrp\fR,
     \fBoff_t\fR \fIlen\fR, \fBunsigned int\fR \fIprot\fR, \fBunsigned int\fR \fImaxprot\fR, \fBunsigned int\fR \fIflags\fR,
     \fBcred_t *\fIcred_p\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Architecture independent level 2 (DKI only).
.SH ARGUMENTS
.sp
.ne 2
.mk
.na
.I dev
.ad
.RS 12n
.rt
Device whose memory is to be mapped.
.RE

.sp
.ne 2
.mk
.na
\fIoff\fR
.ad
.RS 12n
.rt
Offset within device memory at which mapping begins.
.RE

.sp
.ne 2
.mk
.na
.I asp
.ad
.RS 12n
.rt
Pointer to the address space into which the device memory should be
mapped.
.RE

.sp
.ne 2
.mk
.na
.I addrp
.ad
.RS 12n
.rt
Pointer to the address in the address space to which the device memory
should be mapped.
.RE

.sp
.ne 2
.mk
.na
.I len
.ad
.RS 12n
.rt
Length (in bytes) of the memory to be mapped.
.RE

.sp
.ne 2
.mk
.na
.I prot
.ad
.RS 12n
.rt
A bit field that specifies the protections. Possible settings are:
.sp
.ne 2
.mk
.na
.B PROT_READ
.ad
.RS 15n
.rt
Read access is desired.
.RE

.sp
.ne 2
.mk
.na
.B PROT_WRITE
.ad
.RS 15n
.rt
Write access is desired.
.RE

.sp
.ne 2
.mk
.na
.B PROT_EXEC
.ad
.RS 15n
.rt
Execute access is desired.
.RE

.sp
.ne 2
.mk
.na
.B PROT_USER
.ad
.RS 15n
.rt
User-level access is desired (the mapping is  being done as a result of a
.BR mmap (2)
system call).
.RE

.sp
.ne 2
.mk
.na
.B PROT_ALL
.ad
.RS 15n
.rt
All access is desired.
.RE

.RE

.sp
.ne 2
.mk
.na
.I maxprot
.ad
.RS 12n
.rt
Maximum protection flag possible for attempted mapping; the
\fBPROT_WRITE\fR bit may be masked out if the user opened the special file
read-only.
.RE

.sp
.ne 2
.mk
.na
\fIflags\fR
.ad
.RS 12n
.rt
Flags indicating type of mapping. Possible values are (other bits may be
set):
.sp
.ne 2
.mk
.na
.B MAP_SHARED
.ad
.RS 16n
.rt
Changes should be shared.
.RE

.sp
.ne 2
.mk
.na
.B MAP_PRIVATE
.ad
.RS 16n
.rt
Changes are private.
.RE

.RE

.sp
.ne 2
.mk
.na
.I cred_p
.ad
.RS 12n
.rt
Pointer to the  user credentials structure.
.RE

.SH DESCRIPTION
.sp
.LP
The
.B segmap()
entry point is an optional routine for character
drivers that support memory mapping.  The
.BR mmap (2)
system call, when
applied to a character special file, allows device memory to be mapped into
user space for direct access by the user application.
.sp
.LP
Typically, a character driver that needs to support the
.BR mmap (2)
system call supplies either an
.BR devmap "(9E) entry point, or both an"
.BR devmap (9E)
and a
.B segmap()
entry point routine (see the
.BR devmap (9E)
reference page). If no
.B segmap()
entry point is
provided for the driver,  \fBdevmap_setup\fR(9F) is used as a default.
.sp
.LP
A driver for a memory-mapped device would provide a
.B segmap()
entry
point if it:
.RS +4
.TP
.ie t \(bu
.el o
needs to maintain a separate context for each user mapping.  See
.BR devmap_setup (9F)
for details.
.RE
.RS +4
.TP
.ie t \(bu
.el o
needs to assign device access attributes to the user mapping.
.RE
.sp
.LP
The responsibilities of a
.B segmap()
entry point are:
.RS +4
.TP
.ie t \(bu
.el o
Verify that the range, defined by  \fIoffset\fR and
.IR len ,
to be
mapped is valid for  the device. Typically, this task is performed by
calling the  \fBdevmap\fR(9E) entry point. Note that if you are using
.BR ddi_devmap_segmap (9F)
or
.BR devmap_setup "(9F) to set up the mapping,"
it will call your \fBdevmap\fR(9E) entry point for you to validate the range
to be mapped.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Assign device access attributes to the mapping.  See
.BR ddi_devmap_segmap (9F),
and
.BR ddi_device_acc_attr (9S)
for
details.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Set up device contexts for the user mapping if your device requires
context switching.  See \fBdevmap_setup\fR(9F) for details.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Perform the mapping with
.BR ddi_devmap_segmap "(9F), or"
.BR devmap_setup (9F)
and return the status if it fails.
.RE
.SH RETURN VALUES
.sp
.LP
The
.B segmap()
routine should return
.B 0
if the driver is
successful in performing the memory map of its device address space into the
specified address space.
.sp
.LP
The
.B segmap()
must return an error number on failure. For example,
valid error numbers would be
.B ENXIO
if the offset/length pair
specified exceeds the limits of the device memory, or
.B EINVAL
if the
driver detects an invalid type of mapping attempted.
.sp
.LP
If one of the mapping routines
.B ddi_devmap_segmap()
or
\fBdevmap_setup()\fRfails, you must return the error number returned by the
respective routine.
.SH SEE ALSO
.sp
.LP
.BR mmap (2),
.BR devmap (9E),
.BR devmap_setup (9F),
.BR ddi_devmap_segmap (9F),
.BR ddi_device_acc_attr (9S)
.sp
.LP
.I Writing Device Drivers
