usr/src/man/man9e/srv.9e
'\" te
.\" Copyright 1989 AT&T
.\" Copyright (c) 2002 Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH srv 9E "12 Nov 1992" "SunOS 5.11" "Driver Entry Points"
.SH NAME
srv \- service queued messages
.SH SYNOPSIS
.LP
.nf
#include <sys/types.h>
#include <sys/stream.h>
#include <sys/stropts.h>
#include <sys/ddi.h>
#include <sys/sunddi.h>



\fBintprefix\fBrsrv\fR(\fBqueue_t *\fIq\fR/* read side */
.fi

.LP
.nf
\fBintprefix\fBwsrv\fR(\fBqueue_t *\fIq\fR/* write side */
.fi

.SH INTERFACE LEVEL
.sp
.LP
Architecture independent level 1 (DDI/DKI). This entry point is required
for
.BR STREAMS .
.SH ARGUMENTS
.sp
.ne 2
.mk
.na
.I q
.ad
.RS 5n
.rt
Pointer to the
.BR queue "(9S) structure."
.RE

.SH DESCRIPTION
.sp
.LP
The optional service
.B srv()
routine may be included in a \fBSTREAMS \fRmodule or driver for many possible reasons, including:
.RS +4
.TP
.ie t \(bu
.el o
to provide greater control over the flow of messages in a stream;
.RE
.RS +4
.TP
.ie t \(bu
.el o
to make it possible to defer the processing of some messages to avoid
depleting system resources;
.RE
.RS +4
.TP
.ie t \(bu
.el o
to combine small messages into larger ones, or break large messages into
smaller ones;
.RE
.RS +4
.TP
.ie t \(bu
.el o
to recover from resource allocation failure. A module's or driver's
.BR put (9E)
routine can test for the availability of a resource, and if it
is not available, enqueue the message for later processing by the
.B srv()
routine.
.RE
.sp
.LP
A message is first passed to a module's or driver's
.BR put (9E)
routine,
which may or may not do some processing. It must then either:
.RS +4
.TP
.ie t \(bu
.el o
Pass the message to the next stream component with
.BR putnext (9F).
.RE
.RS +4
.TP
.ie t \(bu
.el o
If a
.B srv()
routine has been included, it may call
.BR putq (9F)
to
place the message on the queue.
.RE
.sp
.LP
Once a message has been enqueued, the
.B STREAMS
scheduler controls the
service routine's invocation. The scheduler calls the service routines in
.B FIFO
order. The scheduler cannot guarantee a maximum delay
.B srv()
routine to be called except that it will happen before any user level
process are run.
.sp
.LP
Every stream component (stream head, module or driver) has limit values it
uses to implement flow control. Each component should check the tunable high
and low water marks to stop and restart the flow of message processing. Flow
control limits apply only between two adjacent components with
.BR srv()
routines.
.sp
.LP
.B STREAMS
messages can be defined to have up to 256 different
priorities to support requirements for multiple bands of data flow. At a
minimum, a stream must distinguish between normal (priority zero) messages
and high priority messages (such as
.BR M_IOCACK ).
High priority messages
are always placed at the head of the
.B srv()
routine's queue, after any
other enqueued high priority messages. Next are messages from all included
priority bands, which are enqueued in decreasing order of priority. Each
priority band has its own flow control limits. If a flow controlled band is
stopped, all lower priority bands are also stopped.
.sp
.LP
Once the
.B STREAMS
scheduler calls a
.B srv()
routine, it must
process all messages on its queue. The following steps are general
guidelines for processing messages. Keep in mind that many of the details of
how a
.B srv()
routine should be written depend of the implementation,
the direction of flow (upstream or downstream), and whether it is for a
module or a driver.
.RS +4
.TP
1.
Use
.BR getq "(9F) to get the next enqueued message."
.RE
.RS +4
.TP
2.
If the message is high priority, process (if appropriate) and pass to the
next stream component with
.BR putnext (9F).
.RE
.RS +4
.TP
3.
If it is not a high priority message (and therefore subject to flow
.RB "control), attempt to send it to the next stream component with a" " srv()"
routine. Use
.BR bcanputnext (9F)
to determine if this can be done.
.RE
.RS +4
.TP
4.
If the message cannot be passed, put it back on the queue with
.BR putbq (9F).
If it can be passed, process (if appropriate) and pass with
.BR putnext() .
.RE
.SH RETURN VALUES
.sp
.LP
Ignored.
.SH SEE ALSO
.sp
.LP
.BR put (9E),
.BR bcanput (9F),
.BR bcanputnext (9F),
.BR canput (9F),
.BR canputnext (9F),
.BR getq (9F),
.BR nulldev (9F),
.BR putbq (9F),
.BR putnext (9F),
.BR putq (9F),
.BR qinit (9S),
.BR queue (9S)
.sp
.LP
.I Writing Device Drivers
.sp
.LP
.I STREAMS Programming Guide
.SH WARNINGS
.sp
.LP
Each stream module must specify a read and a write service
.BR srv()
routine. If a service routine is not needed (because the
.B put()
routine
processes all messages), a
.B NULL
pointer should be placed in module's
.BR qinit (9S)
structure. Do not use
.BR nulldev (9F)
instead of the
.B NULL
pointer. Use  of\fBnulldev\fR(9F) for a
.B srv()
routine can
result in flow control errors.
