usr/src/man/man9e/tran_bus_reset.9e
'\" te
.\" Copyright (c) 1996 Sun Microsystems, Inc.  All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH tran_bus_reset 9E "17 Mar 1999" "SunOS 5.11" "Driver Entry Points"
.SH NAME
tran_bus_reset \- reset a SCSI bus
.SH SYNOPSIS
.LP
.nf
#include <sys/scsi/scsi.h> int \fIprefix\fR

\fBtran_bus_reset\fR(\fBdev_info_t\fR \fI*hba_dip\fR, \fBint\fR \fIlevel\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I hba_dip
.ad
.RS 11n
.rt
The
.B dev_info_t
pointer associated with the SCSI HBA.
.RE

.sp
.ne 2
.mk
.na
.I level
.ad
.RS 11n
.rt
The level of reset required.
.RE

.SH DESCRIPTION
.sp
.LP
The
.B tran_bus_reset()
vector in the
.BR scsi_hba_tran "(9S) structure"
should be initialized during the HBA driver's
.BR attach (9E).
It is an HBA
entry point to be called when a user initiates a bus reset through device
control interfaces.
.sp
.LP
.B tran_bus_reset()
must reset the SCSI bus without resetting targets.
.sp
.LP
.I level
will be one of the following:
.sp
.ne 2
.mk
.na
.B RESET_BUS
.ad
.RS 13n
.rt
Reset the SCSI bus only, not the targets.
.RE

.sp
.LP
Implementation is hardware specific. If it is not possible to reset the
SCSI bus without changing the state and operating mode of the targets, the
HBA driver should not initialize this vector or return failure.
.SH RETURN VALUES
.sp
.LP
.B tran_bus_reset()
should return:
.sp
.ne 2
.mk
.na
.B 1
.ad
.RS 5n
.rt
on success.
.RE

.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 5n
.rt
on failure.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for a description of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
.BR attributes (5),
.BR tran_quiesce (9E),
.BR scsi_hba_tran (9S)
