usr/src/man/man9e/tran_tgt_probe.9e
'\" te
.\" Copyright (c) 1993, Sun Microsystems, Inc.  All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH tran_tgt_probe 9E "1 Nov 1993" "SunOS 5.11" "Driver Entry Points"
.SH NAME
tran_tgt_probe \- request to probe SCSI bus for a particular target
.SH SYNOPSIS
.LP
.nf
#include <sys/scsi/scsi.h>



\fBint prefix\fBtran_tgt_probe\fR(\fBstruct scsi_device *\fIsd\fR, \fBint (*\fIwaitfunc\fR,
     \fBvoid));\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris architecture specific (Solaris DDI).
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I sd
.ad
.RS 13n
.rt
Pointer to a
.BR scsi_device "(9S) structure."
.RE

.sp
.ne 2
.mk
.na
.I waitfunc
.ad
.RS 13n
.rt
Pointer to either
.B NULL_FUNC
or
.BR SLEEP_FUNC .
.RE

.SH DESCRIPTION
.sp
.LP
The
.B tran_tgt_probe()
vector in the
.BR scsi_hba_tran "(9S) structure"
may be initialized during the
.B HBA
driver's
.BR attach (9E)
to point
to a function to be called by
.BR scsi_probe "(9F) when called by a target"
driver during \fBprobe\fR(9E) and \fBattach\fR(9E) to probe for a particular
.B SCSI
target on the bus. In the absence of an \fBHBA\fR-specific
.B tran_tgt_probe()
function, the default
.BR scsi_probe (9F)
behavior
is supplied by the function
.BR scsi_hba_probe (9F).
.sp
.LP
The possible choices the
.B HBA
driver may make are:
.RS +4
.TP
.ie t \(bu
.el o
Initialize the
.B tran_tgt_probe
vector to point to
.BR scsi_hba_probe (9F),
which results in the same behavior.
.RE
.RS +4
.TP
.ie t \(bu
.el o
Initialize the
.B tran_tgt_probe
vector to point to a private function
in the
.BR HBA ,
which may call \fBscsi_hba_probe\fR(9F) before or after
any necessary processing, as long as all the defined
.BR scsi_probe (9F)
semantics are preserved.
.RE
.sp
.LP
.I waitfunc
indicates what
.B tran_tgt_probe()
should do when
resources are not available:
.sp
.ne 2
.mk
.na
.B NULL_FUNC
.ad
.RS 15n
.rt
Do not wait for resources.  See  \fBscsi_probe\fR(9F) for defined return
values if no resources are available.
.RE

.sp
.ne 2
.mk
.na
.B SLEEP_FUNC
.ad
.RS 15n
.rt
Wait indefinitely for resources.
.RE

.SH SEE ALSO
.sp
.LP
.BR attach (9E),
.BR probe (9E),
.BR tran_tgt_free (9E),
.BR tran_tgt_init (9E),
.BR scsi_hba_probe (9F),
.BR scsi_probe (9F),
.BR scsi_device (9S),
.BR scsi_hba_tran (9S)
.sp
.LP
.I Writing Device Drivers
