usr/src/man/man9e/tran_reset_notify.9e
'\" te
.\" Copyright (c) 1997, Sun Microsystems, Inc.  All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH tran_reset_notify 9E "30 Aug 1995" "SunOS 5.11" "Driver Entry Points"
.SH NAME
tran_reset_notify \- request to notify SCSI target of bus reset
.SH SYNOPSIS
.LP
.nf
#include <sys/scsi/scsi.h>



\fBint prefix\fBtran_reset_notify\fR(\fBstruct scsi_address *\fIap\fR, \fBint\fR \fIflag\fR,
     \fBvoid (*\fIcallback\fR, \fBcaddr_t),caddr_t\fR \fIarg\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris architecture specific (Solaris DDI).
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I ap
.ad
.RS 13n
.rt
Pointer to the
.BR scsi_address "(9S) structure."
.RE

.sp
.ne 2
.mk
.na
.I flag
.ad
.RS 13n
.rt
A flag indicating registration or cancellation of a notification request.
.RE

.sp
.ne 2
.mk
.na
.I callback
.ad
.RS 13n
.rt
A pointer to the target driver's reset notification function.
.RE

.sp
.ne 2
.mk
.na
.I arg
.ad
.RS 13n
.rt
The callback function argument.
.RE

.SH DESCRIPTION
.sp
.LP
The
.B tran_reset_notify()
entry point is called when a target driver
requests notification of a bus reset.
.sp
.LP
The
.B tran_reset_notify()
vector in the
.BR scsi_hba_tran (9S)
structure may be initialized in the
.B HBA
driver's
.BR attach (9E)
routine to point to the
.B HBA
entry point to be called when a target
driver calls
.BR scsi_reset_notify (9F).
.sp
.LP
The argument
.I flag
is used to register or cancel the notification.
The supported values for
.I flag
are as follows:
.sp
.ne 2
.mk
.na
.B SCSI_RESET_NOTIFY
.ad
.RS 22n
.rt
Register
.I callback
as the reset notification function for the
target.
.RE

.sp
.ne 2
.mk
.na
.B SCSI_RESET_CANCEL
.ad
.RS 22n
.rt
Cancel the reset notification request for the target.
.RE

.sp
.LP
The
.B HBA
driver maintains a list of reset notification requests
registered by the target drivers.   When a bus reset occurs, the  \fBHBA \fRdriver notifies registered target drivers by calling the callback
routine,
.IR callback ,
with the argument,
.IR arg ,
for each registered
target.
.SH RETURN VALUES
.sp
.LP
For
.B SCSI_RESET_NOTIFY
requests,
.B tran_reset_notify()
must
return
.B DDI_SUCCESS
if the notification request has been accepted, and
.B DDI_FAILURE
otherwise.
.sp
.LP
For
.B SCSI_RESET_CANCEL
requests,
.B tran_reset_notify()
must
return
.B DDI_SUCCESS
if the notification request has been canceled, and
.B DDI_FAILURE
otherwise.
.SH SEE ALSO
.sp
.LP
.BR attach (9E),
.BR scsi_ifgetcap (9F),
.BR scsi_reset_notify (9F),
.BR scsi_address (9S),
.BR scsi_hba_tran (9S)
.sp
.LP
.I Writing Device Drivers
