usr/src/man/man9e/tran_quiesce.9e
'\" te
.\" Copyright (c) 2000 Sun Microsystems, Inc.  All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH tran_quiesce 9E "31 Jan 1999" "SunOS 5.11" "Driver Entry Points"
.SH NAME
tran_quiesce, tran_unquiesce \- quiesce and unquiesce a SCSI bus
.SH SYNOPSIS
.LP
.nf
#include <sys/scsi/scsi.h>

\fBint prefix\fBtran_quiesce\fR(\fBdev_info_t\fR \fI*hba_dip\fR);
.fi

.LP
.nf
\fBint prefix\fBtran_unquiesce\fR(\fBdev_info_t\fR \fI*hba_dip\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris DDI
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I hba_dip
.ad
.RS 11n
.rt
The
.B dev_info_t
pointer associated with the SCSI HBA.
.RE

.SH DESCRIPTION
.sp
.LP
The
.B tran_quiesce()
and
.B tran_unquiesce()
vectors in the
.BR scsi_hba_tran (9S)
structure should be initialized during the HBA
driver's
.BR attach (9E).
They are HBA entry points to be called when a
user initiates quiesce and unquiesce operations through device control
interfaces.
.sp
.LP
.B tran_quiesce()
should wait for all outstanding commands to complete
.RB "and blocks (or queues) any I/O requests issued." " tran_unquiesce()"
should allow I/O activities to resume on the SCSI bus.
.sp
.LP
Implementation is hardware specific.
.SH RETURN VALUES
.sp
.LP
.B tran_quiesce()
and
.B tran_unquiesce()
should return:
.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 12n
.rt
Successful completion.
.RE

.sp
.ne 2
.mk
.na
.B Non-zero
.ad
.RS 12n
.rt
An error occurred.
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for a description of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
.BR attributes (5),
.BR tran_bus_reset (9E),
.BR scsi_hba_tran (9S)
