usr/src/man/man9e/tran_dmafree.9e
'\" te
.\" Copyright (c) 1997, Sun Microsystems, Inc.  All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH tran_dmafree 9E "30 Aug 1995" "SunOS 5.11" "Driver Entry Points"
.SH NAME
tran_dmafree \- SCSI HBA DMA deallocation entry point
.SH SYNOPSIS
.LP
.nf
#include <sys/scsi/scsi.h>



\fB void prefix\fBtran_dmafree\fR(\fBstruct scsi_address *\fIap\fR, \fBstruct scsi_pkt *\fIpkt\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris architecture specific (Solaris DDI).
.SH ARGUMENTS
.sp
.ne 2
.mk
.na
.I ap
.ad
.RS 8n
.rt
A pointer to a
.I scsi_address
structure. See
.BR scsi_address (9S).
.RE

.sp
.ne 2
.mk
.na
.I pkt
.ad
.RS 8n
.rt
A pointer to a
.I scsi_pkt
structure. See
.BR scsi_pkt (9S).
.RE

.SH DESCRIPTION
.sp
.LP
The
.B tran_dmafree()
vector in the
.I scsi_hba_tran
structure must
be initialized during the
.B HBA
driver's
.B attach()
to point to an
.B HBA
entry point to be called when a target driver calls
.BR scsi_dmafree (9F).
See
.BR attach "(9E) and"
.BR scsi_hba_tran (9S).
.sp
.LP
.B tran_dmafree()
must deallocate any
.B DMA
resources previously
allocated to this
.I pkt
in a call to
.BR tran_init_pkt (9E).
.B tran_dmafree()
should not free the structure pointed to by
.IR pkt
itself. Since  \fBtran_destroy_pkt\fR(9E) must also free \fBDMA
\fRresources, it is important that the \fBHBA\fR driver keeps accurate note
of whether
.BR scsi_pkt "(9S) structures have"
.B DMA
resources
allocated.
.SH SEE ALSO
.sp
.LP
.BR attach (9E),
.BR tran_destroy_pkt (9E),
.BR tran_init_pkt (9E),
.BR scsi_dmafree (9F),
.BR scsi_dmaget (9F),
.BR scsi_hba_attach (9F),
.BR scsi_init_pkt (9F),
.BR scsi_address (9S),
.BR scsi_hba_tran (9S),
.BR scsi_pkt (9S)
.sp
.LP
.I Writing Device Drivers
.SH NOTES
.sp
.LP
A target driver may call
.B tran_dmafree()
on packets for which no
.B DMA
resources were allocated.
