usr/src/man/man9e/tran_tgt_free.9e
'\" te
.\" Copyright (c) 1995, Sun Microsystems, Inc.  All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH tran_tgt_free 9E "1 Nov 1993" "SunOS 5.11" "Driver Entry Points"
.SH NAME
tran_tgt_free \- request to free HBA resources allocated on behalf of a target
.SH SYNOPSIS
.LP
.nf
#include <sys/scsi/scsi.h>



\fBvoid prefix\fBtran_tgt_free\fR(\fBdev_info_t *\fIhba_dip\fR, \fBdev_info_t *\fItgt_dip\fR,
     \fBscsi_hba_tran_t *\fIhba_tran\fR, \fBstruct scsi_device *\fIsd\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris architecture specific (Solaris DDI).
.SH PARAMETERS
.sp
.ne 2
.mk
.na
.I hba_dip
.ad
.RS 13n
.rt
Pointer to a
.B dev_info_t
structure, referring to the
.B HBA
device
instance.
.RE

.sp
.ne 2
.mk
.na
.I tgt_dip
.ad
.RS 13n
.rt
Pointer to a
.B dev_info_t
structure, referring to the target device
instance.
.RE

.sp
.ne 2
.mk
.na
.I hba_tran
.ad
.RS 13n
.rt
Pointer to a  \fBscsi_hba_tran\fR(9S) structure, consisting of the \fBHBA\fR's
transport vectors.
.RE

.sp
.ne 2
.mk
.na
.I sd
.ad
.RS 13n
.rt
Pointer to a
.BR scsi_device "(9S) structure, describing the target."
.RE

.SH DESCRIPTION
.sp
.LP
The
.B tran_tgt_free()
vector in the
.BR scsi_hba_tran (9S)
structure may be
initialized during the
.B HBA
driver's
.BR attach (9E)
to point to an
.B HBA
driver function to be called by the system when an instance of a target
device is being detached.  The
.B tran_tgt_free()
vector, if not
.IR NULL ,
is called after the target device instance has returned successfully from its
.BR detach (9E)
entry point, but before the
.B dev_info
node structure is
removed from the system. The
.B HBA
driver should release any resources
allocated during its
.B tran_tgt_init()
or
.BR tran_tgt_probe()
initialization performed for this target device instance.
.SH SEE ALSO
.sp
.LP
.BR attach (9E),
.BR detach (9E),
.BR tran_tgt_init (9E),
.BR tran_tgt_probe (9E),
.BR scsi_device (9S),
.BR scsi_hba_tran (9S)
.sp
.LP
.I Writing Device Drivers
