usr/src/man/man9e/tran_abort.9e
'\" te
.\" Copyright (c) 2005, Sun Microsystems, Inc.   All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH tran_abort 9E "17 Aug 2005" "SunOS 5.11" "Driver Entry Points"
.SH NAME
tran_abort \- abort a SCSI command
.SH SYNOPSIS
.LP
.nf
#include <sys/scsi/scsi.h>



\fB int prefix\fBtran_abort\fR(\fBstruct scsi_address *\fIap\fR,
     \fBstruct scsi_pkt *\fIpkt\fR);
.fi

.SH INTERFACE LEVEL
.sp
.LP
Solaris architecture specific (Solaris DDI).
.SH ARGUMENTS
.sp
.ne 2
.mk
.na
.I ap
.ad
.RS 8n
.rt
Pointer to a
.BR scsi_address "(9S) structure."
.RE

.sp
.ne 2
.mk
.na
.I pkt
.ad
.RS 8n
.rt
Pointer to a
.BR scsi_pkt "(9S) structure."
.RE

.SH DESCRIPTION
.sp
.LP
The
.B tran_abort()
vector in the
.BR scsi_hba_tran "(9S) structure must"
be initialized during the HBA driver's
.BR attach (9E)
to point to an HBA
entry point to be called when a target driver calls
.BR scsi_abort (9F).
.sp
.LP
.B tran_abort()
should attempt to abort the command
.I pkt
that has
been transported to the HBA.  If
.I pkt
is
.BR NULL ,
the HBA driver
should attempt to abort all outstanding packets for the target/logical unit
addressed by
.IR ap .
.sp
.LP
Depending on the state of a particular command in the transport layer, the
HBA driver may not be able to abort the command.
.sp
.LP
While the abort is taking place, packets issued to the transported layer
may or may not be aborted.
.sp
.LP
For each packet successfully aborted,
.B tran_abort()
must set the
.B pkt_reason
to
.BR CMD_ABORTED ,
and
.B pkt_statistics
must be
.B OR'ed
with
.B STAT_ABORTED
\&.
.SH RETURN VALUES
.sp
.LP
.B tran_abort()
must return:
.sp
.ne 2
.mk
.na
.B 1
.ad
.RS 6n
.rt
upon success or partial success.
.RE

.sp
.ne 2
.mk
.na
.B 0
.ad
.RS 6n
.rt
upon failure.
.RE

.SH CONTEXT
.sp
.LP
The
.B tran_abort()
function can be called from user or interrupt
context. This requirement comes from
.BR scsi_abort() .
.SH SEE ALSO
.sp
.LP
.BR attach (9E),
.BR scsi_abort (9F),
.BR scsi_hba_attach (9F),
.BR scsi_address (9S),
.BR scsi_hba_tran (9S),
.BR scsi_pkt (9S)
.sp
.LP
.I Writing Device Drivers
.SH NOTES
.sp
.LP
If
.B pkt_reason
already indicates that an earlier error had occurred,
.B tran_abort()
should not overwrite
.B pkt_reason
with
.BR CMD_ABORTED .
