usr/src/man/man7m/connld.7m
'\" te
.\" Copyright 2004 AT&T
.\" Copyright (C) 2004, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH connld 7M "3 May 2004" "SunOS 5.11" "STREAMS Modules"
.SH NAME
connld \- line discipline for unique stream connections
.SH SYNOPSIS
.LP
.nf
\fB#include </sys/steam.h>\fR
.fi

.LP
.nf
\fBint ioctl(\fIfd\fR,I_PUSH,"connld");\fR
.fi

.SH DESCRIPTION
.sp
.LP
.B connld
is a STREAMS-based module that provides unique connections
between server and client processes. It can only be pushed (see
.BR streamio (7I))
onto one end of a STREAMS-based pipe that may
subsequently be attached to a name in the file system name space with
.BR fattach (3C).
After the pipe end is attached, a new pipe is created
internally when an  originating process attempts to
.BR open (2)
or
.BR creat (2)
the file system name. A file descriptor for one end of the
new pipe is packaged into a message identical to that for the ioctl
.B I_SENDFD
(see  \fBstreamio\fR(7I)) and is transmitted along the stream
to the server process on the  other end. The originating process is blocked
until the server responds.
.sp
.LP
The server responds to the
.B I_SENDFD
request by accepting the file
descriptor through the
.B I_RECVFD
ioctl message. When this happens, the
file descriptor associated with the other end of the new pipe is transmitted
to the originating process as the file descriptor returned from
.BR open (2)
or
.BR creat (2).
.sp
.LP
If the server does not respond to the
.B I_SENDFD
request, the stream
that the
.B connld
module is pushed on becomes uni-directional because
the server  will not be able to retrieve any data off the stream until the
.B I_RECVFD
request is issued. If the server process exits before issuing
the
.B I_RECVFD
request, the
.BR open (2)
or the
.BR creat (2)
invocation will fail and return -1 to the originating process.
.sp
.LP
When the
.B connld
module is pushed onto a pipe, it ignores messages
going back and forth  through the pipe.
.SH ERRORS
.sp
.LP
On success, an open of
.B connld
returns 0. On failure,
.B errno
is
set to the following values:
.sp
.ne 2
.mk
.na
.B EINVAL
.ad
.RS 11n
.rt
A stream onto which
.B connld
is being pushed is not a pipe or the pipe
does not have a write queue pointer pointing to a stream head read queue.
.RE

.sp
.ne 2
.mk
.na
.B EINVAL
.ad
.RS 11n
.rt
The other end of the pipe onto which
.B connld
is being pushed is linked
under a multiplexor.
.RE

.sp
.ne 2
.mk
.na
.B EPIPE
.ad
.RS 11n
.rt
.B connld
is being pushed onto a pipe end whose other end is no longer
there.
.RE

.sp
.ne 2
.mk
.na
.B ENOMEM
.ad
.RS 11n
.rt
An internal pipe could not be created.
.RE

.sp
.ne 2
.mk
.na
.B ENXIO
.ad
.RS 11n
.rt
An
.B M_HANGUP
message is at the stream head of the pipe onto which
.B connld
is being pushed.
.RE

.sp
.ne 2
.mk
.na
.B EAGAIN
.ad
.RS 11n
.rt
Internal data structures could not be allocated.
.RE

.sp
.ne 2
.mk
.na
.B ENFILE
.ad
.RS 11n
.rt
A file table entry could not be allocated.
.RE

.SH SEE ALSO
.sp
.LP
.BR creat (2),
.BR open (2),
.BR fattach (3C),
.BR streamio (7I)
.sp
.LP
.I STREAMS Programming Guide
