usr/src/man/man7m/pckt.7m
'\" te
.\" Copyright 1989 AT&T  Copyright (c) 1990, Sun Microsystems, Inc.  All Rights Reserved
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH pckt 7M "3 Jul 1990" "SunOS 5.11" "STREAMS Modules"
.SH NAME
pckt \- STREAMS Packet Mode module
.SH SYNOPSIS
.LP
.nf
int ioctl(\fI fd, \fRI_PUSH, "pckt");
.fi

.SH DESCRIPTION
.sp
.LP
.B pckt
is a STREAMS module that may be used with a pseudo terminal to
packetize certain messages. The
.B pckt
module should be pushed (see
.B I_PUSH
on 
.BR streamio (7I))
onto the master side of a pseudo
terminal.
.sp
.LP
Packetizing is performed by prefixing a message with an
.BR M_PROTO
message. The original message type is stored in the 1 byte data portion of
the
.B M_PROTO
message.
.sp
.LP
On the read-side, only the
.BR M_PROTO ,
.BR M_PCPROTO ,
.BR M_STOP ,
.BR M_START ,
.BR M_STOPI ,
.BR M_STARTI ,
.BR M_IOCTL ,
.BR M_DATA ,
.BR M_FLUSH ,
and
.B M_READ
messages are packetized. All other message
types are passed upstream unmodified.
.sp
.LP
Since all unread state information is held in the master's stream head read
queue, flushing of this queue is disabled.
.sp
.LP
On the write-side, all messages are sent down unmodified.
.sp
.LP
With this module in place, all reads from the master side of the pseudo
terminal should be performed with the
.BR getmsg (2)
or
.BR getpmsg ()
function. The control part of the message contains the message type. The
data part contains the actual data associated with that message type. The
onus is on the application to separate the data into its component parts.
.SH SEE ALSO
.sp
.LP
.BR getmsg (2),
.BR ioctl (2),
.BR ldterm (7M),
.BR ptem (7M),
.BR streamio (7I),
.BR termio (7I)
.sp
.LP
.I STREAMS Programming Guide
