usr/src/man/man7m/ptem.7m
'\" te
.\" Copyright 1989 AT&T
.\" Copyright (C) 1999, Sun Microsystems, Inc. All Rights Reserved
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License (the "License").
.\" You may not use this file except in compliance with the License.
.\"
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
.\" or http://www.opensolaris.org/os/licensing.
.\" See the License for the specific language governing permissions
.\" and limitations under the License.
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ptem 7M "3 Jul 1990" "SunOS 5.11" "STREAMS Modules"
.SH NAME
ptem \- STREAMS Pseudo Terminal Emulation module
.SH SYNOPSIS
.LP
.nf
\fBint ioctl(\fIfd\fR, \fBI_PUSH\fR,\fB "ptem");\fR
.fi

.SH DESCRIPTION
.sp
.LP
.B ptem
is a STREAMS module that, when used in conjunction with a line
discipline and pseudo terminal driver, emulates a terminal.
.sp
.LP
The
.B ptem
module must be pushed (see
.BR I_PUSH ,
.BR streamio (7I))
onto the slave side of a pseudo terminal STREAM, before
the
.BR ldterm "(7M) module is pushed."
.sp
.LP
On the write-side, the
.BR TCSETA ,
.BR TCSETAF ,
.BR TCSETAW ,
.BR TCGETA ,
.BR TCSETS ,
.BR TCSETSW ,
.BR TCSETSF ,
.BR TCGETS ,
.BR TCSBRK ,
.BR JWINSIZE ,
.BR TIOCGWINSZ ,
and
.BR TIOCSWINSZ
.BR "termio ioctl" (2)
messages are processed and acknowledged. If
remote mode is not in effect,
.B ptem
handles the
.B TIOCSTI
ioctl by
copying the argument bytes into an
.B M_DATA
message and passing it back
up the read side. Regardless of the remote mode setting, \fBptem\fR
acknowledges the ioctl and passes a copy of it downstream for possible
further processing. A hang up (that is,
.BR "stty 0" )
is converted to a zero
length
.B M_DATA
message and passed downstream. Termio
.B cflags
and
window row and column information are stored locally one per stream.
.B M_DELAY
messages are discarded. All other messages are passed
downstream unmodified.
.sp
.LP
On the read-side all messages are passed upstream unmodified with the
following exceptions. All
.B M_READ
and
.B M_DELAY
messages are freed
in both directions. A
.B TCSBRK
ioctl is converted to an
.BR M_BREAK
message and  passed upstream and an acknowledgement is returned downstream.
A
.B TIOCSIGNAL
ioctl is converted into an
.B M_PCSIG
message,  and
passed upstream and an acknowledgement is returned downstream. Finally a
.B TIOCREMOTE
ioctl is converted into an
.B M_CTL
message,
acknowledged, and passed upstream; the resulting mode is retained for use in
subsequent
.B TIOCSTI
parsing.
.SH FILES
.sp
.ne 2
.mk
.na
\fB<sys/ptem.h\fR>\fR
.ad
.RS 17n
.rt

.RE

.SH SEE ALSO
.sp
.LP
.BR stty (1),
.BR ioctl (2),
.BR ldterm (7M),
.BR pckt (7M),
.BR streamio (7I),
.BR termio (7I)
.sp
.LP
.I STREAMS Programming Guide
