usr/src/man/man7m/sppptun.7m
'\" te
.\" Copyright (c) 2001 by Sun Microsystems, Inc.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\"  All rights reserved.
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH sppptun 7M "2001" "SunOS 5.11" "STREAMS Modules"
.SH NAME
sppptun \- PPP tunneling pseudo-driver
.SH SYNOPSIS
.LP
.nf
\fB/dev/sppptun\fR
.fi

.SH DESCRIPTION
.sp
.LP
The
.B /dev/sppptun
pseudo-driver provides an interface for tunneling
PPP sessions.  This interface provides PPP over Ethernet (PPPoE) service
with Solaris PPP.
.SH FILES
.sp
.ne 2
.mk
.na
.B /dev/sppptun
.ad
.RS 17n
.rt
Solaris PPP tunneling device driver.
.RE

.SH SEE ALSO
.sp
.LP
.BR pppoec (1M),
.BR pppoed (1M),
.BR sppptun (1M)
.sp
.LP
\fIRFC 2516 \(em A Method for Transmitting PPP Over Ethernet (PPPoE).\fR
Mamakos, et. al. February 1999.
