usr/src/man/man7m/ttcompat.7m
'\" te
.\" Copyright (c) 2001, Sun Microsystems, Inc.  All Rights Reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" Copyright 2001 AT&T
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH ttcompat 7M "2 Oct 2001" "SunOS 5.11" "STREAMS Modules"
.SH NAME
ttcompat \- V7, 4BSD and XENIX STREAMS compatibility module
.SH SYNOPSIS
.LP
.nf
#define BSD_COMP
#include <sys/stropts.h>
#include <sys/ioctl.h>
ioctl(\fIfd\fR, I_PUSH, "ttcompat");
.fi

.SH DESCRIPTION
.sp
.LP
.B ttcompat
is a STREAMS module that translates the
.B ioctl
calls
supported by the older
.B "Version 7,"
.B 4BSD,
and
.BR XENIX
terminal drivers into the
.B ioctl
calls supported by the
.BR termio
interface (see
.BR termio (7I)).
All other messages pass through this
module unchanged; the behavior of
.B read
and
.B write
calls is
unchanged, as is the behavior of
.B ioctl
calls other than the ones
supported by
.BR ttcompat .
.sp
.LP
This module can be automatically pushed onto a stream using the
.B autopush
mechanism when a terminal device is opened; it does not have
to be explicitly  pushed onto a stream. This module requires that the
.B termios
interface be supported by the modules and the application can
push the driver downstream. The
.B "TCGETS, TCSETS,"
and
.B TCSETSF ioctl
calls must be supported. If any information set or
fetched by those
.B ioctl
calls is not supported by the modules and
driver downstream, some of the
.B V7/4BSD/XENIX
functions may not be
supported. For example, if the
.B CBAUD
bits in the
.B c_cflag
field
are not supported, the functions provided by the
.B sg_ispeed
and
.B sg_ospeed
fields of the
.B sgttyb
structure (see below) will not be
supported. If the
.B "TCFLSH ioctl"
is not supported, the function
provided by the
.B "TIOCFLUSH ioctl"
will not be supported. If the
.B TCXONC ioctl
is not supported, the functions provided by the
.B TIOCSTOP
and
.B "TIOCSTART ioctl"
calls will not be supported.
If the
.B TIOCMBIS
and
.B "TIOCMBIC ioctl"
calls are not
supported, the functions provided by the
.B TIOCSDTR
and
.BR TIOCCDTR
.B ioctl
calls will not be supported.
.sp
.LP
The basic
.B ioctl
calls use the
.B sgttyb
structure defined by
.RB < sys/ttold.h "> (included by <" sys/ioctl.h >):
.sp
.in +2
.nf
struct   sgttyb   {
	char	sg_ispeed;
	char	sg_ospeed;
	char	sg_erase;
	char	sg_kill;
	int	sg_flags;
};
.fi
.in -2

.sp
.LP
The
.B sg_ispeed
and
.B sg_ospeed
fields describe the  input and
output speeds of the device.  If the speed set on the device is over
B38400, then it is reported as B38400 for compatibility reasons. If it is
set to B38400 and  the current speed is over B38400, the change is ignored.
See TIOCGETP and TIOCSETP below. The
.B sg_erase
and
.B "sg_kill fields"
of the argument structure specify the erase and kill characters
respectively, and reflect the values in the VERASE and VKILL members of the
.B c_cc field
of the
.B termios
structure.
.sp
.LP
The
.B sg_flags
field of the argument structure contains several flags
that determine the system's treatment of the terminal. They are mapped into
flags in fields of the terminal state, represented by the
.B termios
structure.
.sp
.LP
Delay type
.B 0
(NL0,  TAB0, CR0, FF0,  BS0) is  always mapped into the
equivalent delay type
.B 0
in the
.B c_oflag
field of the
.B termios
structure. Other delay  mappings are  performed as follows:
.sp

.sp
.TS
tab() box;
cw(0i) |cw(5.5i)
lw(0i) |lw(5.5i)
.
sg_flagsc_oflag
_
BS1BS1
_
FF1VT1
_
CR1CR2
_
CR2CR3
_
CR3CR0 (not supported)
_
TAB1TAB1
_
TAB2TAB2
_
XTABSTAB3
_
NL1ONLRET|CR1
_
NL2NL1
_
NL3NL0 (not supported)
.TE

.sp
.LP
If previous
.B TIOCLSET
or
.B "TIOCLBIS ioctl"
calls have not
selected
.B LITOUT
or
.B PASS8
mode, and if
.B RAW
mode is not
selected, the
.B ISTRIP
flag is set in the
.B c_iflag
field of the
.B termios
structure, and the
.B EVENP
and
.B ODDP
flags control
the parity of characters sent to the terminal and accepted from the
terminal, as follows:
.sp
.ne 2
.mk
.na
.B 0 (neither EVENP nor ODDP)
.ad
.RS 30n
.rt
Parity is not to be generated on output or checked on input. The character
size is set to
.B CS8
and the
.B PARENB
flag is cleared in the
.B c_cflag
field of the
.B termios
structure.
.RE

.sp
.ne 2
.mk
.na
.B EVENP
.ad
.RS 30n
.rt
Even parity characters are to be generated on output and accepted on input.
.RB "The INPCK  flag is set in the " c_iflag " field of the " termios 
structure, the character size is set to
.B CS7
and the
.B PARENB
flag
is set in the
.B c_iflag
field of the
.B termios
structure.
.RE

.sp
.ne 2
.mk
.na
.B ODDP
.ad
.RS 30n
.rt
Odd parity characters are to be generated on output and accepted on input.
The
.B INPCK
flag is set in the
.BR c_iflag ,
the character size is set
to
.B CS7
and the
.B PARENB
and
.B PARODD
flags are set in the
.B c_iflag
field  of the
.B termios
structure.
.RE

.sp
.ne 2
.mk
.na
.B EVENP|ODDP or ANYP
.ad
.RS 30n
.rt
Even parity  characters are to be generated  on output and characters of
either parity are to be  accepted on input. The
.B INPCK
flag is cleared
in the
.B c_iflag
field, the character size is set to
.B CS7
and the
.B PARENB
.RB "flag is set in the " c_iflag " field of the " termios 
structure.
.RE

.sp
.LP
The
.B RAW
flag disables all output processing (the
.B OPOST
flag in
the \fBc_oflag\fR field, and the \fBXCASE\fR and
.B IEXTEN
flags in the
.B c_iflag
field are cleared in the termios structure) and input
.RB "processing (all flags  in the " c_iflag " field other than the " IXOFF 
and
.B IXANY
flags  are cleared  in the
.B termios
structure).  Eight
bits of data, with no parity bit are accepted on input and generated on
output; the character size is set to
.B CS8
and the
.B PARENB
and
.B PARODD
flags are cleared in the
.B c_cflag
field of the
.B termios
structure. The signal-generating and line-editing control
characters are disabled by clearing the
.B ISIG
and
.B ICANON
flags in
the
.B c_iflag
field of the termios structure.
.sp
.LP
The
.B CRMOD
flag turns input carriage return characters into linefeed
characters, and output linefeed characters to be sent as a carriage return
followed by a linefeed. The
.B ICRNL
flag in the
.B c_iflag
field, and
the
.B OPOST
and
.B ONLCR
flags in the
.BR "c_oflag field" ,
are set in
the termios structure.
.sp
.LP
The
.B LCASE
flag maps upper-case letters in the
.B ASCII
character
set to their lower-case equivalents on input (the
.B IUCLC
flag is set in
.RB "the " c_iflag " field), and maps lower-case letters in the " ASCII 
.RB "character set to their upper-case equivalents on output (the" " OLCUC"
flag is set in the
.B c_oflag
field). Escape sequences are accepted on
input, and generated on output, to handle certain
.B ASCII
characters not
supported by older terminals (the
.B XCASE
flag is set in the
.B c_lflag
field).
.sp
.LP
Other flags are directly mapped to flags in the
.B termios
structure:
.sp

.sp
.TS
tab() box;
cw(0i) |cw(5.5i)
lw(0i) |lw(5.5i)
.
sg_flagsFlags in termios structure
_
CBREAKComplement of ICANON in c_lflag field
_
ECHOECHO in c_lflag field
_
TANDEMIXOFF in c_iflag field
.TE

.sp
.LP
Another structure associated with each terminal specifies characters that
are special in both the old Version 7 and the newer
.B 4BSD
terminal
interfaces. The following structure is defined by
.BR <sys/ttold.h> :
.sp
.in +2
.nf
struct   tchars   {
          char t_intrc;     /* interrupt */
          char t_quitc;     /* quit */
          char t_startc; /* start output */
          char t_stopc;     /* stop output */
          char t_eofc;        /* end-of-file */
          char t_brkc;        /* input delimiter (like nl) */
     };
.fi
.in -2

.sp
.LP
.B XENIX
defines the
.B tchar
structure as
.BR tc .
The characters
are mapped to members of the
.B c_cc
field of the
.B termios
structure
as follows:
.sp
.in +2
.nf
       tchars                c_cc index
       t_intrc               VINTR
       t_quitc               VQUIT
       t_startc              VSTART
       t_stopc               VSTOP
       t_eofc                VEOF
       t_brkc                VEOL
.fi
.in -2

.sp
.LP
Also associated with each terminal is a local flag word (\fBTIOCLSET\fR and
.BR TIOCLGET ),
specifying flags  supported by the new 4BSD terminal
interface. Most of these flags are directly mapped to flags in the
.B termios
structure:
.sp

.sp
.TS
tab() box;
cw(0i) |cw(5.5i)
lw(0i) |lw(5.5i)
.
Local flagsFlags in termios structure
_
LCRTBSNot supported
_
LPRTERAECHOPRT in the c_lflag field
_
LCRTERAECHOE in the c_lflag field
_
LTILDENot supported
_
LMDMBUFNot supported
_
LTOSTOPTOSTOP in the c_lflag field
_
LFLUSHOFLUSHO in the c_lflag field
_
LNOHANGCLOCAL in the c_cflag field
_
LCRTKILECHOKE in the c_lflag field
_
LPASS8CS8 in the c_cflag field
_
LCTLECHCTLECH in the c_lflag field
_
LPENDINPENDIN in the c_lflag field
_
LDECCTQComplement of IXANY in the c_iflag field
_
LNOFLSHNOFLSH in the c_lflag field
.TE

.sp
.LP
Each flag has a corresponding equivalent
.B sg_flags
value. The
\fBsg_flags\fR definitions omit the leading "L"; for example, TIOCSETP with
.B sg_flags
set to TOSTOP is equivalent to TIOCLSET with LTOSTOP.
.sp
.LP
Another structure associated with each terminal is the
.BR ltchars
structure which defines control characters for the new
.B 4BSD
terminal
interface. Its structure is:
.sp
.in +2
.nf
struct ltchars {
   char t_suspc;  /* stop process signal */
   char t_dsuspc; /* delayed stop process signal */
   char t_rprntc; /* reprint line */
   char t_flushc; /*flush output (toggles) */
   char t_werasc; /* word erase */
   char t_lnextc; /* literal next character */
};
.fi
.in -2

.sp
.LP
The characters are mapped to members of the
.B c_cc
field of the
.B termios
structure as follows:
.sp

.sp
.TS
tab() box;
cw(0i) |cw(5.5i)
lw(0i) |lw(5.5i)
.
ltcharsc_cc index
_
t_suspc VSUS
_
t_dsuspcVDSUSP
_
t_rprntcVREPRINT
_
t_flushcVDISCARD
_
t_werascVWERASE
_
t_lnextcVLNEXT
.TE

.SH IOCTLS
.sp
.LP
.B ttcompat
responds to the following
.B ioctl
calls. All others are
passed to the module below.
.sp
.ne 2
.mk
.na
.B TIOCGETP
.ad
.RS 14n
.rt
The argument is a pointer to an
.B sgttyb
structure. The current
terminal state is fetched; the  appropriate characters in  the terminal
state are stored  in that structure, as are the input and output speeds. If
the speed is over B38400,  then B38400 is  returned. The values of the flags
in the
.B sg_flags
field are derived from the flags in the terminal state
and stored in the structure.
.RE

.sp
.ne 2
.mk
.na
.B TIOCEXCL
.ad
.RS 14n
.rt
Set ``exclusive-use'' mode; no further opens are  permitted until the file
has been closed.
.RE

.sp
.ne 2
.mk
.na
.B TIOCNXCL
.ad
.RS 14n
.rt
Turn off ``exclusive-use'' mode.
.RE

.sp
.ne 2
.mk
.na
.B TIOCSETP
.ad
.RS 14n
.rt
The argument is a pointer to an
.B sgttyb
structure. The appropriate
characters and input and output speeds in the terminal state are set from
the values in that structure, and the flags in the terminal state are set to
match the values of the flags in the
.B sg_flags
field of that structure.
The state is changed with a
.B "TCSETSF ioctl"
so that the interface
delays until output is quiescent, then throws away any unread characters,
before changing the modes. If the current device speed is over B38400 for
either input or output speed, and B38400 is specified through this interface
for that speed, the actual device speed is not changed. If the device speed
is B38400 or lower or if some speed other than B38400 is specified, then the
actual speed specified is set.
.RE

.sp
.ne 2
.mk
.na
.B TIOCSETN
.ad
.RS 14n
.rt
The argument is a pointer to an
.B sgttyb
structure. The terminal state
is changed as
.B TIOCSETP
.RB "would change it, but a" " TCSETS"
.B ioctl
is used, so that the interface neither delays nor discards
input.
.RE

.sp
.ne 2
.mk
.na
.B TIOCHPCL
.ad
.RS 14n
.rt
The argument is ignored. The
.B HUPCL
flag is set in the
.B c_cflag
word of the terminal state.
.RE

.sp
.ne 2
.mk
.na
.B TIOCFLUSH
.ad
.RS 14n
.rt
The argument is a pointer to an
.B int
variable. If its value is zero,
all characters waiting in input or output queues are flushed. Otherwise, the
value of the
.B int
is treated as the logical
.B OR
of the
.BR FREAD
and
.B FWRITE
flags defined by \fB<sys/file.h>\fR\&. If the \fBFREAD\fR
bit is set, all characters waiting in input queues are flushed, and if the
.B FWRITE
bit is set, all characters waiting in output queues are
flushed.
.RE

.sp
.ne 2
.mk
.na
.B TIOCSBRK
.ad
.RS 14n
.rt
The argument is ignored. The break bit is set for the device. (This  is not
supported by
.BR ttcompat .
The underlying driver must support TIOCSBRK.)
.RE

.sp
.ne 2
.mk
.na
.B TIOCCBRK
.ad
.RS 14n
.rt
The argument is ignored. The break bit is cleared for the device. (This is
not supported by
.BR ttcompat .
The underlying driver must support
TIOCCBRK.)
.RE

.sp
.ne 2
.mk
.na
.B TIOCSDTR
.ad
.RS 14n
.rt
The argument is ignored. The Data Terminal Ready bit is set for the
device.
.RE

.sp
.ne 2
.mk
.na
.B TIOCCDTR
.ad
.RS 14n
.rt
The argument is ignored. The Data Terminal Ready bit is cleared for the
device.
.RE

.sp
.ne 2
.mk
.na
.B TIOCSTOP
.ad
.RS 14n
.rt
The argument is ignored. Output is stopped as if the
.B STOP
character
had been typed.
.RE

.sp
.ne 2
.mk
.na
.B TIOCSTART
.ad
.RS 14n
.rt
The argument is ignored. Output is restarted as if the
.B START
character had been typed.
.RE

.sp
.ne 2
.mk
.na
.B TIOCGETC
.ad
.RS 14n
.rt
The argument is a pointer to a
.B tchars
structure. The current terminal
state is fetched, and the appropriate characters in the terminal state are
stored in that structure.
.RE

.sp
.ne 2
.mk
.na
.B TIOCSETC
.ad
.RS 14n
.rt
The argument is a pointer to a
.B tchars
structure. The values of the
appropriate characters in the terminal state are set from the characters in
that structure.
.RE

.sp
.ne 2
.mk
.na
.B TIOCLGET
.ad
.RS 14n
.rt
The argument is a pointer to an
.BR int .
The current terminal state is
fetched, and the values of the local flags are derived from the flags in the
terminal state and stored in the
.B int
pointed to by the argument.
.RE

.sp
.ne 2
.mk
.na
.B TIOCLBIS
.ad
.RS 14n
.rt
The argument is a pointer to an
.B int
whose value is a mask containing
flags to be set in the local flags word. The current terminal state is
fetched, and the values of the local flags are derived from the flags in the
terminal state; the specified flags are set, and the flags in the terminal
state are set to match the new value of the local flags word.
.RE

.sp
.ne 2
.mk
.na
.B TIOCLBIC
.ad
.RS 14n
.rt
The argument is a pointer to an
.B int
whose value is a mask containing
flags to be cleared in the local flags word. The current terminal state is
fetched, and the values of the local flags are derived from the flags in the
terminal state; the specified flags are cleared, and the flags in the
terminal state are set to match the new value of the local flags word.
.RE

.sp
.ne 2
.mk
.na
.B TIOCLSET
.ad
.RS 14n
.rt
The argument is a pointer to an int containing a new set of local flags.
The flags in the terminal state are set to match the  new value of the local
flags word.  (This
.B ioctl
was added because
.B sg_flags
was once a
16 bit value. The local modes controlled by TIOCLSET are equivalent to the
modes controlled by TIOCSETP and
.BR sg_flags .)
.RE

.sp
.ne 2
.mk
.na
.B TIOCGLTC
.ad
.RS 14n
.rt
The argument is a pointer to an
.B ltchars
structure. The values of the
appropriate characters in the terminal state are stored in that structure.
.RE

.sp
.ne 2
.mk
.na
.B TIOCSLTC
.ad
.RS 14n
.rt
The argument is a pointer to an
.B ltchars
structure. The values of the
appropriate characters in the terminal state are set from the characters in
that structure.
.RE

.sp
.ne 2
.mk
.na
.B FIORDCHK
.ad
.RS 14n
.rt
Returns the number of immediately readable characters. The argument is
ignored. (This ioctl is  handled in the stream head, not in the
.B ttcompat
module.)
.RE

.sp
.ne 2
.mk
.na
.B FIONREAD
.ad
.RS 14n
.rt
Returns the number of immediately readable characters in the int pointed to
by the argument. (This ioctl is  handled in the stream head, not in the
.B ttcompat
module.)
.RE

.sp
.LP
The following ioctls are returned as successful for the sake of
compatibility. However, nothing significant is done (that is, the state of
the terminal is not changed in any way, and no message is passed through to
the underlying
.B tty
driver).
.sp
.in +2
.nf

DIOCSETP
DIOCSETP
DIOCGETP
LDCLOSE
LDCHG
LDOPEN
LDGETT
LDSETT
TIOCGETD
TIOCSETD
.fi
.in -2

.sp
.LP
The following old
.BR ioctl "s are not supported by"
.BR ttcompat ,
but are
supported by Solaris
.B tty
drivers. As with all ioctl not otherwise
listed in this documentation, these are passed through to the underlying
driver and are handled there.
.sp
.in +2
.nf
TIOCREMOTE
TIOCGWINSZ
TIOCSWINSZ
.fi
.in -2

.sp
.LP
The following
.B ioctls
are  not supported by
.BR ttcompat ,
and are
generally not supported by Solaris
.B tty
drivers. They are passed
through, and the
.B tty
drivers return EINVAL.
.sp
.in +2
.nf
LDSMAP
LDGMAP
LDNMAP
TIOCNOTTY
TIOCOUTQ
.fi
.in -2

.sp
.LP
(Note:   LDSMAP,   LDGMAP,  and   LDNMAP   are defined   in
.RB < sys/termios.h >.)
.SH SEE ALSO
.sp
.LP
.BR ioctl (2),
.BR termios (3C),
.BR ldterm (7M),
.BR termio (7I)
