usr/src/man/man7m/usb_ah.7m
'\" te
.\" Copyright (c) 2009 by Sun Microsystems, Inc. All rights reserved.
.\" Copyright (c) 2012-2013, J. Schilling
.\" Copyright (c) 2013, Andreas Roehler
.\" CDDL HEADER START
.\"
.\" The contents of this file are subject to the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.opensource.org/licenses/cddl1.txt
.\"
.\" When distributing Covered Code, include this CDDL HEADER in each
.\" file and include the License file at usr/src/OPENSOLARIS.LICENSE.
.\" If applicable, add the following below this CDDL HEADER, with the
.\" fields enclosed by brackets "[]" replaced with your own identifying
.\" information: Portions Copyright [yyyy] [name of copyright owner]
.\"
.\" CDDL HEADER END
.TH usb_ah 7M "15 May 2009" "SunOS 5.11" "STREAMS Modules"
.SH NAME
usb_ah \- USB audio HID STREAMS module
.SH DESCRIPTION
.sp
.LP
The
.B usb_ah
STREAMS module enables the USB input control device which
is a member of the Human Interface Device (HID) class and provides support
for volume change and mute button. The
.B usb_ah
module is pushed on top
of a HID class driver instance (see
.BR hid (7D))
and below an Audio
Control class driver instance (see
.BR usb_ac (7D)).
It translates the HID
specific events to the events that are supported by the Solaris audio mixer
framework.
.SH FILES
.sp
.ne 2
.mk
.na
.B /kernel/strmod/usb_ah
.ad
.sp .6
.RS 4n
32-bit ELF kernel STREAMS module. (x86 platform only.)
.RE

.sp
.ne 2
.mk
.na
.B /kernel/strmod/sparcv9/usb_ah
.ad
.sp .6
.RS 4n
SPARC 64-bit ELF kernel STREAMS module
.RE

.sp
.ne 2
.mk
.na
.B /kernel/strmod/amd64/usb_ah
.ad
.sp .6
.RS 4n
x8664-bit ELF kernel STREAMS module
.RE

.SH ATTRIBUTES
.sp
.LP
See
.BR attributes (5)
for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i)
lw(2.75i) |lw(2.75i)
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
ArchitecturePCI-based systems
_
AvailabilitySUNWusb
_
Interface StabilityCommitted
.TE

.SH SEE ALSO
.sp
.LP
.BR hid (7D),
.BR usba (7D),
.BR usb_ac (7D),
.BR usb_as (7D),
.BR usb_mid (7D),
.BR audio (7I),
.sp
.LP
.I STREAMS Programming Guide
.sp
.LP
.I System Administration Guide: Basic Administration
.sp
.LP
.I "Universal Serial Bus Specification 1.0 and 1.1
.sp
.LP
.I "Device Class Definition for Human Interface Devices (HID) 1.1
.SH DIAGNOSTICS
.sp
.LP
None
.SH NOTES
.sp
.LP
If USB audio drivers are not loaded, buttons are not active.
